{"sku":"648696","manufacturer_id":"68739","brand_name":"Gregory","product_name":" Gregory Denali Pro Pack","long_description":"The Gregory Denali Pro pack is touted as the \"Best Value Expedition Pack\" in the 2003 Backpacker Magazine Gear Guide! Denali Pro offers load support, custom fit and easy access for mountaineers and trekkers who demand performance without compromise. Foam-padded, contoured shoulder straps with Auto-Cant(TM) design fit a wide range of shoulders and adjust automatically to varying trail conditions. Soft, thermo-formed foam back panel with cushion inserts and molded air channels offers breathable comfort. Dual-density foam-padded hipbelt is pre-curved to hug the hips and provide greater comfort and load-carrying support. Light HDPE framesheet with cutouts and dual aluminum stays provide an optimal blend of stiffness and torsional flex. Sleeping bag compartment features a separate zippered entry and a removable divider. The Gregory Denali Pro pack offers 2 ways to get at your gear: top-loading and front pocket access to the main compartment. Mesh pocket divider zips closed to keep contents of the front pocket separate from the main bag; unzips for easy access to the main compartment. Removable top lid converts to a waist pack for quick hikes away from camp. 2 large mesh side pockets let you keep essentials close at hand. Includes vinyl-reinforced ski slots, dual ice axe/tool loops and a daisy chain for attaching additional gear. Top and side compression straps along with quick-release sleeping pad straps help stabilize the load. The Gregory Denali Pro pack is made of durable Cordura(R) nylon with Spectra(R)-reinforced nylon stress points that offer strength and abrasion resistance. Waterproof Shelter-Rite(TM) material covers the bottom of the pack to provide long-lasting wear and protection from the elements.","short_description":"The Gregory Denali Pro pack is touted as the \"Best Value Expedition Pack\" in the 2003 Backpacker Magazine Gear Guide!","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410375.png","image_url":"http://i1.avlws.com/115/l410375.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410375&tt=df","keywords":"multiday","retail_price":"549.00","sale_price":"549.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410375\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410375.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=648696&amp;link=&amp;tabs=-Details\"></script>","variants":{"6486960021":{"sku":"6486960021","vendor_sku":"GM68738","upc":"844930002143","size":"L","color":"CHILI RED","retail_price":"549.00","sale_price":"549.00"},"6486960039":{"sku":"6486960039","vendor_sku":"GM68740","upc":"013527687401","size":"S","color":"CHILI RED","retail_price":"549.00","sale_price":"549.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
