{"sku":"662980","manufacturer_id":"D119PET","brand_name":"Cleanwaste","product_name":" Cleanwaste PETT Portable Environmental Toilet","long_description":"This innovative, environmentally friendly Cleanwaste PETT portable environmental toilet has full-size features but folds to an easy-to-carry briefcase size for travel. Its stable tripod design holds a standard-size seat at the right height and supports up to 500 lbs.; folding legs lock in both open and closed positions. Hygienic design ensures no contact with waste; 1 single-use WAG BAG(R) Toilet in a Bag(TM) waste kit is included. Each degradable kit contains a WAG BAG waste bag with Poo Powder(TM), a zip-close storage bag, toilet paper and hand sanitizer. Poo Powder quickly turns waste into a stable gel for easy transport and safe disposal. Odor neutralizers, not perfumes, eliminate unpleasant odors; decay catalyst initiates decomposition. Durable high-impact thermoplastic construction; all parts can be sterilized. WAG BAG waste bags are landfill approved and can be disposed of in trash with regular garbage. Permitted by the U.S. Bureau of Land Management for use on rivers and in Wilderness Areas where toilets are required. Cleanwaste PETT portable environmental toilet is recommended by the Leave No Trace program in conjunction with the National Forest Service. WAG BAG waste bag refills sold separately.","short_description":"This innovative, environmentally friendly Cleanwaste PETT portable environmental toilet has full-size features but folds to an easy-to-carry briefcase size for travel.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"Camp Bathroom","thumb_url":"http://i1.avlws.com/115/s419651.png","image_url":"http://i1.avlws.com/115/l419651.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=419651&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=419651\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m419651.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=662980&amp;link=&amp;tabs=-Details\"></script>","variants":{"6629800019":{"sku":"6629800019","vendor_sku":"D119PET","upc":"709418011119","retail_price":"79.95","sale_price":"79.95"}}}
