{"sku":"671111","manufacturer_id":"02241","brand_name":"Msr","product_name":"MSR SweetWater Water Purifier System","long_description":"This MSR system combines the proven filtration of the SweetWater(R) microfilter with the chlorine-based SweetWater Purifier Solution for safe, clean water worldwide. Simply pump water and add the included MSR SweetWater Purifier Solution to innactivate 99.99% of waterborne viruses, bacteria and protozoan parasites. Chlorine-based purification has no unpleasant iodine taste. One of the easiest pumps to operate-features dual-action draw and a mechanical advantage to quickly supply you with clean water. Sturdy lever-action pump handle provides a 4-to-1 mechanical advantage, drawing water on both the down and up stroke. Lightweight copolyester construction is tough and durable; compact design stows easily. Built-in filter replacement safety indicator keeps tabs on usage, filters up to 200 gal. Its 0.2 micron filter eliminates waterborne bacteria and protozoa such as giardia and. SweetWater Purifier Solution is able to safely disinfect \"worst case\" water sources. SweetWater Purifier Solution comes in a 2 fl. oz. bottle that treats up to 80 gal. of water. Field serviceable and easy to clean with no small parts to lose; includes a universal bottle adapter and a cover to keep the output clean.","short_description":"This MSR system combines the proven filtration of the SweetWater(R) microfilter with the chlorine-based SweetWater Purifier Solution for safe, clean water worldwide.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426175.png","image_url":"http://i1.avlws.com/115/l426175.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426175&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426175\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426175.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=671111&amp;link=&amp;tabs=-Details\"></script>","variants":{"6711110012":{"sku":"6711110012","vendor_sku":"02241","upc":"040818022085","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
