{"sku":"705752","manufacturer_id":"1578050022","product_name":"Exploring the Yellowstone Backcountry","long_description":"Need a guide to cover not only the best Yellowstone hikes, but also paddling, skiing, and even cycling? In the comprehensive pages of. Author: Orville Bach, Jr. Softcover; 276 pages; 13 black-and-white photos, 9 maps. The Sierra Club; copyright 1998. This definitive guide to the Yellowstone backcountry covers more than 3,500 square miles of incomparable wilderness and includes a section on Grand Teton. Contains all the essential information you'll need to plan a paddling trip, a day on skis, a day on the bike or a day in your hiking boots. Offers detailed information on paddling Yellowstone Lake, Shoshone Lake, the Snake River, Jackson Lake and String Lake. Trail descriptions are grouped by region and include trailhead location, mileage, difficulty and points of special interest. Supplies tips on seasonal weather patterns, safety (with special reference to bears), clothing and equipment, photography and fishing. Discusses the best locations and times of year to see elk, moose, bison and other wildlife. Offers advice on the most scenic routes.","short_description":"Need a guide to cover not only the best Yellowstone hikes, but also paddling, skiing, and even cycling? In the comprehensive pages of Exploring the Yellowstone Backcountry , you've found it!","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Camping And Hiking Guidebooks","thumb_url":"http://i1.avlws.com/115/s408863.png","image_url":"http://i1.avlws.com/115/l408863.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408863&tt=df","retail_price":"9.98","sale_price":"9.98","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408863\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408863.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=705752&amp;link=&amp;tabs=-Details\"></script>","variants":{"7057520012":{"sku":"7057520012","vendor_sku":"1578050022","retail_price":"9.98","sale_price":"9.98"}},"categories":["books","guidebooks","camping-and-hiking-guidebooks"]}
