{"sku":"706582","manufacturer_id":"9781586852344","product_name":" 98.6 Degrees - The Art of Keeping Your Ass Alive!","long_description":"How to survive fear, panic and the biggest outdoor killers! Author: Cody Lundin; illustrated by Russ Miller; photographs by Christopher Marchetti. Softcover; 215 pages; black-and-white illustrations and full-color photographs. Gibbs Smith; copyright 2003. This is a nonstop thrill ride, jam-packed with commonsense modern survival skills for the backcountry, the backyard or the highway. Author Cody Lundin is the founder and director of the nationally recognized Aboriginal Living Skills School. His brand of wilderness wisdom is based on the unique principle of keeping the body's core temperature at a lively 98.6 degrees. In his no-nonsense and informative style Cody stresses that a human can live without food for weeks and without water for several days. But if the body's core temperature dips much below or shoots above the 98.6deg mark, a person can die within hours. It's a concept that many don't take seriously or even consider, but knowing what to do to maintain a safe core temperature can save your life. Delivered with wit, rebellious humor, plenty of backcountry expertise and paired with outrageously hip visuals. Promises to not only entertain, but to empower with practical advice, information and detailed instructions of how to create an effective survival kit.","short_description":"How to survive fear, panic and the biggest outdoor killers!","category":"Books And Maps","subcategory":"How-To And Instructional Books","product_group":"Health And Safety Books","thumb_url":"http://i1.avlws.com/115/s445207.png","image_url":"http://i1.avlws.com/115/l445207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445207&tt=df","retail_price":"16.95","sale_price":"16.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=706582&amp;link=&amp;tabs=-Details\"></script>","variants":{"7065820016":{"sku":"7065820016","vendor_sku":"9781586852344","retail_price":"16.95","sale_price":"16.95"}},"categories":["books","howto-and-instructional-books","health-and-safety-books"]}
