{"sku":"708125","manufacturer_id":"0100-0118","brand_name":"Adventure Medical Kits","product_name":"Adventure Medical Kits Mountain Weekender First-Aid Kit","long_description":"Built with weekend adventurers in mind, this Adventure Medical kit packs a variety of medical essentials in an affordable, organized package. Easy Care(TM) system organizes contents by injury type, saving valuable response time. Bright blue color and reflective trim make kit highly visible and easy to find in low-light conditions. All contents are packed together in easily identifiable, clear vinyl compartments. Contains medical supplies for groups up to 6 people on a 1 to 7 day trip. Essential equipment: 3 non-mercury thermometers, EMT shears, splinter picker forceps, duct tape, 3 safety pins and an accident report and pencil. Medications: 4 acetaminophen, 4 ibuprofen, 2 antihistamine and 2 aspirin. CPR/bleeding: CPR face shield, trauma pad, 2 nitrile gloves and 1 antimicrobial hand wipe. Wound care: 20cc. irrigation syringe, 0.75 oz. povidone iodine, 10 wound-closure strips, 2 tinctures of benzoin and 3 antibiotic ointments. Also: 6 After Cuts and Scrapes (R), 8 gauze pads, 2 non-adherent sterile dressings and 2 conforming gauze bandages. 10 yards tape, 10 strip and knuckle bandages and 2 cotton-tipped applicators. Burn/blister care: 1 GlacierGel blister pad and 11 precut and shaped moleskin pieces. Fracture/sprain care: elastic bandage with VELCRO(R) brand closure and 1 triangular bandage. Includes ''A Comprehensive Guide to Wilderness and Travel Medicine''.","short_description":"Built with weekend adventurers in mind, this Adventure Medical kit packs a variety of medical essentials in an affordable, organized package.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s420207.png","image_url":"http://i1.avlws.com/115/l420207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=420207&tt=df","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=420207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m420207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=708125&amp;link=&amp;tabs=-Details\"></script>","variants":{"7081250016":{"sku":"7081250016","vendor_sku":"0100-0118","upc":"707708011832","retail_price":"59.95","sale_price":"59.95"}},"categories":["camping-hiking","health-and-safety","first-aid"]}
