{"sku":"710632","manufacturer_id":"116 348 521","brand_name":"Native Eyewear","product_name":" Native Eyewear Dash XP Polarized Sunglasses - Men's","long_description":"These polarized sunglasses offer unbeatable sun and glare protection and come with two pairs of lenses for all light conditions. Unique interchangeable lens system lets you switch lenses without having to put your fingers all over the lens. Polarized Crystal Carbonate(R) lenses have the strongest hard coating available to protect against scratching. P.C.C.(R) lenses pass the rigorous ANSI Z80.3 tests for optical clarity and impact resistance while blocking 100% of harmful UVA and UVB light. Rhyno-Tuff(R) AIR frames endure extreme highs and lows in temperature. Frames are extremely lightweight, yet flexible and durable enough to withstand high velocity collisions. Self-adjusting Cushinol(TM) nosepads create a non-slip grip that keeps sunglasses in place, ensuring a soft feel and custom fit. Venting system incorporated into the frames enhances airflow and virtually eliminates fog and condensation. Each frame includes one set of polarized lens (tint depends on frame color) and one set of SportFlex(TM) lenses, for a total of two sets of lenses. Additional SportFlex orange-yellow lenses have a blue mirror coating suitable for a range of low-light conditions from cloudy, overcast, dusk and dawn. These sunglasses are designed to fit medium to large profiles. XP = Xtra Protection, lenses are approximately 20% larger for more coverage and protection. Also included is an Optic Gear Kit that features a semi-hard case and a soft pouch.","short_description":"These polarized sunglasses offer unbeatable sun and glare protection and come with two pairs of lenses for all light conditions.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422727.png","image_url":"http://i1.avlws.com/115/l422727.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422727&tt=df","keywords":"Cycling","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422727\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422727.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=710632&amp;link=&amp;tabs=-Details\"></script>","variants":{"7106320059":{"sku":"7106320059","vendor_sku":"116 302 519","upc":"764824003059","color":"ASPHALT/BLUE REFLEX","retail_price":"129.00","sale_price":"129.00"},"7106320075":{"sku":"7106320075","vendor_sku":"116 348 521","upc":"764824003653","color":"CHARCOAL/SILVER REFLEX","retail_price":"129.00","sale_price":"129.00"}}}
