{"sku":"714737","manufacturer_id":"COR-BL","brand_name":"Princeton Tec","product_name":" Princeton Tec Corona LED Headlamp","long_description":"Taking LED lighting to a brighter level, the Corona features 8 super-bright white, shock-resistant LEDs with eight different brightness settings. Switch between 8-, 5-, 3- or 1-LED use, providing great hands-free lighting to satisfy all of your outdoor lighting needs. Multiple modes and functions are suitable for nearly any task around camp. Innovative circuit system lets you adjust the brightness level on each of the LED output modes; chose between bright, dim and strobe. Voltage-regulation circuitry helps headlamp maintain a relatively brighter light over a long period of time. Heat-regulating technology prevents light from getting too hot, even when on 8-LED bright mode. Very bright flood/area light offers excellent peripheral light, allowing your eyes to work with ease in a localized area. Water-resistant design works well in foul weather. Durable nylon headstrap provides plenty of adjustment. Head assembly pivots, letting you shine light where you need it. LED bulbs are nearly indestructible, offer 10,000 hours of bulb life and greatly extend battery life. Powered by three AA batteriess, included.","short_description":"Taking LED lighting to a brighter level, the Corona features 8 super-bright white, shock-resistant LEDs with eight different brightness settings.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s416991.png","image_url":"http://i1.avlws.com/115/l416991.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416991&tt=df","retail_price":"55.00","sale_price":"55.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416991\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416991.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=714737&amp;link=&amp;tabs=-Details\"></script>","variants":{"7147370014":{"sku":"7147370014","vendor_sku":"COR-BL","upc":"795626008546","color":"BLUE","retail_price":"55.00","sale_price":"55.00"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
