{"sku":"715771","manufacturer_id":"830040","brand_name":"Leatherman","product_name":" Leatherman New Wave Multitool","long_description":"Packing a punch, the New Wave is sharper and bigger with easy-to-unlock blades and heavy-duty strength. Secure blades are easy to open and close using lock-release on the outside of the handles. Interior blades/tools rotate individually, letting you easily grab one at a time. Made from 100% stainless steel to provide years of dependable service; each implement is heat-treated to optimal hardness for its function. Includes both needlenose and regular pliers, plus wire strippers and newly designed wire cutters and hard-wire cutters that have 58% more cutting area. Clip-point knife, serrated knife and a saw efficiently handle cutting tasks, and are on the outside of tool for quick and easy access. Two bit drivers, large and small, allow you to customize your bit selection to fit every job; a 3/16-inch standard screwdriver tackles the rest. Includes two double-end bits: one with a Phillips #1 and #2 and the other with an extra-small Phillips and flat-tip eyeglass screwdriver. Diamond-covered file is designed to work effectively on wood or metal; ruler measures up to 8 inches. Features a can/bottle opener, and scissors that are strong enough to cut seat belts, fishing line, zip-ties and fabric. Compatible with the Leatherman Bit Kit, sold separately. Comes with nylon carrying sheath. Assembled in the USA with domestic and imported parts.","short_description":"Packing a punch, the New Wave is sharper and bigger with easy-to-unlock blades and heavy-duty strength.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Knives And Tools","thumb_url":"http://i1.avlws.com/115/s418263.png","image_url":"http://i1.avlws.com/115/l418263.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418263&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418263\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418263.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=715771&amp;link=&amp;tabs=-Details\"></script>","variants":{"7157710018":{"sku":"7157710018","vendor_sku":"830040","upc":"037447758737","color":"STAINLESS","retail_price":"89.95","sale_price":"89.95"}},"categories":["camping-hiking","gadgets","knives-and-tools"]}
