{"sku":"717878","manufacturer_id":"D05","brand_name":"Petzl","product_name":"Petzl Pirana Canyon Descender","long_description":"The Petzl Pirana descender is effective for single or double rope canyoning descents and can be installed on the rope without removing it from the harness. Pirana offers 3 different braking positions, according to the weight of the user, the rope diameter and the terrain. It also offers 2 points where the rope can be angled to adjust the descent speed. A plastic attachment ensures perfect support for many types of HMS locking carabiners. Carabiners with cross sections of 12mm (e.g. Petzl Attache) will provide a very tight fit in the small hole, so tight that it takes a bit of pressure to get the carabiner in. Snug fit creates a rigid carabiner/descender unit that helps to reduce risk of loading carabiner across the gate; also stays securely attached to harness to help prevent loss. Designed for use with the ''Rapid'' technique, which foils formation of a lark's head hitch around Pirana body and reduces kinks without curbing friction. May be used with double ropes, but not all braking positions may be usable depending on the ropes' diameter. The Pirana can also be used to belay the leader.","short_description":"The Petzl Pirana descender is effective for single or double rope canyoning descents and can be installed on the rope without removing it from the harness.","category":"Climbing","subcategory":"Climbing Hardware","product_group":"Ascenders And Descenders","thumb_url":"http://i1.avlws.com/115/s445131.png","image_url":"http://i1.avlws.com/115/l445131.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445131&tt=df","keywords":"rappel,belay","retail_price":"37.95","sale_price":"37.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445131\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445131.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=717878&amp;link=&amp;tabs=-Details\"></script>","variants":{"7178780016":{"sku":"7178780016","vendor_sku":"D05","retail_price":"37.95","sale_price":"37.95"}},"categories":["climbing","climbing-hardware","ascenders-and-descenders"]}
