{"sku":"719482","manufacturer_id":"9780898869491","product_name":" Hiking the Southwest's Canyon Country","long_description":"This book explores the Four Corners Region's most enjoyable trails and awe-inspiring scenic attractions through seven multi-day itineraries. Author: Sandra Hinchman. Softcover; 286 pages; maps, black-and-white photos. The Mountaineers Books; copyright 2004. Itineraries offer something for everyone and offer options such as backpacking trips, scenic drives, rafting trips and visits to archaeological sites. Not your typical guide--select a single hike or follow one of the itineraries from beginning to end. Details more than 150 hikes, including hikes to waterfalls, natural bridges and slot canyons. Trips are within driving distance of Denver, Albuquerque, Phoenix, Las Vegas and Salt Lake City. \"Best Place Adventure Chart\" identifies hikes that are suitable for kids, feature rock art, lead to natural arches and more. Features the Desert Reefs Tour, Desert Rivers Tour, Redrock Tour, Mesa Tour, Pueblo tour, Painted Desert Tour and Canyons Tour.","short_description":"This book explores the Four Corners Region's most enjoyable trails and awe-inspiring scenic attractions through seven multi-day itineraries.","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Camping And Hiking Guidebooks","thumb_url":"http://i1.avlws.com/115/s408895.png","image_url":"http://i1.avlws.com/115/l408895.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408895&tt=df","retail_price":"19.95","sale_price":"19.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408895\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408895.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=719482&amp;link=&amp;tabs=-Details\"></script>","variants":{"7194820010":{"sku":"7194820010","vendor_sku":"9780898869491","retail_price":"19.95","sale_price":"19.95"}}}
