{"sku":"721444","manufacturer_id":"274","brand_name":"La Sportiva","product_name":"La Sportiva Trango S EVO GTX Mountaineering Boots - Men's","long_description":"These award-winning alpine boots with Gore-Tex(R) inserts feature all synthetic construction and a unique ankle-hinge system for ample support. Water-repellent Cordura(R) nylon uppers with Flex Tec 2 rubber-coated, Aramide-reinforced polyester panels are super durable and lightweight. Reinforced with water-repellent Lorica(R) synthetic leather for maximum durability and strength. Waterproof, seam-sealed Gore-Tex(R) inserts keep feet dry while allowing excess moisture vapor to escape to prevent overheating. Wicking Dri-lex(R) nylon linings absorb excess moisture and disperse it for fast drying and enhanced comfort. Fully-gusseted and padded tongues keep out debris and water while relieving lacing pressure. Full rubber randing protects feet and uppers from abrasion and bumps while enhancing edging ability on thin edges. Innovative 3D Flex ankle-hinge system offers ample support while front-pointing yet stays flexible enough for flat-footing. Trailflex nylon midsole supports with half-length steel shanks provide optimal torsional rigidity while remaining comfortable for long approaches. Dual-density micropore rubber provides fine-tuned performance with differing levels of cushioning and support for long-haul trips. Durable Vibram(R) Dru rubber outsoles deliver amazing traction on wet and dry surfaces; undercut heels for braking and edging platforms at toes. Outsoles are compatible with both strap-on and hybrid(New-matic) style crampons.","short_description":"These award-winning alpine boots with Gore-Tex(R) inserts feature all synthetic construction and a unique ankle-hinge system for ample support.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385031.png","image_url":"http://i1.avlws.com/115/l385031.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385031&tt=df","retail_price":"320.00","sale_price":"320.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385031\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385031.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=721444&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","mens-footwear","mens-boots"]}
