{"sku":"721900","manufacturer_id":"M40","brand_name":"Hennessy Hammock","product_name":"Hennessy Hammock Explorer Ultralight Asym Classic Hammock","long_description":"At 10 ft. long, the Explorer Ultralite Asym Classic from Hennessy Hammock was designed for anyone under 250 lbs. or more than 6 ft. tall-you get more comfort without the weight. Patented asymmetrical shape is designed with a diagonal axis making the hammock feel longer with a wider sweet spot of comfort. Patented, easy entry through the bottom--automatically snaps shut behind you as weight tensions the entrance; seals with VELCRO(R) brand closure. Patented integral ridgeline maintains the same comfortable shape to keep your back straight and level when resting on the diagonal. Patented ''never-tip'' center balance design eliminates instability by entering from the center instead of flipping over the side. No-see-um mesh provides excellent insect protection and ventilation, and will deflect wind to provide a calm space inside. Silicone-impregnated nylon rainfly may be tilted to any angle, rolled up above, removed or used separately; large rainfly provides good coverage. Nifty gear pocket slides on the ridgeline and stores out of sight behind your head. Suspension sytem includes 10 ft. long, 1500 lb. test polyester-covered Spectra ropes. Complementary polyester webbing straps are provided to protect the tender bark of trees and provide greater span for the ropes. Ultralight Asym Classic hammock folds into an open-air lounger/chair or can be used on the ground as a tent when paired with your hiking poles.","short_description":"At 10 ft. long, the Explorer Ultralite Asym Classic from Hennessy Hammock was designed for anyone under 250 lbs. or more than 6 ft. tall-you get more comfort without the weight.","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Hammocks","thumb_url":"http://i1.avlws.com/115/s413987.png","image_url":"http://i1.avlws.com/115/l413987.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413987&tt=df","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413987\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413987.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=721900&amp;link=&amp;tabs=-Details\"></script>","variants":{"7219000028":{"sku":"7219000028","vendor_sku":"M40","upc":"832667322214","size":"250#","color":"COYOTE BROWN","retail_price":"199.95","sale_price":"199.95"}},"categories":["camping-hiking","camp-furniture","hammocks"]}
