{"sku":"722001","manufacturer_id":"11043","brand_name":"Msr","product_name":"MSR XGK EX Stove","long_description":"The stove of choice for expeditions throughout the world, the MSR XGK EX burns any liquid fuel from white gas to kerosene to jet fuel! Improved design features a larger pot support and a flexible fuel line that can be wrapped up and stored inside a pot. Self-cleaning shaker jet has a built-in needle that pushes out built-up soot and debris with a simple shake of the stove. Bell-shape burner cup makes the stove extremely effective in cold temperatures and at high altitudes; now with feet that lift burner off the ground. Multi-fuel stove burns white gas, low-grade kerosene, auto fuel, Stoddard solvent, aviation (AV) gas, diesel #1 and naphtha. Fiberfax(R) priming pad makes priming and lighting fuels quick and easy while reducing spillage. Wide and sturdy pot supports handle continuous use with ease. Easily field maintainable with included cleaning and disassembly tools. Large-diameter fuel line allows poor quality fuels to burn well and requires less maintenance than smaller diameter fuel lines. Comes with aluminum windscreen, heat reflector, fuel pump and customized stuff sack. Windscreen is designed to accommodate cookware up to 10 in. in diameter. MSR XGK EX stove requires MSR fuel bottle, sold separately. Weight of liquid fuel stove includes only stove and fuel pump.","short_description":"The stove of choice for expeditions throughout the world, the MSR XGK EX burns any liquid fuel from white gas to kerosene to jet fuel!","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416427.png","image_url":"http://i1.avlws.com/115/l416427.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416427&tt=df","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416427\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416427.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=722001&amp;link=&amp;tabs=-Details\"></script>","variants":{"7220010016":{"sku":"7220010016","vendor_sku":"11043","upc":"040818110430","retail_price":"159.95","sale_price":"159.95"}},"categories":["camping-hiking","camp-kitchen","stoves"]}
