{"sku":"723274","manufacturer_id":"2000007107","brand_name":"Coleman","product_name":"Coleman Hot Water on Demand","long_description":"Compact and portable unit delivers hot water anytime for cooking, washing and other camp tasks, giving you more time to enjoy the outdoors. Using standard 16.4-ounce propane cylinders and a rechargeable water pump, unit can produce up to 40 gallons of hot water per cylinder and per charge. Includes sturdy polyethylene 5-gallon water container for water storage; pump hose attaches neatly to container for use. Easy and quick to use: connect hose to water container, adjust to desired temperature and within 5 seconds hot water is ready for use. Sturdy plastic casing with carry handle stands up to rugged camp life; water spigot emerges from handle for easy direction of hot water. Storage panel on side holds included AC adapter and DC cigarette-lighter adapter for recharging of pump battery. Replaceable lead-acid 6V battery supplies reliable power to water pump; 40-minute run-time on pump and approximately 8 hours to recharge battery. Front indicator lights for Over Temp, Battery Low and Recharging keep you informed of appliance's status. Electronic ignition via piezo igniter for simple, matchless heating; heater generates up to 30,000 BTU and water temperatures up to 160deg F. Low maintenance unit requires occasional cleaning with simple household solution. Unit is to be operated outdoors only in well-ventilated areas to prevent suffocation from carbon monoxide. Can be set up to use bulk propane tanks and continuous water supplies using appropriate adapters (not included). Hot Water on Demand(TM) is designed to be used on a raised, level surface such as a picnic or camp table; do not operate directly on the ground. Use only potable, purified drinking water as unit will not filter or clean water in any way. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"Compact and portable unit delivers hot water anytime for cooking, washing and other camp tasks, giving you more time to enjoy the outdoors.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"Camp Bathroom","thumb_url":"http://i1.avlws.com/115/s419683.png","image_url":"http://i1.avlws.com/115/l419683.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=419683&tt=df","keywords":"sun,solar,kit","retail_price":"259.95","sale_price":"259.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=419683\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m419683.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=723274&amp;link=&amp;tabs=-Details\"></script>","variants":{"7232740014":{"sku":"7232740014","vendor_sku":"2000007107","upc":"076501919851","retail_price":"259.95","sale_price":"259.95"}},"categories":["camping-hiking","health-and-safety","camp-bathroom"]}
