{"sku":"725288","manufacturer_id":"0100-0101","brand_name":"Adventure Medical Kits","product_name":"Adventure Medical Kits Mountain Comprehensive First-Aid Kit","long_description":"Organized for fast and efficient response, the Adventure Medical Mountain Comprehensive first-aid kit is loaded with high-grade medical supplies for large groups. Contains materials for groups of up to 14 members spending as much as 28 days in the wilderness. Treat anything from major trauma to blisters; kit also includes equipment for dealing with infectious materials. Modular Easy Care(TM) system organizes supplies and instruction by injury type, speeding up and simplifying the response. Essential equipment: CPR face shield, scalpel, EMT shears, splinter forceps, duct tape, digital thermometer and 4 empty pill vials. Wounds: 20cc irrigation syringe, surgical scrub brush, povidone iodine, 10 wound closure strips and triple antibiotic ointments. 16 gauze pads, 4 non-adherent sterile dressings, 2 trauma pads and 2 stockinette tubular bandage. 2 conforming 3 in. gauze bandages, 10 strip and 10 knuckle bandages, 10 yds. of adhesive tape and 3 tinctures of benzoin. 6 After Cuts and Scrapes(R) towelettes, 4 cotton tip applicators, 6 nitrile gloves and a bio-hazard waste bag. For sprains and fractures: moldable SAM(R) splint, elastic bandage, 2 triangular bandages and 3 safety pins. For blisters: 2 GlacierGel blister pads, 22 precut and shaped moleskin pieces and one 5 x 3 in. piece of molefoam. For stings, bites and burns: 3 AfterBites(R) sting-relief pads, 3 cortisone itch cream applications and 1 aloe vera gel with lidocaine. Medications: 10 acetaminophen, 6 antihistamine, 6 diamode, 4 aspirin, 10 cold medicine, 10 ibuprofen, 6 diamode, 1 antacid and 1 glucose paste. Also, 2 oral rehydration salts and a dental repair mix. For handling infectious materials: 3 pair nitrile examination gloves, antimicrobial hand wipes, disposal bag. Includes comprehensive wilderness medicine guide accident report forms, pencil and waterproof matches.","short_description":"Organized for fast and efficient response, the Adventure Medical Mountain Comprehensive first-aid kit is loaded with high-grade medical supplies for large groups.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s458887.png","image_url":"http://i1.avlws.com/115/l458887.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458887&tt=df","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458887\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458887.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=725288&amp;link=&amp;tabs=-Details\"></script>","variants":{"7252880013":{"sku":"7252880013","vendor_sku":"0100-0101","upc":"707708001017","retail_price":"199.95","sale_price":"199.95"}},"categories":["camping-hiking","health-and-safety","first-aid"]}
