{"sku":"733351","manufacturer_id":"0932310304","product_name":"Up the Lake with a Paddle: Volume 4 - High Country Lakes of the Central Sierra Nevada","long_description":"Provides the canoeist and kayaker with easy-to-read maps and highlights of more than 25 paddling areas in the Sierras. Author: William Van Der Ven. Softcover; 272 pages; black and white photographs and maps. Detailed paddling guide encompasses the \"Lakes of the High Country\" in California's beautiful Central High Sierras. Tells you where to paddle, how to get there and what to expect on your trip. Describes in detail everything from classic trips for the strong solo paddler to family outings. Paddle trips feature detailed information including: coordinates of put-in points, difficulty ratings, distance, maps needed, history and much more. Routes are well researched to provide new insights and appreciation for the waterways of the the High Central Sierra Nevada region. \"In The Eddy\" and \"Paddle Notes\" sections feature practical information on the surrounding area as well as information on geology, flora and fauna. Covers lakes and reservoirs off California Scenic highways 88 and 4, and along the West Fork of the Carson River,. Also covers the mid portion of the North Fork of the Mokelumne River and the granite-encased reservoirs bordering the Carson-Iceberg Wilderness area.","short_description":"Provides the canoeist and kayaker with easy-to-read maps and highlights of more than 25 paddling areas in the Sierras.","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Paddling Guidebooks","thumb_url":"http://i1.avlws.com/115/s409431.png","image_url":"http://i1.avlws.com/115/l409431.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=409431&tt=df","retail_price":"19.95","sale_price":"9.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=409431\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m409431.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=733351&amp;link=&amp;tabs=-Details\"></script>","variants":{"7333510019":{"sku":"7333510019","vendor_sku":"0932310304","retail_price":"9.93","sale_price":"9.93"}},"categories":["books","guidebooks","paddling-guidebooks"]}
