{"sku":"733952","manufacturer_id":"280","brand_name":"La Sportiva","product_name":"La Sportiva Nepal EVO GTX Mountaineering Boots - Men's","long_description":"A pinnacle of mountaineering footwear! Light, warm, Nepal EVO Gore-Tex boots by La Sportiva are the choice for serious climbs. Expedition-worthy, 3.2mm silicone impregnated Idro-Perwanger leather uppers offer the finest in natural breathability and waterproof durability. Total waterproof protection and insulating warmth from seam-sealed Gore-Tex(R) Duratherm(R) liners. High-rise, Vibram(R) XSV sticky rubber rands stand up to rock abrasion and crampon wear. Molded heel cups and 3D Flex system at ankles stabilize feet while allowing comfort on long approaches or using French technique. Anatomically shaped for comfort, integrated elastic gaiters help keep out snow and trail debris while keeping in warmth. Roller lacing system, locking D-rings and lace loops allow for effortless on and off even while wearing gloves. EZ OUT pull loops allow quick release of lace locks for easier exit from boots. Padded and ventilated tongues offer a secure, custom fit while relieving pressure from laces. Shock-absorbing polyurethane inserts and air cushioning soak up shock and vibration on rock and ice. HDPE plastic midsoles provide mountaineering stiffness and stay strong in extreme cold while eliminating the weight and chill of a steel shank. The La Sportiva Nepal EVO GTX boots feature durable, high-traction Vibram(R) IBS (Impact Brake System) rubber outsoles deliver reliable traction on wet and dry terrain. Molded heel and toe welt areas allow compatibility with most types of crampons, including strap-on, hybrid and rigid step-in.","short_description":"A pinnacle of mountaineering footwear! Light, warm, Nepal EVO Gore-Tex boots by La Sportiva are the choice for serious climbs.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385039.png","image_url":"http://i1.avlws.com/115/l385039.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385039&tt=df","retail_price":"510.00","sale_price":"510.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385039\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385039.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=733952&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","mens-footwear","mens-boots"]}
