{"sku":"734445","manufacturer_id":"120 302 515","brand_name":"Native Eyewear","product_name":" Native Eyewear Hardtop XP Polarized Sunglasses","long_description":"With even more coverage, these Native Eyewear Hardtop XP polarized sunglasses have 2 pairs of lenses that are 20% larger than the regular Hardtop sunglasses for more protection! A unique interchangeable lens system lets you switch lenses without having to put your fingers all over them. Polarized Crystal Carbonate(R) lenses have the strongest hard coating available to protect against scratching. Rhyno-Tuff(R) AIR frames endure extreme highs and lows in temperature. Cam-action spring hinges allow the temples to quickly lock into position. P.C.C.(R) lenses pass the rigorous ANSI Z80.3 tests for optical clarity and impact resistance while blocking 100% of harmful UVA and UVB light. Self-adjusting Cushinol(TM) nosepads and ear stems create a nonslip grip that keeps sunglasses in place, ensuring a soft feel and personalized fit. Venting system incorporated into the frames enhances airflow and virtually eliminates fog and condensation. Frame includes one set of polarized lens (tint depends on frame color) and one set of SportFlex(TM) lenses, for a total of two sets of lenses. Additional SportFlex orange-yellow lenses have a blue mirror coating suitable for a range of low-light conditions from cloudy, overcast, dusk and dawn. These sunglasses are designed to fit medium to large profiles. XP refers to Xtra Protection--lenses are approximately 20% larger for more coverage and protection. Also included is an Optic Gear Kit that features a semi-rigid zippered case and a soft pouch that doubles as a cleaning cloth.","short_description":"With even more coverage, these Native Eyewear Hardtop XP polarized sunglasses have 2 pairs of lenses that are 20% larger than the regular Hardtop sunglasses for more protection!","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422735.png","image_url":"http://i1.avlws.com/115/l422735.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422735&tt=df","keywords":"Cycling","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422735\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422735.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=734445&amp;link=&amp;tabs=-Details\"></script>","variants":{"7344450031":{"sku":"7344450031","vendor_sku":"120 302 515","upc":"764824002861","color":"ASPHALT/BROWN","retail_price":"129.00","sale_price":"129.00"},"7344450072":{"sku":"7344450072","vendor_sku":"120 348 502","upc":"764824002847","color":"CHARCOAL/GRAY","retail_price":"129.00","sale_price":"129.00"}}}
