{"sku":"736945","manufacturer_id":"AE1012-R","brand_name":"Advanced Elements","product_name":"Advanced Elements AdvancedFrame Kayak","long_description":"With a rigid bow and stern plus a multi-chamber inflatable body, this kayak delivers performance and portability in a cutting-edge design! Improved design eases setup and increases kayak's efficiency on the water--no assembly needed, just unfold, inflate and hit the water! New easy-to-use Spring valve and Twistlok(TM) valves are compatible with most pumps and speed setup time. Rigid bow with aluminum frame reinforcement slices gracefully through water, rivaling the tracking of a hard-shell day-touring kayak. Aluminum frame reinforced stern acts as a skeg, increasing the tracking performance; new tracking fin further enhances tracking. Sets up quickly and is compact enough to take along for an adventure just about anywhere. Offers generous on-board storage space without decreasing legroom, making extended trips much more enjoyable. Durable triple-layer polyester material with double PVC coating offers superb puncture resistance; welded seams ensure long life. Removable seat with adjustable, inflating back support improves comfort on the water for all-day use; neoprene paddle guards at sides protect knuckles. Bungee deck lacing and D-ring tie-downs let you stow gear; air-lifted deck sheds spray while water-resistant zippers provide hull storage access. Molded, low-profile rubber handles for easy transport to and from the water; inflatable cockpit coaming for easy attachment of sprayskirt. Comes with a repair kit and a heavy-duty duffel bag for transporting your kayak to your favorite destination. Do not under inflate your boat! Advanced Elements recommends inflate with a 12V electric pump, and then top off with a quality hand pump to get up to the recommended pressure.","short_description":"With a rigid bow and stern plus a multi-chamber inflatable body, this kayak delivers performance and portability in a cutting-edge design!","category":"Paddling","subcategory":"Kayaks","product_group":"Inflatable Kayaks","thumb_url":"http://i1.avlws.com/115/s445283.png","image_url":"http://i1.avlws.com/115/l445283.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445283&tt=df","retail_price":"499.95","sale_price":"499.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445283\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445283.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=736945&amp;link=&amp;tabs=-Details\"></script>","variants":{"7369450015":{"sku":"7369450015","vendor_sku":"AE1012-R","upc":"832994000304","color":"RED","retail_price":"499.95","sale_price":"499.95"}},"categories":["paddling","kayaks","inflatable-kayaks"]}
