{"sku":"736947","manufacturer_id":"AE1007-R","brand_name":"Advanced Elements","product_name":"Advanced Elements AdvancedFrame Convertible Tandem Inflatable Kayak","long_description":"With a rigid bow and stern plus a multi-chamber inflatable body, the AdvancedFrame Convertible Inflatable Kayak offers performance and portability for one or two paddlers. Improved design increases kayak's efficiency on the water and eases setup--just unfold, inflate, attach seats and hit the water! New, easy-to-use Spring valve and Twistlok(TM) valves are compatible with most pumps and allow for quicker setup time. Switches from tandem to solo touring mode via adjustable seat positions; zip-on single-deck conversion spray skirt (sold separately) adds protection. Double-deck conversion spray skirt (sold separately) also available for paddling tandem in rougher and cooler conditions. Rigid bow with aluminum frame reinforcement slices gracefully through water, rivaling the tracking of a hard-shell day touring kayak. Aluminum frame reinforced stern acts as a skeg, increasing the tracking performance; new tracking fin further enhances tracking. Compact enough to take along for an adventure just about anywhere. Offers generous on-board storage space without decreasing legroom, making extended trips much more enjoyable. Durable, triple-layer polyester material with double PVC coating offers superb puncture resistance; welded seams ensure long life. Removable seats with adjustable, inflating back supports improve comfort on the water. Bungee deck lacing and D-ring tie-downs let you stow gear; air-lifted deck sheds spray while water-resistant zipper provides hull storage access. Molded, low-profile rubber handles allow easy transport to and from the water. Paddle holders for quick stowage of paddles while fishing, taking pictures or just relaxing. The AdvancedFrame Convertible Inflatable Kayak comes with a repair kit and a heavy-duty duffel bag for transporting your kayak to your favorite destination.","short_description":"With a rigid bow and stern plus a multi-chamber inflatable body, the AdvancedFrame Convertible Inflatable Kayak offers performance and portability for one or two paddlers.","category":"Paddling","subcategory":"Kayaks","product_group":"Inflatable Kayaks","thumb_url":"http://i1.avlws.com/115/s430531.png","image_url":"http://i1.avlws.com/115/l430531.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430531&tt=df","retail_price":"749.95","sale_price":"749.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430531\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430531.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=736947&amp;link=&amp;tabs=-Details\"></script>","variants":{"7369470013":{"sku":"7369470013","vendor_sku":"AE1007-R","upc":"832994000328","color":"RED","retail_price":"749.95","sale_price":"749.95"}},"categories":["paddling","kayaks","inflatable-kayaks"]}
