{"sku":"737349","manufacturer_id":"8010655","brand_name":"Katadyn","product_name":" Katadyn Base Camp Water Filter","long_description":"For large groups or just lots of water, the Katadyn(R) Base Camp water filter offers effective gravity-fed water filtration-just fill and hang! Easy-to-use dry bag-style design provides safe, potable water for large groups, base camps and families. Large volume 2.6 gallon water bag with roll-top and side-release buckle closure fills quickly and hangs easily. Low maintenance, pleated glassfiber filter supplies fast water flow; cleanable filter protector extends filter life in challenging conditions. Filter physically removes silts, cysts, protozoa and bacteria down to 0.3 microns in size, including giardia, salmonella, cryptosporidia and others. Activated carbon filter core reduces unpleasant tastes and odors. Delivers approximately 16 oz./minute providing up to 200 gallons output depending on water quality. Long 48-inch output hose with on/off valve controls and directs flow of filtered water where you need it. Also includes cleaning sponge and food-grade silicon lubricant for filter O-ring. Lightweight and portable design allows the Katadyn Base Camp water filter to travel easily. Prevent filter from freezing when full of water; dry filter and water bag thoroughly before long-term storage.","short_description":"For large groups or just lots of water, the Katadyn(R) Base Camp water filter offers effective gravity-fed water filtration-just fill and hang!","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426215.png","image_url":"http://i1.avlws.com/115/l426215.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426215&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426215\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426215.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=737349&amp;link=&amp;tabs=-Details\"></script>","variants":{"7373490015":{"sku":"7373490015","vendor_sku":"8010655","upc":"604375106550","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
