{"sku":"738633","manufacturer_id":"CCD4","brand_name":"Smith's","product_name":" Smith's 3-in-1 Sharpening System","long_description":"This 3-in-1 sharpener has a diamond stone sharpener, pre-aligned carbides, and ceramic rods to keep your knives and tools in prime condition. Fine 750-grit diamond stone provides a quick razor-sharp edge. Stone features multiple layers of micron-sized monocrystalline diamonds securely bonded to a flat metal surface. Pre-aligned carbides provide quick edge-setting capabilities with just three or four strokes; use on very dull knives or to restore a damaged edge. Carbide heads are reversible and replaceable: when heads stop cutting they can be rotated and used on the other side. Multi-use fine ceramic rods provide a smooth razor sharp edge; designed to sharpen straight and serrated edged knives. Rods fit securely into specially shaped slots in bottom of base for safe and easy storage. Hook groove in diamond stone and rods will sharpen all size hooks. Storage lid protects the diamond stone and also serves as a hand guard during sharpening. Non-slip rubber feet keep base from shifting while sharpening.","short_description":"This 3-in-1 sharpener has a diamond stone sharpener, pre-aligned carbides, and ceramic rods to keep your knives and tools in prime condition.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Knives And Tools","thumb_url":"http://i1.avlws.com/115/s418315.png","image_url":"http://i1.avlws.com/115/l418315.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418315&tt=df","retail_price":"19.95","sale_price":"19.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418315\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418315.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=738633&amp;link=&amp;tabs=-Details\"></script>","variants":{"7386330018":{"sku":"7386330018","vendor_sku":"CCD4","upc":"027925190098","retail_price":"19.95","sale_price":"19.95"}}}
