{"sku":"739111","manufacturer_id":"JAZ","brand_name":"Prism Designs","product_name":" Prism Designs Jazz Kite","long_description":"The Prism Designs Jazz Kite is the answer for beginners to intermediates seeking big thrills from a forgiving and affordable entry-level kite! Complete package contains everything you need to experience the addictive fun of dual-line kiting; includes strong, color-coded Spectra(R) lines. Plus, package includes winder, handles, adjustable bridle and a compact travel case for easy portability to the best winds. Simple and rugged , Jazz provides incredible performance for an entry-level kite, flying with the ease and control of a large kite. Ripstop nylon sail is both tough and light for long-lasting performance; Kevlar(R)-reinforced nose helps the kite absorb unplanned landings. Carbon-fiber/fiberglass hybrid frame with injection-molded fittings is lightweight yet tough enough to withstand the abuses of first-time pilots. With color-coded lines and bridle, plus instructions printed directly onto the sturdy nylon travel case, Jazz sets up for flight in seconds. The Prism Designs Jazz Kite is rated for winds 5 - 25 MPH. Includes insider's tips and hints for successful kiting.","short_description":"The Prism Designs Jazz Kite is the answer for beginners to intermediates seeking big thrills from a forgiving and affordable entry-level kite!","category":"Lifestyle And Gifts","subcategory":"Games And Toys","product_group":"Outdoor Toys","thumb_url":"http://i1.avlws.com/115/s429883.png","image_url":"http://i1.avlws.com/115/l429883.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=429883&tt=df","retail_price":"60.00","sale_price":"60.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=429883\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m429883.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=739111&amp;link=&amp;tabs=-Details\"></script>","variants":{"7391110001":{"sku":"7391110001","vendor_sku":"JAZ","upc":"649241834762","color":"ASSORTED","retail_price":"60.00","sale_price":"60.00"}},"categories":["gifts","games-and-toys","outdoor-toys"]}
