{"sku":"744609","manufacturer_id":"830664","brand_name":"Leatherman","product_name":"Leatherman Charge AL Multitool","long_description":"With premium materials and fine detailing, Charge AL is a versatile tool with easy-to-unlock blades and heavy-duty strength. Handles are made of aircraft-grade aluminum--heat treated for strength and durability. Blades and body are made from 100% stainless steel to provide years of dependable service. Secure blades are easy to open and close using lock-release on the outside of the handles. Interior blades/tools rotate individually, letting you easily grab one at a time. Includes needlenose and regular pliers, plus wire strippers and newly designed wire cutters and hard-wire cutters that have 58% more cutting area. 154 CM clip-point knife, serrated knife and a saw efficiently handle cutting tasks and are on the outside of tool for quick, easy access. Two bit drivers, large and small, allow you to customize your bit selection to fit every job; a 3/16-inch standard screwdriver tackles the rest. Includes eight zinc-coated steel bits*. Diamond-covered file is designed to work effectively on wood or metal; ruler measures up to 8 inches. Features a can/bottle opener, and scissors that are strong enough to cut seat belts, fishing line, zip-ties and fabric. Removable pocket clip gives you the option of clipping onto belt, backpack or car's visor; quick-release lanyard ring for easy detaching. Compatible with the Leatherman Bit Kit, sold separately. Comes with leather carrying sheath. Assembled in the USA with domestic and imported parts.","short_description":"With premium materials and fine detailing, Charge AL is a versatile tool with easy-to-unlock blades and heavy-duty strength.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Knives And Tools","thumb_url":"http://i1.avlws.com/115/s418319.png","image_url":"http://i1.avlws.com/115/l418319.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418319&tt=df","retail_price":"139.95","sale_price":"139.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418319\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418319.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=744609&amp;link=&amp;tabs=-Details\"></script>","variants":{"7446090016":{"sku":"7446090016","vendor_sku":"830664","upc":"037447119811","color":"BLACK","retail_price":"139.95","sale_price":"139.95"}},"categories":["camping-hiking","gadgets","knives-and-tools"]}
