{"sku":"750789","manufacturer_id":"124 342 515","brand_name":"Native Eyewear","product_name":"Native Eyewear Throttle Polarized Sunglasses - Men's","long_description":"Keep your eyes protected in every season with these low-profile, polarized sunglasses with unbeatable sun and glare protection. Snap-Back(TM) Interchange lens system lets you switch lenses to accommodate a variety of light conditions and activities. Additional lenses sold separately. Polarized Crystal Carbonate(R) lenses have the strongest hard coating available to protect against scratching. P.C.C.(R) lenses pass the rigorous ANSI Z80.3 tests for optical clarity and impact resistance while blocking 100% of harmful UVA and UVB light. Reflex lenses work well for all light conditions, especially extremely bright to moderate sunlight because the Reflex coating blocks more light. Rhyno-Tuff(R) AIR frames endure extreme highs and lows in temperature. Anti-Ocular Intrusion System(R), a 4-point configuration, helps prevent lenses from shooting into your face in the event of high-velocity impact. Self-adjusting Cushinol(TM) nosepads create a nonslip grip that keeps sunglasses in place, ensuring a soft feel and custom fit. Venting system incorporated into the frames enhances airflow and virtually eliminates fog and condensation. Frames are extremely lightweight, yet flexible and durable enough to withstand high velocity collisions. Frames best fit medium profiles. Includes soft carrying/cleaning bag.","short_description":"Keep your eyes protected in every season with these low-profile, polarized sunglasses with unbeatable sun and glare protection.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422755.png","image_url":"http://i1.avlws.com/115/l422755.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422755&tt=df","keywords":"Cycling","retail_price":"89.00","sale_price":"89.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422755\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422755.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=750789&amp;link=&amp;tabs=-Details\"></script>","variants":{"7507890023":{"sku":"7507890023","vendor_sku":"124 302 502","upc":"764824003738","color":"ASPHALT/GRAY","retail_price":"89.00","sale_price":"89.00"},"7507890056":{"sku":"7507890056","vendor_sku":"124 342 515","upc":"764824003707","color":"MAPLE TORT/BROWN","retail_price":"89.00","sale_price":"89.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
