{"sku":"750860","manufacturer_id":"96714709","brand_name":"Mad River","product_name":" Mad River Adventure 14 Canoe","long_description":"Mad River(R) Adventure 14 provides stable paddling performance for both the entry-level paddler and those looking for a reliable family canoe. Design is well-suited to a casual family paddle trip around the lake, early morning fishing or even an overnight trip. Multi-chine hull design delivers stability, rigidity and excellent tracking; shorter hull length means easier handling and transport. Extended decks offer protection from sun and spray while a rolled gunwale provides extra rigidity. Adjustable comfort seating system on bow and stearn seats use contoured EVA foam for increased comfort and grip. Center bench seat adds seating for a third paddler. Rotomolded from the same durable material as Wilderness Systems kayaks, Gen2(TM) high-density polyethylene. Gen2 high-density polyethylene construction offers performance, rugged durability and affordability. Design features generous tumblehome which allows canoe to be paddled easily with standard canoe paddles or longer kayak paddles (230cm +). Multiple beverage holders and storage trays are included for paddler comfort.","short_description":"Mad River(R) Adventure 14 provides stable paddling performance for both the entry-level paddler and those looking for a reliable family canoe.","category":"Paddling","subcategory":"Canoeing","product_group":"Canoes","thumb_url":"http://i1.avlws.com/115/s430351.png","image_url":"http://i1.avlws.com/115/l430351.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430351&tt=df","retail_price":"719.00","sale_price":"719.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430351\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430351.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=750860&amp;link=&amp;tabs=-Details\"></script>","variants":{"7508600017":{"sku":"7508600017","vendor_sku":"96714740","upc":"729282654854","color":"RED","retail_price":"719.00","sale_price":"719.00"}}}
