{"sku":"752084","brand_name":"Innova Disc Golf","product_name":"Innova Disc Golf DX Golf Set - Set of 3","long_description":"See what fun you've been missing! The DX disc golf set from Innova gives you everything you need to play this fun and popular sport. Set of three discs includes driver, mid-range and putt-and-approach discs for versatile gameplay on nearly any disc golf course including your own! Cheetah driver disc is perfect for all tee shots, whether thrown backhand or sidearm. Shark mid-range disc can be used for tee shots, approach shots, and long range putts. Aviar putt-and-approach disc makes putting a cinch as this disc travels straight at low speeds. Crafted with a deluxe (DX) blend of grippy, resilient polymers to offer the best combination of grip and durability. Ideal for beginners to experts, all discs are PDGA approved for use on all disc golf courses. Sorry, color and weight requests cannot be accommodated; please shop in-store for specific colors and weights.","short_description":"See what fun you've been missing! The DX disc golf set from Innova gives you everything you need to play this fun and popular sport.","category":"Lifestyle And Gifts","subcategory":"Games And Toys","product_group":"Games","thumb_url":"http://i1.avlws.com/115/s429663.png","image_url":"http://i1.avlws.com/115/l429663.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=429663&tt=df","retail_price":"29.00","sale_price":"29.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=429663\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m429663.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=752084&amp;link=&amp;tabs=-Details\"></script>","variants":{"7520840013":{"sku":"7520840013","upc":"080757740039","retail_price":"29.00","sale_price":"29.00"}},"categories":["gifts","games-and-toys","games"]}
