{"sku":"757722","manufacturer_id":"899333516","brand_name":"Delorme","product_name":" DeLorme Rhode Island and Connecticut Atlas and Gazetteer","long_description":"The DeLorme Connecticut and Rhode Island Atlas and Gazetteer features topographic maps along with roads, trails and recreational hotspots. Full color shaded relief topographic maps are easy to read; Scale 1:65,000, one inch represents one mile; contour interval of 100 feet. Each large format page (11 x 15.5 inches) covers an area of 10.2 x 13.6 miles; GPS grid and tick marks allow ease of use with GPS unit. Full index of place names and map features (lakes, rivers, mountains, beaches, etc.); index of street names for city maps. Full city street maps for Bridgeport, Hartford, New Haven and Providence. In-depth gazetteer includes information on attractions, campgrounds, fishing, golf courses, historic sites, hunting, paddling and recreation areas. Also includes information on scenic drives, ski areas, trails and unique natural features; each entry is cross-referenced to the corresponding map. Great for in-vehicle reference, exploring back roads, planning and navigation, business travel and armchair journeys. Copyright 2003, DeLorme Publishing; 60 pp. of maps; 80 pp. overall.","short_description":"The DeLorme Connecticut and Rhode Island Atlas and Gazetteer features topographic maps along with roads, trails and recreational hotspots.","category":"Books And Maps","subcategory":"Maps","product_group":"Paper Maps","thumb_url":"http://i1.avlws.com/115/s410059.png","image_url":"http://i1.avlws.com/115/l410059.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410059&tt=df","retail_price":"19.95","sale_price":"19.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410059\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410059.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=757722&amp;link=&amp;tabs=-Details\"></script>","variants":{"7577220010":{"sku":"7577220010","vendor_sku":"899333516","upc":"019916003517","retail_price":"19.95","sale_price":"19.95"}}}
