{"sku":"758623","manufacturer_id":"9780898868722","product_name":"Best Hikes with Kids: Connecticut, Massachusetts and Rhode Island - 3rd Edition","long_description":"Get out-and-about with this guide to 80 urban-accessible and kid-friendly hikes in Connecticut, Massachusetts and Rhode Island. Authors: Cynthia Copeland, Thomas J. Lewis and Emily Kerr. Softcover; 253 pages; black-and-white photographs; maps. The Mountaineers; copyright 2007. Hikes are selected for kid appeal, but are also great for anyone looking for a quick and easy break from the hustle-bustle of everyday life. Distances range from one to six miles round-trip; summaries include directions to the trailhead, mileage, elevation gain and hiking time. Icons give snapshot data on best seasons to hike and whether overnight camping is an option. Trails are rated according to difficulty for children, making it easy for parents and caretakers to plan for young adventurers. Basic maps give you an overview of each hike; includes parking, picnic areas, restrooms, trail features and viewpoints. In addition to hike descriptions, this guide provides valuable information and tips for sharing the outdoors with the next generation of stewards.","short_description":"Get out-and-about with this guide to 80 urban-accessible and kid-friendly hikes in Connecticut, Massachusetts and Rhode Island.","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Camping And Hiking Guidebooks","thumb_url":"http://i1.avlws.com/115/s408967.png","image_url":"http://i1.avlws.com/115/l408967.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408967&tt=df","retail_price":"16.95","sale_price":"16.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408967\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408967.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=758623&amp;link=&amp;tabs=-Details\"></script>","variants":{"7586230018":{"sku":"7586230018","vendor_sku":"9780898868722","retail_price":"16.95","sale_price":"16.95"}},"categories":["books","guidebooks","camping-and-hiking-guidebooks"]}
