{"sku":"760547","manufacturer_id":"1565795377","product_name":" Cycling Arizona: The Statewide Road Biking Guide","long_description":"Whether you're a resident or visiting, this guide provides all the information you need to explore Arizona on two wheels. Author: Christine Maxa. Softcover; 280 pages; full-color photographs, maps and graphs. Westcliffe Publishers, Inc; copyright 2006. Skilled cyclists and casual riders alike will find plenty of options to choose from among the 106 routes listed. Rides range from fewer than 10 miles to more than 100; trips can be completed in a few hours or over several days. Each detailed route description includes an elevation profile; easy-to-read graphs show what level of challenge is offered. Also includes peak cycling times, special considerations and fun facts. Regional and local maps help you chart your course; food, lodging and support service recommendations to keep you traveling in comfort. Appendix route-finder lets you shop at a glance for your next journey.","short_description":"Whether you're a resident or visiting, this guide provides all the information you need to explore Arizona on two wheels.","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Cycling Guidebooks","thumb_url":"http://i1.avlws.com/115/s409383.png","image_url":"http://i1.avlws.com/115/l409383.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=409383&tt=df","retail_price":"19.95","sale_price":"19.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=409383\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m409383.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=760547&amp;link=&amp;tabs=-Details\"></script>","variants":{"7605470017":{"sku":"7605470017","vendor_sku":"1565795377","retail_price":"19.95","sale_price":"19.95"}}}
