{"sku":"761267","manufacturer_id":"412077","brand_name":"Black Diamond","product_name":" Black Diamond Viper Ice Tool - Adze","long_description":"The evolution of the Black Diamond Viper adze ice tool continues with key updates that keep you swinging into ice with ease. New hydroformed shaft is stiffer and lighter than the previous model, yet it still maintains excellent clearance. Hydroforming uses pressurized water to expand the Viper's shaft into a unique shape that is exceptionally stiff and light. Equipped with Viper Fang and Strike to cradle your hands while climbing leashless; Strike allows you to match hands or choke up while climbing. Chromoly-steel laser pick has a thin taper and low-volume tip that penetrates easily with a low displacement of ice. Stainless-steel head and 7075 aluminum shaft combine for lightweight but durable power on ice and mixed routes. Superb balance creates a natural swing for placements with excellent purchase. Scoop-shape adze chops and cleans steps and anchor placements. Thermoplastic urethane grip provides a sure hold while wearing gloves. A great tool for mixed climbing, waterfall ice and drytool classics.","short_description":"The evolution of the Black Diamond Viper adze ice tool continues with key updates that keep you swinging into ice with ease.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Ice Axes And Tools","thumb_url":"http://i1.avlws.com/115/s407531.png","image_url":"http://i1.avlws.com/115/l407531.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407531&tt=df","retail_price":"239.95","sale_price":"239.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407531\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407531.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=761267&amp;link=&amp;tabs=-Details\"></script>","variants":{"7612670013":{"sku":"7612670013","vendor_sku":"412077","upc":"793661092933","color":"ORANGE","retail_price":"239.95","sale_price":"239.95"}}}
