{"sku":"761906","manufacturer_id":"SPPF-RP","brand_name":"Steripen","product_name":" SteriPEN Classic Water Purifier with Prefilter","long_description":"Let the SteriPEN Classic ultraviolet purifier with prefilter be your single source for potable water on your next traveling or backpacking adventure. Ultraviolet (UV-C) light rays safely sterilize clear water by destroying 99.99% of viruses, bacteria and protozoa, including Giardia and Cryptosporidium. SteriPEN protects you from risks that cause botulism, cholera, dysentery and typhoid, just to name a few. But if clear water is not available, no worries-the SteriPEN prefilter clears particulates and debris from water. Prefilter fits Nalgene(R) and other water bottles with 63mm wide-mouth openings; pour source water through filter, and clean water enters bottle. Then use the SteriPEN purifier to treat the water; just press a button and gently agitate the water with a quick stir. Purifies 16 fl. oz. of water (cold or warm) in less than a minute or 32 fl. oz. in a minute and a half. Small size fits most containers-use it in cups, mugs, water bottles and canteens. SteriPEN turns itself off once ultraviolet treatment is complete; can be used up to 8,000 times! Watertight seals keep water away from the electronics; rubberized inset grips for secure handling in wet conditions. Low-power indicator lets you know when batteries need replacing; twist-off cap for easy battery access. Long used by municipal water districts and bottling companies, low-level UV-C light treats water safely, and unit's light will not damage eyes or skin. Purify 200 16 fl. oz. glasses of water with 4 lithium AA batteries (batteries sold separately). SteriPEN recommends the use of name-brand lithium AA batteries with a capacity of 800 milliamp hours (mAh) or greater, such as Duracell, Energizer and Panasonic. SteriPEN does not recommend the use of alkaline batteries, as they provide very few SteriPEN treatments. Nickel-metal hydride (NiMH) rechargeable batteries are approved for use; be sure to fully charge batteries before use.","short_description":"Let the SteriPEN Classic ultraviolet purifier with prefilter be your single source for potable water on your next traveling or backpacking adventure.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426239.png","image_url":"http://i1.avlws.com/115/l426239.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426239&tt=df","retail_price":"69.95","sale_price":"51.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426239\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426239.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=761906&amp;link=&amp;tabs=-Details\"></script>","variants":{"7619060010":{"sku":"7619060010","vendor_sku":"SPPF-RP","upc":"899321000147","retail_price":"51.93","sale_price":"51.93"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
