{"sku":"762054","manufacturer_id":"03-915","brand_name":"Oakley","product_name":"Oakley Flak Jacket XLJ Sunglasses - Men's","long_description":"With top-half frame coverage, these open-edge design sunglasses are a combination of enhanced style and clarity. Open-edge design extends your vertical field of vision and retains the peripheral clarity of XYZ Optics(R). O Matter(R) nylon frames are lightweight, stress-resistant and flexible for exceptional durability. Shatterproof and scratch-resistant Plutonite(R) polycarbonate lenses provide added durability. Oakley Hydrophobic permanent lens coating prevents sweat and rain from building up and repels skin oils, keeping your vision clear. Black Iridium(R) tint lens provides neutral contrast and 10% light transmission-best for extremely bright light. Reflective Iridium(R) coating enhances optical clarity and contrast and reduces glare in varying light conditions. Unobtainium(R) nose pads and stem sleeves are hydrophilic rubber that becomes tackier as you perspire, holding eyewear in place as you move. Two sizes of interchangeable nosepieces are included to give you the best fit and performance. To preserve the superior optical quality, sunglasses come with a specially woven, electrostatic Microclear bag for cleaning and storage. XLJ = Extra lens coverage.","short_description":"With top-half frame coverage, these open-edge design sunglasses are a combination of enhanced style and clarity.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422759.png","image_url":"http://i1.avlws.com/115/l422759.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422759&tt=df","keywords":"Cycling","retail_price":"150.00","sale_price":"150.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422759\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422759.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=762054&amp;link=&amp;tabs=-Details\"></script>","variants":{"7620540018":{"sku":"7620540018","vendor_sku":"03-915","upc":"700285039152","color":"BLACK/BLACK IRIDIUM","retail_price":"150.00","sale_price":"150.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
