{"sku":"763654","manufacturer_id":"BE0BENWYAT","brand_name":"Benchmark Maps","product_name":"Benchmark Maps Wyoming Road & Recreation Atlas","long_description":"The Wyoming Road and Recreation Atlas provides a true, authoritative reference. Plan your next adventure using this complete map resource. Atlas's award-winning design includes generous page-to-page overlaps, GPS grids and easy-to-read symbols. Includes the renowned Landscape Maps(TM) in 1:400,000 scale, showcasing beautiful shaded relief of land topography. Maps clearly show recreation information and road classes, from freeways to jeep trails, for entire state at a scale of 1 in. = 6.2 mi. (1:400,000). Recreation Guide includes parks, monuments, historic sites, campgrounds, RV parks and boat launches. Includes ''Metro Area Maps'' of large cities at 1:125,000 scale to enhance detail and simplify urban navigation. Climate graphs for most cities help you plan when best to visit. Comprehensive index helps you quickly locate attractions and destinations. Softcover; 96 pages, measures15 x 11 in.; color maps. Published by Benchmark Maps; copyright 2007. Maps are field-checked for accuracy and also include regional maps with mileages and mileage chart. Includes rest areas. exit numbers, point-to-point roadway mileages, campgrounds, RV parks, road surface type, cities and elevations.","short_description":"The Wyoming Road and Recreation Atlas provides a true, authoritative reference. Plan your next adventure using this complete map resource.","category":"Books And Maps","subcategory":"Maps","product_group":"Paper Maps","thumb_url":"http://i1.avlws.com/115/s410071.png","image_url":"http://i1.avlws.com/115/l410071.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410071&tt=df","retail_price":"22.95","sale_price":"22.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410071\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410071.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=763654&amp;link=&amp;tabs=-Details\"></script>","variants":{"7636540010":{"sku":"7636540010","vendor_sku":"BE0BENWYAT","retail_price":"22.95","sale_price":"22.95"}},"categories":["books","maps","paper-maps"]}
