{"sku":"766116","manufacturer_id":"56649","brand_name":"Gregory","product_name":" Gregory Palisade 80 Pack","long_description":"A classic favorite, the redesigned Gregory Palisade pack features all-angle access and an updated suspension for a week on the trail. Response Custom Fit Suspension(TM) system pivots to adjust hipbelt to your hip angle; system also pivots to mirror your body as it moves. Quick-Adjust hipbelt adjusts to five different hipbelt angles with a simple pull of a quick-release tab. HDPE framesheet with twin 7075-T6 aluminum stays and a cross-stay prevents barreling under heavy loads. 3-D precurved hipbelt and harness use dual-density foams laminated to the surface fabric, resulting in cushioning without pinching or binding. Ventilated dual-density molded foam backpanel moves moisture off the back. Design offers three ways to get at gear in the main compartment with top-loading, front panel and bottom access. Side compression straps secure both large and small loads for optimal stability. Hydration-compatible design features a reservoir sleeve and drink-tube exit port for on-the-go hydration (reservoir sold separately). Features dual hipbelt pockets, side stretch pocket, hide-away water bottle pocket and stash pocket. Large front zip pocket keeps bulky gear easily accessible. Top lid pocket lets you keep compass, map, small essentials and raingear close at hand; lid pocket is removable and converts to a lumbar pack. Rubberlike thermoplastic elastomer covers the bottom of the pack providing long-lasting wear and waterproof protection from the elements. Made with 210-denier ripstop nylon and nylon twill for strength, durability and lightness.","short_description":"A classic favorite, the redesigned Gregory Palisade pack features all-angle access and an updated suspension for a week on the trail.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410379.png","image_url":"http://i1.avlws.com/115/l410379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410379&tt=df","keywords":"multiday","retail_price":"399.00","sale_price":"399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=766116&amp;link=&amp;tabs=-Details\"></script>","variants":{"7661160056":{"sku":"7661160056","vendor_sku":"GM56649","upc":"844930034816","size":"M","color":"IRON GRAY","retail_price":"399.00","sale_price":"399.00"},"7661160064":{"sku":"7661160064","vendor_sku":"GM56650","upc":"844930034823","size":"L","color":"IRON GRAY","retail_price":"399.00","sale_price":"399.00"},"7661160098":{"sku":"7661160098","vendor_sku":"GM56647","upc":"844930034793","size":"L","color":"CINDER CONE RED","retail_price":"399.00","sale_price":"399.00"}}}
