{"sku":"766118","manufacturer_id":"53767","brand_name":"Gregory","product_name":"Gregory Deva 85 Pack - Women's","long_description":"With all- angle access, loads of organization and increased capacity, the Gregory Deva pack is ideal for women who wander. Response Custom Fit Suspension(TM) system pivots to adjust hipbelt to your hip angle; system also pivots to mirror your body as it moves. Quick-Adjust hipbelt adjusts to five different hipbelt angles with a simple pull of a quick release tab. HDPE framesheet with twin 7075-T6 aluminum stays and an anti-barreling cross-stay prevents barreling under heavy loads. Women's 3-D precurved hipbelt and harness use dual-density foams laminated to the surface fabric, resulting in cushioning without pinching or binding. Specifically engineered to fit a women's shape, the narrow ventilated dual-density molded foam backpanel helps move moisture off the back. Design offers four ways to get at your gear in the main compartment via top-loading, front panel, side and bottom accesses. Side compression straps secure both large and small loads for optimal stability. Hydration-compatible design features a reservoir sleeve and drink-tube exit port for on-the-go hydration (reservoir sold separately). Features dual hipbelt pockets, side stretch pocket, hide-away water bottle pocket and stash pocket. Large front zip pocket keeps bulky gear easily accessible. Removable top lid pocket converts to a lumbar pack and lets you keep compass, maps, small essentials and raingear close at hand. Rubberlike thermoplastic elastomer covers the bottom of the pack, providing long-lasting wear and waterproof protection from the elements. Features 210-denier ripstop nylon and nylon twill for strength, durability and lightness.","short_description":"With all- angle access, loads of organization and increased capacity, the Gregory Deva pack is ideal for women who wander.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410387.png","image_url":"http://i1.avlws.com/115/l410387.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410387&tt=df","keywords":"multiday","retail_price":"429.00","sale_price":"429.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410387\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410387.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=766118&amp;link=&amp;tabs=-Details\"></script>","variants":{"7661180054":{"sku":"7661180054","vendor_sku":"GM53765","upc":"844930000309","size":"M","color":"CALISTOGA BLUE","retail_price":"429.00","sale_price":"429.00"},"7661180062":{"sku":"7661180062","vendor_sku":"GM53763","upc":"844930000286","size":"Xs","color":"CALISTOGA BLUE","retail_price":"429.00","sale_price":"429.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
