{"sku":"767345","manufacturer_id":"522501G","brand_name":"Stohlquist","product_name":" Stohlquist TowMOTION PFD","long_description":"The Stohlquist TowMOTION PFD accommodates a tow belt (sold separately) for those unexpected instances where a rescue is necessary. Durable Cordura(R) nylon shell resists abrasion and UV rays for long-lasting service. Stretchy, adjustable neoprene shoulders follow your movement without hindering it. Eco-conscious Gaia(TM) PVC-free foam is soft and flexible, and won't break down in a wet environment. Unique cross-chest cinch strap design totally eliminates annoying ride-up and keeps flotation in place to float you higher when in the water. Hand-beveled foam provides a close, comfortable fit; High-waistline cut and short lower back won't hinder motion or rub backrest. Roomy, zippered bellowed pocket with drainage grommet stores accessories securely. Zippered outer pocket is reinforced with EVA foam to protect a weather radio or GPS. Center-zip design with non-corroding nickel zipper slider allows easy entry. Cool mesh side panels with wide side cinch straps secure fit and allow cooling airflow. 3M reflective accents enhance visibility. 4-way lash tab lets you secure accessories such as strobes or knives. Dual-adjustable waist strap with side-release buckle closure.","short_description":"The Stohlquist TowMOTION PFD accommodates a tow belt (sold separately) for those unexpected instances where a rescue is necessary.","category":"Paddling","subcategory":"Pfds","product_group":"Men's Pfds","thumb_url":"http://i1.avlws.com/115/s431903.png","image_url":"http://i1.avlws.com/115/l431903.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431903&tt=df","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431903\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431903.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=767345&amp;link=&amp;tabs=-Details\"></script>","variants":{"7673450016":{"sku":"7673450016","vendor_sku":"522501G","upc":"053242204521","size":"S/M","color":"FIREBALL RED","retail_price":"149.95","sale_price":"149.95"}},"categories":["paddling","pfds","mens-pfds"]}
