{"sku":"767849","manufacturer_id":"9780939431359","product_name":" Great Day Hikes In and Around Napa Valley - Third Edition","long_description":"A guide to day hikes in the 22 parks and preserves in the wild wonderland surrounding the famous vineyards of this celebrated destination. Author: Ken Stanton. Softcover; 231 pages; black-and-white pictures and maps. Bored Feet Press; copyright 2008. Updated and expanded, the third edition features hikes in the Knoxville-Berryessa Lake District, both directions of the Oat Hill Mine Trail and more. Venture out to: the new Palisades Trail, Oat Hill Mine Trail, Skyline Wilderness Park, Napa Valley Ecological Reserve and Bothe-Napa Valley State Park. Enjoy the world's only petrified redwood forest, summit the Bay Area's highest peak, and hike the rugged edge of the Coast Range on Blue Ridge. Hikes range from casual walks suitable for small children to endurance contests fit for a Nepalese Sherpa. Author covers directions to trail, hike distance, hike grade, elevation gain, best time of year to hike, facilities and other pertinent information.","short_description":"A guide to day hikes in the 22 parks and preserves in the wild wonderland surrounding the famous vineyards of this celebrated destination.","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Camping And Hiking Guidebooks","thumb_url":"http://i1.avlws.com/115/s453635.png","image_url":"http://i1.avlws.com/115/l453635.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=453635&tt=df","retail_price":"16.00","sale_price":"16.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=453635\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m453635.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=767849&amp;link=&amp;tabs=-Details\"></script>","variants":{"7678490017":{"sku":"7678490017","vendor_sku":"9780939431359","size":"media.","retail_price":"16.00","sale_price":"16.00"}},"categories":["books","guidebooks","camping-and-hiking-guidebooks"]}
