{"sku":"768140","brand_name":"Delta Kayaks","product_name":" Delta Kayaks TwentyT Tandem Kayak with Rudder","long_description":"A superb blend of performance and cargo capacity, Delta TwentyT will forever change the way you think about tandem kayaks! Thermoformed ABS plastic hull material is stiff and light like traditional composite kayaks and with similar looks, but costs considerably less. Acrylic Solarkote(TM) protects the high gloss and color of the kayak from UV rays. Hull shape enhances primary stability without compromising secondary stability or manuverability, even when fully loaded for long trips. Seats are adjustable forward and backward even while paddling so the trim of the kayak can be adjusted on the move. Cockpit-deployable aluminum rudder system enhances tracking while minimizing side-slipping and helping with steering when you need it. 4 bulkheads create 3 expedition-sized hatches to add buoyancy and keep all your gear dry during long trips or day paddles. Hardshell, recessed hatch covers with neoprene hatch seals are secured via bungee closures. Neoprene-padded seat and adjustable backband offer comfort and support on long trips; neoprene padding on thigh bracing improves comfort and control. Cockpit-adjustable foot braces fit most paddlers and feature a locking mechanism to disable rudder control movement. Bungee deck rigging at bow and stern retains extra gear. Ergonomic rubber grab handles are easy on hands and make car-topping and transport to the water a snap.","short_description":"A superb blend of performance and cargo capacity, Delta TwentyT will forever change the way you think about tandem kayaks!","category":"Paddling","subcategory":"Kayaks","product_group":"Sea Kayaks","thumb_url":"http://i1.avlws.com/115/s430603.png","image_url":"http://i1.avlws.com/115/l430603.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430603&tt=df","retail_price":"3295.00","sale_price":"3295.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430603\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430603.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=768140&amp;link=&amp;tabs=-Details\"></script>","variants":{"7681400029":{"sku":"7681400029","upc":"476814000299","color":"YELLOW/WHITE","retail_price":"3295.00","sale_price":"3295.00"}},"categories":["paddling","kayaks","sea-kayaks"]}
