{"sku":"768245","manufacturer_id":"038048-651-1-O/","brand_name":"Osprey","product_name":"Osprey Ace 48 Pack - Youth","long_description":"Not just a scaled-down adult pack, the Ace 48 pack from Osprey was designed to fit children's dimensions and proportions-and it grows with them! Fits a variety of backs, thanks to its generous torso-length adjustment: just rip it, adjust it and stick it. Pack is sized to fit kids from approximately 12 to 16 years old. To ensure a healthy and comfortable carry, loaded pack should not be more than 15 to 20 percent of child's body weight. AirScape backpanel features three sections of ridged foam and a central air chimney for increased ventilation. Running down the sidewall, peripheral rods anchor to load-lifter straps and hipbelt, actively transferring load and resisting sag. Top-loading design gives you easy access to the pack's contents; two zippered pockets in removable/extendable lid let you stash maps and small items. Retractable sleeping bag compartment has straps to pull it in from the inside allowing the negative space on the outside for a sleeping bag or pad. ErgoPull hipbelt closure provides extra cinching leverage-drawing tension along top and bottom, not through the center-relieving hipbone pressure. Zippered pockets on hipbelt let you stash small essentials such as a digital camera, snacks, lipbalm and sunblock. Front stretch pocket is ideal for stowing jacket, hat and other often-used essentials. Large stretch-woven side pockets hold your water bottles and organize other small gear items. Hydration-compatible design features reservoir sleeve and a drink tube exit port for on-the-go hydration (reservoir sold separately). Bottom of pack features a small zippered compartment to hold built-in raincover, which is tethered for security. Backpacker April '09 declares that the Osprey Ace 48 \"represents a sea change in comfort, features and durability among youth backpacks.\".","short_description":"Not just a scaled-down adult pack, the Ace 48 pack from Osprey was designed to fit children's dimensions and proportions-and it grows with them!","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410395.png","image_url":"http://i1.avlws.com/115/l410395.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410395&tt=df","keywords":"multiday","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410395\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410395.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=768245&amp;link=&amp;tabs=-Details\"></script>","variants":{"7682450015":{"sku":"7682450015","vendor_sku":"038048-651-1-O/","upc":"877257007850","size":"One Size","color":"BLUE YONDER","retail_price":"159.95","sale_price":"159.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
