{"sku":"768902","manufacturer_id":"BV500","brand_name":"Bearvault","product_name":" BearVault BV500 Food Container","long_description":"Keep bears from inviting themselves to your feast! The BearVault BV500 container features simple access, light weight and large volume. Durable polycarbonate construction keeps the weight light and the inner volume high. Large rainproof lid features a snapping bump/tab locking mechanism and screws on and off easily without the use of tools. Dimpled exterior keeps tie-down straps from shifting and eliminates the need for a carrying pouch. Translucent vault makes finding your meal selection easy. Container helps suppress strong odors from food, sunscreen, insect repellent, soap and toothpaste, lessening the chance of bear vs. human conflict. Hand wash in warm water with a mild dishwashing detergent. With the lid fully closed the BearVault also makes a great camp seat. This BearVault model has approval from both the Sierra Interagency Black Bear Group and Interagency Grizzly Bear Committee. Store BearVault at least 100 yards downwind of campsite, preferably in the shade to keep contents cool. .","short_description":"Keep bears from inviting themselves to your feast! The BearVault BV500 container features simple access, light weight and large volume.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"Bear Safety","thumb_url":"http://i1.avlws.com/115/s419595.png","image_url":"http://i1.avlws.com/115/l419595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=419595&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=419595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m419595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=768902&amp;link=&amp;tabs=-Details\"></script>","variants":{"7689020019":{"sku":"7689020019","vendor_sku":"BV500","upc":"893554000097","retail_price":"79.95","sale_price":"79.95"}}}
