{"sku":"772278","manufacturer_id":"5848","brand_name":"Arc'teryx","product_name":" Arc'teryx Epsilon SV Hoodie Jacket - Women's","long_description":"Laminated fabric makes the Arc'Teryx Epsilon SV breathable jacket an excellent choice for backcountry touring or mixed-weather aerobic use. Comfortable polyester sheds snow, cuts wind and transfers moisture from your skin so you stay comfortable. Moisture-wicking fleece interior helps draw moisture away from skin, sending it to the fabric's exterior where it can quickly evaporate. Structured(TM) hood with brim fits over your climbing helmet; 1-handed cinch adjustments provide optimal visibility; hood can also be adjusted via handwarmer pockets. Features 2 mesh-lined handwarmer pockets and single internal pocket; zippers are protected with Zipper Garages(TM) to ensure leak-free seals. Jacket fits snugly and layers easily; adjustable drawcord waist and elasticized cuffs enhance the fit while sealing out the cold. Gusseted underarms allow a full range of motion without binding. Waist length with drop back for added coverage. Full-length zipper with chin guard to shield you from possible zipper abrasion.","short_description":"Laminated fabric makes the Arc'Teryx Epsilon SV breathable jacket an excellent choice for backcountry touring or mixed-weather aerobic use.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Soft-Shell Jackets","thumb_url":"http://i1.avlws.com/115/s394407.png","image_url":"http://i1.avlws.com/115/l394407.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=394407&tt=df","retail_price":"235.00","sale_price":"163.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=394407\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m394407.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=772278&amp;link=&amp;tabs=-Details\"></script>","variants":{"7722780058":{"sku":"7722780058","vendor_sku":"5848","upc":"806955353679","size":"Xl","color":"BLUE","retail_price":"163.93","sale_price":"163.93"}}}
