{"sku":"772421","manufacturer_id":"035352-354-3-LG","brand_name":"Osprey","product_name":"Osprey Variant 52 Pack","long_description":"Ski mountaineering, ice climbing, and rock climbing-Osprey thought of it all when developing the new top loading Variant 52 pack for vertical endeavors. Lightweight suspension consists of a removable HDPE framesheet with aluminum tubing framesheet. Fixed Stretch comfort shoulder harness provides superb carry with rolled seams for added comfort; rescue whistle is incorporated into sternum-strap buckle. 3-D contoured EVA hipbelt is removable and stowable; to stow while climbing, tuck hipbelt out of the way by threading webbing and buckles through tool holster slot. Thermoformed, contoured back panel provides carrying comfort and snow shedding capabilities. Dual, adjustable tool bungee Y-clips stow ice tool shafts quickly, with corresponding holsters securely attaching ice tool head, including leashless ice tools. Removable top pocket has a zippered pocket underneath and an extendable spindrift collar to keep snow out of the pack; collar can be rolled up. Front pocket stores often-used essentials and is protected from the elements with a water-resistant zipper. Reinforced front crampon shield compression pocket provides secure storage and easy access. Pack includes protection pockets for easy storage and quick access to wands, probes and pickets. 3-point haul system, consisting of grab handle and 2 reinforced loops located at the top of pack, facilitate big wall hauling. Internal sleeve and drink tube exit port accommodate a 3-liter reservoir (sold separately) for hydration on the go. Side compression straps cnch down loads for jostle-free carrying; dual ski carry loops.","short_description":"Ski mountaineering, ice climbing, and rock climbing-Osprey thought of it all when developing the new top loading Variant 52 pack for vertical endeavors.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s450723.png","image_url":"http://i1.avlws.com/115/l450723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450723&tt=df","keywords":"multiday","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=772421&amp;link=&amp;tabs=-Details\"></script>","variants":{"7724210021":{"sku":"7724210021","vendor_sku":"035352-354-3-LG","upc":"877257007942","size":"L","color":"PYRO","retail_price":"199.95","sale_price":"199.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
