{"sku":"772922","manufacturer_id":"806020202","brand_name":"Dansko","product_name":"Dansko Professional Cabrio Clogs - Women's","long_description":"The popular Dansko Professional Clogs combine the strength and quality of European footwear with lightweight flexibility and support. Breathable, full-grain Cabrio leather uppers are oiled for water resistance and durability; leather-lined, padded collars add comfort across insteps. Oiled leather may occasionally appear to have light scuffs-rub lightly with fingertips to smooth out scuffs. Leather uppers are securely stapled to the bases for durability. Protective polyethylene heel counters offer lateral stability and act as natural shoe horns, letting heels move up and down while walking. Sturdy thermoplastic polyurethane toe boxes protect feet from bumps and enhance durability without compromising toe space. Nonallergenic, vegetable-tanned leather sockliners wrap around Poliyou(R) synthetic foam footbeds that manage moisture. Poliyou footbeds consist of a breathable, recycled EVA foam for cushioning; antimicrobial treatment controls odors. Polypropylene supports within the midsole allow heel-to-toe flexibility and side-to-side stability, reducing torque and overpronation. Molded polyurethane outsole/midsole units offer full flexibility, dependable shock absorption and nonslip traction. Rocker-bottom outsoles propel feet forward for easy walking; slip-resistant outsole carries SATRA approval. Proudly carries the Seal of Acceptance from the American Podiatric Medical Association.","short_description":"The popular Dansko Professional Clogs combine the strength and quality of European footwear with lightweight flexibility and support.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s387279.png","image_url":"http://i1.avlws.com/115/l387279.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=387279&tt=df","retail_price":"120.00","sale_price":"120.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=387279\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m387279.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=772922&amp;link=&amp;tabs=-Details\"></script>","variants":{"7729220025":{"sku":"7729220025","vendor_sku":"806020202","upc":"673088034412","size":"37","color":"BLACK","retail_price":"120.00","sale_price":"120.00"},"7729220033":{"sku":"7729220033","vendor_sku":"806020202","upc":"673088034429","size":"38","color":"BLACK","retail_price":"120.00","sale_price":"120.00"}},"categories":["footwear","womens-footwear","womens-shoes"]}
