{"sku":"776502","manufacturer_id":"TSR28","brand_name":"Big Agnes","product_name":" Big Agnes String Ridge 2 Tent","long_description":"The Big Agnes String Ridge 2 is a winning choice for people who move in the mountains year-round. Easy set up, good ventilation, light weight and ample space are just a few of the amenities available on the String Ridge 2. Two-hub pole assembly, one crossover pole and DAC Twist clips contribute to the tent's strength and stability. Oversize stake-out loops work with an ice axe, skis or ski poles. Tent's reflective corner webbing and heavy-duty reflective guyline stand out at night in your headlamp's beam. DAC Featherlite(R) NSL poles are superlight and strong, featuring press-fit connectors and lightweight hubs. NSL anodization uses far less harsh acid than conventional anodization and recycles wastewater during rinsing process for less environmental impact. Fly and floor are made of lightweight ripstop nylon treated with silicone for durability and coated with polyurethane for waterproofness. Tent body is made from breathable ripstop nylon; closeable mesh vents keep air circulating inside. Interior mesh pockets keep gear organized. Use the String Ridge 2 footprint (sold separately), tent fly and poles to pitch a lightweight shelter. Includes stuff sacks, guyline and lightweight, oversized Mega X-peg stakes. Average minimum weight specification is based on tent, rainfly and poles only.","short_description":"The Big Agnes String Ridge 2 is a winning choice for people who move in the mountains year-round.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s449519.png","image_url":"http://i1.avlws.com/115/l449519.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449519&tt=df","retail_price":"649.95","sale_price":"649.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449519\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449519.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=776502&amp;link=&amp;tabs=-Details\"></script>","variants":{"7765020016":{"sku":"7765020016","vendor_sku":"TSR28","upc":"873840003704","size":"2 Person","color":"RUST/CHARCOAL","retail_price":"649.95","sale_price":"649.95"}}}
