{"sku":"776727","manufacturer_id":"899333834","brand_name":"Delorme","product_name":" DeLorme California Atlas and Gazetteer","long_description":"From the gleaming flanks of Mount Shasta to the shimmering beaches of San Diego, this DeLorme atlas covers the entire state of California. Covers wilderness areas, unique natural features, beaches, bicycle routes, campgrounds, hiking, botanical gardens, wineries and fishing areas. Also includes back roads, museums, golf courses, historic sites, scenic drives, hiking areas, campgrounds, biking areas and boat launch sites. 159 quadrangular maps cover approximately 24 miles wide by 33.5 miles high; scale is 1:200,000; one in. represents approximately 3.16 mi. Features tips on how to estimate your mileage on a road trip, use a GPS with the atlas and how to orient the maps with a compass. Detailed atlas index, listed alphabetically with map page and grid coordinates, helps locate points of interest easily. GPS-compatible maps contain Lat./Lon. tick marks and grid lines using the standard WGS84 datum. Latitude spacing is at 7-minute-and-15-second intervals while longitude is at 8-minute intervals. First edition; copyright 2008 DeLorme; 160 pages.","short_description":"From the gleaming flanks of Mount Shasta to the shimmering beaches of San Diego, this DeLorme atlas covers the entire state of California.","category":"Books And Maps","subcategory":"Maps","product_group":"Paper Maps","thumb_url":"http://i1.avlws.com/115/s410163.png","image_url":"http://i1.avlws.com/115/l410163.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410163&tt=df","retail_price":"24.95","sale_price":"24.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410163\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410163.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=776727&amp;link=&amp;tabs=-Details\"></script>","variants":{"7767270015":{"sku":"7767270015","vendor_sku":"899333834","retail_price":"24.95","sale_price":"24.95"}}}
