{"sku":"777606","brand_name":"Rei","product_name":"REI XR 8 x 32 Waterproof Binoculars","long_description":"The REI XR 8 x 32 binoculars are an outstanding value and deliver great magnification and clarity. They are compact and light enough to go just about anywhere. Fully multicoated lenses using anti-reflective coatings provide superb light transmission, even in low light. BaK4 prisms match the optical system to enhance image quality, brightness and resolution to discern fine detail at long distances. Roof-prism style is less bulky and more compact than traditional or porro prism styles, making it much easier to hold and carry. Long eye relief enhances viewing comfort by reducing eye strain regardless of whether user is wearing eyeglasses or not. Twist up/down eyecups make it easy for eyeglass wearers to enjoy a full field of view. Shockproof, rubberized aluminum body construction accommodates rugged use in the field; water- and fog-proof thanks to sealed O-rings and nitrogen filling. Excellent close focus ability allows user to enjoy a sharp view of images at a short distance. Includes carry case, neck strap, lens cleaning cloth and instructions for usage. Great for bird watching, travel, spectator sports and nearly any outdoor adventure.","short_description":"The REI XR 8 x 32 binoculars are an outstanding value and deliver great magnification and clarity. They are compact and light enough to go just about anywhere.","category":"Camping & Hiking","subcategory":"Binoculars","product_group":"Mid-Size Binoculars","thumb_url":"http://i1.avlws.com/115/s43191.png","image_url":"http://i1.avlws.com/115/l43191.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=43191&tt=df","keywords":"optic,birding,binoculars,binocular,bird watching","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=43191\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m43191.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=777606&amp;link=&amp;tabs=-Details\"></script>","variants":{"7776060019":{"sku":"7776060019","vendor_sku":"XR8X32","upc":"477760600199","size":"8X32","color":"BLACK","retail_price":"129.00","sale_price":"129.00"}}}
