{"sku":"777793","manufacturer_id":"010C094800","brand_name":"Garmin","product_name":" Garmin MapSource TOPO US 24K microSD Data Card - Washington/Oregon","long_description":"The Garmin MapSource Topo microSD card lets you add richly detailed topographic maps of Washington and Oregon to your Garmin GPS receiver. Similar in format to USGS 1:24,000 scale, topographic paper maps, detailed features include elevation contours, trails and more. Map names correspond to USGS map names for easy referencing from guidebooks; USGS trail names are also used to facilitate planning. Points of interest use thematic icons for parks, campgrounds, boat ramps, airports and other sites, making it easy to plan outings. Covers national, state and local parks, national and state forests, and national and state wilderness areas. Also features interstates, major highways, rural roads, trails, city neighborhood roads, railroads, power lines, borders and more. Searchable database of cities, geographic names, summits, lakes and other points of interest makes locating a special spot quick and easy. Summit locations feature elevation information, handy for calibrating altimeters. Nautical information includes radio beacons, fog signals, river, harbor and other lights, as well as shipwrecks and other submerged hazards. Topographic contours with shading enhances relief viewing; elevation profile displays on PC and some compatible units to estimate terrain difficulty. 24K Topo ships on a 4GB Micro SD card; older GPS devices may require a firmware update in order to read a 4GB and larger card. Note: Maps on microSD and SD cards cannot be copied or viewed on a computer.","short_description":"The Garmin MapSource Topo microSD card lets you add richly detailed topographic maps of Washington and Oregon to your Garmin GPS receiver.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412475.png","image_url":"http://i1.avlws.com/115/l412475.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412475&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412475\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412475.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=777793&amp;link=&amp;tabs=-Details\"></script>","variants":{"7777930012":{"sku":"7777930012","vendor_sku":"010C094800","upc":"753759081645","retail_price":"89.95","sale_price":"89.95"}}}
