{"sku":"777753","manufacturer_id":"11076","brand_name":"Rei","product_name":"REI Base Camp 4 Tent","long_description":"With a compact, geodesic dome design that makes it strong and storm-worthy, the REI Base Camp 4 tent is easy to set up and roomy enough for your group of 4 and your gear. Color coding makes the tent quick to set up with a combination of clips, sleeves and 4 strong aluminum poles that give the tent flexible stability. Large front and rear doors offer easy access and tuck cleanly away into interior pockets. Generous mesh windows in walls, ceiling and doors provide excellent ventilation; 2 fly ceiling vents help reduce condensation and can be accessed from inside the tent. Front and rear vestibules provide ample covered space to store gear; front vestibule's window lets you see the view and enjoy the light. Mesh gear attic and multiple interior pockets keep your tent organized; hang loops are located throughout the tent. Bound, cut-in floor and UV-resistant, full coverage polyester rainfly will not stretch or expand when wet, ensuring a consistently taut pitch. Convenient backpack-style carry bag organizes tent, fly and poles with extra space for footprint; footprint sold separately. The REI Base Camp 4 tent comes with 12 stakes, 4 guylines with tighteners, pole repair tube and gear attic.","short_description":"With a compact, geodesic dome design that makes it strong and storm-worthy, the REI Base Camp 4 tent is easy to set up and roomy enough for your group of 4 and your gear.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424351.png","image_url":"http://i1.avlws.com/115/l424351.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424351&tt=df","retail_price":"369.00","sale_price":"275.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424351\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424351.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=777753&amp;link=&amp;tabs=-Details\"></script>","variants":{"7777530010":{"sku":"7777530010","vendor_sku":"11076","upc":"477775300107","size":"4 Person","color":"SAGE/PLATINUM","retail_price":"275.93","sale_price":"275.93"}}}
