{"sku":"777981","manufacturer_id":"9014","brand_name":"Cycleops","product_name":" CycleOps SuperMagneto Pro Bike Trainer","long_description":"The CycleOps SuperMagneto Pro trainer is built for Tri-geeks, podium chasers and first-time finishers alike. It combines versatility with an authentic roadlike feel. Between seasons, use SuperMagneto Pro to get in great shape-and stay that way. Offers 4 resistance curves; easy, road, interval and mountain. Resistance curves adjust to fit a conditioned rider or someone less physically, or modify the curves to fit big and small riders. Each resistance setting is controlled by the internal movement of 4 rare earth, spring-loaded magnets; magnets enhance the natural progressive-resistance power curve. Flywheel is designed to deliver a smooth ride and a realistic, roadlike feel. Wide stable platform; quick-lock cam lever allows quick and easy bike installation; install and remove bike with a simple 90deg turn of the handle. Convenient skewer clamp centers your bike from just 1 side and holds it securely. Handy, single-leg leveling adjusts for riding on most any surface. Also fits 29er wheels using the 2-position mounting bracket.","short_description":"The CycleOps SuperMagneto Pro trainer is built for Tri-geeks, podium chasers and first-time finishers alike. It combines versatility with an authentic roadlike feel.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trainers","thumb_url":"http://i1.avlws.com/115/s379543.png","image_url":"http://i1.avlws.com/115/l379543.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379543&tt=df","retail_price":"420.00","sale_price":"420.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379543\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379543.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=777981&amp;link=&amp;tabs=-Details\"></script>","variants":{"7779810014":{"sku":"7779810014","vendor_sku":"9014","upc":"012527004256","retail_price":"420.00","sale_price":"420.00"}}}
