{"sku":"778044","manufacturer_id":"SP184","brand_name":"Sawyer","product_name":" Sawyer Complete Water Treatment System - 4 Liter","long_description":"Set up the Sawyer Complete water treatment system and in the time it takes you to unpack your tent you'll have 4 liters of fresh, clean drinking water. Utilizing a hollow fiber membrane filter, the Sawyer system yields 1 liter of potable water per minute. Simply fill the included gray reservoir with unfiltered water, attach the filter and filter hose and let gravity do the rest to fill the included blue reservoir. Once the blue reservoir is full, hang the reservoir from its handle using the included Nite Ize S-Biner loop and fill your water bottle, pots and pans. Or, attach the included drink tube and a bite valve of your choice (sold separately) and use the reservoir as you would any hydration system. Filter physically removes particles, protozoa, and bacteria down to 0.1 micron in size, including giardia, salmonella and cryptosporidia. All Sawyer water filters exceed Environmental Protection Agency (EPA) recommendations for removal rates. Filter is fully field maintainable to ensure a fast flow of water; system includes a faucet adapter for thorough back washing from a household faucet. Setup is simple and the system packs easily, weighing in at only 18 oz. This Sawyer water filter comes with a Million Gallon Guarantee, essentially eliminating the need to ever have to replace the filter cartridge. System includes a 4 liter gray reservoir, 4 liter blue reservoir, hollow fiber filter, faucet adapter, drink tube, quick-release hose adapter, S-Biner and instructions for use. Please note: Take care not to let your filter freeze as this could damage the filter housing or the fibers themselves.","short_description":"Set up the Sawyer Complete water treatment system and in the time it takes you to unpack your tent you'll have 4 liters of fresh, clean drinking water.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426259.png","image_url":"http://i1.avlws.com/115/l426259.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426259&tt=df","retail_price":"139.95","sale_price":"139.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426259\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426259.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=778044&amp;link=&amp;tabs=-Details\"></script>","variants":{"7780440017":{"sku":"7780440017","vendor_sku":"SP184","upc":"050716001846","retail_price":"139.95","sale_price":"139.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
