{"sku":"778046","manufacturer_id":"SP194","brand_name":"Sawyer","product_name":" Sawyer Complete Water Purifier System - 4 Liter","long_description":"With no pumping and no chemicals required, the Sawyer Complete water purifier system delivers 4 liters of purified drinking water in as little as 15 min. Features a 0.02-micron hollow fiber membrane purifier that physically removes particles, protozoa, bacteria and viruses while maintaining a high rate of flow. Simply fill the included gray reservoir with unfiltered water, attach the filter and filter hose and let gravity do the rest to fill the included blue reservoir. Once the blue reservoir is full, hang the reservoir from its handle using the included Nite Ize S-Biner loop and fill your water bottle, pots and pans. Or, attach the included drink tube and a bite valve of your choice (sold separately) and use the reservoir as you would any hydration system. All Sawyer water purifiers meet Environmental Protection Agency (EPA) recommendations for removal rates. Purifier is fully field maintainable to ensure a fast flow of water; system includes a faucet adapter for thorough back washing from a household faucet. Setup is simple and the system packs easily, weighing in at only 20 oz. This Sawyer water purifier comes with a Million Gallon Guarantee, essentially eliminating the need to ever have to replace the purifier cartridge. Includes 4 liter gray reservoir, 4 liter blue reservoir, hollow fiber purifier, faucet adapter, purifier tube, drink tube, 90deg fitment, S-Biner and instructions.","short_description":"With no pumping and no chemicals required, the Sawyer Complete water purifier system delivers 4 liters of purified drinking water in as little as 15 min.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426263.png","image_url":"http://i1.avlws.com/115/l426263.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426263&tt=df","retail_price":"219.95","sale_price":"219.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426263\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426263.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=778046&amp;link=&amp;tabs=-Details\"></script>","variants":{"7780460015":{"sku":"7780460015","vendor_sku":"SP194","upc":"050716001945","retail_price":"219.95","sale_price":"219.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
