{"sku":"778409","manufacturer_id":"PAW1300-1V","brand_name":"Casio","product_name":" Casio Pathfinder PAW1300-1V Multifunction Watch","long_description":"This wrist-top information center from Casio keeps time via the accurate Atomic Clock and draws its power reliably from the sun! Automatically receives atomic clock time calibration signals in the U.S., England, Germany and Japan for incredibly accurate timekeeping. No batteries to replace! This compact unit has a large-capacity solar storage battery that requires very little light to recharge. Small sensors detect direction, altitude and temperature, keeping you in tune with the world around you. Digital compass displays current heading; reports bearing in 1deg increments. Altimeter tracks elevation gain and loss from -2,300 to 32,800 ft. (-700 to 10,000m) in 20 ft. (5m) increments. Altimeter memory captures up to 40 records of high/low altitude, cumulative ascent/descent, date, month and time. Altitude tendency graph positions you with respect to your target altitude. Detect change in the weather-barometric tendency graph charts the weather changes. Barometer tracks atmospheric pressure changes from 260 to 1,100 hPa (7.68 to 32.49 inHg). Thermometer ranges from 14 to 140degF (-10 to 60degC) measured in 0.2degF increments (0.1degC). Electro-luminescent backlight activates by simply tilting your wrist 40deg toward you from the horizontal. 1/100-second stopwatch measures elapsed time, split time and 1st-2nd place times. Features countdown timer, time in 12 or 24-hour format, world time with 29 time zones, date, day, auto calendar (through 2039), 5 daily alarms and hourly chime. Water resistant to 100m (330 ft.).","short_description":"This wrist-top information center from Casio keeps time via the accurate Atomic Clock and draws its power reliably from the sun!","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413299.png","image_url":"http://i1.avlws.com/115/l413299.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413299&tt=df","keywords":"waterproof","retail_price":"269.00","sale_price":"269.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413299\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413299.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=778409&amp;link=&amp;tabs=-Details\"></script>","variants":{"7784090016":{"sku":"7784090016","vendor_sku":"PAW1300-1V","upc":"079767874629","color":"BLACK/SILVER","retail_price":"269.00","sale_price":"269.00"}}}
