{"sku":"781283","manufacturer_id":"3605355200","brand_name":"Deuter","product_name":" Deuter Fox 30 Pack - Juniors'","long_description":"Before they leave the pack, introduce your young pup to the outdoors with the fully loaded, junior-sized Deuter Fox 30 backpack for overnight and weekend trips. Variquick harness allows quick, easy adjustment of torso length for kid's growing frame. Back panel features \"chimney\" style twin vertical 3D air-mesh foam pads that vent away warm air and sweat to keep you dry. Contoured, padded shoulder straps are lined with 3D air-mesh for breathability and feature stabilizer straps for ideal positioning of pack. Soft hip pads and hipbelt wrap body, stabilizing and controlling lateral movements of pack while on the go. Top-loading main compartment has plenty of room for an overnight or lightweight weekend trip. 2 lid pockets and side bellows pockets store often-accessed gear such as headlamp, baseball hat, sunscreen, bug repellent, found treasures and more. Hydration-compatible design features reservoir pocket and drink tube exit port for on-the-go hydration (reservoir sold separately). 2 side mesh pockets are roomy enough for water bottles and snacks. Bottom zippered compartment separates a sleeping bag or dirty clothes. Side compression straps let you cinch down loads for jostle-free carrying; ice axe loops and pole attachments allow additional gear to be strapped on to the pack exterior.","short_description":"Before they leave the pack, introduce your young pup to the outdoors with the fully loaded, junior-sized Deuter Fox 30 backpack for overnight and weekend trips.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410399.png","image_url":"http://i1.avlws.com/115/l410399.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410399&tt=df","keywords":"multiday","retail_price":"99.00","sale_price":"99.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410399\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410399.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=781283&amp;link=&amp;tabs=-Details\"></script>","variants":{"7812830001":{"sku":"7812830001","vendor_sku":"3605355200","color":"FIRE/CRANBERRY","retail_price":"99.00","sale_price":"99.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
