{"sku":"781870","manufacturer_id":"KL 2 C31 240","brand_name":"Werner","product_name":"Werner Kalliste Paddle - Carbon Bent-Shaft","long_description":"The bent-shaft Kalliste paddle from Werner provides low-angle paddlers with premium materials, enhanced control and an exceptionally light and buoyant stroke. High-quality, continuous-weave carbon fiber shaft delivers a superior strength-to-weight ratio. Bent shaft naturally aligns wrists, providing immediate comfort and reducing strain; a special grip area that fits the natural contour of your hand increases overall control. Adjustable Ferrule System allows elegant adjustment of feathering angle from 0deg - 60deg right or left in 15deg increments. Improved ferrule design incorporates internal printing of offset degrees and a low-profile button release that makes paddle feel like 1 piece. Carbon fiber/foam core blades create a distinct profile that enters and exits the water quietly while adding buoyancy for a light stroke. Blade design with ribless back allows for a smooth sculling stroke; asymmetrical dihedral shape delivers flutter-free power and reduces fatigue. Midsize blades are designed with power and bracing in mind yet are surprisingly easy to pull through the water. Remarkably light swing weight reduces overall fatigue on long paddling excursions. Drip rings help keep hands and lap dry. 2-piece design breaks down quickly and eases transport and storage.","short_description":"The bent-shaft Kalliste paddle from Werner provides low-angle paddlers with premium materials, enhanced control and an exceptionally light and buoyant stroke.","category":"Paddling","subcategory":"Paddles","product_group":"Kayak Paddles","thumb_url":"http://i1.avlws.com/115/s430995.png","image_url":"http://i1.avlws.com/115/l430995.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430995&tt=df","retail_price":"475.00","sale_price":"475.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430995\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430995.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=781870&amp;link=&amp;tabs=-Details\"></script>","variants":{"7818700028":{"sku":"7818700028","vendor_sku":"KL 2 C31 230","upc":"840463104941","size":"230 Cm","color":"BLACK","retail_price":"475.00","sale_price":"475.00"},"7818700036":{"sku":"7818700036","vendor_sku":"KL 2 C31 240","upc":"478187000364","size":"240 Cm","color":"BLACK","retail_price":"475.00","sale_price":"475.00"}},"categories":["paddling","paddles","kayak-paddles"]}
