{"sku":"782450","manufacturer_id":"T10LL 22","brand_name":"Petzl","product_name":"Petzl Sarken Leverlock Crampons","long_description":"Updated with structural reinforcements and a new heat-treatment process to improve strength and durability, the Petzl Sarken Leverlock crampons are ideal for adventures in mixed terrain. Microadjustable Leverlock heel bail clamps securely to mountaineering boots with a rear welt; plastic toe piece remains flexible even in extreme cold. Serrated T-shaped front points are optimized for penetration in hard ice and stable front pointing on mixed terrain. Second set of points are angled forward to reinforce purchase and give support when front pointing. Forth set of points provide stability while descending slopes facing downhill. Crampons adjust easily without tools, accommodating half sizes for an accurate, snug fit. Linking bars can be set for flexible or semi-rigid modes to adapt the crampons to flexible or rigid boots. Low-profile Antisnow(R) plates help prevent sticky snow from balling up beneath your feet without interfering with the projection of the points.","short_description":"Updated with structural reinforcements and a new heat-treatment process to improve strength and durability, the Petzl Sarken Leverlock crampons are ideal for adventures in mixed terrain.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Crampons","thumb_url":"http://i1.avlws.com/115/s407483.png","image_url":"http://i1.avlws.com/115/l407483.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407483&tt=df","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407483\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407483.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=782450&amp;link=&amp;tabs=-Details\"></script>","variants":{"7824500016":{"sku":"7824500016","vendor_sku":"T10LL 22","retail_price":"199.00","sale_price":"199.00"}},"categories":["climbing","mountaineering-gear","crampons"]}
