{"sku":"782459","manufacturer_id":"B17S_RG","brand_name":"Petzl","product_name":"Petzl Ascension Ascender","long_description":"Updated to provide greater comfort, efficiency and ease of use, the Petzl Ascenion ascender is great for aid climbing, mountaineering or caving. Updated molded grip features a more ergonomically shaped handle that provides greater comfort than the previous version; grip is over-molded with rubber for greater friction. Large index finger indent increases efficiency when pulling on the ascender. Chrome-plated, spring-loaded steel cam features angled teeth and a self-cleaning slot to securely grip the rope, even in wet, muddy or icy conditions. Cam has been refined to glide more easily along the rope, requiring less effort during long sessions of jugging. Open/close trigger is now recessed inside the ascender's frame to avoid accidentally opening the cam while in use; trigger can still be operated with 1 hand. Safety catch prevents the cam from opening too far, thereby keeping the rope captured. Includes multiple attachment points to allow for different uses, such as self-belaying or hauling. Anodized frame is color coded for easy identification; black ascender is for the left hand and gray is for the right. Designed for use with ropes between 8 and 13mm in diameter.","short_description":"Updated to provide greater comfort, efficiency and ease of use, the Petzl Ascenion ascender is great for aid climbing, mountaineering or caving.","category":"Climbing","subcategory":"Climbing Hardware","product_group":"Ascenders And Descenders","thumb_url":"http://i1.avlws.com/115/s380087.png","image_url":"http://i1.avlws.com/115/l380087.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380087&tt=df","keywords":"rappel,belay","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380087\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380087.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=782459&amp;link=&amp;tabs=-Details\"></script>","variants":{"7824590017":{"sku":"7824590017","vendor_sku":"B17S_LN","color":"LEFT","retail_price":"79.95","sale_price":"79.95"},"7824590025":{"sku":"7824590025","vendor_sku":"B17S_RG","color":"RIGHT","retail_price":"79.95","sale_price":"79.95"}},"categories":["climbing","climbing-hardware","ascenders-and-descenders"]}
