{"sku":"782802","manufacturer_id":"STW-004T","brand_name":"Snow Peak","product_name":" Snow Peak Hybrid Trail Cookset","long_description":"Every ounce counts when you're climbing a peak or logging some major miles on the trail. The Snow Peak Hybrid Trail cookset lightens your load while still giving you great cooking functionality. Set includes a 22 fl. oz. titanium pot, small titanium frypan, silicone bowl by Guyot Designs, titanium spork and a nylon mesh storage sack; frypan doubles as a pot lid. Titanium pot and frypan are extremely light yet functional; titanium leaves no metallic smell or taste, and it will not rust. Silicone bowl by Guyot Designs is created exclusively for this Snow Peak set; bowl can be folded, flipped and crammed and it will always bounce back to its original shape. Food-grade silicone bowl is taste free and temperature resistant to 400degF. Rounded bottom edges on pot and frypan improve heating efficiency and are easy to clean. Pot and pan have handles that fold flat for packing. Compact titanium spork does the work of 2 utensils to save you weight; spork measures 4.6 in. long. Set nests together into a compact 5.5 in. x 2.5 in. stack; comes with a lightweight nylon mesh storage bag. Frypan measures 5.6 in x 1.1 in; pot measures 5.4 in. x 2.4 in.; and bowl measures 5 in. x 2.25 in.","short_description":"Every ounce counts when you're climbing a peak or logging some major miles on the trail. The Snow Peak Hybrid Trail cookset lightens your load while still giving you great cooking functionality.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414467.png","image_url":"http://i1.avlws.com/115/l414467.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414467&tt=df","keywords":"messkit","retail_price":"55.95","sale_price":"55.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414467\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414467.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=782802&amp;link=&amp;tabs=-Details\"></script>","variants":{"7828020011":{"sku":"7828020011","vendor_sku":"STW-004T","upc":"691688170019","retail_price":"55.95","sale_price":"55.95"}},"categories":["camping-hiking","camp-kitchen","cookware-and-dinnerware"]}
