{"sku":"783117","manufacturer_id":"9781423601050","product_name":" When All Hell Breaks Loose: Stuff You Need to Survive When Disaster Strikes","long_description":"Survival expert Cody Lundin delivers home-tested techniques, tips and tricks that will help you become more self-reliant in any situation. Author: Cody Lundin. Softcover; 449 pages; black-and-white illustrations and color photographs. Gibbs Smith; copyright 2007. First section of book covers psychological aspects of survival: curbing fear and panic, defining priorities and thinking ahead. Second section of the book describes survival techniques: creating shelter, finding food and water, first aid, lighting, hygiene, transportation, self-defense and hygiene. Promises to not only entertain, but to empower with practical advice, information and detailed instructions of how to create an effective survival mindset. Delivered with wit, rebellious humor, and plenty of backcountry expertise paired with outrageously hip visuals.","short_description":"Survival expert Cody Lundin delivers home-tested techniques, tips and tricks that will help you become more self-reliant in any situation.","category":"Books And Maps","subcategory":"How-To And Instructional Books","product_group":"Health And Safety Books","thumb_url":"http://i1.avlws.com/115/s441603.png","image_url":"http://i1.avlws.com/115/l441603.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441603&tt=df","retail_price":"19.98","sale_price":"19.98","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441603\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441603.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=783117&amp;link=&amp;tabs=-Details\"></script>","variants":{"7831170019":{"sku":"7831170019","vendor_sku":"9781423601050","retail_price":"19.98","sale_price":"19.98"}}}
