{"sku":"784449","manufacturer_id":"SP-SYS","brand_name":"Steripen","product_name":"SteriPEN Safe Water Purifier System","long_description":"The SteriPEN Safe Water purifier system is an all-in-one purifier kit for making great-tasting potable water while hiking the trail or traveling the world. Safe Water system includes the SteriPEN Classic purifier, water bottle prefilter, 1-liter BPA-free wide-mouth water bottle, SteriPEN carrying case and instruction manuals. Ultraviolet (UV-C) light rays safely sterilize clear water by destroying 99.99% of viruses, bacteria and protozoa, including Giardia and Cryptosporidium. SteriPEN protects you from risks that cause botulism, cholera, dysentery and typhoid, just to name a few. But if clear water is not available, no worries-the SteriPEN 4-micron prefilter clears particulates and debris from water. Prefilter fits the included Nalgene BPA-free water bottle and other bottles with 63mm wide-mouth openings; pour source water through filter, and clean water enters bottle. Then use the SteriPEN purifier to treat the water; just press a button and gently agitate the water with a quick stir. SteriPEN purifies 16 fl. oz. of water (cold or warm) in less than a minute or 32 fl. oz. in a minute and a half. Small size fits most containers-use it in cups, mugs, water bottles and canteens. SteriPEN turns itself off once ultraviolet treatment is complete; can be used up to 8,000 times! Watertight seals keep water away from the electronics; rubberized inset grips for secure handling in wet conditions. Low-power indicator tells you when batteries need replacing; twist-off cap for easy battery access. Long used by municipal water districts and bottling companies, low-level UV-C light treats water safely, and unit's light will not damage eyes or skin. Purify 200 glasses with 4 lithium AA batteries (batteries sold separately); SteriPEN does not recommend the use of alkaline batteries, as they provide very few treatments.","short_description":"The SteriPEN Safe Water purifier system is an all-in-one purifier kit for making great-tasting potable water while hiking the trail or traveling the world.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426271.png","image_url":"http://i1.avlws.com/115/l426271.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426271&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426271\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426271.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=784449&amp;link=&amp;tabs=-Details\"></script>","variants":{"7844490016":{"sku":"7844490016","vendor_sku":"SP-SYS","upc":"899321000024","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
