{"sku":"784511","manufacturer_id":"8007183","brand_name":"Yakima","product_name":" Yakima SkyBox Pro 18 Roof Box","long_description":"Turn your car into a gear-hauling machine with the spacious Yakima SkyBox Pro 18. It keeps all of your dirty gear out of your car and the aerodynamic shape helps keep fuel bill down. SkyBox Pro series dons a sleek automotive finish that resists scratches. Aerodynamic design reduces drag, resulting in less noise and more stability. Lid is now 50% stiffer than other Yakima cargo boxes for reduced vibration; one-handed opening and closing is as easy as pie. Rapid-fire installation is quickest and easiest yet-all adjusting and tightening is done from inside the box. Dual side opening conveniently allows the box to be opened from either the right or left side. Smooth-action support lets the lid lift effortlessly; wide-mouth opening is easy to load and unload. Lid shape is easy to grab regardless of the size of your hands. New and improved easier-to-use SuperLatch(TM) design can be operated with 1 hand and ensures your lid is locked. SkyBox series has integrated track system for accessories so you can protect and organize all your gear. Cargo boxes are made from up to 80% recycled ABS plastic. Fits round, square or most factory-rack crossbars (sold separately); fits crossbar spreads as short as 24 inches. SKS lock cores included.","short_description":"Turn your car into a gear-hauling machine with the spacious Yakima SkyBox Pro 18. It keeps all of your dirty gear out of your car and the aerodynamic shape helps keep fuel bill down.","category":"Car Racks","subcategory":"Cargo Boxes, Baskets And Bags","product_group":"Roof Rack Boxes","thumb_url":"http://i1.avlws.com/115/s408199.png","image_url":"http://i1.avlws.com/115/l408199.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408199&tt=df","retail_price":"649.00","sale_price":"649.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408199\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408199.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=784511&amp;link=&amp;tabs=-Details\"></script>","variants":{"7845110001":{"sku":"7845110001","vendor_sku":"8007197","upc":"736745071974","size":"18 Cu Ft","color":"ONYX","retail_price":"649.00","sale_price":"649.00"},"7845110027":{"sku":"7845110027","vendor_sku":"8007183","upc":"736745071837","size":"18 Cu Ft","color":"Titanium","retail_price":"649.00","sale_price":"649.00"}},"categories":["car-racks","cargo-boxes-baskets-and-bags","roof-rack-boxes"]}
