{"sku":"784609","manufacturer_id":"0130-0435","brand_name":"Adventure Medical Kits","product_name":" Adventure Medical Kits Smart Travel First-Aid Kit","long_description":"Whether you're traveling abroad or taking a trip across the USA, the Adventure Medical Smart Travel first-aid kit has all the essentials to keep you comfortable and in good health during the journey. All contents are packed together in easily identifiable, clear vinyl compartments; system organizes contents by injury type, saving valuable response time. Contains medical supplies for 1 - 2 persons on multiday trips. Kit includes 4 Diotame tablets, 4 antacid tablets and 4 Diamode tablets to relieve discomfort due to upset stomach and diarrhea. Eight 200mg ibuprofen tablets, eight 500mg acetaminophen tablets and four 25mg antihistamine tablets knock out pain, fever and allergy symptoms. Treat blisters with 11 precut, shaped Moleskin patches, one 3 x 1.75 in. GlacierGel(R) blister and burn dressing and one 2.25 x 1 in. GlacierGel blister and burn dressing. 6 fabric bandages, 2 knuckle bandages, 5 butterfly closures, 1 conforming gauze bandage, 10 gauze pads and 2 non-adherent sterile dressings help you care for cuts and scrapes. Also includes 5 anesthetic/antiseptic wipes, 2 applications of triple antibiotic ointment, 10 yards of 0.5 in. tape, 4 cotton-tip applicators and 1 pair of nitrile gloves. 2 doses of rice-based oral rehydration mix enhance the body's ability to absorb fluids. Instruments include a disposable thermometer, splinter picker/tick remover forceps and 3 safety pins. Includes the book, \"A Comprehensive Guide to Wilderness and Travel Medicine,\" a visual communication card, a patient assessment form and a pencil. S-hook lets you hang the carrying case anywhere that is convenient. Assembled in the USA of imported and domestic materials.","short_description":"Whether you're traveling abroad or taking a trip across the USA, the Adventure Medical Smart Travel first-aid kit has all the essentials to keep you comfortable and in good health during the journey.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s420307.png","image_url":"http://i1.avlws.com/115/l420307.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=420307&tt=df","retail_price":"49.95","sale_price":"49.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=420307\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m420307.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=784609&amp;link=&amp;tabs=-Details\"></script>","variants":{"7846090012":{"sku":"7846090012","vendor_sku":"0130-0435","upc":"707708104350","color":"GREEN","retail_price":"49.95","sale_price":"49.95"}}}
