{"sku":"784788","manufacturer_id":"03-881","brand_name":"Oakley","product_name":" Oakley Flak Jacket Sunglasses - Men's","long_description":"With top-half frame coverage, these Oakley Flak Jacket open-edge sunglasses optimize your vision, allowing you the best possible performance. Open-edge design extends your vertical field of vision and retains the peripheral clarity of XYZ Optics(R). Lightweight, flexible nylon frames resist damaging stresses. Optically correct, shatterproof and scratch-resistant Plutonite(R) polycarbonate lenses enhance durability. Oakley Hydrophobic permanent lens coating prevents sweat and rain from building up, and repels skin oils, keeping your vision clear. Black Iridium(R) tint lens provides neutral contrast and 10% light transmission-best for extremely bright light. Reflective Iridium(R) coating enhances optical clarity and contrast, and reduces glare in varying light conditions. Unobtainium(R) nose pads and stem sleeves are hydrophilic rubber that becomes tackier as you perspire, holding eyewear in place as you move. 2 sizes of interchangeable nose pads are included to give you the best fit and performance. To preserve the superior optical quality, sunglasses come with a specially woven, electrostatic Microclear bag for cleaning and storage.","short_description":"With top-half frame coverage, these Oakley Flak Jacket open-edge sunglasses optimize your vision, allowing you the best possible performance.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422779.png","image_url":"http://i1.avlws.com/115/l422779.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422779&tt=df","keywords":"Cycling","retail_price":"150.00","sale_price":"150.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422779\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422779.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=784788&amp;link=&amp;tabs=-Details\"></script>","variants":{"7847880015":{"sku":"7847880015","vendor_sku":"03-881","upc":"700285038810","color":"JET BLACK/BLACK IRIDIUM","retail_price":"150.00","sale_price":"150.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
