{"sku":"785575","manufacturer_id":"TY 2 F11 215","brand_name":"Werner","product_name":" Werner Tybee Paddle - Fiberglass","long_description":"With its high-angle blade, fiberglass-and-carbon construction and lightweight design, the Werner Tybee is aggressive on the water but easy on the wallet. Fiberglass-and-carbon blended shaft is lightweight and rugged; a slight amount of flex increases comfort and reduces strain. Adjustable Ferrule System allows elegant adjustment of feathering angle from 0deg - 60deg right or left in 15deg increments. Improved ferrule design incorporates internal printing of offset degrees and a low-profile button release that makes paddle feel like 1 piece. Injection-molded blades are constructed with fiberglass-reinforced nylon, offering a lighter swing weight than plastic blades. High-angle blades with powerful catches feature a slight dihedral shape and excel at smooth linking strokes and advanced techniques. Asymmetrical blade shape helps reduce torque, allowing paddle to pull smoothly through the water and reducing the need to grip tightly. Light swing weight reduces overall fatigue on long paddling excursions. Drip rings help keep hands and lap dry. Design is optimized for high-angle paddling style. 2-piece design breaks down quickly and eases transport and storage.","short_description":"With its high-angle blade, fiberglass-and-carbon construction and lightweight design, the Werner Tybee is aggressive on the water but easy on the wallet.","category":"Paddling","subcategory":"Paddles","product_group":"Kayak Paddles","thumb_url":"http://i1.avlws.com/115/s431019.png","image_url":"http://i1.avlws.com/115/l431019.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431019&tt=df","retail_price":"130.00","sale_price":"130.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431019\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431019.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=785575&amp;link=&amp;tabs=-Details\"></script>","variants":{"7855750027":{"sku":"7855750027","vendor_sku":"TY 2 F11 215","upc":"840463110829","size":"215 Cm","color":"YELLOW","retail_price":"130.00","sale_price":"130.00"}}}
