{"sku":"786392","manufacturer_id":"SP161","brand_name":"Sawyer","product_name":"Sawyer Water Filter System - 2 Liter","long_description":"Think of water filtration in a whole new way with the quick and convenient gravity-powered Sawyer 2-liter water filter system. Utilizing a hollow fiber membrane filter, the Sawyer system yields 2 liters of potable water in as little as 1.5 min. Simply fill the included reservoir with unfiltered water, attach the filter and hoses and let gravity do the rest to fill your own hydration reservoir or water bottle. Filter physically removes particles, protozoa, and bacteria down to 0.1 micron in size, including giardia, salmonella and cryptosporidia. All Sawyer water filters exceed Environmental Protection Agency (EPA) recommendations for removal rates. Filter is fully field maintainable to ensure a fast flow of water; system includes a faucet adapter for a thorough backwash from a household faucet. Setup is simple and the system packs easily, weighing in at only 11 oz. This Sawyer water filter comes with a Million Gallon Guarantee, essentially eliminating the need to ever have to replace the filter cartridge. Sawyer water filter system includes a 2 liter reservoir, hollow fiber filter, faucet adapter, filter tube, quick-release hose adapter and instructions for use. Please note: take care not to let your filter freeze as this could damage the filter housing or the fibers themselves.","short_description":"Think of water filtration in a whole new way with the quick and convenient gravity-powered Sawyer 2-liter water filter system.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426279.png","image_url":"http://i1.avlws.com/115/l426279.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426279&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426279\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426279.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=786392&amp;link=&amp;tabs=-Details\"></script>","variants":{"7863920018":{"sku":"7863920018","vendor_sku":"SP161","upc":"050716001617","retail_price":"89.95","sale_price":"89.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
