{"sku":"789101","brand_name":"Oboz","product_name":"Oboz Sawtooth Mid Hiking Boots - Women's","long_description":"Take to the trails in the Oboz Sawtooth mid-height hiking boots, which feature lightweight, waterproof construction that's great for light hiking on varied terrain in varied conditions. Rugged nubuck leather uppers feature breathable nylon mesh panels for a comfortable fit right out of the box; rubber toe randing protects against abrasion. B-DRY(TM) waterproof, breathable membranes keep the elements out so your feet stay comfortable. Nylon mesh linings wick moisture, dry quickly and further enhance breathability. Anatomic EVA footbeds and dual-density EVA midsoles provide cushioning over a long day of hiking. Nylon shanks offer torsional stability and protection underfoot, increasing surefootedness on varied terrain. Injection-molded heel counters lock feet in to deliver technical yet nimble performance. Aggressively lugged outsoles utilize a durable, sticky rubber for exceptional grip in all directions on both wet and dry surfaces.","short_description":"Take to the trails in the Oboz Sawtooth mid-height hiking boots, which feature lightweight, waterproof construction that's great for light hiking on varied terrain in varied conditions.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Boots","thumb_url":"http://i1.avlws.com/115/s386671.png","image_url":"http://i1.avlws.com/115/l386671.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=386671&tt=df","retail_price":"140.00","sale_price":"140.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=386671\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m386671.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=789101&amp;link=&amp;tabs=-Details\"></script>","variants":{"7891010063":{"sku":"7891010063","upc":"810918014231","size":"8.5","color":"ICEBURG","retail_price":"140.00","sale_price":"140.00"}},"categories":["footwear","womens-footwear","womens-boots"]}
