{"sku":"789312","manufacturer_id":"010-11315-00","brand_name":"Garmin","product_name":"Garmin Topo U.S. 24K DVD - Southwest","long_description":"The Garmin Topo U.S. 24K Southwest DVD lets you open USGS topographic maps from the southwest states on your computer and load them into your Garmin GPS receiver. Richly detailed maps cover all of Arizona, Colorado, New Mexico and Utah. Similar in format to USGS 1:24,000-scale topographic paper maps, detailed features include elevation contours, trails and more. Map names correspond to USGS map names for easy referencing from guidebooks; USGS trail names are also used to facilitate planning. Points of interest use thematic icons for areas such as parks, campgrounds, boat ramps, airports and others making it easy to plan outings. Covers: national, state and local parks, national and state forests and national and state wilderness areas. Also features interstate freeways, major highways, rural roads, trails, neighborhood streets, railroads, power lines and borders. Searchable database of cities, geographic names, summits, lakes and more makes locating a special spot quick and easy. Summit locations feature elevation information, handy for calibrating altimeters. Nautical information includes radio beacons, fog signals, river, harbor and other lights, as well as shipwrecks and other submerged hazards. Topographic contours with shading enhances relief viewing; elevation profile displays on PC and some compatible units to estimate terrain difficulty.","short_description":"The Garmin Topo U.S. 24K Southwest DVD lets you open USGS topographic maps from the southwest states on your computer and load them into your Garmin GPS receiver.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412491.png","image_url":"http://i1.avlws.com/115/l412491.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412491&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412491\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412491.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=789312&amp;link=&amp;tabs=-Details\"></script>","variants":{"7893120019":{"sku":"7893120019","vendor_sku":"010-11315-00","upc":"753759093501","color":"SOUTHWEST REG","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","camp-electronics","gps"]}
