{"sku":"790323","manufacturer_id":"GXT1000VP4","brand_name":"Midland","product_name":"Midland GXT1000VP4 2-Way Radios - 2 Pack","long_description":"The Midland GXT1000VP4 radios offer powerful 2-way communication in a tough, weatherproof package with 50 channels and impressive range. Weatherproof construction protects against rain, snow and splashes; JIS4 waterproofing allows exposure to water for up to 30 min. Talk on both Family Radio Service (FRS) and General Mobile Radio Service (GMRS); 50 channels with 387 privacy codes provide 5,964 options. 2 watts of power transmit and receive up to 36 miles per manufacturer (based on an unobstructed line of sight between you and another radio operator in good weather). Power is automatically reduced to a half-watt across FRS-only channels (2-mile range), enabling radios to talk to all existing FRS 2-way radios. High, medium and low power settings control transmission power to conserve battery life. Receives all government-operated NOAA weather broadcasts and NOAA All Hazard Alert Radio. Whisper feature allows you to speak quietly and still be heard clearly. SOS alert sends out a distinctive distress signal for emergency situations. eVOX voice activation with 9 sensitivity levels lets you talk hands-free when used with or without optional accessories. Direct Call allows you to contact 1 member of your party without alerting the others. 10 call alerts and a vibrate mode alert your friends before you start speaking. Also features weather scan, channel scan, auto squelch, ''roger'' beep, silent operation, keystroke tones, and mic and headphone jacks. Bright LCD backlight makes the display easy to read in the dark. Keypad lock protects your personalized settings. Rechargeable batteries included; can also operate on 4 AA batteries (sold separately). Includes dual desk charger, AC adapter, mic headsets, belt clips and owner's manual.","short_description":"The Midland GXT1000VP4 radios offer powerful 2-way communication in a tough, weatherproof package with 50 channels and impressive range.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412683.png","image_url":"http://i1.avlws.com/115/l412683.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412683&tt=df","keywords":"walkie talkies","retail_price":"80.00","sale_price":"80.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412683\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412683.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=790323&amp;link=&amp;tabs=-Details\"></script>","variants":{"7903230014":{"sku":"7903230014","vendor_sku":"GXT1000VP4","upc":"046014510005","color":"BLACK/SILVER","retail_price":"80.00","sale_price":"80.00"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
