{"sku":"790321","manufacturer_id":"010-00777-00","brand_name":"Garmin","product_name":"Garmin Foretrex 401 GPS","long_description":"With a powerful new high-sensitivity receiver, compass, altimeter and a smaller design than its predecessor, the wrist-top Garmin Foretrex 401 GPS is ideal for hands-free navigation. Newly updated industrial design offers a smaller, lighter unit than previous models for increased comfort and mobility. Easy, single-handed operational system features 5 ergonomically situated buttons that intuitively guide you through functions. High-sensitivity receiver delivers fast signal acquisition and lock for reception in narrow valleys, dense tree cover and urban jungles. High-contrast 64 x 100 pixel screen with bright LED backlight for use in low light; dual-position display allows convenient horizontal or vertical viewing. Built-in electronic compass and barometric altimeter provide additional navigational aid. Enjoy effortless sharing of waypoints, tracks and routes between Garmin GPS units with ANT wireless communication function. The Garmin Foretrex 401 GPS is compatible with Garmin heart rate monitors and GSC 10 Speed and Cadence Sensor (sold separately). For the mariner, sail race feature allows you to configure the start countdown sequence with audible alerts at each start phase. View route and follow it back with Garmin's exclusive TracBack(R) feature. Navigate 20 reversible routes; stores 500 waypoints with name and graphic symbols, and 10,000 trackpoints. Trip computer calculates current, average and maximum speed; plus, it tracks trip time and calculates distance. Computer-compatible design allows you to load waypoints and routes directly from your computer via USB. The Garmin Foretrex 401GPS features waterproof construction, rated IPX7 to withstand immersion in 1m of water for up to 30 min. 2 AAA batteries (sold separately) typically provide up to 15 hours of use.","short_description":"With a powerful new high-sensitivity receiver, compass, altimeter and a smaller design than its predecessor, the wrist-top Garmin Foretrex 401 GPS is ideal for hands-free navigation.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412499.png","image_url":"http://i1.avlws.com/115/l412499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412499&tt=df","keywords":"hiking","retail_price":"179.95","sale_price":"179.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=790321&amp;link=&amp;tabs=-Details\"></script>","variants":{"7903210016":{"sku":"7903210016","vendor_sku":"010-00777-00","upc":"753759096922","color":"GREEN","retail_price":"179.95","sale_price":"179.95"}},"categories":["camping-hiking","camp-electronics","gps"]}
