{"sku":"791308","manufacturer_id":"FLASH-BLU","brand_name":"Jetboil","product_name":" Jetboil Flash Cooking System","long_description":"The colorful Jetboil Flash cooking system surely wins some style points, but don't be caught thinking that's all there is to it. This good-looking stove is loaded with functionality. Winner of the Backcountry Magazine 2010 Editors' Choice Award, the Jetboil Flash is perfect for making hot drinks and whipping up a quick meal. An innovative thermochromic temperature indicator is integrated into the 3 stripes on the colorful neoprene cozy to show you when the cup contents are hot. When the indicator starts to turn orange you know your water is getting warm and will be boiling before long. Flash features a translucent drink-though lid that lets you check on the contents of the cup so you'll know precisely when your water begins to boil; lid is BPA free. Translucent measuring cup with easy-to-read lines unsnaps from the bottom of the cooking cup, giving you a convenient tool for preparing meals and hot drinks. Same as the original Jetboil Personal Cooking system, the Flash integrates the personal cooking cup and stove for fast setup and compact storage. FluxRing(R) heat exchanger on the bottom of the cooking cup creates excellent fuel efficiency. Adjustable-flame burner is housed in a windscreen, reducing heat loss when a breeze picks up. Wire valve bail allows for easy flame adjustment and simmer control even while wearing gloves. Stove burner and cooking cup twist together to create a single convenient system for cooking; disconnect the stove burner and cooking cup for storage. Piezo igniter reliably sparks the stove to life with a simple push of the button; piezo is integrated into the burner for improved protection from bumps and knocks. Stove burner and 110g fuel canister (sold separately) stow inside the cup; lid snaps shut for storage. Anodized aluminum 1-liter cooking cup provides excellent heat transfer and cleans up fast.","short_description":"The colorful Jetboil Flash cooking system surely wins some style points, but don't be caught thinking that's all there is to it. This good-looking stove is loaded with functionality.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416471.png","image_url":"http://i1.avlws.com/115/l416471.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416471&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416471\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416471.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=791308&amp;link=&amp;tabs=-Details\"></script>","variants":{"7913080001":{"sku":"7913080001","vendor_sku":"FLASH-GRN","upc":"893483000557","color":"PERIDOT GREEN","retail_price":"99.95","sale_price":"99.95"},"7913080029":{"sku":"7913080029","vendor_sku":"FLASH-CBN","upc":"893483000717","color":"CARBON","retail_price":"99.95","sale_price":"99.95"}}}
