{"sku":"792847","manufacturer_id":"90048731","brand_name":"Polar","product_name":"Polar FT4 Heart Rate Monitor - Women's","long_description":"Easy to use and comfortable to wear, the Polar FT4 heart rate monitor for women will help you improve your fitness level. Included Polar WearLink(R)+ transmitter chest strap accurately measures your heart rate; transmitter is coded, eliminating interference from other heart rate monitors. WearLink+ strap is soft next to skin and it adapts to the shape of your body so you'll hardly notice it's there. Watch offers average and maximum heart rate during total exercise time; includes time spent in target zone. Visual and audible alarm alerts you every time your heart rate exceeds the upper limit or falls below the lower limit of your target zone. Polar OwnCal(R) counts and displays calories burned during a training session; also displays accumulated kilocalories from several training sessions for long-term goals. HeartTouch function enables button-free operation of certain heart rate functions; simply bring the watch close to the transmitter on your chest to change functions. FT4 keeps track of the number of training sessions, total training hours, total time of in-zone training and total burned calories. Watch features include time of day with alarm and snooze, date and weekday indicator, stopwatch and low-battery indicator. Display text in English, German, French, Spanish, Italian, Portuguese, Finnish and Swedish. The Polar FT4 heart rate monitor is water resistant to 30m (98 ft.). User-replaceable CR1632 battery included.","short_description":"Easy to use and comfortable to wear, the Polar FT4 heart rate monitor for women will help you improve your fitness level.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427043.png","image_url":"http://i1.avlws.com/115/l427043.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427043&tt=df","keywords":"watch","retail_price":"90.00","sale_price":"90.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427043\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427043.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=792847&amp;link=&amp;tabs=-Details\"></script>","variants":{"7928470001":{"sku":"7928470001","vendor_sku":"90042864","upc":"725882554433","color":"PURPLE/PINK","retail_price":"90.00","sale_price":"90.00"},"7928470002":{"sku":"7928470002","vendor_sku":"90048731","upc":"725882009124","color":"GREEN/LIME","retail_price":"90.00","sale_price":"90.00"}},"categories":["fitness","running","fitness-electronics"]}
