{"sku":"792857","manufacturer_id":"PDS-50","brand_name":"Rei","product_name":"REI Double Shot Press Mug","long_description":"Updated and improved, the REI Double Shot Press Mug lets you enjoy 2 mugs of terrific-tasting coffee when you want, where you want! Updated to include a more durable handle, a new French-press lid with a sliding sip-hole closure and a more secure fit for the included air-tight canister. Included air-tight canister securely stores away ground coffee in the base of the mug, ensuring that you'll never be without a second round. To brew coffee, simply put your fresh ground coffee in the mug, add hot (not boiling) water, steep, press the plunger and sip-it's that easy! Double-wall stainless-steel construction ensures your coffee stays enjoyably hot and fresh for long periods of time. French-press mechanism comes with its own commuter-style cap with a screen over the sip hole to keep grounds inside; you can close off the sip hole with the sliding mechanism. Or, when using the mug for tea or coffee from a conventional pot, use the secondary commuter cap with sliding sip-hole closure. Mug features a beefy handle to accommodate large hands and a narrow base to fit most cars' cup holders; clip the handle to a pack with an accessory carabiner (sold separately). 2 rubber gaskets encircle the mug to cut down on vibration noise while in a cup holder and reduce shock to the system if tipped.","short_description":"Updated and improved, the REI Double Shot Press Mug lets you enjoy 2 mugs of terrific-tasting coffee when you want, where you want!","category":"Camping & Hiking","subcategory":"Coffee And Tea","product_group":"Camp Coffee Presses","thumb_url":"http://i1.avlws.com/115/s121475.png","image_url":"http://i1.avlws.com/115/l121475.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=121475&tt=df","keywords":"cookware,java,maker,pot,cooking","retail_price":"29.50","sale_price":"29.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=121475\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m121475.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=792857&amp;link=&amp;tabs=-Details\"></script>","variants":{"7928570030":{"sku":"7928570030","vendor_sku":"PDS-50","upc":"645771000127","color":"STAINLESS","retail_price":"29.50","sale_price":"29.50"}}}
