{"sku":"793103","manufacturer_id":"90036619","brand_name":"Polar","product_name":" Polar RS300X Heart Rate Monitor - Men's","long_description":"The attractive and simple-to-use Polar RS300X heart rate monitor improves your fitness results by helping you train at the optimum intensity. Included Polar WearLink(R)+ 31 transmitter chest strap accurately measures your heart rate; transmitter is coded, eliminating interference from other heart rate monitors. Polar OwnZone(R) feature determines an individual training zone and guides you through an appropriate warm-up routine based on your current physical condition. Watch offers average and maximum heart rate during total exercise time; includes time spent in target zone. Visual and audible alarm alerts you every time your heart rate exceeds the upper limit or falls below the lower limit of your target zone. RS300X displays how many calories you've burned during your workout. Tracks your latest 16 training sessions and your last 16 weeks of training. Event countdown timer keeps you motivated by showing how many days remain until race day (e.g. Boston 21 days). Watch features include time of day with alarm and snooze, dual time zone, date and weekday indicator, stopwatch and low-battery indicator. Display text in English, German, French or Spanish. Water resistant to 164 ft. (50m). CR2032 Battery included. Add the Polar S1 Foot Pod(TM) and G1 GPS sensor (both sold separately) so you can track speed and distance during your workouts. Transfer training data to www.polarpersonaltrainer.com with the optional Polar FlowLink(TM) (sold separately).","short_description":"The attractive and simple-to-use Polar RS300X heart rate monitor improves your fitness results by helping you train at the optimum intensity.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427047.png","image_url":"http://i1.avlws.com/115/l427047.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427047&tt=df","keywords":"watch","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427047\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427047.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=793103&amp;link=&amp;tabs=-Details\"></script>","variants":{"7931030014":{"sku":"7931030014","vendor_sku":"90036619","upc":"725882511214","color":"BLACK","retail_price":"129.95","sale_price":"129.95"}}}
