{"sku":"793122","manufacturer_id":"9781594850943","product_name":" Day Hiking: Central Cascades","long_description":". Author: Craig Romano. Softcover; 355 pages; short section of color photographs, otherwise black-and-white and photographs and maps. The Mountaineers Books; copyright 2009. This handsome guide is full of charts and easy-to-find information that will help you quickly select an ideal hike. Find options for nearby camping, ratings for trail difficulty and photos of what you'll see on your hike. Small topographic maps, elevation profiles and easy-to-follow directions guide you through spectacular scenery. Hikes are typically less than 13 mi. round trip, and a comparson chart helps you choose a route based on distance, difficulty, kid- and pet-friendliness, season and scenery. Includes destinations in the Entiat mountains, Skykomish River valley, the Wild Sky Wilderness, Icicle Creek, Lake Chelan, Puget Sound lowlands and Whidbey Island. Also includes destinations in the Wenatchee River valley and near Lake Wenatchee. Guide is organized around major highways. 1% of sales benefits Washington Trails Association.","short_description":"Day Hiking: Central Cascades offers 125 hikes near Steven's Pass, the Alpine Lakes Wilderness and Lake Wenatchee that are appropriate for all abilities.","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Camping And Hiking Guidebooks","thumb_url":"http://i1.avlws.com/115/s409023.png","image_url":"http://i1.avlws.com/115/l409023.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=409023&tt=df","retail_price":"18.95","sale_price":"18.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=409023\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m409023.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=793122&amp;link=&amp;tabs=-Details\"></script>","variants":{"7931220011":{"sku":"7931220011","vendor_sku":"9781594850943","retail_price":"18.95","sale_price":"18.95"}},"categories":["books","guidebooks","camping-and-hiking-guidebooks"]}
