{"sku":"794283","brand_name":"Rei","product_name":"REI Arete ASL 2 Tent","long_description":"The REI Arete ASL (All Season Light) 2 tent fills the gap between the limited seasonality of ultralight tents and the robustness of 4-season tents. High-strength pole architecture, lightweight materials, fully sealable interior and roomy floor plan combine to create a low-weight, weather-worthy tent. 3-pole extended dome structure is designed for strength; compact footprint and single front vestibule are ideal for setups in tight spots. Asymmetrical shape keeps the weight low while allowing an efficient use of interior space; it provides nice roominess around the shoulder area. Large, multidiameter DAC Featherlight(R) NSL Combi poles increase interior volume and structural stability. Dual AirLift rainfly vents channel wind to increase tent's strength; fully adjustable, these ceiling vents create cross-flow ventilation that mitigates condensation. Dead End pole sleeves and color coding facilitate a quick setup. Speed-pitching option allows tent and fly to be semi-permanently attached for a quick setup that protects the canopy from precipitation. Arete can be used in a variety of seasons and climates: inner tent is fully closeable, with zippered panels that cover the mesh doors and vents. Hybrid floor combines sealed seams and bathtub curves to create a waterproof, taut floor; tautness enhances door-zipper operation and maximizes volume at end walls. Vestibule overhangs tent door so rain stays outside. Multiple storage options include corner pockets, roof pockets and hang loops; use the door pocket to hold door out of the way or for storage. Siliconized 30-denier ripstop nylon fly is lightweight, highly water repellent and tear resistant. No-wick welded construction ensures that moisture won't sneak through susceptible areas, such as guy-out points, pole wraps and zippers.","short_description":"The REI Arete ASL (All Season Light) 2 tent fills the gap between the limited seasonality of ultralight tents and the robustness of 4-season tents.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s174119.png","image_url":"http://i1.avlws.com/115/l174119.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=174119&tt=df","keywords":"tent,backpacktent","retail_price":"359.00","sale_price":"359.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=174119\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m174119.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=794283&amp;link=&amp;tabs=-Details\"></script>","variants":{"7942830014":{"sku":"7942830014","vendor_sku":"12628","upc":"479428300144","size":"2 Person","color":"DEEP BLUSH/ABYSS","retail_price":"359.00","sale_price":"359.00"}}}
