{"sku":"794412","manufacturer_id":"12278","brand_name":"Rei","product_name":"REI Sahara Convertible Pants with No-Sit Zips - Men's 36\" Inseam","long_description":"The REI Sahara Convertible pants with No-Sit Zips feature an innovative new design that makes converting from pants to shorts and back again easier than ever before! Side zippers run the full length of the lower legs; together with thigh zippers they allow quick conversions without requiring wearer to sit down. They also preclude the need to slip lower legs sections over messy boots when converting from pants to shorts along a muddy trail. Color-coded thigh zippers help you easily tell the right leg from the left leg when converting back to pants. Lightweight nylon fabric dries quickly, resists pilling and is easy to pack away in a backpack. With a UPF 50+ rating, fabric provides excellent protection against harmful ultraviolet rays. Fabric is treated with a Durable Water Repellent finish to repel moisture and stains. Side cargo pockets offer ample space for trail items; also includes front hand pockets, zip coin/security pocket, 1 rear zippered pocket and 1 rear rip-and-stick pocket. Mesh pockets bags enhance ventilation and allow water to drain. Gusseted crotch facilitates freedom of movement for increased comfort. Included webbing belt can be completely removed if desired. Elastic waist helps secure the fit.","short_description":"The REI Sahara Convertible pants with No-Sit Zips feature an innovative new design that makes converting from pants to shorts and back again easier than ever before!","category":"Men's","subcategory":"Men's Pants","product_group":"Men's Convertible Pants","thumb_url":"http://i1.avlws.com/115/s107015.png","image_url":"http://i1.avlws.com/115/l107015.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=107015&tt=df","keywords":"lightweight,convertible,cargo,pants,zipoff","retail_price":"64.50","sale_price":"44.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=107015\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m107015.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=794412&amp;link=&amp;tabs=-Details\"></script>","variants":{"7944120002":{"sku":"7944120002","vendor_sku":"12278","upc":"479441200025","size":"L","color":"WILDWHEAT","retail_price":"44.93","sale_price":"44.93"},"7944120026":{"sku":"7944120026","vendor_sku":"12278","upc":"479441200261","size":"L","color":"GUNMETAL","retail_price":"44.93","sale_price":"44.93"},"7944120042":{"sku":"7944120042","vendor_sku":"12278","upc":"479441200421","size":"Xxl","color":"GUNMETAL","retail_price":"44.93","sale_price":"44.93"}}}
