{"sku":"794657","manufacturer_id":"831103","brand_name":"Leatherman","product_name":" Leatherman Super Tool 300 Multitool","long_description":"The original super-duty Leatherman Super Tool 300 multi-tool is back! Comfortable rounded handles, easy-to-unlock blades and heavy-duty strength are all earmarks of this classic tool. All 10 blades lock and unlock quickly by rotating the lock-release on the outside of the handles. Made from 100% stainless steel to provide years of dependable service; each implement is heat-treated to optimal hardness for its function. Includes both needlenose and regular pliers, wire cutters, hard-wire cutters, stranded wire cutters, an electrical crimper, wire strippers and an awl/punch. Clip-point knife, sheep's foot serrated knife and a wood saw handle the cutting tasks. Large, medium and extra-small standard screwdrivers plus a Phillips screwdriver tackle any loose screws. File designed to work effectively on wood or metal; ruler measures up to 9 in. Can/bottle opener helps keep you nourished. Comes with leather carrying sheath. Compatible with the Leatherman Tool Adapter(TM). Assembled in the USA with domestic and imported parts.","short_description":"The original super-duty Leatherman Super Tool 300 multi-tool is back! Comfortable rounded handles, easy-to-unlock blades and heavy-duty strength are all earmarks of this classic tool.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Knives And Tools","thumb_url":"http://i1.avlws.com/115/s418391.png","image_url":"http://i1.avlws.com/115/l418391.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418391&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418391\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418391.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=794657&amp;link=&amp;tabs=-Details\"></script>","variants":{"7946570012":{"sku":"7946570012","vendor_sku":"831103","upc":"037447250897","color":"STAINLESS","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","gadgets","knives-and-tools"]}
