{"sku":"794742","manufacturer_id":"90039170","brand_name":"Polar","product_name":"Polar FT7 Heart Rate Monitor","long_description":"The Polar FT7 heart rate monitor keeps track of your aerobic activity and can help you burn fat and improve your fitness level. Included Polar H1 transmitter chest strap accurately measures your heart rate; transmitter is coded, eliminating interference from other heart rate monitors. EnergyPointer feature lets you easily see the effects of your training by displaying your heart rate as it relates to fat burning and aerobic fitness. Watch offers average and maximum heart rate during total exercise time; includes time spent in target zone. Visual and audible alarm alerts you every time your heart rate exceeds the upper limit or falls below the lower limit of your target zone. Polar OwnCal(R) counts and displays calories burned during a training session; also displays accumulated kilocalories from several training sessions for long-term goals. HeartTouch function enables button-free operation of certain heart rate functions; simply bring the watch close to the transmitter on your chest to change functions. FT7 keeps track of the number of training sessions, total training hours, total time of in-zone training and total burned calories. Watch features include time of day with alarm and snooze, date and weekday indicator, stopwatch and low-battery indicator. Display text in English, German, French, Spanish, Italian, Portuguese, Finnish and Swedish. Water resistant to 50m (165 ft.). User-replaceable battery included. Transfer training data to www.polarpersonaltrainer.com with the optional Polar FlowLink(TM) (sold separately).","short_description":"The Polar FT7 heart rate monitor keeps track of your aerobic activity and can help you burn fat and improve your fitness level.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427055.png","image_url":"http://i1.avlws.com/115/l427055.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427055&tt=df","keywords":"watch","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427055\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427055.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=794742&amp;link=&amp;tabs=-Details\"></script>","variants":{"7947420019":{"sku":"7947420019","vendor_sku":"90039170","upc":"725882543796","color":"BLACK/SILVER","retail_price":"109.95","sale_price":"109.95"},"7947420027":{"sku":"7947420027","vendor_sku":"90039173","upc":"725882013022","color":"BLACK/RED","retail_price":"109.95","sale_price":"109.95"}},"categories":["fitness","running","fitness-electronics"]}
