{"sku":"794803","manufacturer_id":"12244","brand_name":"Rei","product_name":" REI Lumen Sleeping Bag - Youth","long_description":"Built for the young backpacker, the 3-season REI Lumen kids' synthetic sleeping bag features amazing compressibility and warmth while balancing price and performance. Rated to keep your child warm down to about 25degF during adventures in spring, summer and fall. Synthetic Thermawave polyester insulation is durable and highly compressible; synthetic polyester fill retains some insulating properties even when wet. Shingle construction with overlapping layers distributes insulation evenly and keeps it from moving around so there are no cold spots. Equally distributed insulation accommodates the multi-position sleeper; mummy shape is thermally efficient, yet roomy enough to ensure sleeping comfort. Ripstop nylon shell fabric has a nice hand feel, is lightweight, durable, water- and abrasion resistant; nylon taffeta lining is soft and tear-resistant. Relaxed fit through the shoulders and hips gives you room to move for a better night's rest. Contoured hood, insulated full-face muffler, roomy footbox and full-length zipper draft tube with ground-level seams work together to keep heat in and cold out. External chest pocket keeps small essentials-headlamp, watch, glasses-right at hand and easy to find in the dark. Special pocket in hood can be stuffed with clothing layers to make a pillow that stays in place; no need for a pillow to take up valuable space in your backpack. Pad loops provide attachment points to keep your sleeping bag and pad together, so you needn't worry about rolling onto the cold ground (straps sold separately). Full length zipper is backed by wide, antisnag binding tape. Differentiated drawcords (1 round, 1 flat) allow quick identification, even in the dark, so neck and hood adjustments are a cinch. Nylon stuff sack and cotton storage bag included. Ideal for 10 - 14 year olds.","short_description":"Built for the young backpacker, the 3-season REI Lumen kids' synthetic sleeping bag features amazing compressibility and warmth while balancing price and performance.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421167.png","image_url":"http://i1.avlws.com/115/l421167.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421167&tt=df","keywords":"compact","retail_price":"119.00","sale_price":"119.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421167\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421167.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=794803&amp;link=&amp;tabs=-Details\"></script>","variants":{"7948030023":{"sku":"7948030023","vendor_sku":"12244","upc":"479480300236","size":"Kids","color":"INDIGO/OCEAN","retail_price":"119.00","sale_price":"119.00"}}}
