{"sku":"795048","manufacturer_id":"12609","brand_name":"Rei","product_name":"REI Nodder Sleeping Bag - Kids'","long_description":"Built for the growing young backpacker, the 3-season REI Nodder kids' synthetic sleeping bag is light and compressible while balancing price and performance for years of use. This bag is built to the same insulation standard as the EN-rated REI Polar Pod +25degF adult sleeping bag. Attached stuff sack doubles as a space adjuster allowing you to shorten or lengthen the bag as child grows. Close-fitting hood with a stretchy opening around face allows an auto-adjust, kid-friendly fit. Dual side zips combined with rip-and-stick closure tabs allow room for arms to be free for games or reading while inside bag. Shingle construction with overlapping layers eliminates cold spots; evenly distributed insulation accomodates the multi-position sleeper. Special pocket in hood can be stuffed with clothing layers to make a pillow that stays in place; no need for a pillow to take up valuable space in your backpack. Synthetic polyester insulation is durable and retains some insulating properties even when wet. Ripstop nylon shell fabric has a nice hand feel, is lightweight, durable, water- and abrasion resistant; nylon taffeta lining is soft and tear-resistant. Both zippers feature full-length draft tubes to keep heat in and cold out. Pad loop attachment points keep your sleeping bag and pad together, so you needn't worry about rolling onto the cold ground (straps sold separately). Ideal for 6 - 10 year olds.","short_description":"Built for the growing young backpacker, the 3-season REI Nodder kids' synthetic sleeping bag is light and compressible while balancing price and performance for years of use.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Kids' Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s170183.png","image_url":"http://i1.avlws.com/115/l170183.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=170183&tt=df","keywords":"youth,insulated,sleep,sleeping,children","retail_price":"89.50","sale_price":"89.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=170183\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m170183.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=795048&amp;link=&amp;tabs=-Details\"></script>","variants":{"7950480017":{"sku":"7950480017","vendor_sku":"12609","upc":"479504800179","size":"Kids","color":"MESA ORANGE","retail_price":"89.50","sale_price":"89.50"}}}
