{"sku":"795519","manufacturer_id":"12362","brand_name":"Rei","product_name":"REI Venus 70 Pack - Women's","long_description":"Pack the fuzzy slippers, the newly redesigned REI Venus 70 women's backpack is built to carry all the creature comforts-in comfort! It's a great pack and a great value. This well-designed pack features heavy load handling, quick access and an ultra-adjustable suspension and women-specific contours and sizing in the harness. Not just a small men's pack, it features a slim width and a short height, and its anatomic, ergonomic shoulder straps and hipbelt fit a woman's shape. With a \"rip-and-stick\" torso adjustment, shoulder strap system easily slides along pack's frame to fit torsos of varying lengths. Precurved shoulder straps match your anatomy for non-binding comfort on and off the trail. Dual-density foam padded back panel provides a comfortable and supportive fit when carrying heavy loads. Precurved hipbelt is designed to cradle hip bones for a natural fit and to distribute weight without sagging. Hipbelt webbing system allows you to use a natural forward pulling motion for quick, easy cinching and precise adjustment. Enjoy dual access to pack via the top-loading opening and the horseshoe-shape, zippered front panel opening, which works like a duffel opening. Removable top lid pocket with water-repellent zipper lets you stash the essentials you want to bring into tent; pack can stay outside or in vestibule. Zippered pocket under the lid stores maps and keys, spare batteries and other small essentials. Front panel features a new and improved stretch-woven zipper pocket with easy access for packing oft-used gear. Internal sleeping-bag compartment with a zippered divider separates it from gear and clothes in the main compartment. Utilizing 4 buckles, the pack's streamlined compression system lets you cinch and strap down loads for jostle-free carrying. Concave head pod at the top of pack gives your head freedom of movement-no more staring at the ground.","short_description":"Pack the fuzzy slippers, the newly redesigned REI Venus 70 women's backpack is built to carry all the creature comforts-in comfort! It's a great pack and a great value.","category":"Camping & Hiking","subcategory":"Backpacking Packs","product_group":"Extended Trip Packs","thumb_url":"http://i1.avlws.com/115/s155967.png","image_url":"http://i1.avlws.com/115/l155967.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=155967&tt=df","keywords":"extendedtrip","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=155967\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m155967.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=795519&amp;link=&amp;tabs=-Details\"></script>","variants":{"7955190017":{"sku":"7955190017","vendor_sku":"12362","upc":"479551900174","size":"S","color":"EVERGLADE","retail_price":"199.00","sale_price":"199.00"},"7955190025":{"sku":"7955190025","vendor_sku":"12362","upc":"479551900259","size":"M","color":"EVERGLADE","retail_price":"199.00","sale_price":"199.00"}}}
