{"sku":"795513","manufacturer_id":"12363","brand_name":"Rei","product_name":"REI Mars 80 Pack","long_description":"Built to handle heavy loads with all the creature comforts, the newly updated REI Mars 80 pack handles extended backpacking in any season. Precurved shoulder straps match your anatomy for nonbinding comfort on and off the trail. With a \"rip-and-stick\" torso adjustment, shoulder strap system easily slides along pack's frame to fit torsos of varying lengths. Dual-density foam padded back panel provides a comfortable and supportive fit when carrying heavy loads. Precurved hipbelt is designed to cradle hip bones for a natural fit and to distribute weight without sagging. Hipbelt webbing system allows you to use a natural forward pulling motion for quick, easy cinching and precise adjustment. Enjoy dual access to pack via the top-loading opening and the horseshoe-shape, zippered front panel opening, which works like a duffel opening. Removable top lid pocket with water repellent zipper lets you stash the essentials you want to bring into tent; pack can stay outside or in vestibule. Zippered pocket under lid stores maps and keys, spare batteries and other small essentials. Front panel features a new and improved stretch-woven zippered pocket with easy access for packing often-used gear. Internal sleeping bag compartment is created by a zippered divider, separating it from gear and clothes in the main compartment. Utilizing 4 buckles, the pack's streamlined compression system lets you cinch and strap down loads for jostle-free carrying. Concave head pod at the top of pack gives your head freedom of movement-no more staring at the ground. 2 mesh side pockets hold water bottles, energy bars and other essentials you want close at hand. Side hipbelt pocket stores those small essentials you want at your fingertips, such as lip balm and sunscreen. Lash points on the other side of hipbelt let you attach camera and GPS pouches. Lash straps on bottom of pack let you attach sleeping pad.","short_description":"Built to handle heavy loads with all the creature comforts, the newly updated REI Mars 80 pack handles extended backpacking in any season.","category":"Camping & Hiking","subcategory":"Backpacking Packs","product_group":"Extended Trip Packs","thumb_url":"http://i1.avlws.com/115/s156291.png","image_url":"http://i1.avlws.com/115/l156291.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=156291&tt=df","keywords":"extendedtrip","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=156291\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m156291.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=795513&amp;link=&amp;tabs=-Details\"></script>","variants":{"7955130013":{"sku":"7955130013","vendor_sku":"12363","upc":"479551300134","size":"M","color":"COAL","retail_price":"199.00","sale_price":"199.00"}}}
