{"sku":"795973","manufacturer_id":"AJQVRS7","brand_name":"The North Face","product_name":"The North Face Terra Youth 55 Pack","long_description":"The North Face Terra Youth 55 pack is built with young first-time backpackers in mind. It features an adjustable suspension and plenty of room in an affordable package. Opti-Fit(TM) suspension features an adjustable fit for varying torso lengths. Dual-density padded shoulder straps and 3-point adjustable hipbelt distribute weight for comfortable, stable carrying. Stretched across the back, the open-air trampoline mesh Verti-Cool(TM) back panel lets air circulate between back and pack. Aluminum V-stays transfer load weight to the hips for comfortable carrying; polyethylene framesheet offers support and protection. Top-loading system with a mesh pocket in lid for stashing small essentials such as energy bars, sunglasses and sunblock. Zippered front stretch pocket holds other small items that you want within easy reach; stretch fabric allows maximum stuffing. Stretch-woven side pockets and an internal hydration pocket (reservoir sold separately) let you carry plenty of water. Bottom zippered compartment with an internal divider separates gear from sleeping bag; extended zipper provides easy access to sleeping bag compartment. Trekking pole loops, lash points and tool loops let you secure extra gear onto pack's exterior. Side compression straps let you cinch down loads for jostle-free carrying. Sternum strap adjusts vertically for comfort and features a buckle that doubles as a safety whistle.","short_description":"The North Face Terra Youth 55 pack is built with young first-time backpackers in mind. It features an adjustable suspension and plenty of room in an affordable package.","category":"Camping & Hiking","subcategory":"Backpacking Packs","product_group":"Kids' Backpacks","thumb_url":"http://i1.avlws.com/115/s155991.png","image_url":"http://i1.avlws.com/115/l155991.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=155991&tt=df","keywords":"child,junior,lightweight,kids,youth","retail_price":"159.00","sale_price":"78.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=155991\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m155991.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=795973&amp;link=&amp;tabs=-Details\"></script>","variants":{"7959730002":{"sku":"7959730002","vendor_sku":"AJQVRS7","upc":"617932521383","size":"ONE SIZE","color":"RHUMBA ORANGE","retail_price":"78.83","sale_price":"78.83"}}}
