{"sku":"795974","manufacturer_id":"AJQRSZ4","brand_name":"The North Face","product_name":"The North Face Terra 55 Pack - Women's","long_description":"With a bevy of features in an affordable package, The North Face Terra 55 women's pack is designed to accommodate long day hikes and overnight trips. Female-friendly features include narrow shoulder straps, small hipbelt and short torso length. Mesh Verti-cool(TM) back panel circulates air between back and pack. Dual-density padded shoulder straps and 3-point adjustable hipbelt distribute weight for comfortable, stable carrying. Aluminum V-stays transfer load weight to the waist for comfortable carrying; polyethylene framesheet provides support and protection. Front stretch pocket holds small items that you want within easy reach; stretch fabric allows maximum capacity. Top-loading system features a mesh pocket in lid for stashing small essentials such as energy bars, sunglasses and sunblock. Compression straps, trekking pole loops, lash points and tool loops let you secure extra gear to the pack's exterior. Stretch-woven side pockets, plus a hydration pocket (reservoir sold separately) let you carry plenty of water. Bottom zippered compartment with trampoline divider separates gear from sleeping bag.","short_description":"With a bevy of features in an affordable package, The North Face Terra 55 women's pack is designed to accommodate long day hikes and overnight trips.","category":"Camping & Hiking","subcategory":"Backpacking Packs","product_group":"Multi-Day Backpacks","thumb_url":"http://i1.avlws.com/115/s156099.png","image_url":"http://i1.avlws.com/115/l156099.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=156099&tt=df","keywords":"lightweight,adult","retail_price":"165.00","sale_price":"165.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=156099\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m156099.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=795974&amp;link=&amp;tabs=-Details\"></script>","variants":{"7959740002":{"sku":"7959740002","vendor_sku":"AJQRSZ4","upc":"617932516952","size":"ONE SIZE","color":"GRECIAN GREEN/FIG GREEN","retail_price":"165.00","sale_price":"165.00"}}}
