{"sku":"795901","manufacturer_id":"20080","brand_name":"Marmot","product_name":"Marmot Col Membrain -20 Sleeping Bag","long_description":"The highest quality 800-fill-power goose down and a waterproof shell make the Marmot Col Membrain -20 sleeping bag the right bag for serious mountaineering in extreme conditions. Marmot MemBrain(R) shell is breathable, downproof and waterproof. Lofty, premium 800-fill-power goose down offers superb warmth for minimal weight; it has been meticulously cleaned and processed for hypoallergenic qualities. 9-baffle chest section provides maximum goose down control for warmth and durability. 6-Baffle Hood envelops your head in warmth; Face Muff allows hood to be cinched snug without digging into your face. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make hood adjustments easy. Hood closure system stays closed without the use of rip-and-stick and also keeps the drawstring and zipper away from your face. Spacious 11-baffle footbox allows down to loft fully; footbox is reinforced to handle extra abuse of boot liners and water bottle. Down-filled draft collar increases warmth; hidden pocket in down-filled draft tube keep small items such as lip balm or your watch warm and accessible. Zipper guards prevent zipper snags; locking, full-length zippers keep bag from opening in the night. Comes with nylon stuff sack and a storage bag.","short_description":"The highest quality 800-fill-power goose down and a waterproof shell make the Marmot Col Membrain -20 sleeping bag the right bag for serious mountaineering in extreme conditions.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421175.png","image_url":"http://i1.avlws.com/115/l421175.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421175&tt=df","keywords":"compact","retail_price":"669.00","sale_price":"669.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421175\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421175.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=795901&amp;link=&amp;tabs=-Details\"></script>","variants":{"7959010021":{"sku":"7959010021","vendor_sku":"20080","upc":"481208542675","size":"Long Left","color":"ALERT/TERRA COTTA","retail_price":"669.00","sale_price":"669.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
