{"sku":"796072","manufacturer_id":"BDWCC10","brand_name":"Big Agnes","product_name":"Big Agnes Cabin Creek Sleeping Bag - Double","long_description":"Designed to sleep 2 people comfortably, the Big Agnes Cabin Creek spacious double bag offers the same great features as a single Big Agnes sleeping bag. High loft synthetic insulation has a soft feel that offers excellent drape and compressibility. Ripstop nylon shell features a Durable Water Repellent finish causing moisture to bead up and roll off; soft, nylon taffeta lining features a stain resistant finish. Underside insulation has been eliminated and replaced with sleeves for two 72 x 20 in. pads (sold separately); no-draft wedge insulates the connection between bag and pads. Draft collar for each person keeps cold air from sneaking in around the neck; no-draft flap running down the inside center of the bag keeps heat compartmentalized. Zippers on each side allow easy access for both sleepers; draft tubes back zippers to prevent warm air from escaping and cold air from entering. Built-in pillow pocket for each person lets you stuff a jacket or a pillow inside. Internal loops allow attachment of a sleeping bag liner, sold separately. Comes with a stuff sack and nylon mesh storage bag.","short_description":"Designed to sleep 2 people comfortably, the Big Agnes Cabin Creek spacious double bag offers the same great features as a single Big Agnes sleeping bag.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421183.png","image_url":"http://i1.avlws.com/115/l421183.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421183&tt=df","keywords":"compact","retail_price":"269.95","sale_price":"269.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421183\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421183.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=796072&amp;link=&amp;tabs=-Details\"></script>","variants":{"7960720014":{"sku":"7960720014","vendor_sku":"BDWCC10","upc":"873840006262","size":"Double","color":"RED/GRAY","retail_price":"269.95","sale_price":"269.95"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
