{"sku":"796823","manufacturer_id":"HS2-A-BK","brand_name":"Surefire","product_name":"SureFire Minimus LED Headlamp","long_description":"Built tough to withstand your many adventures, the slight yet sophisticated SureFire Saint Minimus LED headlamp gives you complete control over your lighting needs. Don't underestimate this compact light! Variable light output dial lets you easily set the light up or down from 0 to 100 lumens with a simple twist. On/off adjustment dial is easy to locate and can be operated with cold fingers or while wearing bulky gloves. Advanced optics and a high-quality LED form a smooth white beam that corresponds with your peripheral vision; beam also works well for close-up work. High-quality LED throws light up to 42m on highest setting and 4m on lowest setting. Expect to get about 1.5 hrs. of runtime on high and 50 hrs. on low using a single CR123A lithium battery, included. Stretchy headband utilizes a fine mesh material for a comfortable and secure fit; soft Breathe-O-Prene(R) pads sit against the forehead to wick moisture. SureFire Saint Minimus headlamp is waterproof to 1m for 30 min. Includes a red filter designed to be used at night.","short_description":"Built tough to withstand your many adventures, the slight yet sophisticated SureFire Saint Minimus LED headlamp gives you complete control over your lighting needs.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417031.png","image_url":"http://i1.avlws.com/115/l417031.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417031&tt=df","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417031\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417031.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=796823&amp;link=&amp;tabs=-Details\"></script>","variants":{"7968230016":{"sku":"7968230016","vendor_sku":"HS2-A-BK","upc":"084871312745","color":"BLACK","retail_price":"149.00","sale_price":"149.00"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
