{"sku":"797045","manufacturer_id":"7521","brand_name":"Vasque","product_name":" Vasque Mindbender Trail-Running Shoes - Women's","long_description":"The women's Vasque Mindbender shoes provide support, plenty of cushioning and excellent traction as you set out running trails. Breathable, abrasion-resistant synthetic leather and nylon mesh uppers are lightweight and flexible for comfort; thermoplastic urethane overlays provide structure and support. Nylon linings absorb excess moisture and disperse it for fast drying; protective toe bumpers shield toes and uppers from abrasion. Padded tongues and collars add comfort and relieve pressure from lacing. Reflective detailing increases your visibility in low light. Removable dual-density EVA footbeds add cushioning. Thermoplastic urethane shanks and nylon forefoot plates provide support and stability on rough terrain and protection from sharp objects underfoot. Molded dual-density EVA midsoles cushion the footstrike and assist in heel-to-midfoot transition. Blur trail-running outsoles utilize a slip-resistant rubber compound and feature aggressive, multidirectional lugs for superior traction.","short_description":"The women's Vasque Mindbender shoes provide support, plenty of cushioning and excellent traction as you set out running trails.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s387283.png","image_url":"http://i1.avlws.com/115/l387283.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=387283&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=387283\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m387283.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=797045&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
