{"sku":"797167","manufacturer_id":"07.6490.7030","brand_name":"Ocean Kayak","product_name":"Ocean Kayak Nalu Stand Up Paddleboard - 11'","long_description":"The Ocean Kayak Nalu(TM) 11 ft. stand-up paddleboard offers a versatile experience on the water: when you get tired of paddling while standing, just sit down and paddle it like a sit-on-top kayak! Besides providing a new way to get on the water, paddleboarding works core muscles and develops balance-it's perfect training for surfers, skiers and paddlers. Ideal for cruising on flat water and enjoying light surf, the Nalu offers those interested in stand up paddleboards great value and high durability. Low rocker from nose to tail provides high speed and straight tracking when paddling on flat water; design also handles light surf and rolling waves with ease. 11 ft. length maneuvers easily in waves and tracks well when exploring flat water; short length helps develop strength with a focus on balance and technique. Rotomolded polyethylene hull resists abrasion and UV light, and it offers good looks at a great value. Standing area features comfortable foot wells, and molded-in seat enhances comfort from the sitting position. Stern storage bungee secures accessories. Scupper drain holes prevent the Nalu from taking on water. Drainplug at bow evacuates excess water due to condensation. 3 in-molded fins promote straight tracking in the water; fins are low-profile and integrated in the hull to increase durability. Carry handles ease transport.","short_description":"The Ocean Kayak Nalu(TM) 11 ft. stand-up paddleboard offers a versatile experience on the water: when you get tired of paddling while standing, just sit down and paddle it like a sit-on-top kayak!","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s442495.png","image_url":"http://i1.avlws.com/115/l442495.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442495&tt=df","retail_price":"599.95","sale_price":"599.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442495\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442495.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=797167&amp;link=&amp;tabs=-Details\"></script>","variants":{"7971670001":{"sku":"7971670001","vendor_sku":"07.6490.7030","upc":"785978077055","color":"LIME/WHITE","retail_price":"599.95","sale_price":"599.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
