{"sku":"797211","manufacturer_id":"CTE20003FC","brand_name":"Nemo","product_name":"NEMO Losi 3P Tent","long_description":"The NEMO Losi 3P palace offers nearly 80 sq. ft. under the rainfly and almost vertical walls, all for about 2 lbs. per person. 2 doors protected by vestibules eliminate jockeying for position and provide roomy gear storage. Unique pole structure provides extra stability and creates nearly vertical walls that maximize usable space; setup is straightforward. Full mesh canopy is perfect on summer evenings; large side vents provide continuous airflow on rainy nights. Lightweight and strong DAC(R) pole system with press-fit connectors and lightweight hubs uses an anodization process without harsh acids. Hassle-free setup features DAC(R) Jake's Feet corner anchor system which locks poles in place. Jake's Feet act as levers that keep tent corners grounded as the rainfly is tensioned over the canopy. Catenary cut-aways in rainfly increase airflow, while reflective guyouts are illuminated in a headlamp's light. Features reflective guyouts and inside mesh pockets; also includes a removable Gear Caddy organizer with pockets and light-diffusing slots for headlamps. Pawprint(TM) interior liner (sold separately) converts 2 sleeping pads into a double bed. As a convenient option, poles and rainfly can be set up with the included footprint to create a lightweight shelter. Includes footprint, roll-up-style stuff sack, stakes and repair kit. Average minimum weight specification is based on tent, rainfly and poles only.","short_description":"The NEMO Losi 3P palace offers nearly 80 sq. ft. under the rainfly and almost vertical walls, all for about 2 lbs. per person.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423779.png","image_url":"http://i1.avlws.com/115/l423779.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423779&tt=df","retail_price":"349.95","sale_price":"349.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423779\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423779.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=797211&amp;link=&amp;tabs=-Details\"></script>","variants":{"7972110014":{"sku":"7972110014","vendor_sku":"CTE20003FC","upc":"892802002784","size":"3 Person","color":"BIRCH LEAF GREEN","retail_price":"349.95","sale_price":"349.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
