{"sku":"797210","manufacturer_id":"CTE20002FC","brand_name":"Nemo","product_name":"NEMO Losi 2P Tent","long_description":"The NEMO Losi 2P tent is remarkably sturdy and elegantly spacious. It offers 2 backpackers a comfortable retreat in the wilderness. Enjoy summer evenings from inside the full mesh canopy; breathe easy on rainy nights with large side vents that provide continuous airflow. 2 doors protected by vestibules eliminate jostling for position and provide roomy gear storage. Unique pole structure provides extra stability and creates nearly vertical walls that maximize usable space. DAC Featherlite(R) NSL poles are strong and lightweight due to extruded construction and the elimination of insert connections. NSL poles are anodized without the use of harmful acids. Setup is straightforward thanks to ball and socket attachments for the pole ends and an intuitive symmetrical design. Catenary cut-aways in rainfly increase airflow; reflective guyouts are illuminated in a headlamp's light. Features inside mesh pockets and a removable tent organizer that includes a light-diffusing pocket for your headlamp. Included footprint, fly and poles pitch without canopy to create a lightweight shelter. Pawprint(TM) interior liner (sold separately) converts 2 sleeping pads into a double bed. Average minimum weight specification is based on tent, rainfly and poles only.","short_description":"The NEMO Losi 2P tent is remarkably sturdy and elegantly spacious. It offers 2 backpackers a comfortable retreat in the wilderness.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s443563.png","image_url":"http://i1.avlws.com/115/l443563.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=443563&tt=df","retail_price":"319.95","sale_price":"319.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=443563\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m443563.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=797210&amp;link=&amp;tabs=-Details\"></script>","variants":{"7972100015":{"sku":"7972100015","vendor_sku":"CTE20002FC","upc":"892802002760","size":"2 Person","color":"BLUE","retail_price":"319.95","sale_price":"319.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
