{"sku":"798038","manufacturer_id":"87501-201","brand_name":"Scarpa","product_name":"Scarpa Mont Blanc GTX Mountaineering Boots - Men's","long_description":"With superb all-around mountain performance, the Scarpa Mont Blanc GTX mountaineering boots are lightweight and responsive for great feel yet sturdy and tough enough for harsh environs. Single-piece 3mm suede leather uppers remain resilient in demanding conditions; HS12 tanning treatment adds water resistance and speeds dry time. Boot design faciliates dynamic flex and natural movement in the uppers while maintaining a solid, stable platform underfoot; close-to-toe lacing provide a snug, responsive fit. Rubber rands protect uppers against bumps and abrasion while rear heel slings lock heels in for secure performance. GORE-TEX(R) waterproof liners let feet breathe while protecting them from the elements, keeping them dry and comfortable. Moisture-wicking nylon linings absorb and disperse sweat to keep feet and boots dry and comfortable. Insulated Comfort polyester fibers and Pro-Fiber insoles create a barrier between your feet and the cold ground and air, helping to keep your feet warm. Polyurethane and thermoplastic urethane midsoles absorb shock without compromising sensitivity. Polyethylene and fiberglass plates offer ample rigidity to support crampons yet also have enough flex for comfort when walking. Lightweight Vibram(R) rubber outsoles on the Scarpa Mont Blanc GTX mountaineering boots ensure superb trail traction.","short_description":"With superb all-around mountain performance, the Scarpa Mont Blanc GTX mountaineering boots are lightweight and responsive for great feel yet sturdy and tough enough for harsh environs.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385087.png","image_url":"http://i1.avlws.com/115/l385087.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385087&tt=df","retail_price":"469.00","sale_price":"469.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385087\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385087.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=798038&amp;link=&amp;tabs=-Details\"></script>","variants":{"7980380062":{"sku":"7980380062","vendor_sku":"87501-201","upc":"666898227112","size":"43.5","color":"MANGO","retail_price":"469.00","sale_price":"469.00"},"7980380070":{"sku":"7980380070","vendor_sku":"87501-201","upc":"666898227129","size":"44","color":"MANGO","retail_price":"469.00","sale_price":"469.00"},"7980380104":{"sku":"7980380104","vendor_sku":"87501-201","upc":"666898227150","size":"45.5","color":"MANGO","retail_price":"469.00","sale_price":"469.00"}},"categories":["footwear","mens-footwear","mens-boots"]}
