{"sku":"798183","manufacturer_id":"2510-01940","brand_name":"Mammut","product_name":"Mammut Neon Gear 45 Climbing Pack","long_description":"The Mammut Neon Gear 45 climbing pack offers an intelligent transport solution for outdoor or indoor climbers with a built-in rope bag and large opening for loading bulky gear. Anatomically shaped, padded back panel, shoulder straps and hip belt with soft, moisture-wicking stretch fabric offer great comfort and support. Shoulder straps can be combined to form a carrying handle. 5mm aluminum U-frame is light and adjustable. Main compartment features a wide, circular-zip opening on the back. Hydration-compatible design accommodates a reservoir (sold separately) to let you drink on the go. Integrated rope bag can be removed and spread out on the ground to help protect ropes from dirt and tangles; chalk bag pouch helps keep the rest of your gear clean. Lid features 2 pockets-1 external and 1 internal. Large mesh inner pocket and gear loop lets you organize pack contents. External daisy chain and gear loops create external attachment points for extra items and tools. Mammut Neon Gear 45 climbing pack is built tough with 420-denier nylon and 1,680-denier ballistic nylon trim.","short_description":"The Mammut Neon Gear 45 climbing pack offers an intelligent transport solution for outdoor or indoor climbers with a built-in rope bag and large opening for loading bulky gear.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s410983.png","image_url":"http://i1.avlws.com/115/l410983.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410983&tt=df","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410983\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410983.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=798183&amp;link=&amp;tabs=-Details\"></script>","variants":{"7981830016":{"sku":"7981830016","vendor_sku":"2510-01940","size":"One Size","color":"BLACK","retail_price":"149.95","sale_price":"149.95"}},"categories":["camping-hiking","backpacks","day-packs"]}
