{"sku":"798273","manufacturer_id":"50139","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors Halulite Minimalist Cookset","long_description":"The GSI Halulite(TM) Minimalist cookset gives ultralight backpackers a compact system for heating water to rehydrate meals and make hot drinks. Features an innovative compact silicone pot gripper that fits over 2 fingers and allows you to lift the hot pot off of a stove by pinching 2 fingers and your thumb together. Gripper weighs in at a mere 0.5 oz., saving weight over a standard aluminum pot gripper or integrated handle. Built-in magnet lets you set the gripper on a metal fuel canister (sold separately) for convenient storage while your water heats up. Hard-anodized Halulite alloy distributes heat evenly for fast and efficient cooking and is extremely lightweight and abrasion resistant. 2-way lid can be flipped over for use as either a pot top or a Sip-It lid. Remove the pot from the stove and put it into the removable insulating sleeve to keep water warm and protect your hands while using the Sip-It lid to enjoy a hot beverage. Telescoping Foon combines a fork with a spoon, thereby eliminating the need for a second utensil and saving precious weight. Foon collapses down to 3.8 in. and expands to 6 in.; copolyester head and acetal handle are strong, heat-resistant and dishwasher safe.","short_description":"The GSI Halulite(TM) Minimalist cookset gives ultralight backpackers a compact system for heating water to rehydrate meals and make hot drinks.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414543.png","image_url":"http://i1.avlws.com/115/l414543.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414543&tt=df","keywords":"messkit","retail_price":"27.95","sale_price":"27.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414543\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414543.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=798273&amp;link=&amp;tabs=-Details\"></script>","variants":{"7982730017":{"sku":"7982730017","vendor_sku":"50139","upc":"090497501395","retail_price":"27.95","sale_price":"27.95"}}}
