{"sku":"798578","manufacturer_id":"ST1026","brand_name":"Bob","product_name":" BOB Revolution Stroller CE Stroller","long_description":"This BOB Revolution CE stroller is great for around-city adventures with a kid, be it visiting the farmer's market, cruising a park path or jogging around the neighborhood. Made with a tough frame and durable fabric for lasting use; 2-step folding design supplies convenient transport and storage. 12 in. swiveling front wheel allows for excellent maneuverability; locks forward for increased stability jogging or when the terrain turns tough. In addition, the front wheel tracking can be easily adjusted with a dial to keep you rolling straight. Lightweight and strong alloy wheels are outfitted with durable, compact tires for easy urban strolling. Padded and adjustable reclining seat offers great seating comfort; 5-point padded harness keeps child secure. Multi-position canopy can be adjusted for protection against the elements; large viewing window on top lets you keep an eye on the passenger. Internal seat pockets offer secure space for snacks and toys. Store extra clothing, food and more with the large seat-back pocket and Low Boy undercarriage cargo basket. Adjustable suspension system smooths out bumpy terrain and supplies a comfortable ride for precious cargo. Accessory adapter allows for quick and easy attachment of BOB Infant Car Seat Adapter (sold separately). Foot-actuated rear wheel parking brake on the BOB Revolution CE stroller ensures the stroller stays put until you're ready to roll.","short_description":"This BOB Revolution CE stroller is great for around-city adventures with a kid, be it visiting the farmer's market, cruising a park path or jogging around the neighborhood.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s427395.png","image_url":"http://i1.avlws.com/115/l427395.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427395&tt=df","retail_price":"375.00","sale_price":"375.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427395\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427395.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=798578&amp;link=&amp;tabs=-Details\"></script>","variants":{"7985780019":{"sku":"7985780019","vendor_sku":"ST1026DI","upc":"692176702101","color":"BLACK","retail_price":"375.00","sale_price":"375.00"}}}
