{"sku":"798577","manufacturer_id":"ST1007DI","brand_name":"Bob","product_name":" BOB Ironman Stroller","long_description":"Bring the little one along in the BOB Ironman stroller, designed to carry a child safely and comfortably as you embark on your training sessions. Made with a tough frame and durable fabric for lasting use; 2-step folding design supplies convenient transport and storage. 16 in. fixed front wheel allows for great stability when jogging or running at a fast training pace; hand-operated brake lets you decelerate quickly. Lightweight and strong alloy wheels are outfitted with durable low-profile tires to roll smoothly on hard surfaces such as a track or path. Padded and adjustable reclining seat offers great seating comfort; 5-point padded harness keeps child secure. Multi-position canopy can be adjusted for protection against the elements; large viewing window on top lets you keep an eye on the passenger. Internal seat pockets offer secure space for snacks and toys. Store extra clothing, food and more with the large seat-back pocket and Low Boy undercarriage cargo basket. Adjustable suspension system smooths out bumpy terrain and supplies a comfortable ride for precious cargo. Accessory adapter allows for quick and easy attachment of BOB Infant Car Seat Adapter (sold separately). Foot-actuated rear wheel parking brake on the BOB Ironman stroller ensures the stroller stays put until you're ready to roll.","short_description":"Bring the little one along in the BOB Ironman stroller, designed to carry a child safely and comfortably as you embark on your training sessions.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s427391.png","image_url":"http://i1.avlws.com/115/l427391.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427391&tt=df","retail_price":"327.00","sale_price":"327.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427391\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427391.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=798577&amp;link=&amp;tabs=-Details\"></script>","variants":{"7985770010":{"sku":"7985770010","vendor_sku":"ST1007DI","upc":"692176702033","color":"NAVY","retail_price":"327.00","sale_price":"327.00"}}}
