{"sku":"799003","manufacturer_id":"ADO-RP","brand_name":"Steripen","product_name":" SteriPEN Adventurer Opti Water Purifier","long_description":"The SteriPEN Adventurer Opti water purifier is equipped with a new optical water sensor for reliable performance so you can enjoy clean, purified water on the go. From 2011. SteriPEN Opti features an optical water sensor that detects whether or not the device is in water and only allows the UV lamp to activate when the SteriPEN is immersed. After pressing the button to activate the SteriPEN, immerse the lamp and optical sensor; the UV lamp will then activate and emit UV light and visible blue light. Optical sensor doubles as a backup LED flashlight that can be handy when walking to the stream to get water; operate flashlight with SteriPEN cap in place to protect the lamp. Adventurer Opti requires no pumping, chemicals, test strips, extended time-keeping or filters; leaves no aftertaste, will not clog and does not require lubrication. Innovative SteriPEN system uses UV light rays instead of chemicals to purify water for drinking. Ultraviolet (UV-C) light rays safely sterilize clear water by destroying 99.99% of protozoa (including Giardia and. Long used by municipal water districts and bottling companies, low-level UV-C light treats water safely, and unit's light will not damage eyes or skin when used properly. SteriPEN protects you from risks that cause botulism, cholera, dysentery and typhoid, just to name a few. SteriPEN Adventurer Opti is simple to use: just press a button and gently agitate the water with a quick stir. Purifies 16 fl. oz. of water (cold or warm) in less than a minute, or 32 fl. oz. in a minute and a half. Small size fits most containers-use it in cups, mugs, water bottles and canteens; carries easily in a shirt pocket. SteriPEN Adventurer Opti turns itself off once ultraviolet treatment is complete; light source can be used up to 8,000 times! Watertight seals keep water away from the electronics; rubberized coating ensures secure handling in wet conditions.","short_description":"The SteriPEN Adventurer Opti water purifier is equipped with a new optical water sensor for reliable performance so you can enjoy clean, purified water on the go.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426287.png","image_url":"http://i1.avlws.com/115/l426287.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426287&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426287\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426287.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=799003&amp;link=&amp;tabs=-Details\"></script>","variants":{"7990030012":{"sku":"7990030012","vendor_sku":"ADO-RP","upc":"899321000574","retail_price":"89.95","sale_price":"89.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
