{"sku":"799219","manufacturer_id":"VNPCGYMSM","brand_name":"Smith","product_name":" Smith Pivlock V90 Interchangeable Sunglasses","long_description":"Providing an unobstructured field of vision for your high speed activities, the rimless Smith PivLock V90 sunglasses feature new interchangeable lenses. With the new patent pending PivLock interchangeable system, simply rotate temple piece up 45deg and remove from lens; to remove nose piece, grasp lens and pull piece away. Scratch- and impact-resistant Carbonic(TM) lenses use Smith Tapered Lens Technology(TM) to provide distortion-free vision. Tapered Lens Technology contours the thickness of the lens so that light travels through without distortion-what you see is what you get. Oleophobic lens coating repels moisture, grease and grime to keep your vision clear. Smoke crystal frames feature a gray lens with a platinum mirror to reduce visible light and glare while preserving true color definition. 2 additional sets of lenses included: rose Ignitor lenses with mirror coating for medium light/overcast conditions; clear mirror lenses for low light to night conditions. Includes a total of 3 sets of lenses. 7-base-curve lens (the higher the number the more curved the lens); Smith features sunglasses with 6, 7, 8 and 9 base curvature. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Hydrophilic Megol(TM) temple and nose pads become tackier when wet for reliable grip during exercise and hot weather. Frames have a small-medium fit with medium coverage. Includes protective case.","short_description":"Providing an unobstructured field of vision for your high speed activities, the rimless Smith PivLock V90 sunglasses feature new interchangeable lenses.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s441715.png","image_url":"http://i1.avlws.com/115/l441715.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441715&tt=df","keywords":"Cycling","retail_price":"139.00","sale_price":"139.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441715\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441715.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=799219&amp;link=&amp;tabs=-Details\"></script>","variants":{"7992190012":{"sku":"7992190012","vendor_sku":"VNPCGYMSM","upc":"715757326890","color":"SMOKE CRYSTAL/PLATINUM","retail_price":"139.00","sale_price":"139.00"}}}
