{"sku":"799267","manufacturer_id":"CCP075-CIN","brand_name":"Jetboil","product_name":"Jetboil Flash Companion Cup","long_description":"This companion cup for the Jetboil Flash cooking system lets you shave weight by sharing your burner base and fuel with friends. Companion cup snaps easily onto the Jetboil Flash cooking system base. Jetboil Flash companion cup features an innovative thermochromic temperature indicator integrated into the 3 stripes on the colorful neoprene cozy. When the indicator starts to turn orange you know your water is getting warm and will be boiling before long. Translucent measuring cup with easy-to-read lines unsnaps from the bottom of the cup, providing a convenient tool for preparing meals and hot drinks. Translucent drink-though lid that lets you check on the contents of the cup so you'll know precisely when your water begins to boil; lid is BPA free. Neoprene cozy on the cooking cup stays in place during cooking without melting, thereby increasing heat retention and efficiency. Sewn-on tunnel pocket on the cozy holds your utensils or Jetboil hanging kit (sold separately). FluxRing(R) heat exchanger on the bottom of the cooking cup creates excellent fuel efficiency. Jetboil Flash companion cup is compatible with Jetboil Flash cooking system, Jetboil Personal cooking system and Jetboil Group cooking system burners.","short_description":"This companion cup for the Jetboil Flash cooking system lets you shave weight by sharing your burner base and fuel with friends.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414575.png","image_url":"http://i1.avlws.com/115/l414575.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414575&tt=df","retail_price":"54.95","sale_price":"54.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414575\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414575.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=799267&amp;link=&amp;tabs=-Details\"></script>","variants":{"7992670013":{"sku":"7992670013","vendor_sku":"CCP075-CIN","upc":"893483000564","color":"CARBON","retail_price":"54.95","sale_price":"54.95"}},"categories":["camping-hiking","camp-kitchen","cookware-and-dinnerware"]}
