{"sku":"799494","manufacturer_id":"LVUBATMO4","brand_name":"Kokatat","product_name":" Kokatat Bahia Tour PFD","long_description":"Offering extra comfort in boats with tall seat backrests, the Kokatat Bahia Tour PFD minimizes bulkiness and maximizes airflow. Gaia(TM) PVC-free foam is soft, flexible and won't break down in a wet environment. A great PFD for recreational kayakers, the variable thickness foam back with mesh panel eliminates discomfort and ride-up from tall seat backs. Durable 210-denier nylon oxford shell offers lasting comfort and performance. Adjustable shoulders with neoprene padding and a durable, nonslip surface sit comfortably across your shoulders. Side and lower back panels dial in a secure fit using 2 strap adjustments per side and a buckle waist closure. Large armholes and mesh panels allow unrestricted movement and airflow. Front-mounted, 4-way lash tab and 2 stretch-mesh zippered pockets stow accessories for easy, quick access. Bahia Tour also offers a water-resistant pocket for electronics, a fishing license window and a separate sleeve designed for pliers. Reflective tape on the front and rear of the jacket improves visibility in low light.","short_description":"Offering extra comfort in boats with tall seat backrests, the Kokatat Bahia Tour PFD minimizes bulkiness and maximizes airflow.","category":"Paddling","subcategory":"Pfds","product_group":"Men's Pfds","thumb_url":"http://i1.avlws.com/115/s431915.png","image_url":"http://i1.avlws.com/115/l431915.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431915&tt=df","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431915\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431915.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=799494&amp;link=&amp;tabs=-Details\"></script>","variants":{"7994940034":{"sku":"7994940034","vendor_sku":"LVUBATMO6","upc":"606891021508","size":"Xxl","color":"MULTI","retail_price":"129.00","sale_price":"129.00"}},"categories":["paddling","pfds","mens-pfds"]}
