{"sku":"799604","manufacturer_id":"M90","brand_name":"Hennessy Hammock","product_name":"Hennessy Hammock Scout Classic Hammock","long_description":"The Hennessy Hammock Scout Classic has a diamond shape and a large, protective rainfly, just like the original Hennessey Hammock. The Scout is a simply a bit shorter in length than the original. This general-purpose model is an excellent and economical choice for young adventurers, Scouts and short individuals. Hennessey Hammock Scout provides comfort for those up to 5 ft. 10 in. and 150 lbs., with more room for shoulders at one end. Patented, easy entry through the bottom; automatically snaps shut behind you as weight tensions the entrance and seals with VELCRO(R) brand closure. Patented integral ridgeline maintains the same comfortable shape to keep your back straight and level when resting on the diagonal. Patented \"never-tip\" center balance design eliminates instability by entering from the center instead of flipping over the side. No-see-um mesh provides excellent insect protection and ventilation and will deflect wind, providing a calm space inside. Coated ripstop polyester rainfly protects the Scout from the elements; slightly asymmetric in shape, it may be tilted to any angle, rolled up above, removed or used separately. Nifty gear pocket slides on the ridgeline and stores out of sight behind your head. Complementary polyester webbing straps protect the tender bark of trees and provide greater span for the ropes. Hammock folds into an open air lounger/chair or can be used on the ground as a tent when paired with your hiking poles, sold separately. Includes detachable rainfly, support ropes and stuff sack with printed setup instructions.","short_description":"The Hennessy Hammock Scout Classic has a diamond shape and a large, protective rainfly, just like the original Hennessey Hammock. The Scout is a simply a bit shorter in length than the original.","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Hammocks","thumb_url":"http://i1.avlws.com/115/s414027.png","image_url":"http://i1.avlws.com/115/l414027.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414027&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414027\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414027.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=799604&amp;link=&amp;tabs=-Details\"></script>","variants":{"7996040015":{"sku":"7996040015","vendor_sku":"M90","upc":"832667574415","size":"200#","color":"FOREST GREEN","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","camp-furniture","hammocks"]}
