{"sku":"799922","manufacturer_id":"4802","brand_name":"Thule","product_name":"Thule Traverse Half Foot Pack - Set of 2","long_description":"The revolutionary new Thule Traverse Half Pack for gutterless roofs is used when 2 different style feet are necessary for equipping certain vehicles with mulitbar or long-load rack applications. New Thule patented MaxClamp Technology delivers a stable system and one of the most secure attachments available; offers 12% more force than comparable equipment. Integrated AccuTight Tensioning Tool automatically indicates when rack is safely and properly attached; AccuTight tools can be stored within the towers when not in use. OneTouch Bar Lock separates the foot positioning from the bar mounting/locking; set it once and you're done. Exclusive design features fewer parts than comparable equipment and requires half the time to install. Lockable outer cover hides and protects the foot internal mechanism and also blends well with roofline. Designed exclusively for use with Thule Square Load Bars, sold separately. Thule One-Key(TM)-compatible system lets you purchase lock cores that match the Thule keys you already own.","short_description":"The revolutionary new Thule Traverse Half Pack for gutterless roofs is used when 2 different style feet are necessary for equipping certain vehicles with mulitbar or long-load rack applications.","category":"Car Racks","subcategory":"Base Roof Racks","product_group":"Car Rack Towers","thumb_url":"http://i1.avlws.com/115/s407939.png","image_url":"http://i1.avlws.com/115/l407939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407939&tt=df","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=799922&amp;link=&amp;tabs=-Details\"></script>","variants":{"7999220010":{"sku":"7999220010","vendor_sku":"4802","upc":"091021410220","size":"SET OF 2","retail_price":"109.95","sale_price":"109.95"}},"categories":["car-racks","base-roof-racks","car-rack-towers"]}
