{"sku":"799921","manufacturer_id":"480R","brand_name":"Thule","product_name":" Thule Rapid Traverse Foot Pack - Set of 4","long_description":"Revolutionary new Rapid Traverse Foot pack from Thule provides the strongest hold yet! This safe and easy car rack installation for gutterless roofs provides peace of mind. Designed exclusively for use with the Rapid Aero aluminum load bars, sold separately. New Thule patented MaxClamp Technology delivers a stable system and one of the most secure attachments available; offers a 12% greater force than competitors. Integrated AccuTight Tensioning Tool automatically indicates when rack is safely and properly attached; AccuTight tools can be stored within the towers when not in use. OneTouch Bar Lock separates the foot positioning from the bar mounting/locking; set it once and you're done. Exclusive design features fewer parts than competitors and requires half the time to install. Lockable outer cover hides and protects the foot internal mechanism and also blends well with roofline. Thule One-Key(TM)-compatible system lets you purchase lock cores that match keys you already own.","short_description":"Revolutionary new Rapid Traverse Foot pack from Thule provides the strongest hold yet! This safe and easy car rack installation for gutterless roofs provides peace of mind.","category":"Car Racks","subcategory":"Base Roof Racks","product_group":"Car Rack Towers","thumb_url":"http://i1.avlws.com/115/s407935.png","image_url":"http://i1.avlws.com/115/l407935.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407935&tt=df","retail_price":"194.95","sale_price":"194.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407935\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407935.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=799921&amp;link=&amp;tabs=-Details\"></script>","variants":{"7999210011":{"sku":"7999210011","vendor_sku":"480R","upc":"091021410770","size":"SET OF 4","retail_price":"194.95","sale_price":"194.95"}}}
