{"sku":"800320","manufacturer_id":"PLPPGYBK","brand_name":"Smith","product_name":" Smith Parallel Polarized Sunglasses - Men's","long_description":"Sleek and subtle, these Smith Parallel polarized interchangeable sunglasses allow unobstructed peripheral vision-ideal for trail running, cycling or a day on the boat. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Each frame includes 1 set of polarized lenses (tint depends on frame color) and 2 additional sets of lenses for a total of 3 sets of lenses. Brown frames feature polarized brown lenses that block reflected glare while providing increased depth perception and reducing eye strain. Black frames feature polarized gray lenses that block reflected glare while preserving natural colors in order to provide true color definition. Non-polarized, additional (red and clear) lenses are ideal for low and medium to nighttime light. Scratch- and impact-resistant Carbonic(TM) lenses use Tapered Lens Technology from Smith(TM) to provide distortion-free vision. Tapered Lens Technology contours the thickness of the lens so that light travels through without distortion-what you see is what you get. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Hydrophilic Megol(TM) nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. 9-base-curve lenses; (the higher the number the more curved the lens-Smith features sunglasses with 6, 7, 8 and 9 base curvature). Frames have a medium fit with medium coverage.","short_description":"Sleek and subtle, these Smith Parallel polarized interchangeable sunglasses allow unobstructed peripheral vision-ideal for trail running, cycling or a day on the boat.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422847.png","image_url":"http://i1.avlws.com/115/l422847.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422847&tt=df","keywords":"Cycling","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422847\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422847.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=800320&amp;link=&amp;tabs=-Details\"></script>","variants":{"8003200014":{"sku":"8003200014","vendor_sku":"PLPPGYBK","upc":"715757315528","color":"BLACK/GRAY","retail_price":"129.00","sale_price":"129.00"},"8003200022":{"sku":"8003200022","vendor_sku":"PLPPBRBR","upc":"715757315535","color":"BROWN/BROWN","retail_price":"129.00","sale_price":"129.00"}}}
