{"sku":"800317","manufacturer_id":"H202-10","brand_name":"Maui Jim","product_name":" Maui Jim Peahi Polarized Sunglasses - Burgundy - Men's","long_description":"Like the bay they were named for, the Maui Jim Peahi sunglasses boost colors in a big way, providing shade your eyes from the sun's harmful rays and reducing glare from water, sand and snow. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Maui Jim PolarizedPlus2(R)2 technology blocks glare and UV rays from all angles while managing harmful blue light and boosting colors for clarity and contrast. Frames are constructed from cellulose propionate (thermoplastic), which is lightweight and hypoallergenic. Lightweight nylon frames offer a consistent fit and flexibility at any temperature, and they are extremely impact resistant. Frame shape is ideal for oval, round, square, pear, and diamond face shapes. Lenses and frames feature a special effectiveness treatment for use in saltwater. Anti-corrosive nickel/silver alloy hinges enhance durability. Built-in silicone nose pads prevent slippage. Includes a protective case and cleaning cloth. Burgundy tortoise frames feature bronze lenses that offer excellent contrast and optimize visibility in low light; they provide subtle bronze hue for everyday wear.","short_description":"Like the bay they were named for, the Maui Jim Peahi sunglasses boost colors in a big way, providing shade your eyes from the sun's harmful rays and reducing glare from water, sand and snow.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422835.png","image_url":"http://i1.avlws.com/115/l422835.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422835&tt=df","keywords":"Cycling","retail_price":"219.00","sale_price":"219.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422835\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422835.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=800317&amp;link=&amp;tabs=-Details\"></script>","variants":{"8003170019":{"sku":"8003170019","vendor_sku":"H202-10","upc":"603429012601","color":"BURGUNDY TORT/BRONZE","retail_price":"219.00","sale_price":"219.00"}}}
