{"sku":"800332","manufacturer_id":"120 302 519","brand_name":"Native Eyewear","product_name":"Native Eyewear Hardtop XP Reflex Polarized Sunglasses - Men's","long_description":"Featuring excellent coverage and a reflective finish, the Native polarized Hardtop XP Reflex sunglasses are perfect for sun-filled adventures. A unique interchangeable lens system lets you switch lenses without having to put your fingers all over them. Each frame includes 1 set of polarized lenses (tint depends on frame color) and 1 set of SportFlex(TM) lenses, for a total of 2 sets of lenses. Gunmetal frames feature polarized Silver (gray tint) Reflex lenses that work well in extremely bright sunlight; Reflex- lenses provide increased glare reduction. Additional SportFlex orange-yellow lenses have a blue mirror coating suitable for cloudy or overcast days, and dusk and dawn. Polarized Crystal Carbonate(R) lenses have the strongest hard coating available to protect against scratching. P.C.C.(R) lenses pass the rigorous ANSI Z80.3 tests for optical clarity and impact resistance while blocking 100% of harmful UVA and UVB light. Extremely lightweight and flexible Rhyno-Tuff(R) AIR frames are engineered to endure extreme temperatures. Anti-Ocular Intrusion System(R), a 4-point configuration, helps prevent lenses from shooting into your face in the event of high-velocity impact. Cam-action spring hinges allow the temples to quickly lock into position. Self-adjusting Cushinol(TM) nosepads and ear stems create a nonslip grip that keeps sunglasses in place, ensuring a soft feel and personalized fit. Venting system incorporated into the frames enhances airflow and virtually eliminates fog and condensation. Also included is an Optic Gear Kit that features a semi-rigid zippered case and a soft pouch that doubles as a cleaning cloth. Xtra Protection lenses are approximately 20% larger than orginal Native Hardtop lenses and provide increased coverage and protection. Best fits a large to extra-large profile.","short_description":"Featuring excellent coverage and a reflective finish, the Native polarized Hardtop XP Reflex sunglasses are perfect for sun-filled adventures.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422859.png","image_url":"http://i1.avlws.com/115/l422859.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422859&tt=df","keywords":"Cycling","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422859\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422859.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=800332&amp;link=&amp;tabs=-Details\"></script>","variants":{"8003320001":{"sku":"8003320001","vendor_sku":"120 302 519","upc":"480033200019","color":"BLUE REFLEX","retail_price":"149.00","sale_price":"149.00"},"8003320028":{"sku":"8003320028","vendor_sku":"120 347 521","upc":"764824003509","color":"GUNMETAL/SILVER REFLEX","retail_price":"149.00","sale_price":"149.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
