{"sku":"800978","manufacturer_id":"50071NB","brand_name":"New Balance","product_name":"New Balance N4 Heart Rate Monitor - Women's","long_description":"The full-featured New Balance N4 heart rate monitor has a sleek silhouette that won't get in your way while working out. Watch works in conjunction with the included chest strap to provide continuous heart rate monitoring during your training runs. Heart rate monitor mode measures total time, percent of maximum heart rate, calories burned, time in zone, maximum heart rate, lowest heart rate and time of day. Features 3 preprogrammed intensity levels based on your maximum heart rate; you can also create custom heart rate zones. Preprogrammed fitness zone (55 - 70% of maximum heart rate) is ideal for people on a low- to moderate-intensity program. Preprogrammed endurance zone (70% - 80% of maximum heart rate) helps burn calories and strengthen the cardiovascular system. Preprogrammed training zone (80% - 100% of maximum heart rate) is intended for fitness enthusiasts engaging in intense aerobic activity. Visual and audible alerts help you keep track of your heart rate in relation to the selected heart rate zone. 24-hr. chronograph lets you time your workouts. Watch stores data from 9 previous runs; data recall shows date, total time, time in zone, calories burned, percentage fat burned, maximum beats per min. (BPM) and average BPM. View your workout information in low light via the electroluminescent backlight. Standard watch functions include time, day, date, 12- or 24-hour time, and daily alarm. Watch can be set to show units of measure in metric or English.","short_description":"The full-featured New Balance N4 heart rate monitor has a sleek silhouette that won't get in your way while working out.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427063.png","image_url":"http://i1.avlws.com/115/l427063.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427063&tt=df","keywords":"watch","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427063\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427063.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=800978&amp;link=&amp;tabs=-Details\"></script>","variants":{"8009780027":{"sku":"8009780027","vendor_sku":"50071NB","upc":"096506500717","color":"PEARL","retail_price":"69.95","sale_price":"69.95"}},"categories":["fitness","running","fitness-electronics"]}
