{"sku":"800906","manufacturer_id":"9604","brand_name":"Rei","product_name":"REI Backpacker Plus Multiday First-Aid Kit","long_description":"The REI Backpacker Plus Multiday first-aid kit is designed to meet the needs of 4 people for 5 days while traveling in the backcountry. All contents are packed together in a zippered nylon case; clear vinyl compartments let you easily identify the items you need. Comes with \"The Wilderness First Aid Manual\" by Dr. William Forgey for quick reference while on the trail; also includes an accident/evacuation record. Treat wounds with five 3 x 0.75 in. adhesive bandages, five 3 x 1 in. adhesive bandages, 4 knuckle adhesive bandages, 4 fingertip bandages and 4 butterfly closures. Also includes four 2 x 2 in. gauze pads, three 3 x 3 in. gauze pads, a 3 x 2 in. non-adherent pad, a 4 x 3 in. non-adherent pad and four 4 x 4 in. sterile top sponges. Two 4 x 3 in. pieces of moleskin, a 9 x 5 in. abdominal/pressure pad, a 4.1 yd. x 2 in. stretch gauze roll, a 10 yd. x 1 in. roll of tape and a 2 in. elastic bandage. Prep and care for wounds with 3 antibacterial wipes, 4 triple-antibiotic ointment packets, 3 sting relief wipes, 3 povidone-iodine wipes and 1 antimicrobial hand wipe. Medications include 4 Nutralox(R) mint antacid tablets, 4 Proprinal(R) ibuprofen 200mg tablets and 4 Cetafen(R) acetaminophen 325mg tablets. Also includes 2 Histaprin(R) diphenhydramine 25mg tablet and 1 pill vial and label. Equipment includes 3 safety pins, a pair of latex-free medical gloves, bandage scissors, splinter forceps and a 10 x 8 in. resealable waste bag. Assembled in the USA with domestic and imported parts.","short_description":"The REI Backpacker Plus Multiday first-aid kit is designed to meet the needs of 4 people for 5 days while traveling in the backcountry.","category":"Camping & Hiking","subcategory":"First Aid","product_group":"First-Aid Kits","thumb_url":"http://i1.avlws.com/115/s129631.png","image_url":"http://i1.avlws.com/115/l129631.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=129631&tt=df","keywords":"wellfare,medical,emergency,kit,safety","retail_price":"33.50","sale_price":"33.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=129631\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m129631.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=800906&amp;link=&amp;tabs=-Details\"></script>","variants":{"8009060016":{"sku":"8009060016","vendor_sku":"9604","upc":"480090600166","color":"RED/BLACK","retail_price":"33.50","sale_price":"33.50"}}}
