{"sku":"800973","manufacturer_id":"AE1017-O","brand_name":"Advanced Elements","product_name":" Advanced Elements AdvancedFrame Sport Kayak","long_description":"Perfectly sized for spontaneous adventures, the Advanced Elements AdvancedFrame(R) Sport kayak is easy to set up, highly maneuverable and really fun to paddle. Sets up quickly and is compact enough to take along for an adventure just about anywhere; no assembly needed-just unfold, inflate, attach the seat and hit the water! Triple-layer polyester material with PVC coating offers superb puncture resistance; welded seams ensure long life. Air chambers supply superb buoyancy and exclusive kayak shape while adding stability. Rigid bow and stern with aluminum frame reinforcement slices gracefully through water, rivaling the tracking of a hard-shell kayaks. Underside tracking fin further enhances handling. Removable seat with adjustable back support improves comfort on the water for all-day use; neoprene paddle guards at sides protect knuckles. Easy-to-use Spring valves and Twistlok(TM) valves are compatible with most pumps and speed setup time. Bungee deck lacing and D-ring tie-downs stow gear, and storage areas below the deck offer enough space for day-paddle essentials. Molded, low-profile rubber handles ease transport to and from the water. Comes with a repair kit and a heavy-duty duffel bag. Do not under inflate your boat! Advanced Elements recommends inflate with a 12V electric pump, and then top off with a quality hand pump to get up to the recommended pressure.","short_description":"Perfectly sized for spontaneous adventures, the Advanced Elements AdvancedFrame(R) Sport kayak is easy to set up, highly maneuverable and really fun to paddle.","category":"Paddling","subcategory":"Kayaks","product_group":"Inflatable Kayaks","thumb_url":"http://i1.avlws.com/115/s445287.png","image_url":"http://i1.avlws.com/115/l445287.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445287&tt=df","retail_price":"439.95","sale_price":"439.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445287\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445287.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=800973&amp;link=&amp;tabs=-Details\"></script>","variants":{"8009730014":{"sku":"8009730014","vendor_sku":"AE1017-O","upc":"832994000670","color":"ORANGE/BLUE","retail_price":"439.95","sale_price":"439.95"}}}
