{"sku":"801098","manufacturer_id":"DELTA 10","brand_name":"Delta Kayaks","product_name":" Delta Kayaks Delta 10 Kayak","long_description":"The Delta 10 kayak from Delta Kayaks uses a catamaran-style hull to achieve remarkable stability and excellent tracking. Thermoformed ABS plastic hull material is stiff and light like traditional composite kayaks and offers similar looks, but costs considerably less. Specially coated exterior offers a new, shiny appearance for years to come- the Delta 10 does not suffer from the gradual fade typical of composite watercraft. Catamaran-style hull enhances stability without adding the width typical of standard recreational kayaks. Molded cockpit area with adjustable foot pegs personalizes comfort to fit most any size paddler; soft, padded seat keeps things comfortable during long days on the water. Clear window in the cockpit floor lets you view the environment below the surface. Rear compartment offers roomy dry storage for day-tripping gear. Seat forms a watertight bulkhead with the rear compartment and offers excellent flotation when hatch is in place. Front storage pod under deck provides dry shelter for small items and adds extra flotation when sealed; pod faces you when in the cockpit and seals with a watertight screw. Cup holder near the cockpit offers easy access to beverages. Bungee rigging offers plenty of room for take-along gear. Small depressions behind cockpit are designed to lash down and hold your paddle. Carry handles at the bow and stern are molded into the boat itself and make carrying the boat a breeze. The Delta 10 features 2 tie down points at bow and stern that offer a secure place to attach a bow line.","short_description":"The Delta 10 kayak from Delta Kayaks uses a catamaran-style hull to achieve remarkable stability and excellent tracking.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s430547.png","image_url":"http://i1.avlws.com/115/l430547.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430547&tt=df","retail_price":"995.00","sale_price":"717.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430547\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430547.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=801098&amp;link=&amp;tabs=-Details\"></script>","variants":{"8010980020":{"sku":"8010980020","vendor_sku":"DELTA 10","upc":"480109800204","color":"RED","retail_price":"717.93","sale_price":"717.93"}},"categories":["paddling","kayaks","recreational-kayaks"]}
