{"sku":"801106","manufacturer_id":"CW0040101","brand_name":"Finish Line","product_name":" Finish Line Ceramic WAX Lubricant - 4 fl. oz.","long_description":"Finish Line Ceramic WAX is an advanced wax-based lubricant featuring nano-sized platelets of ceramic boron nitride and micron particles of fluoropolymer. Ceramic WAX ensures total drivetrain cleanliness without the \"distance\" compromise that other wax lubricants require. It creates a coating with an extremely low coefficient of friction. Every time Ceramic WAX is applied, the ceramic coating is enhanced, ultimately providing the durability of many oil-based lubricants. There is no wetness or stickiness on your chain or parts, so dirt and grime are not attracted or absorbed by the lubricant. By avoiding abrasive wear, parts run smoothly and last longer; plus, it won't build up over time. Ceramic WAX is extremely smooth, quiet and durable; it's perfect for dry climates and dirty conditions. Features an inherently biodegradable formulation; 20 - 60% of the product's base oils will degrade within 28 days. It's non-toxic when use in quantities and applications as intended. Ceramic WAX contains no carcinogenic or Hazardous Air Polluting (HAP) ingredients. Contains no artificial dyes or fragrances and is packaged in recyclable HDPE #2 plastic squeeze bottles. Ceramic WAX is flammable and contains Volatile Organic Compounds (VOCs); use with caution and in a well ventilated area.","short_description":"Finish Line Ceramic WAX is an advanced wax-based lubricant featuring nano-sized platelets of ceramic boron nitride and micron particles of fluoropolymer.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Tools And Maintenance","thumb_url":"http://i1.avlws.com/115/s379427.png","image_url":"http://i1.avlws.com/115/l379427.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379427&tt=df","retail_price":"9.50","sale_price":"9.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379427\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379427.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=801106&amp;link=&amp;tabs=-Details\"></script>","variants":{"8011060012":{"sku":"8011060012","vendor_sku":"CW0040101","upc":"036121006058","size":"4 OZ","retail_price":"9.50","sale_price":"9.50"}}}
