{"sku":"801839","manufacturer_id":"12610","brand_name":"Rei","product_name":"REI Expedition -20 Sleeping Bag","long_description":"Stay at low camp or high camp in the REI Expedition -20degF sleeping bag featuring goose down insulation, a water-resistant/breathable shell and a double zipper system for temperature fluctuations. Unique double zipper system allows you to adjust comfort as needed-fully close both zippers to increase warmth, open inner zipper to decrease warmth. Goose down is efficiently distributed for maximum warmth and compressibility-800-fill-power goose down on top and 700-fill-power goose down underneath. Exclusive REI Down Fill Calculator optimizes the amount of down per baffle for the most warmth with the least amount of down. Ultralight ripstop nylon shell fabric was specifically designed to dissipate moisture from the inside, as well as repel moisture from the outside, keeping the down dry. In-the-round pattern wraps vertical baffles around perimeter of sleeping bag, from head to foot, creating a 3-dimensional bag that wraps you in warmth. Baffle spacing is optimized to keep down in place and prevent cold spots. Multi-chambered hood and anatomically-contoured, insulated draft collar seal in heat; trapezoidal footbox mirrors sleeping position for room to move and thermal efficiency. A pass-through pocket with zipper access on both outside and inside provides a convenient way to get to your stashed essentials such as eyewear and headlamp. Includes nylon stuff sack and large cotton storage bag.","short_description":"Stay at low camp or high camp in the REI Expedition -20degF sleeping bag featuring goose down insulation, a water-resistant/breathable shell and a double zipper system for temperature fluctuations.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s170743.png","image_url":"http://i1.avlws.com/115/l170743.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=170743&tt=df","keywords":"winter,sleep,cold,sleeping,insulated","retail_price":"499.00","sale_price":"369.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=170743\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m170743.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=801839&amp;link=&amp;tabs=-Details\"></script>","variants":{"8018390016":{"sku":"8018390016","vendor_sku":"12610","upc":"480183900166","size":"Regular","color":"BLACK/STEEL","retail_price":"347.93","sale_price":"347.93"},"8018390032":{"sku":"8018390032","vendor_sku":"12610","upc":"480184000131","size":"Long","color":"BLACK/STEEL","retail_price":"369.93","sale_price":"369.93"}}}
