{"sku":"803309","manufacturer_id":"134870-348-2-M/","brand_name":"Osprey","product_name":"Osprey Farpoint 70 Travel Pack","long_description":"For those trekking the world 'round, the Osprey Farpoint 70 travel pack offers long-haul comfort in a streamlined, convenient design for adventures to the far points of the globe. Main bag offers a panel-loading opening with lockable zippers, interior pocket and internal compression straps to cinch down contents. Also features removable sleeping pad straps, gear attachment points and top and side haul handles to offer additional carrying options. Adjustable suspension system can be stored in its own panel for streamlined transport as luggage. Spacer mesh back panel with LightWire frame promotes airflow and moisture dispersal during warm weather and heavy lugging. ErgoPull hipbelt closure enhances leverage in cinching, drawing tension along top and bottom, not through the center, to relieve hipbone pressure. Detachable daypack includes multiple internal and external pockets, tuckaway harness and an internal sleeve for hydration reservoir or a computer. External compression straps on the Farpoint 70 travel pack help secure daypack and let you cinch down loads for jostle-free carrying.","short_description":"For those trekking the world 'round, the Osprey Farpoint 70 travel pack offers long-haul comfort in a streamlined, convenient design for adventures to the far points of the globe.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s433683.png","image_url":"http://i1.avlws.com/115/l433683.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433683&tt=df","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433683\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433683.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=803309&amp;link=&amp;tabs=-Details\"></script>","variants":{"8033090002":{"sku":"8033090002","vendor_sku":"134870-348-2-M/","upc":"877257014087","size":"M/L","color":"MUD RED","retail_price":"199.95","sale_price":"199.95"}},"categories":["travel","luggage","travel-packs"]}
