{"sku":"803970","manufacturer_id":"BE0BENIDAT","brand_name":"Benchmark Maps","product_name":" Benchmark Maps Road and Recreation Atlas - Idaho","long_description":"Updated with all-new maps, the Benchmark Maps Idaho Road and Recreation atlas provides an accurate, authoritative reference for your next adventure in the Gem State. Award-winning design includes generous page-to-page overlaps, GPS grids and easy-to-read symbols. Includes the renowned Landscape Maps(TM) in 1:225,000 scale, showcasing beautiful shaded relief of land topography. Maps clearly show recreation information and road classes, from freeways to jeep trails, for entire state at a scale of 1 in. = 4 mi. Recreation Guide includes parks, monuments, historic sites, campgrounds, RV parks and boat launches. Climate data helps you plan the best time to visit. Comprehensive index helps you quickly locate attractions and destinations. Maps are field-checked for accuracy and also include regional maps with mileages and mileage chart. Includes rest areas, exit numbers, point-to-point roadway mileages, road surface type, cities and elevations. Softcover; 96 pages, measures 15 x 11 in.; color maps. Published by Benchmark Maps; copyright 2010 (2nd edition).","short_description":"Updated with all-new maps, the Benchmark Maps Idaho Road and Recreation atlas provides an accurate, authoritative reference for your next adventure in the Gem State.","category":"Books And Maps","subcategory":"Maps","product_group":"Paper Maps","thumb_url":"http://i1.avlws.com/115/s410207.png","image_url":"http://i1.avlws.com/115/l410207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410207&tt=df","retail_price":"22.95","sale_price":"22.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=803970&amp;link=&amp;tabs=-Details\"></script>","variants":{"8039700011":{"sku":"8039700011","vendor_sku":"BE0BENIDAT","upc":"767020000204","retail_price":"22.95","sale_price":"22.95"}}}
