{"sku":"804290","manufacturer_id":"AJWRJK3","brand_name":"The North Face","product_name":"The North Face Overhaul 40 Daypack","long_description":"The North Face Overhaul 40 daypack is a heavy-duty hauler for those on the go through airports, across trails and into urban canyons. Main compartment features an organizer panel for pens, PDAs and cards; a large mesh pocket stashes electronic accessories; a universal sleeve stores documents. Separate, dedicated laptop compartment has a water-resistant zipper and accommodates laptops with 17 in. screens. Secondary compartment is perfect for clothing and other travel and work essentials; compartment features a large expansion panel and internal organization. Zippered, externally accessed \"laundry\" compartment stows dirty gear separately from the clean goods. Front zippered pocket and dual stretch water bottle pockets allow quick access to gear and hydration. Padded air-mesh shoulder straps with sternum strap and padded back panel combine with a winged, padded waistbelt to comfortably distribute the load. Suspension system can be easily tucked away behind back panel for simplified transport on airlines. Padded top and side carry handles supply additional carry options. External slide-through sleeve goes over the handle of your wheeled luggage for convenient transportation through the terminal. The North Face Overhaul 40 daypack is constructed of abrasion-, moisture- and tear-resistant nylon for exceptional durability.","short_description":"The North Face Overhaul 40 daypack is a heavy-duty hauler for those on the go through airports, across trails and into urban canyons.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s284323.png","image_url":"http://i1.avlws.com/115/l284323.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=284323&tt=df","keywords":"carry on,travel,daypack,small,commute","retail_price":"159.00","sale_price":"159.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=284323\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m284323.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=804290&amp;link=&amp;tabs=-Details\"></script>","variants":{"8042900001":{"sku":"8042900001","vendor_sku":"AJWRJK3","upc":"648335994283","color":"TNF BLACK","retail_price":"159.00","sale_price":"159.00"}}}
