{"sku":"804366","brand_name":"Patagonia","product_name":"Patagonia Hog Tie Shoes - Men's","long_description":"Kick it in the Patagonia Hog Tie shoes, which offer casual comfort, sturdy construction and lasting style for everyday adventures. Soft and supple, full-grain and pigskin leather uppers are sourced from tanneries that strive to minimize harmful effects on the environment caused by their activities. Polyester mesh linings are blended with 25% charcoal-infused bamboo fibers to provide excellent moisture wicking performance and help control odors. Footbeds are made of 70% recycled open-cell foam and mixed with carbon and cork to help combat odor and provide natural moisture management. EVA midsoles absorb shock, cushion feet and provide gentle support while cushioning units in the heels reduce impact forces from heel strikes. Injection-molded nylon arch shanks deliver stability and support underfoot. Low-profile Vibram(R) rubber outsoles provide lightweight performance without compromising on grip or stability. Outsoles are stitched onto uppers, minimizing the need for solvents and adhesives.","short_description":"Kick it in the Patagonia Hog Tie shoes, which offer casual comfort, sturdy construction and lasting style for everyday adventures.","category":"Footwear","subcategory":"Men's Casual Footwear","product_group":"Men's Casual Shoes","thumb_url":"http://i1.avlws.com/115/s143127.png","image_url":"http://i1.avlws.com/115/l143127.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=143127&tt=df","keywords":"footwear,shoes,mens,casual,men","retail_price":"130.00","sale_price":"130.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=143127\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m143127.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=804366&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
