{"sku":"806227","manufacturer_id":"I300","brand_name":"Cycleops","product_name":"CycleOps 300 Pro Indoor Cycle","long_description":"The CycleOps 300 Pro Indoor Cycle gives you the formidable combination of performance reporting, power feedback and fit delivered on an indoor setup. You'll never miss a workout again! PowerTap Technology provides the most precise power measurement available, taking the guesswork out of your workouts; +/-1.5% accurate power feedback. Joule(TM) 2.0 data manager manages performance data with dashboard functions, ride reports, history and workouts right at your fingertips. Wirelessly measure and record your power output while you are riding; data travels from the flywheel to Joule 2.0 with no sensors or wires to get in the way of your workout. Joule 2.0 display shows power in current watts, average watts, maximum watts, watts per kg, average watts without zeroes and kilojoules. Also shows training zones for current power, current heart rate and current RPE (rate of perceived exertion), and peak power readings at 5 sec., 5 min. and 20 min. peak power. Plus, training scores, cadence, heart rate, heart rate percentage of maximum or threshold, speed and ride time. Through the PowerAgent software, you can track and adapt your training goals as they relate to peak power, heart rate or weight loss. Data transfers easily to your Mac or PC through a simple USB connection; in fact, you may get so much out of your Pro 300 workouts that you'll make excuses to ride inside! 4 points of micro adjustment duplicate the fit of your outdoor bike; you can customize your ride by changing out the seat, the pedals and/or road-style handlebar. Precise resistance control lets you dial up the difficulty level for whatever intensity you can dish out. Freewheeling hub lets you stop pedaling and coast whenever your pace dictates needed recovery between efforts. Heavy-duty 48 lb. flywheel provides fluid starts/stops and precise, incremental resistance adjustment. Stable platform for sprinting workouts or hill climbs.","short_description":"The CycleOps 300 Pro Indoor Cycle gives you the formidable combination of performance reporting, power feedback and fit delivered on an indoor setup. You'll never miss a workout again!","category":"Cycling","subcategory":"Bikes","product_group":"Stationary Bikes","thumb_url":"http://i1.avlws.com/115/s378723.png","image_url":"http://i1.avlws.com/115/l378723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378723&tt=df","retail_price":"2160.00","sale_price":"2160.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806227&amp;link=&amp;tabs=-Details\"></script>","variants":{"8062270015":{"sku":"8062270015","vendor_sku":"I300","upc":"012527005598","retail_price":"2160.00","sale_price":"2160.00"}},"categories":["cycling","bikes","stationary-bikes"]}
