{"sku":"806225","manufacturer_id":"I100","brand_name":"Cycleops","product_name":"CycleOps 100 Pro Indoor Cycle","long_description":"The 100 Pro is the most affordable indoor cycle offered by CycleOps. It's built on the Pro Series frame, features freewheel gearing and allows quick geometry adjustments that create the perfect fit. Pro 100 is a gym-quality indoor cycle that can be easily adjusted to comfortably fit everyone in your household; includes the ability to change saddles and pedals easily. 4 points of micro adjustment duplicate the fit of your outdoor bike; you can customize your ride by changing out the seat, the pedals and/or road-style handlebar. Precise resistance control lets you dial up the difficulty level for whatever intensity you can dish out. Freewheeling hub lets you stop pedaling and coast whenever your pace dictates needed recovery between efforts. Stable platform for sprinting workouts or hill climbs. Dual-capacity water bottle holder keeps you hydrated for the long haul. Heavy-duty 48 lb. flywheel provides fluid starts/stops and precise, incremental resistance adjustment. Pro 100 includes CycleOps saddle, which can be easily swapped out for a personalized ride; pedals not included.","short_description":"The 100 Pro is the most affordable indoor cycle offered by CycleOps. It's built on the Pro Series frame, features freewheel gearing and allows quick geometry adjustments that create the perfect fit.","category":"Cycling","subcategory":"Bikes","product_group":"Stationary Bikes","thumb_url":"http://i1.avlws.com/115/s442595.png","image_url":"http://i1.avlws.com/115/l442595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442595&tt=df","retail_price":"1170.00","sale_price":"1170.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806225&amp;link=&amp;tabs=-Details\"></script>","variants":{"8062250017":{"sku":"8062250017","vendor_sku":"I100","upc":"012527005581","retail_price":"1170.00","sale_price":"1170.00"}},"categories":["cycling","bikes","stationary-bikes"]}
