{"sku":"806314","manufacturer_id":"120112","brand_name":"Black Diamond","product_name":"Black Diamond Quadrant Randonee Boots - Men's - 2010/2011","long_description":"The powerful Black Diamond Quadrant randonee boots bring the skiing performance of a freeride boot together with the light weight of a touring boot so you can drive big skis down steep slopes. Triple-injected, multidensity shells use Pebax plastic for a progressive flex; 120 flex index is hearty enough to drive big skis down steep lines. Stiff, lightweight custom thermal-formable liners allow for a long-lasting fit and feature a smooth antimicrobial lining for easy on and off. Boa Lacing System provides a precise and personalized fit that is simple to adjust with the turn of a dial; Boa holds laces tight and secure. Tech components in front and back give the boot Dynafit and G3 Onyx binding compatibility; Quadrant boots are also compatible with step-in style randonee bindings. Ski/walk switches are hassle free with a simple on/off toggle; ski mode locks you into a forward lean position that can be set from 14deg to 22deg. Walk mode provides a 40deg range of resistance-free motion for comfort while hiking. 4 micro-adjustable buckles and a power strap on each boot close the boots comfortably and securely around the feet and legs. Black Diamond Quadrant boots feature rockered rubber outsoles for good grip on snow and rock.","short_description":"The powerful Black Diamond Quadrant randonee boots bring the skiing performance of a freeride boot together with the light weight of a touring boot so you can drive big skis down steep slopes.","category":"Skiing","subcategory":"Ski Boots","product_group":"Randonee Ski Boots","thumb_url":"http://i1.avlws.com/115/s458191.png","image_url":"http://i1.avlws.com/115/l458191.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458191&tt=df","retail_price":"629.00","sale_price":"399.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458191\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458191.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806314&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","randonee-ski-boots"]}
