{"sku":"806352","manufacturer_id":"12206/501","brand_name":"Scarpa","product_name":"Scarpa T1 Telemark Boots - Men's - 2010/2011","long_description":"The powerful Scarpa T1 telemark boots combine stiff shells, beefy buckles and high-performance Intuition liners to ensure you enjoy maximum control as you steer wide skis down steep lines. Boots feature Pebax Rnew(R) plastic that is made from castor plant oil rather than petroleum as most plastics are. Pebax Rnew performs exceptionally well across a wide range of temperatures, ensuring consistent flex, strength and stability. Torsionally stiff plastic shells combine with 4 buckles and a power strap on each boot to deliver the control needed to drive big skis at high speeds. Custom-thermal-formable Intuition Speed Pro G liners use dual-density foam for great performance, comfort and support. Liners feature flex zones on the tongues for good ankle articulation while making telemark turns. Pull tabs on the tongues and rear top edges of the liners ease entry. Liners can be custom molded to your feet by an REI ski shop professional for the optimal fit. Second buckle from the bottom on each boot has been improved over previous models with thicker cable to lock your feet in place and withstand the stress of backcountry skiing. Powerful forward-lean mechanisms lock you in between 15deg - 22deg; release the forward lean for a comfortable walk mode while hiking or strolling around the lodge. Scarpa T1 telemark boots sport rockerless Vibram Escape soles that provide excellent responsiveness while turning.","short_description":"The powerful Scarpa T1 telemark boots combine stiff shells, beefy buckles and high-performance Intuition liners to ensure you enjoy maximum control as you steer wide skis down steep lines.","category":"Skiing","subcategory":"Ski Boots","product_group":"Telemark Ski Boots","thumb_url":"http://i1.avlws.com/115/s382767.png","image_url":"http://i1.avlws.com/115/l382767.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382767&tt=df","retail_price":"699.00","sale_price":"699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382767\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382767.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806352&amp;link=&amp;tabs=-Details\"></script>","variants":{"8063520087":{"sku":"8063520087","vendor_sku":"12206/501","upc":"666898252060","size":"29.5","color":"BLACK/GRAY","retail_price":"699.00","sale_price":"699.00"}},"categories":["snow","ski-boots","telemark-ski-boots"]}
