{"sku":"806333","manufacturer_id":"48326","brand_name":"Dynafit","product_name":"Dynafit Stoke Randonee Skis - 2010/2011","long_description":"Get stoked for powder snow! The Dynafit Stoke randonee skis invite you to tour the backcountry and take a thrilling ride down untracked slopes on deep days. Ultralight paulownia wood core combines with bamboo and beech stringers to keep the skis light and exceptionally smooth on every turn. Biaxial prepreg fiberglass and carbon layers above and below the core provide good torsional stiffness and lateral reinforcement without weighing the skis down. Early-rise tips create great performance in powder snow; sidewall construction helps you hold an edge on hardpack. Patented titanal Dynafit Ski Insert System eliminates the need to drill your skis for Dynafit bindings (sold separately) and creates excellent ski-to-binding holding strength. Patented SpeedSkinFix attachment system securely attaches Dynafit skins (sold separately) to skis. SpeedSkinFix system does not interfere with the attachment of other brands of skins that feature a tip loop and tail clip. Sintered graphite coating on the bases enhances glide and improves wax retention. Base or topsheet color may vary from online photo. 164cm Dynafit Stoke randonee skis have sidecut dimensions of 128/104/118mm; 173cm sidecut is 129/105/119mm; 182cm sidecut is 130/106/120mm.","short_description":"Get stoked for powder snow! The Dynafit Stoke randonee skis invite you to tour the backcountry and take a thrilling ride down untracked slopes on deep days.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s381759.png","image_url":"http://i1.avlws.com/115/l381759.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381759&tt=df","retail_price":"799.95","sale_price":"481.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381759\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381759.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806333&amp;link=&amp;tabs=-Details\"></script>","variants":{"8063330024":{"sku":"8063330024","vendor_sku":"48326","size":"173 Cm","color":"RED/BROWN","retail_price":"481.83","sale_price":"481.83"}},"categories":["snow","skis","backcountry-skis"]}
