{"sku":"806552","manufacturer_id":"101273","brand_name":"Fritschi Diamir","product_name":" Fritschi Diamir Freeride Pro Randonee Bindings - 2010/2011","long_description":"The Fritschi Diamir Freeride Pro randonee bindings are the perfect match for those wide skis you plan to take out on the next big powder day. Bindings are designed to transfer power directly to wide skis for downhill performance that rivals high-end alpine bindings; wide front and rear plates resist torsional flex. Features moving baseplates that allow you to raise your feet until they are perpendicular to the skis for complete freedom of movement. Quickly transition between touring mode and ski mode by adjusting the rear levers with a ski pole; levers also serve as heel lifts to make climbing hills more comfortable. Use a ski pole to move the levers into 4 different positions that give you 0deg, 3deg, 9deg or 13deg of lift while climbing. Independent toe and heel release provide reliable exits from the bindings when falling; fits DIN-standard alpine or lug-soled randonee boots. Antifriction plates with Teflon strips allow boots with lugged rubber soles to release evenly. DIN setting adjusts from 4 - 12. Fritschi Diamir Freeride Pro randonee bindings come with 120mm-wide ski brakes installed to accommodate today's powder skis. Compatible with the Axion ski crampon (sold separately), which can be fastened to the binding at the start of your tour and then activated or deactived at any time. Mounting pattern requires a ski that is 80mm or wider at the waist.","short_description":"The Fritschi Diamir Freeride Pro randonee bindings are the perfect match for those wide skis you plan to take out on the next big powder day.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Randonee Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381647.png","image_url":"http://i1.avlws.com/115/l381647.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381647&tt=df","retail_price":"569.95","sale_price":"569.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381647\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381647.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806552&amp;link=&amp;tabs=-Details\"></script>","variants":{"8065520001":{"sku":"8065520001","vendor_sku":"101273","size":"M","color":"BLACK/OLIVE","retail_price":"569.95","sale_price":"569.95"},"8065520002":{"sku":"8065520002","vendor_sku":"101273","size":"L","color":"BLACK/OLIVE","retail_price":"569.95","sale_price":"569.95"},"8065520003":{"sku":"8065520003","vendor_sku":"101273","size":"S","color":"BLACK/OLIVE","retail_price":"569.95","sale_price":"569.95"}}}
