{"sku":"806816","manufacturer_id":"010-11551-00","brand_name":"Garmin","product_name":"Garmin City Navigator microSD Data Card - North America NT 2012","long_description":"Slip the Garmin City Navigator microSD data card - North America NT 2012 into compatible Garmin GPS units to avoid download hassles and drive North America like a local. Updated coverage for 2012 includes additional islands in the Carribean: U.S. Virgin Islands, French Guiana, Guadeloupe, Martinique, Saint Barthelemy and Jamaica. Updated points of interest and larger map segments offer easy selection and planning of activities and routes. Preloaded microSD(TM) card with street level detail, addresses and points of interest offers turn-by-turn directions to locations in North America. Features fully routable detailed coverage of the continental U.S., Canada (minus Queen Elizabeth Islands), Puerto Rico, Bahamas and the Cayman Islands. Coverage of major urban areas and intertown roads extends to Hawaii and Mexico. Includes interstates, highways, local roads and residential areas, as well as turn restrictions, speed limits and other navigational aids. Garmin City Navigator microSD data card displays millions of up-to-date points of interest such as restaurants, lodging, border crossings, gas stations, hospitals and more.","short_description":"Slip the Garmin City Navigator microSD data card - North America NT 2012 into compatible Garmin GPS units to avoid download hassles and drive North America like a local.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412511.png","image_url":"http://i1.avlws.com/115/l412511.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412511&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412511\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412511.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806816&amp;link=&amp;tabs=-Details\"></script>","variants":{"8068160012":{"sku":"8068160012","vendor_sku":"010-11551-00","upc":"753759105778","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","camp-electronics","gps"]}
