{"sku":"806938","manufacturer_id":"178","brand_name":"Nikwax","product_name":"Nikwax Fabric and Leather Spray Care Kit - 4.2 fl. oz.","long_description":"Nikwax Fabric and Leather Spray care kit includes cleaning gel and waterproofing agent for footwear made with fabric and leather materials, including hiking boots, running shoes and sandals. Nikwax water-based products are nontoxic and contain no harmful solvents, fluorocarbons or propellants. Handy gel cleaner works on all types of footwear with both leather and fabric materials. Cleaner removes stubborn dirt and wax left by previous waterproofing applications; preps your boots for a fresh application of Nikwax treatment. Cleaner is formulated to retain leather's water repellency, unlike other cleaners that strip leather of its natural oils. Cleaner is recommended for Gore-Tex(R) and eVent(R) footwear. Water-based liquid wax restores water repellency to fabric and leather footwear. Wax contains mineral waxes, flexible polymers and tanning agents to condition and protect leather without over-softening or changing the fit. Gentle formula allows nubuck and suede textures to remain; will not flatten leather. Wax will darken and wax down leather and suede-test on inconspicuous spot first. Wax is recommended for Gore-Tex and eVent footwear.","short_description":"Nikwax Fabric and Leather Spray care kit includes cleaning gel and waterproofing agent for footwear made with fabric and leather materials, including hiking boots, running shoes and sandals.","category":"Camping And Hiking","subcategory":"Gear Storage And Maintenance","product_group":"Treatments And Washes","thumb_url":"http://i1.avlws.com/115/s419515.png","image_url":"http://i1.avlws.com/115/l419515.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=419515&tt=df","keywords":"treatment,dwr","retail_price":"17.00","sale_price":"17.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=419515\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m419515.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806938&amp;link=&amp;tabs=-Details\"></script>","variants":{"8069380015":{"sku":"8069380015","vendor_sku":"178","upc":"703861003011","size":"2 PK- 4.2 OZ/125ML EA","retail_price":"17.00","sale_price":"17.00"}},"categories":["camping-hiking","gear-storage-and-maintenance","treatments-and-washes"]}
