{"sku":"806939","manufacturer_id":"176","brand_name":"Nikwax","product_name":"Nikwax Nubuck and Suede Spray Care Kit - 4.2 fl. oz.","long_description":"This convenient Nikwax Nubuck and Suede Spray care kit includes cleaning gel and a waterproofing agent for nubuck and suede leather footwear such as hiking boots, winter boots and more. Nikwax water-based products are nontoxic and contain no harmful solvents, fluorocarbons or propellants. Handy gel cleaner works on all suede, nubuck or smooth-finish leathers and fabric. Cleaner removes stubborn dirt and wax left by previous waterproofing applications; preps your boots for a fresh application of Nikwax treatment. Cleaner is formulated to retain leather's water repellency, unlike other cleaners that strip the leather of its natural oils. Cleaner is recommended for Gore-Tex(R) and eVent(R) footwear. Water-based liquid wax restores water repellency to nubuck and suede leather footwear. Wax contains mineral waxes, flexible polymers and tanning agents to condition and protect leather without over-softening or changing the fit. Wax will darken and wax down leather and suede-test on inconspicuous spot first. Wax is recommended for Gore-Tex and eVent footwear.","short_description":"This convenient Nikwax Nubuck and Suede Spray care kit includes cleaning gel and a waterproofing agent for nubuck and suede leather footwear such as hiking boots, winter boots and more.","category":"Camping And Hiking","subcategory":"Gear Storage And Maintenance","product_group":"Treatments And Washes","thumb_url":"http://i1.avlws.com/115/s419519.png","image_url":"http://i1.avlws.com/115/l419519.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=419519&tt=df","keywords":"dwr,treatment","retail_price":"17.00","sale_price":"17.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=419519\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m419519.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=806939&amp;link=&amp;tabs=-Details\"></script>","variants":{"8069390014":{"sku":"8069390014","vendor_sku":"176","upc":"703861003028","size":"2 PK- 4.2 OZ/125ML EA","retail_price":"17.00","sale_price":"17.00"}},"categories":["camping-hiking","gear-storage-and-maintenance","treatments-and-washes"]}
