{"sku":"807089","manufacturer_id":"010-00829-06","brand_name":"Garmin","product_name":"Garmin Edge 500 Wireless Bike Computer","long_description":"Sharpen your cycling performance with the Garmin Edge(R) 500, a lightweight GPS-based cycling computer for performance-driven cyclists. Low-profile bike mount attaches easily to your stem or handlebar; high-sensitivity GPS receiver with HotFix(TM) satellite prediction calculates your position. Edge 500 measures your speed, distance, time, calories burned, altitude, climb and descent, and records this data for your review. For extra-precise climb and descent data, Edge 500 also incorporates a barometric altimeter to pinpoint changes in elevation. Courses feature helps you compare successive rides over the same route; other features include Auto Pause, Auto Lap and temperature readings. Once your ride is done, use the included USB cable to connect Edge 500 to your computer and the internet to analyze your performance. With a simple click, you can join a worldwide network of cyclists and outdoor enthusiasts through Garmin Connect(TM), a 1-stop website for data analysis and sharing. Package includes Edge 500 GPS unit, bike mount, AC charger, USB cable, owner's manual on disk and a quick-start manual. Please note: the Edge 500 does not come with a cadence sensor, though is capable of tracking cadence with a cadence sensor (sold separately). Also note: to track heart rate, a separate ANT+ heart rate strap must be purchased (see relateds).","short_description":"Sharpen your cycling performance with the Garmin Edge(R) 500, a lightweight GPS-based cycling computer for performance-driven cyclists.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375155.png","image_url":"http://i1.avlws.com/115/l375155.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375155&tt=df","retail_price":"200.00","sale_price":"200.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375155\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375155.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=807089&amp;link=&amp;tabs=-Details\"></script>","variants":{"8070890010":{"sku":"8070890010","vendor_sku":"010-00829-06","upc":"753759104306","color":"NEUTRAL","retail_price":"200.00","sale_price":"200.00"}},"categories":["cycling","bike-accessories","bike-computers"]}
