{"sku":"807485","manufacturer_id":"B-20000","brand_name":"Backcountry Access","product_name":"Backcountry Access Tracker2 Avalanche Transceiver","long_description":"The Backcountry Access Tracker2 avalanche transceiver features quick processing and 3 receiving antennas wrapped up in an easy-to-use interface to make searching faster and simpler. Fast internal processor essentially eliminates lag so you can quickly search for a victim without having to wait for your transceiver. 3 receiving antennas allow excellent precision and pinpoint search capabilities no matter what position the victim is buried in. Mechanical search/transmit switch clearly indicates the mode you are in and is easy to operate; pull the switch to enter search and push it back in to return to transmit. Numeric distance display shows approximate distance in meters to buried transmitter; pinpoint search loudspeaker provides reinforcement to visual data. When searching, LED lights indicate the direction of the victim's signal; simply rotate the transceiver and proceed as the lights indicate. Special Mode narrows the search angle field to assist in searches for multiple burials; indicator light illuminates when multiple burials are detected. Tracker2 has a thinner profile and harness than the Backcountry Access Tracker DTS (sold separately); rubberized housing provides a sure grip. Included holster harness system allows the unit to be easily removed for searching. Operates on 457 kHz frequency and is fully compatible with other 457 kHz units; functions as a transmitter and receiver. Uses 3 AAA alkaline batteries (included), which provide a minimum life of 250 hrs. in transmit mode; 50 hrs. in receive mode.","short_description":"The Backcountry Access Tracker2 avalanche transceiver features quick processing and 3 receiving antennas wrapped up in an easy-to-use interface to make searching faster and simpler.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Avalanche Safety Gear","thumb_url":"http://i1.avlws.com/115/s407323.png","image_url":"http://i1.avlws.com/115/l407323.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407323&tt=df","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407323\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407323.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=807485&amp;link=&amp;tabs=-Details\"></script>","variants":{"8074850010":{"sku":"8074850010","vendor_sku":"B-20000","upc":"894913002714","retail_price":"299.95","sale_price":"299.95"}},"categories":["climbing","mountaineering-gear","avalanche-safety-gear"]}
