{"sku":"807561","manufacturer_id":"951301","brand_name":"Burley","product_name":" Burley Travoy Urban Bike Trailer","long_description":"The Burley Travoy is an urban bike trailer system that lets you easily take all your gear with you. Pull the trailer behind your bike and then bring it with you when you arrive! Burley Travoy hitches to the seatpost of any bike and detaches simply with the flip of a switch, so you can wheel it with you wherever you go. Features a sturdy anodized aluminum frame and weighs in at under 10 lbs.; carries up to 60 pounds of gear. Lightweight frame with 2 wheels keeps the trailer upright and steady when riding or walking; track width is 22 in. Patent-pending design provides excellent stability and maneuverability; rear reflectors enhance visibility in low light. 12 in. plastic wheels have angled valve stems for easy inflation; anodized aluminum hitch fits standard seatposts. When you reach your destination, fold the top arm down by using the twist grip on the frame; then pull the trailer behind you using that twist-grip as a handle. Tote bag included features a cinch-strap closure and carry handles; clips to the tie-down buttons on the frame, so it won't go astray. Travoy trailer folds flat and fits inside its briefcase-sized tote bag for transport or storage; includes tie-downs for strapping on extra gear. In more than 6 months of testing, Burley hauled just about everything in the Travoy: groceries, laptops, files, snowshoes, bike gear, gym and work clothes, books and more! Much more than just a series of bicycle accessories, the Travoy and its accompanying bags (sold separately) offer you a complete alternative transportation system.","short_description":"The Burley Travoy is an urban bike trailer system that lets you easily take all your gear with you. Pull the trailer behind your bike and then bring it with you when you arrive!","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trailers","thumb_url":"http://i1.avlws.com/115/s376779.png","image_url":"http://i1.avlws.com/115/l376779.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376779&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376779\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376779.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=807561&amp;link=&amp;tabs=-Details\"></script>","variants":{"8075610017":{"sku":"8075610017","vendor_sku":"951301","upc":"840840006394","retail_price":"299.00","sale_price":"299.00"}},"categories":["cycling","bike-accessories","bike-trailers"]}
