{"sku":"807597","manufacturer_id":"FUPPGYBK","brand_name":"Smith","product_name":" Smith Forum Polarized Sunglasses - Men's","long_description":"These Smith Forum polarized sunglasses will add a bit a bit of swagger in your saunter even as they provide comfortable protection from the sun. Polarized lenses reduce 99% of visible glare for increased sharpness and decreased eye fatigue. Scratch- and impact-resistant Carbonic(TM) lenses use Tapered Lens Technology from Smith(TM) to provide distortion-free vision. Tapered Lens Technology(TM) progressively tapers the lens toward the outer edge, allowing distortion-free vision. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Hydrophilic Megol(TM) nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. 8-base-curve lenses; (the higher the number the more curved the lens-Smith features sunglasses with 6, 7, 8 and 9 base curvature). Sunglasses provide 100% protection from the sun's harmful UVA and UVB rays. Mahogany frames feature polarized brown lenses that block reflected glare while providing increased depth perception and reducing eye strain. Black frames feature polarized gray lenses that block reflected glare while preserving natural colors in order to provide true color definition. Smith Forum polarized sunglasses include a protective case. Sized to fit medium to large faces.","short_description":"These Smith Forum polarized sunglasses will add a bit a bit of swagger in your saunter even as they provide comfortable protection from the sun.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422887.png","image_url":"http://i1.avlws.com/115/l422887.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422887&tt=df","keywords":"Cycling","retail_price":"119.00","sale_price":"119.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422887\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422887.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=807597&amp;link=&amp;tabs=-Details\"></script>","variants":{"8075970015":{"sku":"8075970015","vendor_sku":"FUPPGYBK","upc":"715757346959","color":"BLACK/GRAY","retail_price":"119.00","sale_price":"119.00"},"8075970023":{"sku":"8075970023","vendor_sku":"FUPPBRMH","upc":"715757346966","color":"MAHONGANY/BROWN","retail_price":"119.00","sale_price":"119.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
