{"sku":"807783","manufacturer_id":"3608324040","brand_name":"Deuter","product_name":"Deuter Fox 40 Pack - Juniors'","long_description":"The Deuter Fox 40 pack is a great piece of gear for your kids' overnight and weekend trips as you introduce them to the great outdoors. Variquick harness allows quick, easy adjustment of torso length for kid's growing frame. Back panel features twin vertical air-mesh foam pads that work like a chimney to vent away warm air and sweat. Contoured, padded harness lined with air-mesh for breathability; harness features stabilizer straps for ideal positioning of pack. Soft hipbelt wraps the body, stabilizing and controlling the pack's lateral movements. Top loading main compartment has plenty of room for an overnight or lightweight weekend trip. 2 lid pockets and side bellows pockets store often-accessed gear such as snacks, headlamp, hat, sunscreen and bug repellent. Hydration-compatible design features reservoir pocket and drink tube exit port for on-the-go hydration (reservoir sold separately). 2 side mesh pockets are roomy enough for water bottles. The Deuter Fox 40 pack features a bottom zippered compartment for separate access to a sleeping bag or for storing dirty clothes away from clean gear. Side compression straps let you cinch down loads for jostle-free carrying; ice axe loops and pole attachments allow additional gear to be strapped on to the pack exterior.","short_description":"The Deuter Fox 40 pack is a great piece of gear for your kids' overnight and weekend trips as you introduce them to the great outdoors.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s440651.png","image_url":"http://i1.avlws.com/115/l440651.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440651&tt=df","keywords":"multiday","retail_price":"109.00","sale_price":"109.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440651\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440651.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=807783&amp;link=&amp;tabs=-Details\"></script>","variants":{"8077830001":{"sku":"8077830001","vendor_sku":"3608324040","size":"ONE SIZE","color":"EMERALD/TITAN","retail_price":"109.00","sale_price":"109.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
