{"sku":"807785","manufacturer_id":"9629","brand_name":"Rei","product_name":"REI Emergency Kit","long_description":"The REI Emergency Kit is stocked with recommended products for emergencies, and is small enough to store in your car trunk or a closet at home. Provides relief in an emergency situation with survival goods, tools, safety supplies and personal hygiene items; pack-style bag offers portability. Contains enough supplies for 1 - 2 people for up to 3 days. Kit includes emergency items: 2 food packages, 20 water packets, tube tent, 2 waterproof ponchos, 2 rescue blankets, 4 hand warmers and 2 dust masks. Also includes hand-crank flashlight/radio, multifunction tool, work gloves, 2.5 gal. collapsible water jug, whistle, 4 light sticks and 2 emergency candles. Includes essentials such as pencil, paper, 50 ft. nylon rope, waterproof tape, 2 cold packs, latex-free medical gloves (2 pairs) and 6 antimicrobial hand wipes. Also includes bandage scissors, tweezers/forceps, 2 finger splints, digital thermometer, first aid manual, 2 facial tissue packages and 2 biohazard waste bags. Treat wounds with five 3 x 0.75 in. bandages, five 3 x 1 in. bandages, 5 knuckle bandages, 5 fingertip bandages and four 2 x 2 in. gauze pads. Also includes two 3 x 3 in. gauze pads, two 4 x 4 in. gauze pads, 4 yd. x 2 in. stretch gauze, two 9 x 5 in. ABD/combine pads, eye pad and 5 butterfly closures. Treatments include 3 sting relief wipes, 9 antibacterial wipes, 2 triple antibiotic ointment packets, 2 burn cream packets and 2 eye wash bottles. Medications include 4 Cetafen(R) acetaminophen tablets, 4 Nutralox(R) antacid tablets and 4 Proprinal(R) ibuprofen tablets. Also includes 2 Diamode(R) loperamide HCI antidiarrheal tablets. Easy-to-read first-aid guide is written by Dr. William W. Forgey. All pieces fit neatly into the 3-compartment nylon backpack with adjustable shoulder straps-stows neatly in a closet or trunk of a car.","short_description":"The REI Emergency Kit is stocked with recommended products for emergencies, and is small enough to store in your car trunk or a closet at home.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s420351.png","image_url":"http://i1.avlws.com/115/l420351.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=420351&tt=df","retail_price":"165.00","sale_price":"165.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=420351\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m420351.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=807785&amp;link=&amp;tabs=-Details\"></script>","variants":{"8077850017":{"sku":"8077850017","vendor_sku":"9629","upc":"480778500177","color":"RED","retail_price":"165.00","sale_price":"165.00"}}}
