{"sku":"807911","manufacturer_id":"BD620703DKCHALL","brand_name":"Black Diamond","product_name":" Black Diamond Titan Lantern","long_description":"The powerful Black Diamond Titan lantern lights up your climbing basecamp or a backyard party with bright, ambient light. Frosted globe and dual reflectors effectively capture and put out LED light; wide 45 ft. diameter lighting area illuminates basecamps and backyards. QuadPower LED puts out 250 lumens on high and 16 lumens on low. 4 D-cell batteries (sold separately) provide up to 24 hrs. of runtime on high and 168 hrs. on low. Fine-tune your lighting needs with the dimming switch-simply hold down the on/off button to activate dimmer. Collapsible design saves space in your car and protects on/off button from accidental activation. Unique double-hook hanging system on top provides a simple and secure thread-through or clip-in attachment point for string, fabric loops or branches. Wide base with rubber accents stabilizes the lantern when set on a table or the ground. Battery power indicator shows you how much battery life remains. Black Diamond Titan lantern runs on 4 D batteries, sold separately; base of lantern unscrews to reveal battery compartment.","short_description":"The powerful Black Diamond Titan lantern lights up your climbing basecamp or a backyard party with bright, ambient light.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Lanterns","thumb_url":"http://i1.avlws.com/115/s417291.png","image_url":"http://i1.avlws.com/115/l417291.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417291&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417291\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417291.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=807911&amp;link=&amp;tabs=-Details\"></script>","variants":{"8079110014":{"sku":"8079110014","vendor_sku":"BD620703DKCHALL","upc":"793661140559","color":"DARK CHOCOLATE","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","camp-lighting","lanterns"]}
