{"sku":"807909","manufacturer_id":"BD620702ULWTALL","brand_name":"Black Diamond","product_name":"Black Diamond Apollo Lantern","long_description":"Updated for 2010, the Black Diamond Apollo lantern is brighter than the previous version yet still features a dimming switch so you can set the lighting for nighttime cooking and reading. DoublePower LED with frosted globe creates bright, non-glaring light; dual reflectors effectively capture and distribute light. LED puts out 80 lumens on high and 10 lumens on low; illuminates an area approximately 45 ft. in diameter on high. Fine-tune your lighting needs with the dimming switch-simply hold down the on/off button to activate dimmer. Collapsible legs fold down and adjust to uneven terrain; legs fold up for compact transport. Small LED lights indicate battery status; green indicates 50% - 99% battery life, yellow indicates less than 50% and red indicates less than 25%. Innovative double-hook hanging system on top provides a simple and secure thread-through or clip-in attachment point for string, fabric loops or branches. Operates on 4 AA alkaline batteries or the Black Diamond NRG rechargeable battery kit, both sold separately. 4 AA batteries provide 60 hrs. of use on low and 15 hrs. on high. Integrated charger port accepts NRG wall charger so you can recharge batteries without removing them from the lantern.","short_description":"Updated for 2010, the Black Diamond Apollo lantern is brighter than the previous version yet still features a dimming switch so you can set the lighting for nighttime cooking and reading.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Lanterns","thumb_url":"http://i1.avlws.com/115/s417287.png","image_url":"http://i1.avlws.com/115/l417287.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417287&tt=df","retail_price":"49.95","sale_price":"49.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417287\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417287.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=807909&amp;link=&amp;tabs=-Details\"></script>","variants":{"8079090001":{"sku":"8079090001","vendor_sku":"620702","upc":"793661175568","color":"DARK SHADOW","retail_price":"49.95","sale_price":"49.95"},"8079090026":{"sku":"8079090026","vendor_sku":"BD620702ULWTALL","upc":"793661144946","color":"ULTRA WHITE","retail_price":"49.95","sale_price":"49.95"}},"categories":["camping-hiking","camp-lighting","lanterns"]}
