{"sku":"808325","manufacturer_id":"2718","brand_name":"Rei","product_name":"REI Passage 40 Pack - Kids'","long_description":"The REI Passage 40 pack perfectly suits young kids ages 6 - 11 as they learn to love backpacking. It uses the same quality materials and design as adult packs for great comfort and performance. Adjustable harness fits 12 - 15 in. torsos and lets the pack grow with your child; highly visible torso adjustment increment markers make it quick and easy to dial in the fit. Contoured, padded shoulder straps, hipbelt and molded foam back panel with breathable mesh provide carrying comfort and great ventilation. Dual aluminum stays stabilize the load and shift pack weight to the hips. Precurved hipbelt comfortably waps around the hips and can be extended to provide an additional 2 in. of circumference as your child grows. Hipbelt webbing tightens with an ergonomic forward pull for easy adjustment. Adjustable sternum strap features a safety whistle built into the buckle. Organize gear in the top-loading main compartment, sleeping bag compartment, front mesh stuff pocket and 2 pockets in the top lid. Floating top lid extends to accommodate large loads. Pack bottom features sleeping pad straps with quick-release buckles. Water-repellent zippers help keep contents dry and eliminate the need for fabric zipper flaps. 2 zippered mesh pockets on the hipbelt keep snacks and other small essentials close at hand. Hydration-ready design allows a reservoir's drink tube to be routed over either shoulder (hydration reservoir sold separately). Ice axe loops and dual daisy chains provide external attachment points for tools and other gear; dual side pockets hold water bottles or other compact items. Side compression straps let you cinch down loads for jostle-free carrying. The REI Passage 40 pack is designed and sized to fit kids ages 6 - 11.","short_description":"The REI Passage 40 pack perfectly suits young kids ages 6 - 11 as they learn to love backpacking. It uses the same quality materials and design as adult packs for great comfort and performance.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410411.png","image_url":"http://i1.avlws.com/115/l410411.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410411&tt=df","keywords":"multiday","retail_price":"99.50","sale_price":"99.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410411\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410411.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=808325&amp;link=&amp;tabs=-Details\"></script>","variants":{"8083250012":{"sku":"8083250012","vendor_sku":"2718","upc":"480832500129","size":"One Size","color":"INDIGO","retail_price":"99.50","sale_price":"99.50"}}}
