{"sku":"808326","manufacturer_id":"11129","brand_name":"Rei","product_name":"REI Passage 65 Pack - Youth","long_description":"The REI Passage 65 pack is perfect for Scouts and other kids ages 11 - 17 who love backpacking. It uses the same quality materials and design as adult packs for great comfort and performance. Adjustable harness fits 15 - 19 in. torsos and lets the pack grow with your young backpacker; highly visible increment markers make it quick and easy to dial in the fit. Contoured, padded shoulder straps, hipbelt and molded foam back panel with breathable mesh provide carrying comfort and great ventilation. Dual aluminum stays stabilize the load and shift pack weight to the hips. Precurved hipbelt comfortably wraps around the hips and can be extended to provide an additional 2 in. of circumference as your child grows. Hipbelt webbing tightens with an ergonomic forward pull for easy adjustment. Top-loading main compartment features side zip access, making it easy to retrieve deeply buried items. Adjustable sternum strap features a safety whistle built into the buckle. Organize your gear in top-loading main compartment, sleeping bag compartment, front essentials zip pocket and 2 pockets in the top lid pocket. Floating top lid extends to accommodate large loads; lid detaches and can be used as a lumbar pack for side trips and day hikes. Elastic cord crisscrosses the front of the pack and creates an ideal spot to stash a jacket or pack towel. Pack bottom features sleeping pad straps with quick-release buckles; 2 zippered mesh pockets on the hipbelt keep snacks and other small essentials close at hand. Water-repellent zippers help keep contents dry and eliminate the need for fabric zipper flaps. Hydration-ready design allows a reservoir's drink tube to be routed over either shoulder (hydration reservoir sold separately). Ice axe loops and dual daisy chains provide external attachment points for tools and other gear; dual side pockets hold water bottles or other compact items.","short_description":"The REI Passage 65 pack is perfect for Scouts and other kids ages 11 - 17 who love backpacking. It uses the same quality materials and design as adult packs for great comfort and performance.","category":"Camping & Hiking","subcategory":"Backpacking Packs","product_group":"Kids' Backpacks","thumb_url":"http://i1.avlws.com/115/s160591.png","image_url":"http://i1.avlws.com/115/l160591.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=160591&tt=df","keywords":"lightweight,kids,youth,child,junior","retail_price":"159.00","sale_price":"159.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=160591\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m160591.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=808326&amp;link=&amp;tabs=-Details\"></script>","variants":{"8083260011":{"sku":"8083260011","vendor_sku":"11129","upc":"480832600119","size":"One Size","color":"PINEDALE","retail_price":"159.00","sale_price":"159.00"}}}
