{"sku":"808780","manufacturer_id":"00.5016.166.010","brand_name":"Avid","product_name":" Avid BB7 Mountain Disc Brake - 160mm rotor","long_description":"With gobs of beautifully modulated power and intuitive easy-to-use adjustability, the Avid BB7 Mountain disc brake sets the standard in the realm of mechanical disc brakes. With easily accessible adjustment knobs and an attractive finish, the Avid BB7 disc brake provides epic stopping power and versatile pressure settings. Tri-Align Caliper Positioning System(TM) aligns caliper perfectly without shims. Features inboard and outboard pad adjustment knobs, rigid 2-piece forged body and tool-free pad replacement. Integrated cable stop prevents routing cable and housing from entering the brake at odd angles, reducing the possibility of cable drag. Adjustable pad retraction. Spring tension can be modified with an Allen wrench, sold separately. Includes 160mm rotor and 2 caliper adapters; can be mounted front or rear. Please note: the Avid BB7 Mountain disc brake does not include brake lever; brake is compatible with most mountain-style cable levers.","short_description":"With gobs of beautifully modulated power and intuitive easy-to-use adjustability, the Avid BB7 Mountain disc brake sets the standard in the realm of mechanical disc brakes.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Brakes","thumb_url":"http://i1.avlws.com/115/s388495.png","image_url":"http://i1.avlws.com/115/l388495.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=388495&tt=df","retail_price":"81.00","sale_price":"81.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=388495\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m388495.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=808780&amp;link=&amp;tabs=-Details\"></script>","variants":{"8087800010":{"sku":"8087800010","vendor_sku":"00.5016.166.010","upc":"710845641008","retail_price":"81.00","sale_price":"81.00"}}}
