{"sku":"808727","manufacturer_id":"LP36185-0EU","brand_name":"Lowepro","product_name":"Lowepro Toploader Zoom AW 50 Camera Case","long_description":"The Lowepro Toploader Zoom AW 50 camera bag offers a weatherproof, streamlined and easy-access carrying solution for outdoor photographers who are ready to capture that once-in-a-lifetime shot. Integrated all-weather AW Cover(TM) lets you access the main compartment without exposing your gear to rain or snow; cover stows in a small front pocket when not in use. 7.8 x 6.3 x 4.3 in. interior size holds a DSLR with an attached lens (up to 17-55mm f/2.8); horizontal divider creates a separate area for an extra lens. Internal pocket holds extra memory, UV filter or spare battery. High-density closed-cell foam and soft nylon lining protect camera and accessories. Large zipper pulls are easy to grasp, even in wet and cold conditions; shoulder strap with durable D-rings and a built-in belt loop provide carrying options. Lowepro Toploader Zoom AW 50 camera case features a zippered exterior pocket that provides space for accessories. SlipLock(TM) attachment loop lets you add a compatible case, pouch or Lowepro Topload chest harness (sold separately).","short_description":"The Lowepro Toploader Zoom AW 50 camera bag offers a weatherproof, streamlined and easy-access carrying solution for outdoor photographers who are ready to capture that once-in-a-lifetime shot.","category":"Electronics","subcategory":"Photography","product_group":"Camera Bags","thumb_url":"http://i1.avlws.com/115/s426839.png","image_url":"http://i1.avlws.com/115/l426839.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426839&tt=df","retail_price":"50.00","sale_price":"50.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426839\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426839.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=808727&amp;link=&amp;tabs=-Details\"></script>","variants":{"8087270016":{"sku":"8087270016","vendor_sku":"LP36185-0EU","upc":"056035361852","color":"BLACK","retail_price":"50.00","sale_price":"50.00"}},"categories":["electronics","photography","camera-bags"]}
