{"sku":"809068","manufacturer_id":"2106449499","brand_name":"Lowa","product_name":"Lowa Camino GTX FreeFlex Hiking Boots - Men's","long_description":"Lowa Camino GTX FreeFlex hiking boots deliver solid backpacking performance, offering comfort and stability over long miles with heavy packs. 2.2mm thick nubuck leather uppers are durable and flexible, offering long-lasting protection and comfort; rubber toe and heel caps protect uppers from abrasion. Dual-zone lacing with locking eyelets delivers custom, optimized heel fit and instep stability without hindering comfort. GORE-TEX(R) waterproof liners let feet breathe while protecting them from the elements, keeping them dry and comfortable. Polyester linings work wonderfully to wick moisture away from feet, further improving comfort. Polyurethane midsoles offer outstanding cushioning for all-day wear; nylon shanks afford enhanced torsional rigidity to protect and support feet. FreeFlex forefoot design secures the foot within the boot while reducing strain across the toes, especially when going downhill, resulting in great, free-flexing comfort. Vibram(R) rubber outsoles on the Camino GTX boots have self-cleaning lugs with a high surface contact area; oversize front heel edges supply good downhill traction.","short_description":"Lowa Camino GTX FreeFlex hiking boots deliver solid backpacking performance, offering comfort and stability over long miles with heavy packs.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385099.png","image_url":"http://i1.avlws.com/115/l385099.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385099&tt=df","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385099\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385099.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=809068&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","mens-footwear","mens-boots"]}
