{"sku":"809171","manufacturer_id":"13260","brand_name":"Rei","product_name":"REI Quantum Daypack","long_description":"Road warriors of the world rejoice! The REI Quantum daypack is built with you in mind. It holds a laptop, legal-size documents and plenty of gear. 100% post-consumer recycled PET fabrics are tough enough to withstand the urban grind and soft enough to feel good doing it. Carries up to 16 in. laptop computers in a fully padded pocket; legal-size documents also fit easily in the main compartment. Easy access to the laptop sleeve through either top or side zippers; makes getting through airport security lines a breeze. Voluminous main compartment has space for all your mobile office essentials on weekdays and doubles as a terrific weekend getaway bag once you are off the clock. Top and side handles offer solid grab points; wide backpack straps, adjustable waistbelt and padded mesh back panel combine to make long hauls less taxing. Exterior zippered pocket fits travel documents, tickets and boarding passes; mesh side pocket accommodates a 1-liter bottle. REI Quantum daypack includes a fully featured organizer panel with multiple pockets for pens, electronics and small essentials. Ballistic nylon bottom panel is very durable and foam padding protects contents. Reflective trim creates great visibility for active commuters; webbing loop provides reliable attachment point for LED blinking light (sold separately).","short_description":"Road warriors of the world rejoice! The REI Quantum daypack is built with you in mind. It holds a laptop, legal-size documents and plenty of gear.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s226783.png","image_url":"http://i1.avlws.com/115/l226783.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=226783&tt=df","keywords":"carry on,pack,commute,travel,small","retail_price":"89.50","sale_price":"66.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=226783\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m226783.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=809171&amp;link=&amp;tabs=-Details\"></script>","variants":{"8091710001":{"sku":"8091710001","vendor_sku":"13260","upc":"480917100015","color":"RED MAPLE","retail_price":"66.93","sale_price":"66.93"}}}
