{"sku":"809157","manufacturer_id":"13259","brand_name":"Rei","product_name":"REI Vagabond Tour 40 Travel Pack","long_description":"Boarding a crowded train, walking cobblestone streets, trekking the hills-wherever you roam, the REI Tour 40 travel pack is the perfect choice. Panel-loading access to the main compartment facilitates easy packing and unpacking and gives you a quick, easy view of all contents when pack is fully open. Main-panel zipper is oriented for easy access to gear while pack is upright. Technically styled, ergonomic pack harness and waistbelt pair with an HDPE framesheet and a single aluminum stay to provide stable carrying and lots of comfort. Top organization pocket stows tickets, passport, pens, small electronics and travel-size bottles. Side and front zippered pockets stow a water bottle and an extra layer; all exterior pocket zippers can be secured with standard travel locks (sold separately). Webbing loops for trekking pole, ice axe and gear attachment tuck away when not in use; lash points allow attachment of accessory straps to carry sleeping pad or other items. REI Vagabond Tour 40 travel pack boasts multiple haul handles for convenient off-back transport between trains, planes or taxis. Integrated cover encloses straps when pack is checked as baggage and doubles as a raincover for use in wet weather. Interior pocket and attachment points accommodate common hydration reservoirs (sold separately); hydration tube exit port makes routing to shoulder strap easy. 420-denier nylon construction is light yet strong to keep you focused on your adventures abroad and not worrying whether your pack will make it to the next hostel. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"Boarding a crowded train, walking cobblestone streets, trekking the hills-wherever you roam, the REI Tour 40 travel pack is the perfect choice.","category":"Luggage & Travel","subcategory":"Luggage","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s167463.png","image_url":"http://i1.avlws.com/115/l167463.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=167463&tt=df","keywords":"backpack,back,luggage,travel,convertible","retail_price":"149.00","sale_price":"103.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=167463\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m167463.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=809157&amp;link=&amp;tabs=-Details\"></script>","variants":{"8091570013":{"sku":"8091570013","vendor_sku":"13259","upc":"480915700132","color":"BLACK","retail_price":"103.93","sale_price":"103.93"}}}
