{"sku":"809156","manufacturer_id":"13257","brand_name":"Rei","product_name":"REI Grand Tour 85 Travel Pack - Men's","long_description":"Sitting squarely at the intersection of comfort and convenience, the REI Grand Tour 85 travel pack has an adjustable suspension system and a removable daypack. Suspension system features adjustable torso length and padded shoulder straps, waistbelt and back panel for added support. Main-panel zipper is oriented for easy access to gear while pack is upright. Panel-loading daypack zips on/off main pack easily; daypack's main compartment features 2 interior pockets. Daypack offers an integrated organizer panel, exterior bottle pockets and back panel security pocket; interior neoprene pocket fits most 13 in. laptop computers. Travel pack's main compartment has zippered panel opening with lockable zipper sliders (locks sold separately). Interior compression straps prevent clothes from shifting; exterior compression straps stabilize the load for jostle-free carrying. Zippered bottom compartment on main pack provides extra storage for clothes or gear; adjustable divider creates a sleeping bag compartment. Side mesh pocket on main pack allows additional storage of 1-liter water bottle. Daisy chains on front of main pack and daypack let you clip on extra gear. Shoulder harness adjusts easily to fit those with torso lengths from 17 to 21 in. Side and top handles with foam padding enhance carrying comfort. Dual aluminum stays provide support. Daypack volume is 915 cu. in., plus main bag volume of 4,409 cu. in. for a total volume of 5,324 cu. in. Integrated cover protects pack when checked as baggage and doubles as a raincover. REI Grand Tour 85 travel pack is constructed of 420-denier nylon twill for exceptional durability. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"Sitting squarely at the intersection of comfort and convenience, the REI Grand Tour 85 travel pack has an adjustable suspension system and a removable daypack.","category":"Luggage & Travel","subcategory":"Luggage","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s171147.png","image_url":"http://i1.avlws.com/115/l171147.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=171147&tt=df","keywords":"back,pack,convertible,travel,backpack","retail_price":"199.00","sale_price":"118.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=171147\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m171147.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=809156&amp;link=&amp;tabs=-Details\"></script>","variants":{"8091560014":{"sku":"8091560014","vendor_sku":"13257","upc":"480615600145","color":"ROCKWALL","retail_price":"118.93","sale_price":"118.93"}}}
