{"sku":"809172","manufacturer_id":"13261","brand_name":"Rei","product_name":"REI Quantum Messenger Bag","long_description":"The REI Quantum Messenger laptop bag offers an updated take on a classic design, sporting plenty of improvements to keep up with a world that moves as fast as you do. 100% post-consumer recycled PET fabrics are tough enough to withstand the urban grind and soft enough to feel good doing it. Carries up to 17 in. laptop computers, in a fully padded pocket easily accessible via water-resistant zipper on the back panel; making removal at airport security painless. Sculpted top flap; shoulder-panel design securely covers main compartment; exterior zippered pocket accommodates travel documents, tickets and boarding passes. Removable shoulder strap includes an ergonomic pad for comfortable carrying during active commutes; padded top handle lets you carry bag like a briefcase. Internal organizer includes pockets for pens and business cards, and a microfleece-lined pocket is perfect for phone or MP3 player. Stretch mesh pockets on both ends of the bag hold water bottles or small essentials for easy access. Reflective trim creates great visibility for active commuters; webbing loop provides reliable attachment point for LED blinking light (sold separately).","short_description":"The REI Quantum Messenger laptop bag offers an updated take on a classic design, sporting plenty of improvements to keep up with a world that moves as fast as you do.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Messenger Bags","thumb_url":"http://i1.avlws.com/115/s202143.png","image_url":"http://i1.avlws.com/115/l202143.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=202143&tt=df","keywords":"travel,briefcase,shoulder,messenger bag,pack","retail_price":"89.50","sale_price":"66.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=202143\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m202143.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=809172&amp;link=&amp;tabs=-Details\"></script>","variants":{"8091720001":{"sku":"8091720001","vendor_sku":"13261","upc":"480917200012","color":"RED MAPLE","retail_price":"66.93","sale_price":"66.93"}}}
