{"sku":"809212","manufacturer_id":"3373074000","brand_name":"Deuter","product_name":"Deuter ACT Lite 40 + 10 Pack","long_description":"The lightweight Deuter ACT Lite 40 + 10 pack features a light-and-fast design that will keep you cool on overnight and weekend trekking adventures. Variquick harness adjustment system lets you dial in the best fit quickly and easily. Contoured, padded shoulder straps feature 3D air mesh lining for breathability and stabilizer straps for ideal positioning of pack. Bi-laminate foam hipbelt uses a soft interior foam for comfort and a stiff outer foam for weight transfer and lateral movement control. Deuter Aircontact Lite suspension features a special hollow foam which creates a pump effect, forcing warm air out and drawing cool air in. Hollow-core aluminum X-frame offers torsional rigidity, flexibility for body movement and effective weight transfer. Top- and front-loading main compartment offers space for your overnight gear; 2 side stretch-mesh pockets store your water bottles and snacks. Lid has 2 pockets for quick access to gear such as map, headlamp, first aid kit, sunscreen and multi-tool. Hydration-compatible design features reservoir pocket and drink tube exit port for on-the-go hydration (reservoir sold separately). Bottom compartment lets you stuff your sleeping bag or other light, bulky items directly into the pack; shares a zippered separator with the main bag. Side compression straps let you cinch down loads for jostle-free carrying. The Deuter ACT Lite 40 + 10 pack features dual ice axe loops and front elastic cord that are ideal for securing gear to the front of the pack.","short_description":"The lightweight Deuter ACT Lite 40 + 10 pack features a light-and-fast design that will keep you cool on overnight and weekend trekking adventures.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410419.png","image_url":"http://i1.avlws.com/115/l410419.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410419&tt=df","keywords":"multiday","retail_price":"169.00","sale_price":"169.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410419\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410419.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=809212&amp;link=&amp;tabs=-Details\"></script>","variants":{"8092120001":{"sku":"8092120001","vendor_sku":"3373074000","size":"ONE SIZE","color":"BLACK/SILVER","retail_price":"169.00","sale_price":"169.00"},"8092120016":{"sku":"8092120016","vendor_sku":"3373055200","size":"One Size","color":"FIRE","retail_price":"169.00","sale_price":"169.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
