{"sku":"809337","manufacturer_id":"ASKD","brand_name":"The North Face","product_name":"The North Face Snow Leopard Sleeping Bag","long_description":"The North Face Snow Leopard sleeping bag offers the optimal balance of weight and warmth for cold-weather backpacking and mountaineering. Solid layer of Climashield Apex insulation is placed over the core of body to reflect radiant heat back to you; synthetic insulation is a small-diameter, continuous-filiment. Wrapping all around is Climashield(TM) Prism synthetic insulation, a high-lofting, warm and light insulation that even works exceptionally well when compressed. Overlapping shingle construction prevents insulation from moving around, creating consistent warmth. Top shell features extremely lightweight nylon fabric; nylon bottom shell defends against grit/abrasion. Adjustable insulated draft collar with microfleece cord tunnel is comfortable against skin. Oversize top draft tube backing snag-free zipper prevents heat loss. Internal draft tube pocket stores small items to keep them warm (headlamp batteries) and within easy reach. Color-coded, 1-handed hood drawcords and glow-in-the-dark zipper pulls make adjustments easy at night. Features a roomy, vaulted footbox that has a tricot lining for added warmth and comfort. Includes lightweight compression stuff sack.","short_description":"The North Face Snow Leopard sleeping bag offers the optimal balance of weight and warmth for cold-weather backpacking and mountaineering.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s170791.png","image_url":"http://i1.avlws.com/115/l170791.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=170791&tt=df","keywords":"winter,sleeping,cold,sleep,insulated","retail_price":"229.00","sale_price":"169.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=170791\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m170791.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=809337&amp;link=&amp;tabs=-Details\"></script>","variants":{"8093370016":{"sku":"8093370016","vendor_sku":"ASKD","upc":"027906150691","size":"Long Left","color":"ISLAND GRASS GREEN","retail_price":"169.93","sale_price":"169.93"}}}
