{"sku":"810122","manufacturer_id":"13096","brand_name":"Rei","product_name":" REI Hobitat 4 Tent","long_description":"A home-away-from-home, the REI Hobitat 4 tent is a spacious and easy-to-use campground tent. Hobitat 4 features 1 generously sized end door. If your activities center around the campsite, the Hobitat 4 provides a comfortable daytime private refuge and a nighttime shelter from the wind, the rain and the critters. Rectangular floor plan with end-to-end symmetry makes it easy to arrange sleeping bags and gear and provides organizational efficiency and comfort. Combination of pole clips, pole sleeves and color coding facilitate a quick and easy setup. Advanced frame design maximizes headroom, interior volume and strength. Huge door with 4 zipper sliders provides multiple entry configurations that can be personalized for both children and adults; door tucks away into an adjacent pocket. Weatherproof door with awning provides easy access, ventilation and good weather protection. Seam-sealed polyester fly provides a waterproof, durable and sag-free cover; seam-sealed, cut-in floor provides a taut pitch and waterproof protection. Roll-up side panels mated to interior bug-proof mesh panels enhance and allow you to control ventilation. Multiple interior storage options are provided by various combinations of mesh side pockets and hang loops located throughout the tent. Includes carry/storage sack, 8 stakes and 4 guylines with tighteners. Connect Tech zipper attachment lets you add more living space or storage with the Hobitat Garage or Hobitat Vestibule, both sold separately. Please note: 2011 Hobitat tent will not work with prior years' Hobitat Vestibule.","short_description":"A home-away-from-home, the REI Hobitat 4 tent is a spacious and easy-to-use campground tent. Hobitat 4 features 1 generously sized end door.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s456027.png","image_url":"http://i1.avlws.com/115/l456027.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456027&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456027\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456027.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=810122&amp;link=&amp;tabs=-Details\"></script>","variants":{"8101220013":{"sku":"8101220013","vendor_sku":"13096","upc":"481012200136","size":"4 Person","color":"SAGE/PLATINUM","retail_price":"299.00","sale_price":"299.00"}}}
