{"sku":"810175","manufacturer_id":"ASHV","brand_name":"The North Face","product_name":" The North Face VE-25 Tent","long_description":"The North Face VE-25 Tent is engineered to withstand the extreme conditions of high-altitude alpine environments. This 3-person juggernaut is still a perennial favorite with core mountaineers. Multiple exterior guy points, no-stretch Kevlar(R) guylines with cam adjusters and an internal guy system provide stability in extreme storms. Continuous pole sleeves increase structural integrity; DAC Featherlite(R) NSL poles slide through without snagging. 2 large doors allow easy access and good ventilation; 2 vestibules for gear storage. Full-coverage rainfly includes pole-supported front vestibule with snowflaps and a stake-out rear vestibule for gear stowage. Internally adjusted mesh top vents ensure spindrift melts onto rainfly. Polyurethane windows, cold crack tested to -60degF, improve living conditions by increasing light and views. Taped, seam-tensioned true bathtub floor offers the clean angles and usable space of a catenary cut without requiring seam sealing. Waterproof, polyurethane-coated rainfly and floor provide superior protection and durability. Reflective guyline loops and zipper pulls help locate tent in the dark, minimizing the risk of tripping over guylines or kicking it loose. For a lightweight setup during nice weather leave tent body behind; use the rainfly and footprint (sold separately) with the poles and stakes. The North Face VE-25 Tent comes with DAC stakes with pull-cords and 4 fabric snow stakes.","short_description":"The North Face VE-25 Tent is engineered to withstand the extreme conditions of high-altitude alpine environments. This 3-person juggernaut is still a perennial favorite with core mountaineers.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423795.png","image_url":"http://i1.avlws.com/115/l423795.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423795&tt=df","retail_price":"619.00","sale_price":"619.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423795\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423795.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=810175&amp;link=&amp;tabs=-Details\"></script>","variants":{"8101750019":{"sku":"8101750019","vendor_sku":"ASHV","upc":"481017500194","size":"3 Person","color":"Summit Gold","retail_price":"619.00","sale_price":"619.00"}}}
