{"sku":"810186","manufacturer_id":"05138","brand_name":"Msr","product_name":"MSR Carbon Reflex 3 Tent","long_description":"Three used to be a crowd-especially in the backcountry. But now, the freestanding MSR Carbon Reflex 3 tent eliminates the hassle of figuring out sleeping arrangements for 3. With 2 full doors and 2 vestibules, it offers uncompromised accommodations at the weight of many lightweight 2-person tents. And that also makes the Carbon Reflex 3 is also a great option for 2 as well-especially on longer trips where extra space may be especially appreciated. MSR Custom Carbon poles weight 30% less than aluminum with a significant increase in strength. Unique geometry provides ample center height and steep sidewalls to maximize usable space; freestanding design is easy to move around once assembled. Taped DuraShield(R)-coated fly and bathtub floor are durable and waterproof; mesh walls ensures great cross-ventilation and views outside. Clip construction ensures a fast and easy setup. 4 internal mesh pockets organize small gear. For a lightweight setup during nice weather leave tent body behind; use the rainfly and footprint (sold separately) with the poles and stakes. Includes stuff sacks, guyline/tensioners and stakes.","short_description":"Three used to be a crowd-especially in the backcountry. But now, the freestanding MSR Carbon Reflex 3 tent eliminates the hassle of figuring out sleeping arrangements for 3.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s446927.png","image_url":"http://i1.avlws.com/115/l446927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=446927&tt=df","retail_price":"649.95","sale_price":"649.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=446927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m446927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=810186&amp;link=&amp;tabs=-Details\"></script>","variants":{"8101860016":{"sku":"8101860016","vendor_sku":"05138","upc":"481018600169","size":"3 Person","color":"Moss Green/Black","retail_price":"649.95","sale_price":"649.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
