{"sku":"810834","manufacturer_id":"APOBC8T","brand_name":"The North Face","product_name":"The North Face Prophet 52 Pack","long_description":"The North Face Prophet 52 pack travels light and fast for climbers who reach for the summits. You'll love this top-loading mountaineering pack. Breathable, molded E-VAP(TM) back panel uses perforated foam to eliminate excess weight and circulate air through channels; back panel can be removed and used as a bivy pad. Anatomic shoulder straps also use E-VAP perforated foam to eliminate excess weight and circulate air through channels. Formed hipbelt features molded gear loops which let you easily attach climbing tools and gear. Welded reinforcements and double fabric on base of pack enhance abrasion resistance and durability. Removable top pocket with shockcord strap lets you stow essentials inside your tent while leaving the pack outside or in vestibule. Removable, custom extruded 6061 aluminum stay offers stability and light weight. Internal pocket holds hydration reservoir (sold separately) for hands-free drinking on the trail. Side compression straps with hypalon reinforcement wings secure both large and small loads for increased stability. Haul an assortment of climbing gear with the expandable wand pockets, dual haul loops, adjustable tool loops and elastic ice axe attachment. The North Face Prophet 52 pack features a reinforced front panel with dual lashing straps that accommodates sharp and bulky gear.","short_description":"The North Face Prophet 52 pack travels light and fast for climbers who reach for the summits. You'll love this top-loading mountaineering pack.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410439.png","image_url":"http://i1.avlws.com/115/l410439.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410439&tt=df","keywords":"multiday","retail_price":"209.00","sale_price":"209.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410439\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410439.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=810834&amp;link=&amp;tabs=-Details\"></script>","variants":{"8108340002":{"sku":"8108340002","vendor_sku":"APOBC8T","upc":"732075054021","size":"L","color":"SUMMIT GOLD/ASPHALT GREY","retail_price":"209.00","sale_price":"209.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
