{"sku":"810844","manufacturer_id":"3374022500","brand_name":"Deuter","product_name":" Deuter ACT Lite 45 + 10 SL Pack - Women's","long_description":"The Deuter ACT Lite 45 + 10 SL pack is perfect for women who want light weight, quality, durability, and comfort, all in a pack with torso-length adjustability. This multiday women's pack features a light-and-fast design that will keep you cool on your trekking adventures. SL (Slimline) fit is specifically designed with narrow, short shoulder straps and short back proportions for women. Variquick harness adjustment system lets you dial in the best fit quickly and easily. Contoured, padded shoulder straps feature 3D air-mesh lining for breathability and stabilizer straps for ideal positioning of pack. Bi-laminate foam hipbelt uses a soft interior foam for comfort and a stiff outer foam for weight transfer and lateral movement control. Deuter Aircontact Lite suspension features a special hollow foam which creates a pump effect, forcing warm air out and drawing cool air in. Hollow-core aluminum X-frame offers torsional rigidity, flexibility for body movement and effective weight transfer. Top-loading main compartment offers lots of room for your overnight gear; 2 side mesh pockets store your water bottles or snacks. Stretch-woven front pocket holds raingear and other quick-access essentials. Adjustable lid has 2 pockets for small items such as a map, headlamp, first aid kit, sunscreen and multitool. Extendable lid allows you to expand the collar, adding up to 600 cu. in. (10 liters) of storage space. Hydration-compatible design features reservoir pocket and drink tube exit port for on-the-go hydration (reservoir sold separately). Bottom compartment lets you stuff your sleeping bag or other light, bulky items directly into the pack; shares a zippered separator with the main bag. Side compression straps let you cinch down loads for jostle-free carrying. SOS label inside the lid includes information to help if you're lost or need assistance.","short_description":"The Deuter ACT Lite 45 + 10 SL pack is perfect for women who want light weight, quality, durability, and comfort, all in a pack with torso-length adjustability.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410443.png","image_url":"http://i1.avlws.com/115/l410443.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410443&tt=df","keywords":"multiday","retail_price":"179.00","sale_price":"179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410443\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410443.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=810844&amp;link=&amp;tabs=-Details\"></script>","variants":{"8108440010":{"sku":"8108440010","vendor_sku":"3374022500","size":"One Size","color":"PINE/MOSS","retail_price":"179.00","sale_price":"179.00"}}}
