{"sku":"810801","manufacturer_id":"010-00863-30","brand_name":"Garmin","product_name":"Garmin Forerunner 210 GPS Heart Rate Monitor","long_description":"The Garmin Forerunner 210 GPS heart rate monitor maintains the user-friendly features of the popular Forerunner 110 and gives you more ways to track performance to help you reach your fitness goals. Forerunner 210 includes heart rate alerts, interval training, and foot pod compatibility (foot pod sold separately) for detailed performance tracking indoors and out. Answer a few simple setup questions then just step outside, press the start button and begin your walk or run to track essential workout data-it's as easy as that! Forerunner 210 uses GPS to accurately record your speed, distance and average pace information. High-sensitivity GPS receiver stays locked onto satellites, even near tall buildings and under tree cover. Included chest-strap heart rate monitor helps you optimize performance while training. Heart rate alerts indicate when your heart rate exceeds the upper limit or falls below the lower limit of your target zone. Features advanced heart-rate-based calorie computation. Interval training function lets you set up custom exercise sessions and automatically see your pace for each interval. Wireless ANT+(TM) technology allows the Forerunner 210 to communicate with the included heart rate monitor and with the Garmin foot pod (sold separately). ANT+ technology also enables the watch to communicate with third-party equipment such as the Tanita BC-1000 scale and select fitness equipment (all sold separately). Data from each run is stored in the unit so you can go back and review how you did last week. Upload data to the Garmin Connect community website for in-depth analysis of time, speed, distance and route; store and share data with other Forerunner community users. When you aren't exercising, the Forerunner 210 can be used as a full-functioning watch that features time, calendar (day/date) and daily alarm.","short_description":"The Garmin Forerunner 210 GPS heart rate monitor maintains the user-friendly features of the popular Forerunner 110 and gives you more ways to track performance to help you reach your fitness goals.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s453335.png","image_url":"http://i1.avlws.com/115/l453335.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=453335&tt=df","keywords":"waterproof,odometer","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=453335\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m453335.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=810801&amp;link=&amp;tabs=-Details\"></script>","variants":{"8108010011":{"sku":"8108010011","vendor_sku":"010-00863-30","upc":"753759969578","color":"BLACK","retail_price":"250.00","sale_price":"250.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
