{"sku":"810969","brand_name":"Vibram","product_name":"Vibram FiveFingers KMD Sport Multisport Shoes - Women's","long_description":"Made for running and fitness, the Vibram FiveFingers KMD Sport multisport shoes supply traction, support and a snug, custom fit. Stretchy uppers hug feet and offer quick-drying comfort; breathable stretch-mesh panels keep debris and grit out. Adjustable instep and heel straps secure with rip-and-stick closures to provide a snug, supportive fit. Individual toe slots separate and encourage strengthening of toes and can enhance balance, agility and range of motion. AEGIS Microbe Shield(R) antimicrobial treatment to helps deter odors. Seamless 2mm polyurethane footbeds reduce friction underfoot; EVA arch shanks provide light support. 4mm Vibram outsoles are made of nonmarking Vibram TC1 rubber and feature traction pods that follow the contours of your feet and toes for enhanced traction. Recommended for running and fitness; in order to allow your feet to adapt to using different muscles, gradually increase usage of these shoes. Vibram FiveFingers KMD Sport multisport shoes are machine washable in cold water; air dry only. To determine size, stand with heels against a wall and measure from the wall to the tip of the longest toe; use the longest toe length in conjunction with the size chart.","short_description":"Made for running and fitness, the Vibram FiveFingers KMD Sport multisport shoes supply traction, support and a snug, custom fit.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s387303.png","image_url":"http://i1.avlws.com/115/l387303.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=387303&tt=df","retail_price":"110.00","sale_price":"54.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=387303\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m387303.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=810969&amp;link=&amp;tabs=-Details\"></script>","variants":{"8109690035":{"sku":"8109690035","upc":"847100000758","size":"38","color":"BLUE/YELLOW/GREY","retail_price":"54.83","sale_price":"54.83"}},"categories":["footwear","womens-footwear","womens-shoes"]}
