{"sku":"810956","manufacturer_id":"NIQ2-07-1WC","brand_name":"Nite Ize","product_name":" Nite Ize 1-Watt LED Upgrade II with IQ Switch Combo Kit - AA Mini Maglite","long_description":"The Nite Ize 1-Watt LED Upgrade II with IQ Switch combo kit upgrades your AA Mini Maglite flashlight, giving it 3 brightness levels, 2 strobes and convenient push-button control. Upgrade kit replaces the incandescent bulb of an AA Mini Maglite flashlight and adds a push-button on/off switch to the tail cap. Push-button IQ Switch(R) screws onto the back of the flashlight, enabling you to switch between 3 brightness levels and 2 strobe settings. 3 brightness levels include 100%, 50% and 25%; 2 strobe settings feature fast and slow flashing; hold and release the button for on-demand illumination. Super bright 1-watt replacement LED throws light up to 60m and runs for up to 6 hrs. on high with 2 AA batteries (sold separately); LED outputs 65 lumens on high. IQ switch turns the light off automatically after 14.5 min. of nonuse to help conserve battery power. Blinking LED housed inside the IQ button makes it easy to locate the flashlight in your tent, backpack or car's glove compartment. Nite Ize 1-Watt LED Upgrade II with IQ Switch combo kit is simple to install. Please note: installing a Nite Ize LED Upgrade kit or IQ switch voids the Mag Instrument(R) Limited Lifetime Warranty covering the AA Mini Maglite flashlight.","short_description":"The Nite Ize 1-Watt LED Upgrade II with IQ Switch combo kit upgrades your AA Mini Maglite flashlight, giving it 3 brightness levels, 2 strobes and convenient push-button control.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416719.png","image_url":"http://i1.avlws.com/115/l416719.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416719&tt=df","retail_price":"19.95","sale_price":"19.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416719\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416719.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=810956&amp;link=&amp;tabs=-Details\"></script>","variants":{"8109560014":{"sku":"8109560014","vendor_sku":"NIQ2-07-1WC","upc":"094664015883","retail_price":"19.95","sale_price":"19.95"}}}
