{"sku":"811092","manufacturer_id":"BSPLL11","brand_name":"Big Agnes","product_name":" Big Agnes Summit Park Sleeping Bag","long_description":"From the Big Agnes Park Series, the Summit Park high-quality down bag is geared for the big guys or campers looking for supreme comfort at base camp and while car camping. Underside insulation has been eliminated and replaced with a sleeve for a Big Agnes pad or any 25-in.-wide sleeping pad, sold separately. 600-fill-power down insulation delivers compressibility and warmth without added weight. Vertical baffle Flow Construction features internal Flow Gates-vertical chambers with internal mesh gates that keep insulation from shifting up and down. Rectangular shaped bag has a durable ripstop nylon shell with Durable Water Repellant finish and soft, down-proof nylon lining. the Summit Park +15degF sleeping bag features a down-filled collar at top; this seals around the neck to prevent warm air from escaping and cold air from entering. Large draft tube located behind the zipper prevents warm air from escaping and cold air from entering. Continuous oversize draft wedge insulates the connection between the bag and pad to prevent cold air from entering. Built-in pillow sleeve allows you to stuff in a jacket or other clothing for a stay-in-place pillow. Bag will zip to another bag with opposite zipper configuration. Interior fabric loops stabilize a sleeping bag liner, sold separately. Big Agnes Summit Park sleeping bag includes a nylon stuff sack and cotton storage bag.","short_description":"From the Big Agnes Park Series, the Summit Park high-quality down bag is geared for the big guys or campers looking for supreme comfort at base camp and while car camping.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s440771.png","image_url":"http://i1.avlws.com/115/l440771.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440771&tt=df","keywords":"compact","retail_price":"339.95","sale_price":"339.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440771\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440771.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=811092&amp;link=&amp;tabs=-Details\"></script>","variants":{"8110920017":{"sku":"8110920017","vendor_sku":"BSPLL11","upc":"873840007788","size":"Long Xwide","color":"LAKE/GRAY","retail_price":"339.95","sale_price":"339.95"}}}
