{"sku":"811097","manufacturer_id":"BHPLL11","brand_name":"Big Agnes","product_name":" Big Agnes Hog Park Sleeping Bag","long_description":"From the Big Agnes Park Series, the synthetic Hog Park sleeping bag offers big guys and campers who like a lot of space supreme comfort at base camp and during car-camping excursions. Underside insulation has been eliminated and replaced with a sleeve for a 25-in.-wide pad, sold separately. Quallofil(TM) synthetic insulation works a lot like down, with minimal bulkiness and excellent packability, yet provides warmth even when wet. Semirectangular-shape bag has a durable ripstop nylon shell with Durable Water Repellent finish and soft cotton/polyester lining. No-draft yoke collar extends down from the top of the bag, sealing around the neck to prevent warm air from escaping and cold air from entering. The Hog Park +20degF sleeping bag features a draft tube behind the zipper to prevent cold air from seeping inside. Oversized draft wedge insulates the connection between the bag and pad to prevent cold air from entering. Built-in pillow sleeve allows you to stuff in a jacket or other clothing for a stay-in-place pillow. Bag will zip to another bag with opposite zipper configuration. Interior fabric loops stabilize a sleeping bag liner, sold separately. Big Agnes Hog Park +20degF sleeping bag includes a nylon stuff sack.","short_description":"From the Big Agnes Park Series, the synthetic Hog Park sleeping bag offers big guys and campers who like a lot of space supreme comfort at base camp and during car-camping excursions.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421207.png","image_url":"http://i1.avlws.com/115/l421207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421207&tt=df","keywords":"compact","retail_price":"169.95","sale_price":"169.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=811097&amp;link=&amp;tabs=-Details\"></script>","variants":{"8110970012":{"sku":"8110970012","vendor_sku":"BHPLL11","upc":"873840007849","size":"Long Xwide","color":"COAL/RUST","retail_price":"169.95","sale_price":"169.95"}}}
