{"sku":"811012","manufacturer_id":"TFD411","brand_name":"Big Agnes","product_name":"Big Agnes Flying Diamond 4 Tent","long_description":"The Big Agnes Flying Diamond 4 is a deluxe car camping and basecamp tent that will withstand 4-season weather conditions. Now you have every reason to go camping in the snow! 1 large main door and a smaller back door allow easy access; both doors have vestibules for covered entry and storage. Front vestibule door has vertical zippers which may be staked out as a shade using trekking poles (not included). Both doors on the Flying Diamond tent body have 2 closure options: zip up the mesh only for ventilation or zip up the ripstop polyester layer for full protection. Plastic clips attach the tent body to the pole frame for a quick, convenient setup. DAC(R) poles are made from TH72M aluminum, the latest technology in lightweight tent poles with improved durability; plus, they're annodized without the use of harsh acids. Headroom and comfort are maximized through the use of a dual diameter pole system. Rainfly is made from durable ripstop polyester with an extra-thick waterproof polyurethane coating; all seams are taped with waterproof, solvent-free polyurethane tape. Mesh floor pockets help organize your gear; gear loft loops let you add your own loft, sold separately. Reflective guyline provides nighttime visibility. Briefcase-style carry bag features long shoulder straps and organizational pockets. Package also includes hook-shaped aluminum stakes.","short_description":"The Big Agnes Flying Diamond 4 is a deluxe car camping and basecamp tent that will withstand 4-season weather conditions. Now you have every reason to go camping in the snow!","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424371.png","image_url":"http://i1.avlws.com/115/l424371.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424371&tt=df","retail_price":"449.95","sale_price":"449.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424371\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424371.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=811012&amp;link=&amp;tabs=-Details\"></script>","variants":{"8110120014":{"sku":"8110120014","vendor_sku":"TFD411","upc":"873840006606","size":"4 Person","color":"RUST/CHARCOAL","retail_price":"449.95","sale_price":"449.95"}},"categories":["camping-hiking","tents","camping-tents"]}
