{"sku":"811240","manufacturer_id":"SIDE-SYS","brand_name":"Steripen","product_name":" SteriPEN Sidewinder Water Purifier","long_description":"Great for camping and emergency use, the hand-powered SteriPEN Sidewinder water purifier requires no batteries and is capable of purifying 1 liter of water in just 90 sec. Sidewinder purifier does away with pumping, chemicals, test strips, extended timekeeping and filters; leaves no aftertaste, will not clog and does not require lubrication. Sidewinder is simple to use: just fill the included 1 liter bottle with water, screw it onto the Sidewinder purifier, flip the unit over and start cranking. Small LEDs indicate when purification is complete; purifies 1 liter (32 fl. oz.) of water (cold or warm) in a minute and a half. Innovative SteriPEN system uses UV light rays instead of chemicals to purify water for drinking. Ultraviolet (UV-C) light rays safely sterilize clear water by destroying 99.99% of protozoa (including Giardia and Cryptosporidia), bacteria and even viruses. Long used by municipal water districts and bottling companies, low-level UV-C light treats water safely, and unit's light will not damage eyes or skin when used properly. SteriPEN protects you from risks that cause botulism, cholera, dysentery and typhoid, just to name a few. Operates best with clear water, but if that's not available, no worries-the SteriPEN prefilter clears particulates and debris from water. Prefilter fits the included 1 liter bottle and other water bottles with 63mm wide-mouth openings; pour source water through filter, and clean water enters bottle. SteriPEN UV lamp provides up to 8,000 treatments. Includes SteriPEN Sidewinder water purifier, prefilter, 1 liter water bottle and instruction manuals; water bottle is made with BPA-free Tritan(TM) copolyester.","short_description":"Great for camping and emergency use, the hand-powered SteriPEN Sidewinder water purifier requires no batteries and is capable of purifying 1 liter of water in just 90 sec.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426307.png","image_url":"http://i1.avlws.com/115/l426307.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426307&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426307\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426307.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=811240&amp;link=&amp;tabs=-Details\"></script>","variants":{"8112400018":{"sku":"8112400018","vendor_sku":"SIDE-SYS","upc":"899321000789","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
