{"sku":"811550","manufacturer_id":"22620611","brand_name":"Kelty","product_name":" Kelty Trekker 65 External Frame Pack","long_description":"The iconic Kelty Trekker 65 offers outstanding value. Its classic, proven design is coupled with modern adjustability and comfort features. Adjustable suspension conforms to a wide range of torso lengths. Large, top-loading pack bag sports multiple zippered pockets and a mesh water bottle pocket to organize your gear and keep it within easy reach. Adjustable suspension conforms to a range of torso lengths; tightly stretched mesh back panel, padded shoulder straps and dual density foam hipbelt offer ventilated comfort. Sternum strap, load-lifter straps and belt stabilizers help balance the load; pulleylike Scherer Cinch(TM) makes tightening your hipbelt a breeze. Separate sleeping bag compartment allows you to pack and unpack your sleeping bag without digging through the rest of your belongings. Hydration-compatible design features reservoir pocket and drink tube exit port for on-the-go hydration (reservoir sold separately). Spindrift collar cinches down over the main compartment to seal out the weather; a hold-open bar makes loading and unloading easy. Daisy chain, ice axe loop and lash tabs allow additional gear to be attached to outside of pack. The Kelty Trekker 3900 is made from lightweight, durable 420-denier ripstop and reinforced with 420-denier oxford polyester for light weight and durability.","short_description":"The iconic Kelty Trekker 65 offers outstanding value. Its classic, proven design is coupled with modern adjustability and comfort features.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410447.png","image_url":"http://i1.avlws.com/115/l410447.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410447&tt=df","keywords":"multiday","retail_price":"179.95","sale_price":"179.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410447\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410447.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=811550&amp;link=&amp;tabs=-Details\"></script>","variants":{"8115500012":{"sku":"8115500012","vendor_sku":"22620611","upc":"727880021412","size":"S/M","color":"JAVA RED","retail_price":"179.95","sale_price":"179.95"},"8115500020":{"sku":"8115500020","vendor_sku":"22620511","upc":"727880021399","size":"M/L","color":"JAVA RED","retail_price":"179.95","sale_price":"179.95"}}}
