{"sku":"811767","manufacturer_id":"61614","brand_name":"Camelbak","product_name":" CamelBak UnBottle Insulated Reservoir - 70 fl. oz.","long_description":"The BPA-free CamelBak UnBottle insulated reservoir carries hydrating fluid inside or outside your backpack. It features an updated reservoir with improved stability and quick-connect enhancements. Newly designed Antidote(TM) reservoir features a welded center baffle and low-profile shape for stability. Quick Link(TM) system lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director, flow meter or hanger (accessories sold separately). Folding arms lock into position to hold the reservoir open when drying; arms tuck out of the way around the port when not in use. CamelBak UnBottle features an air-light, wide-mouth port that cuts weight and makes it easy to fill and clean the reservoir; quick-snap cap tightens in just a quarter turn. Improved buckles secure the CamelBak UnBottle insulated reservoir to the inside or outside of your pack; adjustable loop on the top features a quick-release buckle.","short_description":"The BPA-free CamelBak UnBottle insulated reservoir carries hydrating fluid inside or outside your backpack. It features an updated reservoir with improved stability and quick-connect enhancements.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Pack Accessories","thumb_url":"http://i1.avlws.com/115/s412111.png","image_url":"http://i1.avlws.com/115/l412111.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412111&tt=df","retail_price":"45.00","sale_price":"45.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412111\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412111.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=811767&amp;link=&amp;tabs=-Details\"></script>","variants":{"8117670011":{"sku":"8117670011","vendor_sku":"61614","upc":"713852616144","size":"70 Fl Oz","color":"FROST GRAY","retail_price":"45.00","sale_price":"45.00"}}}
