{"sku":"811837","manufacturer_id":"G173","brand_name":"Vibram","product_name":" Vibram FiveFingers KSO Multisport Shoes - Kids'","long_description":"Kids can wander free and without worry in the Vibram FiveFingers KSO multisport shoes, which offer the freedom of bare feet with the grip and protection of a Vibram sole. Individual toe slots enhance dexterity, control and stability to deliver a natural walking motion. Thin, abrasion-resistant polyamide stretch fabric fits low on feet and offers quick-drying comfort; breathable stretch-mesh panels keep debris and grit out. Instep straps secure with rip-and-stick closures and are attached to thin webbing straps that wrap around heels to provide a secure, supportive fit. Footbeds feature AEGIS Microbe Shield(R) antibacterial treatment to help control odors. EVA midsoles help provide light cushioning underfoot. Vibram outsoles are designed to follow the contours of feet and toes; made of nonmarking Vibram TC1 performance rubber. Razor siping on soles provides sure grip on wet and slippery surfaces. Recommended for light trekking, climbing, canyoneering, running, fitness training, travel and most water sports. FiveFingers KSO multisport shoes may help kids feel an increased sense of balance, expanded range of motion and improved posture. In order to allow kids' feet to adapt to using different muscles, gradually increase usage of these shoes. Machine washable in cold water; air dry only. To determine size, stand with heels against a wall and measure from the wall to the tip of the longest toe; use the longest toe length in conjunction with the size chart.","short_description":"Kids can wander free and without worry in the Vibram FiveFingers KSO multisport shoes, which offer the freedom of bare feet with the grip and protection of a Vibram sole.","category":"Footwear","subcategory":"Kids' Footwear","product_group":"Kids' Shoes","thumb_url":"http://i1.avlws.com/115/s377239.png","image_url":"http://i1.avlws.com/115/l377239.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=377239&tt=df","retail_price":"60.00","sale_price":"29.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=377239\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m377239.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=811837&amp;link=&amp;tabs=-Details\"></script>","variants":{"8118370010":{"sku":"8118370010","vendor_sku":"G17432","upc":"847100001434","size":"32","color":"WHITE/PINK/BLACK","retail_price":"29.83","sale_price":"29.83"},"8118370108":{"sku":"8118370108","vendor_sku":"B176","upc":"847100001311","size":"32","color":"BLUE/GRAY","retail_price":"29.83","sale_price":"29.83"}}}
