{"sku":"811991","manufacturer_id":"CTE24001","brand_name":"Nemo","product_name":"NEMO Obi 1P Tent","long_description":"The Obi 1P tent is the black belt martial artist of the NEMO lineup. It's a finely tuned instrument, with not one ounce of material wasted; every feature and detail is driven by purpose and strategy. Subtly moving the front pole hub overhead gives the pole skeleton shoulders, creating more interior volume without the need for an additional ridge pole. Raised waterproof tub floor allows fly cutouts which save significant weight while improving ventilation. Obi 1P features a covered entrance with a generously-sized vestibule. Enjoy 21 sq. ft. of interior space at only 2 lbs. 8 oz. Hubbed pole intersections create a single-corded pole for quick and easy setup; it also allows freestanding support while minimizing total pole weight for the tent. Configure vestibule fully opened, closed or partially deployed depending on the weather. Lightweight and strong DAC(R) NSL pole system with press-fit connectors and lightweight hubs uses an anodization process without harsh acids. DAC pole clips are easy to use and more durable than standard pole clips. DAC Jake's Feet(TM) corner anchor system setup is fast and easy; when fly is attached they act as cantilevers to pull the corners of the inner tent closer to the ground. Jake's Feet also allow you to set up your fly and poles without the inner tent to create an ultralight shade or shelter; optional footprint for this setup is sold separately. A combination of venting options in the Obi 1 helps promote good air circulation. Includes reflective guyouts, inside mesh pockets and light-diffusing headlamp pocket. Average minimum weight specification is based on tent, rainfly and poles only.","short_description":"The Obi 1P tent is the black belt martial artist of the NEMO lineup. It's a finely tuned instrument, with not one ounce of material wasted; every feature and detail is driven by purpose and strategy.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423803.png","image_url":"http://i1.avlws.com/115/l423803.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423803&tt=df","retail_price":"319.95","sale_price":"319.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423803\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423803.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=811991&amp;link=&amp;tabs=-Details\"></script>","variants":{"8119910019":{"sku":"8119910019","vendor_sku":"CTE24001","upc":"814041010931","size":"1 Person","color":"BIRCH LEAF GREEN","retail_price":"319.95","sale_price":"319.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
