{"sku":"812224","manufacturer_id":"3108450925","brand_name":"Lowa","product_name":" Lowa Renegade LL Mid Hiking Boots - Men's","long_description":"Lowa Renegade LL Mid hiking boots take the successful Renegade design and up the ante with soft leather linings for exceptional in-boot comfort and fit. Water-repellent waxed nubuck leather uppers feature Cordura(R) nylon ankle bands for comfort, flexibility and protection. Derby-cut lacing fits a wide variety of foot volumes; padded and gusseted tongues relieve lace pressure while keeping out trail debris. Linings are made of glove-grade leather for an extra-supple and smooth, natural environment within boots. Contoured polyurethane midsoles with stabilizing full-length nylon shanks provide dependable cushioning, shock absorption and support. External polyurethane Monowrap(R) frame is part of the midsole and offers support while reducing weight. Lowa Renegade LL Mid hiking boots feature Vibram(R) Evo rubber outsoles to supply excellent traction on a wide variety of terrain.","short_description":"Lowa Renegade LL Mid hiking boots take the successful Renegade design and up the ante with soft leather linings for exceptional in-boot comfort and fit.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385103.png","image_url":"http://i1.avlws.com/115/l385103.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385103&tt=df","retail_price":"225.00","sale_price":"225.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385103\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385103.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=812224&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
