{"sku":"812552","manufacturer_id":"11-10031-08","brand_name":"Mountainsmith","product_name":" Mountainsmith Daylight Waistpack","long_description":"The Mountainsmith Daylight waistpack is a light and durable option for done-in-a-day adventures or as a secondary pack for backcountry and travel use. This rugged lumbar pack hugs your body for stability and comfort, and easily converts to a shoulder bag with a single shoulder strap. Patented Delta Compression System connects to hipbelt and pulls weight into the lumbar area for a stable, evenly distributed load; hipbelt tucks away when not in use. Top-loading main compartment and exterior zippered pocket with key clip organize gear; nylon mesh side pouches accommodate water bottles. Zippered interior pocket converts to a removable \"stash and dash\" pocket for carrying small essentials when you leave the waistpack behind. Bungee cord helps stabilize the load and secure an extra layer or other gear; reflective highlights increase your visibility in low light. Light, 210-denier ripstop nylon, bar tack/Hypalon(TM) and YKK(R) zippers stand up to years of heavy outdoor use. The stuffable Daylight packs down small into its own pocket; it includes a padded, removable shoulder strap for easy toting and dual carry handles for use as a briefcase.","short_description":"The Mountainsmith Daylight waistpack is a light and durable option for done-in-a-day adventures or as a secondary pack for backcountry and travel use.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Waistpacks","thumb_url":"http://i1.avlws.com/115/s412391.png","image_url":"http://i1.avlws.com/115/l412391.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412391&tt=df","retail_price":"64.95","sale_price":"64.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412391\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412391.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=812552&amp;link=&amp;tabs=-Details\"></script>","variants":{"8125520001":{"sku":"8125520001","vendor_sku":"11-10031-08","upc":"757894319618","size":"One Size","color":"CHARCOAL GRAY","retail_price":"64.95","sale_price":"64.95"}}}
