{"sku":"813516","manufacturer_id":"0140-1737","brand_name":"Sol","product_name":" SOL Hybrid 3 Survival Kit","long_description":"Carry the SOL Hybrid 3 survival kit on your backcountry adventures. It covers all the basics of outdoor safety, including first aid, survival and gear repair. Kit contains four 3 x 1 in. bandages, 2 knuckle bandages, 4 butterfly bandages, one 2 in. conforming gauze bandage and two 4 x 4 in. gauze dressings. Four 2 x 2 in. sterile gauze dressings, four 3 x 3 in. sterile gauze dressings, two 4 x 3 in. non-adherent sterile dressings and 1 pair of nitrile gloves. 11 precut and shaped moleskin pieces, 1 pair of EMT shears, 5 safety pins, 3 antiseptic wipes, 1 povidone iodine, 2 triple antibiotic ointments and 1 tincture of benzoin vial. 2 After Bite wipes, two 25mg antihistamine tablets, eight 200mg ibuprofen tablets and one 10 yd. x 0.5 in. roll of medical tape. Survival tools include 2 sheets of heavy duty aluminum foil, 1 button compass, 1 fire striker, one 2-watt LED headlamp, 1 Heatsheets survival blanket and 1 signal mirror. 1 rescue whistle, 4 pieces of nylon cord and 1 Tinder Quick fire starter. Gear repair equipment includes one 50 x 2 in. roll of duct tape, three 4 in. cable ties, three 8 in. cable ties. Contents of the SOL Hybrid 3 survival kit come packaged in a convenient bag; includes a small detachable bag so you can carry only what's needed for short trips.","short_description":"Carry the SOL Hybrid 3 survival kit on your backcountry adventures. It covers all the basics of outdoor safety, including first aid, survival and gear repair.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s420375.png","image_url":"http://i1.avlws.com/115/l420375.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=420375&tt=df","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=420375\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m420375.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=813516&amp;link=&amp;tabs=-Details\"></script>","variants":{"8135160001":{"sku":"8135160001","vendor_sku":"0140-1737","upc":"707708217371","retail_price":"59.95","sale_price":"59.95"}},"categories":["camping-hiking","health-and-safety","first-aid"]}
