{"sku":"813518","manufacturer_id":"0140-0828","brand_name":"Sol","product_name":" SOL Origin Survival Kit","long_description":"The SOL Origin(TM) survival kit fits in the palm of your hand and gives you a collection of tools you may need to survive the night. Contents are packed together in a compact, waterproof case; flip-up signal mirror, fire striker, compass and folding-blade knife are stowed on the outside of the case. Knife features a 100-decibel rescue whistle and 10-lumen LED light integrated into handle; AUS-8 steel blade holds an edge and sharpens more easily than common steel blades. Fire striker can be used with 1 hand and emits a powerful shower of sparks; small liquid compass can be removed from the case. Open the case to find a 6 ft. piece of stainless-steel wire, 1 sewing needle (size 7), 4 pieces of Tinder Quick fire starter and a 3 sq. ft. piece of heavy-duty aluminum foil. Aluminum foil can be formed into a drinking cup or can be used as a pot to boil water. Also includes 10 ft. of nylon-braided cord, 3 safety pins, 4 fish hooks (size 10), 1 piece of fishing line, 2 snap swivels (size 12) and 2 split shot lead pellets. Entire kit weights only 6.25 oz. Included lanyard lets you carry the survival kit around your neck. The SOL Origin(TM) survival kit includes instructions that feature 62 survival techniques and strategies from Buck Tilton.","short_description":"The SOL Origin(TM) survival kit fits in the palm of your hand and gives you a collection of tools you may need to survive the night.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s420379.png","image_url":"http://i1.avlws.com/115/l420379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=420379&tt=df","retail_price":"39.95","sale_price":"39.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=420379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m420379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=813518&amp;link=&amp;tabs=-Details\"></script>","variants":{"8135180001":{"sku":"8135180001","vendor_sku":"0140-0828","upc":"707708208287","retail_price":"39.95","sale_price":"39.95"}}}
