{"sku":"813623","manufacturer_id":"ZIP","brand_name":"Jetboil","product_name":"Jetboil Zip Stove","long_description":"The Jetboil Zip(TM) stove delivers the same great performance and reliability of the original Jetboil at an even better price. It's more compact and lighter weight, too! Jetboil Zip includes a 0.8-liter aluminum FluxRing(R) cooking cup with insulating cozy to keep your drinks and meals warm. Same as the original Jetboil, the stove burner and cooking cup twist together to create a single convenient cooking system; disconnect the burner and cooking cup for storage. FluxRing(R) heat exchanger on the bottom of the cooking cup creates excellent fuel efficiency; the Zip boils 0.5 liter of water in 2 min. 31 sec. Adjustable-flame burner is housed in a windscreen, reducing heat loss when a breeze picks up. Drink-through lid features a pour spout and a built-in strainer. Stove burner and 100g fuel canister (sold separately) stow inside the cup; lid snaps shut for storage. Bottom cover unsnaps from the cooking cup to double as a measuring cup or bowl; measuring cup comes in handy when preparing meals and hot drinks. Includes a stabilizer tripod that clips onto fuel canister (sold separately). Sewn-on tunnel pocket on the cozy holds your utensils or Jetboil hanging kit (sold separately). Jetboil Zip stove is compatible with all Jetboil accessories (sold separately). Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores. Because this stove system has a capacity of less than 1 liter, the average boil time specification represents the time required to do 2 separate boils of 0.5 liter of water.","short_description":"The Jetboil Zip(TM) stove delivers the same great performance and reliability of the original Jetboil at an even better price. It's more compact and lighter weight, too!","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416487.png","image_url":"http://i1.avlws.com/115/l416487.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416487&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416487\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416487.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=813623&amp;link=&amp;tabs=-Details\"></script>","variants":{"8136230001":{"sku":"8136230001","vendor_sku":"ZIP","upc":"893483000625","color":"BLACK","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","camp-kitchen","stoves"]}
