{"sku":"814263","manufacturer_id":"M26","brand_name":"Hennessy Hammock","product_name":"Hennessy Hammock Ultralite Backpacker Asym Zip Hammock","long_description":"The Hennessy Hammock Ultralight Backpacker Asym Zip solo shelter provides lightweight, inexpensive comfort for ounce-conscious hikers. And, it sets up in about 2 minutes! Fits anyone up to 6 ft. tall and weighing 200 lbs. or less. Patented asymmetric shape of hammock bed improves comfort; asymmetric shape of rainfly improves coverage. Strong #8 zipper features double sliders for easy adjustments to the hammock and mesh; entry is from the side on this Hennessy model. Integral ridgeline design holds a comfortable shape each time the hammock is set up; keeps your back straight and level when resting diagonally. No-see-um mesh canopy keeps the bugs away while allowing air circulation. Gear pocket suspended from ridgeline holds small personal items. Waterproof, asymmetric silynylon ripstop rainfly adjusts to any angle for weather protection, can be rolled up or completely removed for other use. 1200 lb. support ropes are lightweight polyester-covered Spectra(R) cord. Ultralite Backpacker Asym Zip hammock also functions as a chair/lounger or, with a pair of hiking poles, it functions as a tent. Low-impact Hennessy Hammock design requires no ground leveling, trenching or staking; webbing straps protect tree bark. Includes ripstop polyester stuff sack and setup instructions printed on the back. Complementary polyester webbing straps are provided to protect the tender bark of trees and provide greater span for the ropes.","short_description":"The Hennessy Hammock Ultralight Backpacker Asym Zip solo shelter provides lightweight, inexpensive comfort for ounce-conscious hikers. And, it sets up in about 2 minutes!","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Hammocks","thumb_url":"http://i1.avlws.com/115/s414055.png","image_url":"http://i1.avlws.com/115/l414055.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414055&tt=df","retail_price":"239.95","sale_price":"239.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414055\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414055.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=814263&amp;link=&amp;tabs=-Details\"></script>","variants":{"8142630001":{"sku":"8142630001","vendor_sku":"M26","upc":"832667211142","color":"COYOTE BROWN","retail_price":"239.95","sale_price":"239.95"}},"categories":["camping-hiking","camp-furniture","hammocks"]}
