{"sku":"814261","manufacturer_id":"M30","brand_name":"Hennessy Hammock","product_name":"Hennessy Hammock Explorer Deluxe Asym Classic Hammock","long_description":"At 10 ft. long, the Explorer Deluxe Asym Classic from Hennessy Hammock is designed for anyone under 300 lbs. or up to 7 ft. tall. This comfortable hammock sets up in about 3 minutes. Patented asymmetric shape is designed with a diagonal axis, making the hammock feel longer with a wider sweet spot of comfort. Patented, easy entry through the bottom-automatically snaps shut behind you as weight tensions the entrance; seals with VELCRO(R) brand closure. Patented integral ridgeline maintains the same comfortable shape to keep your back straight and level when resting on the diagonal. Patented \"never-tip\" center balance design eliminates instability by entering from the center instead of flipping over the side. No-see-um mesh provides excellent insect protection and ventilation, and will deflect wind to provide a calm space inside. Waterproof polyester ripstop rainfly may be tilted to any angle, rolled up above, removed or used separately; large rainfly provides good coverage. Nifty gear pocket slides on the ridgeline and stores out of sight behind your head. Suspension system includes 10 ft. long, 1800 lb. test low-stretch polyester core ropes with polyester cover. Complementary polyester straps are provided to protect the tender bark of trees and provide greater span for the ropes. Explorer Deluxe Asym Classic hammock folds into an open-air lounger/chair or can be used on the ground as a tent when paired with your hiking poles. Low-impact Hennessy Hammock design requires no ground leveling, trenching or staking; webbing straps protect tree bark. Includes ripstop polyester stuff sack and setup instructions printed on the back.","short_description":"At 10 ft. long, the Explorer Deluxe Asym Classic from Hennessy Hammock is designed for anyone under 300 lbs. or up to 7 ft. tall. This comfortable hammock sets up in about 3 minutes.","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Hammocks","thumb_url":"http://i1.avlws.com/115/s414051.png","image_url":"http://i1.avlws.com/115/l414051.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414051&tt=df","retail_price":"219.95","sale_price":"219.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414051\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414051.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=814261&amp;link=&amp;tabs=-Details\"></script>","variants":{"8142610001":{"sku":"8142610001","vendor_sku":"M30","upc":"832667334217","color":"COYOTE BROWN","retail_price":"219.95","sale_price":"219.95"}},"categories":["camping-hiking","camp-furniture","hammocks"]}
