{"sku":"815176","manufacturer_id":"F8403","brand_name":"Ortlieb","product_name":"Ortlieb Trunk Bag","long_description":"The Ortlieb Trunk bag offers robust protection against the elements and easy access to your riding essentials. Plus, it offers easy off-bike carrying thanks to the included shoulder strap. Constructed out of coated Cordura(R) nylon for exceptional protection from the elements; rated to ensure protection when immersed in water up to 1 meter deep for 3 min. TIZIP(R) zipper supplies water- and dustproof protection and offers straightforward entry to the main compartment of the trunk bag. Small internal zip pocket helps organize contents within main compartment. 2 external zippered neoprene pockets offer easy access to small neccessities; external pockets are not waterproof. Includes a padded shoulder strap for easy off-bike transportation of the trunk bag; please note: shoulder strap must be fixed and stowed away prior to riding. Reflective highlights improve nighttime visibility. Discreet loop lets you affix a rear blinky light to the Ortlieb Trunk Bag (light sold separately). Designed to fit most rear bike racks with the included adapter.","short_description":"The Ortlieb Trunk bag offers robust protection against the elements and easy access to your riding essentials. Plus, it offers easy off-bike carrying thanks to the included shoulder strap.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Panniers And On-Bike Packs","thumb_url":"http://i1.avlws.com/115/s379823.png","image_url":"http://i1.avlws.com/115/l379823.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379823&tt=df","keywords":"bags","retail_price":"145.00","sale_price":"145.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379823\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379823.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=815176&amp;link=&amp;tabs=-Details\"></script>","variants":{"8151760001":{"sku":"8151760001","vendor_sku":"F8403","color":"BLACK","retail_price":"145.00","sale_price":"145.00"}},"categories":["cycling","bike-accessories","panniers-and-onbike-packs"]}
