{"sku":"815173","manufacturer_id":"VS01-BLCK-OS","brand_name":"Showers Pass","product_name":" Showers Pass VelEau 42 Hydration System - 42 fl. oz.","long_description":"Showers Pass VelEau 42 hydration system offers 42 fl. oz. of liquid capacity, plus gear storage, in a seat-mounted design to free up your back and simplify rehydrating while on the bike! With the saddle-mounted hydration reservoir, you can meet your hydration needs without having to carry a hydration pack or be limited by bottle cage mounts (or lack thereof). Extending from the reservoir is a 47 in. tube that can be cut to fit your bike; tube is held in place against the frame with included mounts. Easy-access bite valve is connected to a retractable reel that's anchored with a strong magnet. To take a drink, simply grab the bite valve, bring it up to your mouth, drink, and then let the retracting cord and magnet re-secure bite valve-that's it! The VelEau attaches to the bike with a seat post strap and a sturdy, ratcheting strap that goes through the saddle rails, keeping the system secure. Zippered stow pocket is great for stashing a patch kit, multitool and other ride essentials. Rear-facing attachment point lets you easily affix a rear blinky light (sold separately). Wide-mouth opening makes it easy to refill the BPA-free 42 fl. oz. internal reservoir. Please note: the Showers Pass VelEau 42 hydration system is designed to fit a bike with at least 4 in. of exposed seat post and a saddle with standard rails.","short_description":"Showers Pass VelEau 42 hydration system offers 42 fl. oz. of liquid capacity, plus gear storage, in a seat-mounted design to free up your back and simplify rehydrating while on the bike!","category":"Cycling","subcategory":"Cycling Backpacks And Bags","product_group":"Cycling Hydration Packs","thumb_url":"http://i1.avlws.com/115/s390567.png","image_url":"http://i1.avlws.com/115/l390567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390567&tt=df","retail_price":"80.00","sale_price":"80.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=815173&amp;link=&amp;tabs=-Details\"></script>","variants":{"8151730001":{"sku":"8151730001","vendor_sku":"VS01-BLCK-OS","upc":"906223101992","size":"One Size","color":"BLACK","retail_price":"80.00","sale_price":"80.00"}}}
