{"sku":"815266","manufacturer_id":"MS350R","brand_name":"Motorola","product_name":"Motorola Talkabout MS350R 2-Way Radios - 2 Pack","long_description":"The waterproof Motorola Talkabout MS350R 2-way radios are by no means fairweather friends. They offer high-performance communications in all kinds of extreme outdoor situations-and they float! IP-67 waterproofness repels moisture, heavy precipitation and splashes and helps protect radios if submerged down to 1m for up to 30 min. Don't despair if your radio falls overboard; it floats and is highly visible for easy recovery. Radios feature hands-free iVOX communication, 121 privacy codes, auto squelch, quiet-talk filter, priority scan, volume control, battery meter and talk confirmation beep. 10 call tones, keypad tones, vibrate mode, keypad lock, backlight, built-in flashlight, auto power off and push-to-talk power boost make these radios user-friendly. 22 GMRS channels offer a range of up to 35 miles (per manufacturer); range is based on an unobstructed line of sight between you and another radio operator in good weather. Headset jack connectors make it easy to use the Motorola MS350R 2-way radios with your favorite Motorola audio accessories (sold separately). Sleek yet functional design fits snugly in the palm of your hand; grippy ridges on the housing help prevent slips and drops. Repeater function lets you carry your signal farther when you use built-in repeater channels 15R-22R (GMRS license and accessible repeater station needed). 11 weather channels (7 NOAA) alert you to incoming storms and dangerous conditions with local and regional broadcasts. Battery life is approximately 27 hrs. (3 AA alkaline) or 9 hrs. (NiMH rechargeable). The Motorola MS350R 2-way radios come with 2 belt clips, 1 drop-in charger, 1 charging adapter, 2 NiMH rechargeable battery packs and an emergency preparedness checklist.","short_description":"The waterproof Motorola Talkabout MS350R 2-way radios are by no means fairweather friends. They offer high-performance communications in all kinds of extreme outdoor situations-and they float!","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412695.png","image_url":"http://i1.avlws.com/115/l412695.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412695&tt=df","keywords":"walkie talkies","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412695\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412695.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=815266&amp;link=&amp;tabs=-Details\"></script>","variants":{"8152660001":{"sku":"8152660001","vendor_sku":"MS350R","upc":"843677001198","color":"YELLOW","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
