{"sku":"815584","manufacturer_id":"PTGPPCPMBK","brand_name":"Smith","product_name":" Smith Precept Polarized Photochromic Sunglasses - Men's","long_description":"The Smith Precept polarized photochromic sunglasses protect your eyes as you soak up vitamin D from the sun. Photochromic lenses automatically adjust tint according to light conditions; lenses darken in bright light and lighten when there's less light. Polarized lenses reduce 99% of visible glare for increased sharpness and decreased eye fatigue. Lightweight Techlite(TM) lenses feature high-quality borosilicate glass that is polished and chemically tempered for increased shatter resistance. Frames feature polarized photochromic copper mirror lenses to eliminate glare and enhance contrast while maintaining accuracy of color. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Frames feature spring hinges to accommodate most head sizes. Nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. 8-base-curve lenses; (the higher the number the more curved the lens-Smith features sunglasses with 6, 7, 8 and 9 base curvature). Best fits medium profiles. Smith Precept polarized photochromic sunglasses include a protective case.","short_description":"The Smith Precept polarized photochromic sunglasses protect your eyes as you soak up vitamin D from the sun.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s441723.png","image_url":"http://i1.avlws.com/115/l441723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441723&tt=df","keywords":"Cycling","retail_price":"219.00","sale_price":"219.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=815584&amp;link=&amp;tabs=-Details\"></script>","variants":{"8155840001":{"sku":"8155840001","vendor_sku":"PTGPPCPMBK","upc":"715757361891","size":"Copper Mirror","color":"BLACK","retail_price":"219.00","sale_price":"219.00"}}}
