{"sku":"815537","manufacturer_id":"90102","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors nFORM Crossover Kitchen Kit","long_description":"The GSI nFORM Crossover Kitchen kit delivers innovative solutions to make mealtime more enjoyable in the outdoors. Kit includes Pivot tongs, Pivot spoon, Pivot spatula, scraper, scrubby pad, cutting board, spicer, soap bottle, oil bottle, camp towel and a storage tote. Innovative Pivot tools rotate from stored to working position quickly and easily; tools feature reinforced handles that won't flop around. Pivot spoon includes gradations to make measuring for recipes a snap; Pivot tongs are well suited for serving salads and grabbing hot dogs off the grill. Pivot spatula features tapered edges and a serrated cutting edge to make frying, flipping and serving simple. Waterproof spice holder features 4 compartments and is easy to refill; clear copolyester resin body is lightweight and strong. Slice and dice in the backcountry with the ultralight cutting board. Use the included scraper to get your nonstick pots and pants clean; flexible rubber end helps serve up the last bits of food; hard plastic end scrapes stubborn food. 2 squeeze bottles can be used to hold cooking oil and dish soap. Scrubby pad makes cleaning quick and easy. Use the included camp towel to dry your dishes. All components of the GSI Crossover Kitchen kit fit in the lightweight tote so you can stay organized; tote features separate wet and dry compartments. Kit nests with GSI nFORM Crossover System cooksets (sold separately).","short_description":"The GSI nFORM Crossover Kitchen kit delivers innovative solutions to make mealtime more enjoyable in the outdoors.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414667.png","image_url":"http://i1.avlws.com/115/l414667.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414667&tt=df","retail_price":"37.95","sale_price":"37.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414667\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414667.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=815537&amp;link=&amp;tabs=-Details\"></script>","variants":{"8155370001":{"sku":"8155370001","vendor_sku":"90102","upc":"090497901027","retail_price":"37.95","sale_price":"37.95"}}}
