{"sku":"815582","manufacturer_id":"PTGPBRTT","brand_name":"Smith","product_name":"Smith Precept Polarized Sunglasses - Men's","long_description":"The Smith Precept polarized sunglasses feature a precise and secure fit. The performance details in the lenses provide superior eye protection from the sun's harmful rays. Polarized lenses reduce 99% of visible glare for increased sharpness and decreased eye fatigue. Lightweight Techlite(TM) lenses feature high-quality borosilicate glass that is polished and chemically tempered for increased shatter resistance. Frames feature polarized brown lenses to eliminate glare and enhance contrast while maintaining accurate color. Frames are made from lightweight nylon and a bio-plastic derived from non-GMO castor seeds, providing a resilient, consistent fit. Frames feature spring hinges to accommodate a multitude of head sizes. Anti-reflective coating on the backside of lenses eliminates sidelight reflections. Lens coating repels moisture, grease, and grime, preventing build-up and keeping your vision clear. 8-base-curve lenses; (the higher the number the more curved the lens-Smith features sunglasses with 6, 7, 8 and 9 base curvature). Nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. Best fits medium profiles. Smith Precept polarized sunglasses include a protective case.","short_description":"The Smith Precept polarized sunglasses feature a precise and secure fit. The performance details in the lenses provide superior eye protection from the sun's harmful rays.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s460063.png","image_url":"http://i1.avlws.com/115/l460063.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460063&tt=df","keywords":"Cycling","retail_price":"179.00","sale_price":"179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460063\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460063.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=815582&amp;link=&amp;tabs=-Details\"></script>","variants":{"8155820001":{"sku":"8155820001","vendor_sku":"PTGPBRTT","upc":"715757361938","size":"Brown","color":"Tort","retail_price":"179.00","sale_price":"179.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
