{"sku":"815613","manufacturer_id":"20294","brand_name":"Yepp","product_name":"Yepp Maxi Rear Bicycle Child Carrier","long_description":"Yepp Maxi Rear Bicycle child carrier securely and safely lets your child ride along with you, thanks to an innovative design and sturdy construction. Child carrier is made from perforated EVA polymer, a pliable, rubberlike material that's affixed to a sturdy tubular steel frame and backed by flexible plastic. The combination of the soft EVA over the steel frame and plastic backing gives your child a comfortable ride without sacrificing support. 5-point safety harness is made of flexible, soft tubular nylon straps to safely secure your child in the carrier; adjustable shoulder pads enhance comfort. Carrier features footrests that are easily adjusted to different heights without the use of tools. Back of carrier has 3 reflectors to enhance visibility. Affixes to a bicycle's seat tube with a sturdy adapter (included) that secures with a 4-bolt clamp. The Maxi carrier conveniently slides onto the seat tube adapter and clicks into place where it can be secured with the integrated lock (2 keys included). Child carrier should only be attached to bicycles with a frame size of 21 in. or larger; clamp fits seat tubes between 1.1 - 1.8 in. (28 - 45mm) in diameter. The Maxi is only for kids who are able to hold their head upright while wearing a bicycle helmet and can comfortably sit upright on their own. Additionally, the Yepp Maxi child carrier has an upper weight limit of 48 lbs. and should not be used on a moped or scooter.","short_description":"Yepp Maxi Rear Bicycle child carrier securely and safely lets your child ride along with you, thanks to an innovative design and sturdy construction.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Child Bike Seats","thumb_url":"http://i1.avlws.com/115/s379635.png","image_url":"http://i1.avlws.com/115/l379635.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379635&tt=df","keywords":"toddler","retail_price":"229.95","sale_price":"229.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379635\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379635.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=815613&amp;link=&amp;tabs=-Details\"></script>","variants":{"8156130002":{"sku":"8156130002","vendor_sku":"20294","color":"ORANGE","retail_price":"229.95","sale_price":"229.95"},"8156130003":{"sku":"8156130003","vendor_sku":"20292","color":"BLUE","retail_price":"229.95","sale_price":"229.95"},"8156130004":{"sku":"8156130004","vendor_sku":"20291","color":"BLACK","retail_price":"229.95","sale_price":"229.95"}},"categories":["cycling","bike-accessories","child-bike-seats"]}
