{"sku":"816068","manufacturer_id":"BUS05137","brand_name":"Novara","product_name":" Novara Randonee Bike - 2014","long_description":"Built for long miles on the pavement the Novara Randonee(R) has a smooth-riding chromoly steel frame, 30-speed drivetrain and steady wheelbase for smooth-riding journeys across town or continent. Classic touring frame accommodates fore and aft racks and fenders-rear rack provided (front rack and fenders sold separately). Reynolds 520 chromoly frame offers great stability and strength under heavy loads, and you get the reliably smooth ride quality that steel is known for. Dependable Shimano Deore LX crankset and front derailleur, along with the super-reliable SRAM bar end shifters and X7 rear derailleur, make up the 30-speed drivetrain. The SRAM X7 rear derailleur accommodates up to a 36t rear cog for an ultra-low gear option for sweet relief when tackling mountain passes with a full load. Tektro linear-pull brakes provide reliable stopping power; wide brake arm spacing allows ample room for fenders front and back. Robust Mavic A319S 36-hole rims and puncture-resistant Continental Touring Plus Reflex tires have the durability needed to log long miles; tires also have reflective sidewalls. Riveted leather saddle is contoured and padded for support and comfort during long days on the road; leather handlebar tape offers matching style and excellent longevity. Randonee's fork features a cable guide braze-on for easy upgrading to a dynamo front hub; also includes spoke holders on the drive-side chainstay. Pedals sold separately. Specs on the Novara Randonee touring bike are subject to change.","short_description":"Built for long miles on the pavement the Novara Randonee(R) has a smooth-riding chromoly steel frame, 30-speed drivetrain and steady wheelbase for smooth-riding journeys across town or continent.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374507.png","image_url":"http://i1.avlws.com/115/l374507.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374507&tt=df","retail_price":"1199.00","sale_price":"1199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374507\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374507.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=816068&amp;link=&amp;tabs=-Details\"></script>","variants":{"8160680003":{"sku":"8160680003","vendor_sku":"BUS05137","upc":"481606800032","size":"L","color":"PINON GREEN","retail_price":"1199.00","sale_price":"1199.00"},"8160680004":{"sku":"8160680004","vendor_sku":"BUS05137","upc":"481606800049","size":"XL","color":"PINON GREEN","retail_price":"1199.00","sale_price":"1199.00"}}}
