{"sku":"816103","manufacturer_id":"13268","brand_name":"Rei","product_name":"REI Pinnacle 50 Pack","long_description":"The REI Pinnacle 50 pack is ideal for overnight ascents and winter activities in the mountains. Its beefy suspension and solid design handle alpine gear with ease. Removable hipbelt and framesheet let you strip down the pack to save weight and match the needs of your adventure. Perforated shoulder strap foam allows body vapor to pass through and evaporate; molded foam back panel handles abuse and delivers comfort. Top-loading design features a floating top lid and collar closure; side-zip access allows easy retrieval of items buried deep in the pack. Internal gear loops make it easy to rack and sort climbing gear; lash points let you secure bulky gear to the pack's exterior. Hydration sleeve accommodates a reservoir (sold separately); tube port lets you route the bite valve over either shoulder. Burly front pocket stores crampons and a jacket. Wand pocket is generously sized to also store small items like gloves and hats; exterior zippered pocket also keeps small items handy. Dedicated ski-tail loops and cam-lock buckles securely hold skis. Snow-specific buckles work well with gloves and won't clog with snow.","short_description":"The REI Pinnacle 50 pack is ideal for overnight ascents and winter activities in the mountains. Its beefy suspension and solid design handle alpine gear with ease.","category":"Camping & Hiking","subcategory":"Specialized Packs","product_group":"Climbing Packs","thumb_url":"http://i1.avlws.com/115/s192135.png","image_url":"http://i1.avlws.com/115/l192135.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=192135&tt=df","keywords":"pack,back,scrambling,scrag,climb","retail_price":"159.00","sale_price":"78.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=192135\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m192135.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=816103&amp;link=&amp;tabs=-Details\"></script>","variants":{"8161030001":{"sku":"8161030001","vendor_sku":"13268","upc":"481610300016","size":"M","color":"ROCKWALL","retail_price":"78.83","sale_price":"78.83"},"8161030002":{"sku":"8161030002","vendor_sku":"13268","upc":"481610300023","size":"L","color":"ROCKWALL","retail_price":"78.83","sale_price":"78.83"}}}
