{"sku":"816632","manufacturer_id":"DSULPSPU5","brand_name":"Kokatat","product_name":" Kokatat Lightweight Gore-Tex Paddling Suit - Men's","long_description":"The lightweight Gore-Tex(R) paddling suit from Kokatat supplies splash protection for kayakers who want more comfort than neoprene wetsuits can provide. Tough nylon with Gore-Tex laminate is completely waterproof, extremely breathable and highly durable. Tough reinforcements at elbows, knees and seat boost abrasion resistance and durability. Neoprene neck gasket seals with skin to help keep water out. Elastic drawcord waist with cordlock keeps suit snugly fitted around midsection. Waterproof front-entry zipper eases dressing and relief zipper speeds pit stops. Adjustable leg and arm cuffs with rip-and-stick closures dial in the fit; arm cuffs have latex gaskets to enhance protection. Reflective highlights on front of suit enhances visibility in low light. Integrated Gore-Tex socks are more comfortable than latex gaskets and prevent water from entering suit at legs. Built for mild surface immersion; not intended to replace a full dry suit in more challenging conditions such as whitewater or very cold water. Machine or hand wash in cold water with powdered detergent; do not bleach or dry clean; store dry, hanging or loosely folded.","short_description":"The lightweight Gore-Tex(R) paddling suit from Kokatat supplies splash protection for kayakers who want more comfort than neoprene wetsuits can provide.","category":"Paddling","subcategory":"Paddling Clothing","product_group":"Dry Suits","thumb_url":"http://i1.avlws.com/115/s431495.png","image_url":"http://i1.avlws.com/115/l431495.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431495&tt=df","retail_price":"775.00","sale_price":"775.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431495\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431495.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=816632&amp;link=&amp;tabs=-Details\"></script>","variants":{"8166320007":{"sku":"8166320007","vendor_sku":"DSULPSPU4","upc":"606891039640","size":"L","color":"PUMPKIN/GRAY","retail_price":"775.00","sale_price":"775.00"}}}
