{"sku":"816751","manufacturer_id":"KKR10P104-00","brand_name":"Elie","product_name":"Elie Sound 100 XE Kayak","long_description":"An excellent all-arounder for recreational day trips, the Elie Sound 100 XE Kayak delivers great times on the water with its remarkably strong, highly maneuverable design. 10 ft. length offers excellent maneuverability, and an extended keel enhances tracking. Thermoforming process fuses together the deck and the hull under high pressure and heat to create unusually high strength and a single-piece feel. 3-layer polyethylene includes a special resin in the top layer, resulting in an unusually stiff, light and responsive watercraft with a striking appearance. Large cockpit has comfortable padding for seat, knees and thighs. Height-adjustable backrest supports your paddle stroke with noticeable flex. Large footbraces adjust to ensure a comfortable paddling position. Quick-lock hatch cover features a hinged design and locking lever. Stern bulkhead helps keep contents of hatch dry and organized. Includes a bottle holder, reflective perimeter lines, bungee storage and carry handles.","short_description":"An excellent all-arounder for recreational day trips, the Elie Sound 100 XE Kayak delivers great times on the water with its remarkably strong, highly maneuverable design.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s430555.png","image_url":"http://i1.avlws.com/115/l430555.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430555&tt=df","retail_price":"599.95","sale_price":"599.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430555\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430555.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=816751&amp;link=&amp;tabs=-Details\"></script>","variants":{"8167510001":{"sku":"8167510001","vendor_sku":"KKR10P203-00","upc":"776324526341","color":"YELLOW","retail_price":"599.95","sale_price":"599.95"}},"categories":["paddling","kayaks","recreational-kayaks"]}
