{"sku":"816755","manufacturer_id":"KJR14P601-00","brand_name":"Elie","product_name":"Elie Strait 140 XE Kayak with Rudder","long_description":"Furnished with a few comfort-enhancing extras, the Elie Strait 140 XE kayak with rudder supplies everything needed to get away from it all-except, or course, an excuse to go paddle. V-shaped, swede-form hull and extended keel help the Elie Strait 140 XE kayak glide through the water, and hard chines enhance edged turns and maneuverability. 3-layer polyethylene includes a special resin in the top layer, resulting in an unusually stiff, light and responsive watercraft. Specialized thermoforming process fuses together the deck and the hull under high pressure and heat. Soft padded seat ensures you have a fun, comfortable paddle. Backrest supports your paddle stroke with noticeable flex, and you can adjust the height to dial in the support. Padded cockpit offers comfort for your knees and thighs. Large footbraces adjust to ensure a comfortable paddling position. Extended keel enhances tracking, and cockpit-deployable rudder helps you paddle in a straight line. Day hatch behind cockpit includes a small dry bag to help protect splash-sensitive items. Quick-lock hatch covers on bow and stern hatches feature a hinged design and locking lever; to open hatch, simply slide lever to unlock cover and flip open to access gear. Bow and stern bulkheads help keep contents of hatches dry and organized. Includes a bottle holder, reflective perimeter lines, bungee storage and carry handles that fit into your hands.","short_description":"Furnished with a few comfort-enhancing extras, the Elie Strait 140 XE kayak with rudder supplies everything needed to get away from it all-except, or course, an excuse to go paddle.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s430691.png","image_url":"http://i1.avlws.com/115/l430691.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430691&tt=df","retail_price":"1099.95","sale_price":"1099.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430691\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430691.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=816755&amp;link=&amp;tabs=-Details\"></script>","variants":{"8167550001":{"sku":"8167550001","vendor_sku":"KJR14P601-00","upc":"776324518131","color":"YELLOW","retail_price":"1099.95","sale_price":"1099.95"}},"categories":["paddling","kayaks","touring-kayaks"]}
