{"sku":"816911","manufacturer_id":"93595156","brand_name":"Perception","product_name":" Perception Tribe 9.5 Sit-On-Top Kayak","long_description":"Now with a comfortable foam seat, the Perception Tribe 9.5 sit-on-top kayak transforms your local waterway into an aquatic playground for you and your family. Perfect for kids and the young at heart, the short length is stable, and the open cockpit is user-friendly, even for beginners. Versatile design performs well on flat water and slow-moving rivers, but don't hesitate to take the Tribe 9.5 into rough water and surf. Skid plate on the bottom of the hull increases durability and prolongs life of kayak. Adjustable padded seat offers ventilation and drainage, and ergonomic footbraces make for easy riding. Durable and lightweight linear polyethylene offers long-lasting use and easy care. Molded-in cup holder keeps a refreshing beverage within easy reach. Storage tankwells with bungees secure your gear fore and aft. Scupper tubes located in the seat, rear tankwell and foot area quickly drain any water that may enter the boat. Molded side handles and bow and stern carry handles ease transport to and from the water. Plenty of eyelets attach accessories to the Perception Tribe 9.5 sit-on-top kayak.","short_description":"Now with a comfortable foam seat, the Perception Tribe 9.5 sit-on-top kayak transforms your local waterway into an aquatic playground for you and your family.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s430619.png","image_url":"http://i1.avlws.com/115/l430619.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430619&tt=df","retail_price":"449.00","sale_price":"449.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430619\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430619.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=816911&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["paddling","kayaks","sitontop-kayaks"]}
