{"sku":"817249","brand_name":"Patagonia","product_name":"Patagonia Baby Reversible Tribbles Insulated Jacket - Infant/Toddler Boys'","long_description":"Furry or slick? The Patagonia Baby Reversible Tribbles insulated jacket gives you both choices! It offers light, warm protection for your little one's winter adventures. Reversible design sports a protective recycled polyester shell on one side and cuddly soft fleece on the other; compressible insulation provides added comfort and warmth. Shell fabric is treated with Durable Water Repellent for added protection from rain and snow. Baby Reversible Tribbles insulated jacket features hand pockets, raglan sleeves for mobility and elbow patches on the fleece side to increase durability. Elasticized hood, sleeves and hem seal out elements and provide a secure, protective fit. 100% recyclable through Patagonia's Common Threads Recycling Program-simply return your worn-out item to Patagonia.","short_description":"Furry or slick? The Patagonia Baby Reversible Tribbles insulated jacket gives you both choices! It offers light, warm protection for your little one's winter adventures.","category":"Kids'","subcategory":"Rainwear And Outerwear -- Infants And Toddlers","product_group":"Infants And Toddlers Insulated Parkas And Pants","thumb_url":"http://i1.avlws.com/115/s216183.png","image_url":"http://i1.avlws.com/115/l216183.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=216183&tt=df","keywords":"ski,warm,coldweather,insulate,winter","retail_price":"99.00","sale_price":"99.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=216183\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m216183.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=817249&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
