{"sku":"817505","manufacturer_id":"03-917","brand_name":"Oakley","product_name":"Oakley Flak Jacket XLJ Sunglasses","long_description":"Oakley Flak Jacket XLJ sunglasses feature a semi-rimless design that gives you wide peripheral vision. They're perfect for riding, running and everything else you do fast. Nylon frames are lightweight, stress resistant and flexible for long-term wear. Oakley Hydrophobic/Oleophobic permanent lens coating sheds sweat, rain, dust and skin oils, preventing build-up and keeping your vision clear. Optically correct, shatterproof and scratch-resistant polycarbonate lenses enhance durability. Open-edge design extends your vertical field of vision and retains peripheral clarity. Unique Oakley 3-point fit includes optical alignment for sharp, accurate vision, impact absorption for improved protection, and geometry designed to enhance peripheral view. Polished white frames come with black Iridium gray tinted lenses, which are best for extremely bright light. Reflective Iridium coating enhances optical clarity and contrast, and reduces glare in varying light conditions. Nose pads and stem sleeves are hydrophilic rubber that becomes tackier as you perspire, holding eyewear in place as you move. 2 sizes of interchangeable nosepieces are included to give you the best fit and performance. Interchangeable lenses let you adapt to any light condition (additional lenses not included). To preserve the superior optical quality, Oakley Flak Jacket XLJ sunglasses come with a specially woven, electrostatic bag for cleaning and a semirigid case for storage. XLJ = Extra lens coverage.","short_description":"Oakley Flak Jacket XLJ sunglasses feature a semi-rimless design that gives you wide peripheral vision. They're perfect for riding, running and everything else you do fast.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422903.png","image_url":"http://i1.avlws.com/115/l422903.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422903&tt=df","keywords":"Cycling","retail_price":"150.00","sale_price":"150.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422903\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422903.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=817505&amp;link=&amp;tabs=-Details\"></script>","variants":{"8175050001":{"sku":"8175050001","vendor_sku":"03-917","upc":"700285039176","size":"Black Iridium","color":"Polished White","retail_price":"150.00","sale_price":"150.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
