{"sku":"817945","manufacturer_id":"01.6410.0100","brand_name":"Old Town","product_name":" Old Town Vapor 10XT Kayak","long_description":"The Old Town Vapor 10XT kayak takes the sporty features of the Vapor series 1 step further with an electronics-friendly space and a cover for the stern day well. Relatively short hull eases transport to the water, turns readily and takes up less space in your garage than long boats. Single-layer polyethylene stands up to tough aquatic environments, offers high value and cleans up in a flash. Comfort Flex XT seat flexes with every stroke and adjusts to personalize your position in the cockpit; padding in the seat and backrest ensures daylong comfort. Padded thigh braces increase comfort in the cockpit; adjustable footbraces ensure an efficient stroke and aid in tracking. Stern day well with hinged cover stores lunch, water, a rain shell, bilge pump-anything you might want to bring along for the day. E-pad storage space with bungee cord keeps electronics such as your GPS unit or MP3 player close at hand. Features a molded paddle rest, cockpit tray and beverage holder. Bow and stern carry handles make transporting the Vapor 10XT kayak to and from the water easy.","short_description":"The Old Town Vapor 10XT kayak takes the sporty features of the Vapor series 1 step further with an electronics-friendly space and a cover for the stern day well.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s456567.png","image_url":"http://i1.avlws.com/115/l456567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456567&tt=df","retail_price":"549.95","sale_price":"549.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=817945&amp;link=&amp;tabs=-Details\"></script>","variants":{"8179450001":{"sku":"8179450001","vendor_sku":"01.6410.0100","upc":"759239284223","size":"10 Ft","color":"CLOUD","retail_price":"549.95","sale_price":"549.95"}}}
