{"sku":"818299","manufacturer_id":"47935","brand_name":"Patagonia","product_name":" Patagonia Violeta Daypack - Women's","long_description":"The Patagonia Violeta daypack is made to fit women's torsos. It offers 1 main compartment, a padded laptop sleeve, an exterior stuff pocket and plenty of small pockets for stashing goods. Sleek, single-compartment daypack is designed to fit a woman slipping through the daily flux; torso length and air-flow mesh shoulder straps are women-specific. Main compartment holds lunch, papers, books and a sweater; it has stash pockets inside for caching items. Padded sleeve holds up to a 15 in. laptop and is raised off the bottom to protect laptop from impact; sleeve secures with a buckle closure. Internal organizer contains the small stuff, a lanyard secures your keys, and dual stretch-woven pockets carry water bottles. Slip a hydration reservoir (sold separately) into the computer sleeve and route the tube through a built-in port when you're off for a day hike. Zippered microfleece-lined top pocket holds your audio device or sunglasses; exterior stash pocket keeps other items handy. Made from a tough yet supple 420-denier nylon oxford plain weave with 840-denier ballistics nylon reinforcements; fabric has a Durable Water Repellent finish. Patagonia Violeta has quilting on the front panel and an embroidered text logo.","short_description":"The Patagonia Violeta daypack is made to fit women's torsos. It offers 1 main compartment, a padded laptop sleeve, an exterior stuff pocket and plenty of small pockets for stashing goods.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s432983.png","image_url":"http://i1.avlws.com/115/l432983.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432983&tt=df","keywords":"backpack","retail_price":"69.00","sale_price":"69.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432983\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432983.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=818299&amp;link=&amp;tabs=-Details\"></script>","variants":{"8182990002":{"sku":"8182990002","vendor_sku":"47935","upc":"885657211463","color":"BLACK","retail_price":"69.00","sale_price":"69.00"},"8182990017":{"sku":"8182990017","vendor_sku":"47935","upc":"887187303212","color":"CATALAN CORAL","retail_price":"69.00","sale_price":"69.00"}},"categories":["travel","day-bags-and-packs","travel-daypacks"]}
