{"sku":"818375","manufacturer_id":"13320","brand_name":"Rei","product_name":"REI Sahara Convertible Pants with No-Sit Zips - Women's Petite","long_description":"The REI Sahara Convertible petite-size pants with No-Sit Zips feature an innovative design that makes converting from pants to shorts and back again easier than ever before! Side zippers run the full length of the lower legs; together with thigh zippers they allow quick conversions without having to sit down. They also preclude the need to slip lower legs sections over messy boots when converting from pants to shorts along a muddy trail. Color-coded thigh zippers help you easily tell the right leg from the left leg when converting back to pants. Lightweight nylon faille fabric dries quickly, resists pilling and is easy to pack away in a backpack. Fabric is treated with a Durable Water Repellent finish to repel moisture and stains. With a UPF 50+ rating, fabric provides excellent protection against harmful ultraviolet rays. Flat front waist flatters and smooths the figure; includes snap closure, belt loops and a removable webbing belt. Mesh pockets bags enhance ventilation and allow water to drain. Gusseted crotch facilitates freedom of movement for increased comfort. Topstitching throughout flattens seams and reduces abrasion. Front angle-entry pockets; right side has a hidden zip pocket inside. Zippered back pockets; pleated patch flap cargo pockets with bellows provide roomy storage space. Articulated knees provides a comfortable fit. Sahara petite pants feature a relaxed, easy fit.","short_description":"The REI Sahara Convertible petite-size pants with No-Sit Zips feature an innovative design that makes converting from pants to shorts and back again easier than ever before!","category":"Women's","subcategory":"Women's Pants","product_group":"Women's Convertible Pants","thumb_url":"http://i1.avlws.com/115/s268723.png","image_url":"http://i1.avlws.com/115/l268723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=268723&tt=df","keywords":"bottom,cargo,pant,zip off,hiking","retail_price":"64.50","sale_price":"64.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=268723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m268723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=818375&amp;link=&amp;tabs=-Details\"></script>","variants":{"8183750007":{"sku":"8183750007","vendor_sku":"13320","upc":"481837500077","size":"14 Petite","color":"NEW KHAKI","retail_price":"64.50","sale_price":"64.50"},"8183750008":{"sku":"8183750008","vendor_sku":"13320","upc":"481837500084","size":"16 Petite","color":"NEW KHAKI","retail_price":"64.50","sale_price":"64.50"},"8183750023":{"sku":"8183750023","vendor_sku":"13320","upc":"481837500237","size":"14 Petite","color":"SHALE","retail_price":"64.50","sale_price":"64.50"},"8183750024":{"sku":"8183750024","vendor_sku":"13320","upc":"481837500244","size":"16 Petite","color":"SHALE","retail_price":"64.50","sale_price":"64.50"}}}
