{"sku":"818309","manufacturer_id":"H423-26","brand_name":"Maui Jim","product_name":"Maui Jim Lighthouse Polarized Sunglasses - Men's","long_description":"The lightweight Maui Jim Lighthouse polarized sunglasses protect your eyes and enhance your view with vibrant colors and polarized technology. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Maui Jim PolarizedPlus2 lenses blocks glare and UV from all angles while managing harmful blue light and boosting colors for clarity and contrast. Lightweight and virtually shatterproof, polycarbonate lenses are 20 times more impact resistant than glass and one-third the weight. Lens coating sheds sweat, water and repels skin oils, preventing build-up and keeping your vision clear. Rootbeer frames feature bronze lenses and offer excellent contrast; perfect for low-light and for people who like a subtle bronze hue for everyday wear. Lenses feature a scratch-resistant treatment on the front and back for added durability. Extremely impact-resistant, lightweight nylon frames offer consistent fit and flexibility at any temperature. Lenses and frames are treated for use in saltwater. Anti-corrosive nickel/silver alloy hinges enhance durability. Flexible rubber nose pads prevent slippage. Maui Jim Lighthouse polarized sunglasses include a protective case and cleaning cloth.","short_description":"The lightweight Maui Jim Lighthouse polarized sunglasses protect your eyes and enhance your view with vibrant colors and polarized technology.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Casual Sunglasses","thumb_url":"http://i1.avlws.com/115/s422355.png","image_url":"http://i1.avlws.com/115/l422355.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422355&tt=df","retail_price":"159.00","sale_price":"159.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422355\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422355.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=818309&amp;link=&amp;tabs=-Details\"></script>","variants":{"8183090001":{"sku":"8183090001","vendor_sku":"H423-26","upc":"603429017392","size":"Bronze","color":"Rootbeer","retail_price":"159.00","sale_price":"159.00"},"8183090002":{"sku":"8183090002","vendor_sku":"423-02","upc":"603429017385","size":"Neutral Grey","color":"GLOSS BLACK","retail_price":"159.00","sale_price":"159.00"}},"categories":["camping-hiking","sunglasses","casual-sunglasses"]}
