{"sku":"818452","manufacturer_id":"T-I900","brand_name":"Tifosi","product_name":" Tifosi Wisp Sunglasses","long_description":"The Tifosi Wisp sunglasses are feathery light and protective. Sunglasses include multiple lenses to accommodate all your adventures, from predawn runs to cycling in the glaring sun. Featuring interchangeable lenses, each frame includes 3 sets of lenses to accommodate bright light, low-medium light and nighttime conditions. Matte black frames include smoke gray, red and clear lens sets. Race pink frames include smoke gray, red and clear lens sets. Crystal brown frames include brown gradient, red and clear lens sets. Lightweight and virtually shatterproof, polycarbonate lenses are 20 times more impact resistant than glass and one-third the weight. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Hydrophilic rubber nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. Temple ends adjust for a personaized, comfortable fit. Best fits extra small to small faces. Tifosi Wisp sunglasses include a semirigid carrying case and cleaning cloth.","short_description":"The Tifosi Wisp sunglasses are feathery light and protective. Sunglasses include multiple lenses to accommodate all your adventures, from predawn runs to cycling in the glaring sun.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422911.png","image_url":"http://i1.avlws.com/115/l422911.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422911&tt=df","keywords":"Cycling","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422911\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422911.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=818452&amp;link=&amp;tabs=-Details\"></script>","variants":{"8184520004":{"sku":"8184520004","vendor_sku":"0040104702","upc":"874444004777","size":"Brown Gradient","color":"CRYSTAL BROWN","retail_price":"59.95","sale_price":"59.95"}}}
