{"sku":"819023","manufacturer_id":"000134010404","brand_name":"Point 65","product_name":" Point 65 Martini Kayak Stern Section","long_description":"The Point 65 Martini Kayak Stern Section combines with the Martini Bow Section to form a single kayak and combines with both the Martini Center Section and Bow Section to form a tandem kayak. Innovative system joins pieces together, creating a stable, rigid kayak that you'll love to paddle in light surf, calm rivers and flatwater. Assembly happens in a flash: just align the sections, feed a strap into a ratchet, and ratchet down straps on either side of the cockpit. The Martini stands up to rough treatment thanks to a UV-resistant, single-layer polyethylene hull. Molded cockpit in bow and stern features a comfortable padded seat, foot pedals and thighbraces. Foot pedals in bow and stern control rudder to assist with tracking in adverse conditions. 17 x 10 in. rear hatch stores bulky gear, and 7.9 x 7.9 in. bow hatch is the perfect place for small day-tripping items. Bungee cords offer additional storage, and \"Fish-O-Meter\" hash marks on hull measure your catch. The Point 65 Martini kayak Includes paddle keeper, recessed water bottle holder and and molded carrying handles at bow and stern.","short_description":"The Point 65 Martini Kayak Stern Section combines with the Martini Bow Section to form a single kayak and combines with both the Martini Center Section and Bow Section to form a tandem kayak.","category":"Paddling","subcategory":"Kayaks","product_group":"Tandem Kayaks","thumb_url":"http://i1.avlws.com/115/s430675.png","image_url":"http://i1.avlws.com/115/l430675.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430675&tt=df","retail_price":"444.00","sale_price":"376.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430675\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430675.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=819023&amp;link=&amp;tabs=-Details\"></script>","variants":{"8190230001":{"sku":"8190230001","vendor_sku":"000134010404","color":"RED","retail_price":"376.93","sale_price":"376.93"}},"categories":["paddling","kayaks","tandem-kayaks"]}
