{"sku":"819317","manufacturer_id":"12020-BOBN","brand_name":"Keen","product_name":"Keen Gypsum WP Hiking Shoes - Men's","long_description":"Waterproof and nimble, the Keen Gypsum WP hiking shoes offer a lightweight platform and stout protection from the elements for excellent trail performance. Waterproof nubuck leather uppers offer ample durability, flexibility and breathability for lasting comfort on and off the trail. KEEN.DRY(TM) waterproof breathable membranes keep feet dry while allowing perspiration to dissipate before it saturates the inside of the shoe. Patented rubber Toe Guards protect feet and uppers from impacts and abrasion. Removable Metatomical EVA footbeds are shaped to provide ample cushioning and arch support; can also accommodate orthotics. Compression-molded EVA midsoles offer shock-absorption and padding for all-day comfort. External thermoplastic urethane heel stabilizers support feet on impact, dissipate shock and reduce the chance of twisting an ankle. Supportive plates provide torsional stability and protection from uneven and rocky terrain. Keen Gypsum WP hiking shoes have nonmarking rubber outsoles with aggressive 4mm multidirectional lugs to deliver durability and traction. Fit tip: runs about a 1/2 size small.","short_description":"Waterproof and nimble, the Keen Gypsum WP hiking shoes offer a lightweight platform and stout protection from the elements for excellent trail performance.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Shoes","thumb_url":"http://i1.avlws.com/115/s385643.png","image_url":"http://i1.avlws.com/115/l385643.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385643&tt=df","keywords":"trail","retail_price":"130.00","sale_price":"130.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385643\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385643.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=819317&amp;link=&amp;tabs=-Details\"></script>","variants":{"8193170006":{"sku":"8193170006","vendor_sku":"12020-BOBN","upc":"871209698998","size":"10.5","color":"BLACK OLIVE/BOSSANOVA","retail_price":"130.00","sale_price":"130.00"}},"categories":["footwear","mens-footwear","mens-shoes"]}
