{"sku":"819665","manufacturer_id":"139622-761-1-O/","brand_name":"Osprey","product_name":"Osprey Shuttle Wheeled Duffel - 22\"","long_description":"The Osprey Shuttle 22 is a sleek, carry-on size hauler that offers versatile and durable protection to your most important gear. Osprey Shuttle 22 has multiple pockets to keep small items organized, and padded foam sidewalls protect from bumps and collisions. Ergonomic retractable grab handle and 3 dedicated grab loops ensure easy hauling and lifting during all phases of your trip. Shock-absorbent polyurethane wheels roll smoothly and have a high-clearance design so they won't get caught on bumps and curbs. 16 in. wide chassis is built to be stable, lightweight and ultra durable. Main compartment is accessed by both a panel and bellows pocket opening each with lockable dual zippers (locks sold separately); interior panel divides main compartment into 2. Features 2 internal organizer pockets and compression straps. Outside pockets include a top, dual-zippered stash pocket, a top single-zip slash pocket, a full-length, vertical side zip pocket and zip front slash pocket. Osprey Shuttle 22 includes a hideaway courier bag attachment strap and a retractable business card/name tag holder. Compression strap system secures both large and small loads for increased stability; integrated strap keepers organize loose straps.","short_description":"The Osprey Shuttle 22 is a sleek, carry-on size hauler that offers versatile and durable protection to your most important gear.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433755.png","image_url":"http://i1.avlws.com/115/l433755.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433755&tt=df","retail_price":"229.95","sale_price":"229.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433755\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433755.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=819665&amp;link=&amp;tabs=-Details\"></script>","variants":{"8196650001":{"sku":"8196650001","vendor_sku":"139622-761-1-O/","upc":"877257003517","color":"JUNIPER","retail_price":"229.95","sale_price":"229.95"},"8196650002":{"sku":"8196650002","vendor_sku":"139622-549-1-O/","upc":"877257003500","color":"CHARCOAL","retail_price":"229.95","sale_price":"229.95"}},"categories":["travel","luggage","wheeled-luggage"]}
