{"sku":"821483","manufacturer_id":"L6CO3","brand_name":"Lodge","product_name":" Lodge Logic Camp Dutch Oven - 1 qt.","long_description":"Ready to use right out of the box, this 1 qt. Lodge Logic Camp Dutch oven comes with a beautiful heirloom finish that eliminates the time and effort typically required to season cast iron cookware. From BACKPACKER 2012 Editors' Choice Awards: \"For car-, horse-, and boat-camping trips, when weight is no object, nothing beats these ovens for fireside meals.\". Lodge coats the entire surface of the oven with a proprietary vegetable oil formula, then bakes the oil onto the cookware with high-temperature gas ovens. The high temperature allows the oil to penetrate deeply into the cast iron surface, creating that prized heirloom finish. Cast iron distributes heat evenly-perfect for both quick, high-heat browning and long, slow cooking. Snug-fitting lid is flanged to hold hot coals on top for baking, stewing and roasting; flip the lid over for use as a griddle. High-gauge wire bail handle can be used to hang the Dutch oven over the hearth or campfire. 3 legs let you place the Lodge Logic Dutch oven over hot coals.","short_description":"Ready to use right out of the box, this 1 qt. Lodge Logic Camp Dutch oven comes with a beautiful heirloom finish that eliminates the time and effort typically required to season cast iron cookware.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414687.png","image_url":"http://i1.avlws.com/115/l414687.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414687&tt=df","retail_price":"34.95","sale_price":"34.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414687\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414687.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=821483&amp;link=&amp;tabs=-Details\"></script>","variants":{"8214830001":{"sku":"8214830001","vendor_sku":"L6CO3","upc":"075536380605","retail_price":"34.95","sale_price":"34.95"}}}
