{"sku":"821500","manufacturer_id":"375-4-2201","brand_name":"Timbuk2","product_name":" Timbuk2 Phoenix Cycling Backpack","long_description":"Rise to the occasion and carry the day with the Timbuk2 Phoenix cycling backpack, which boasts expandable capacity and a padded laptop sleeve that secures up to a 17 in. laptop. Padded, low-profile internal laptop sleeve provides protection for up to a 17 in. laptop; sleeve is suspended above base of pack to reducing chances of damage to laptop. Access the main compartment easily via top flap or through Swing Around(TM) side access zipper, which lets you grab the laptop without having to completely remove the pack. As your carrying needs adjust, so does the Phoenix, as it can quickly expand from 1,587 cu. in. to 2,136 cu. in. when you need extra capacity. Ventilated, padded back panel and contoured, adjustable shoulder straps provide carrying comfort for heavy loads. Zippered pocket on top of the flap and front zip pocket keep tools and small essentials easily accessible; exterior U-lock pocket doubles as a water bottle pocket. Rip-and-stick loops offer additional external organizing options, including securing a helmet or your DJ headphones or yoga mat. Also includes a bottle opener on the shoulder strap and a safety flasher attachment loop (bottles and light sold separately). The Timbuk2 Phoenix cycling backpack is constructed of abrasion-, moisture- and tear-resistant ballistic nylon for exceptional durability.","short_description":"Rise to the occasion and carry the day with the Timbuk2 Phoenix cycling backpack, which boasts expandable capacity and a padded laptop sleeve that secures up to a 17 in. laptop.","category":"Cycling","subcategory":"Cycling Backpacks And Bags","product_group":"Cycling Commuter Backpacks","thumb_url":"http://i1.avlws.com/115/s390479.png","image_url":"http://i1.avlws.com/115/l390479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390479&tt=df","retail_price":"109.00","sale_price":"109.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=821500&amp;link=&amp;tabs=-Details\"></script>","variants":{"8215000001":{"sku":"8215000001","vendor_sku":"375-4-2001","upc":"631364502055","size":"One Size","color":"BLACK/BLACK/BLACK","retail_price":"109.00","sale_price":"109.00"}},"categories":["cycling","cycling-backpacks-and-bags","cycling-commuter-backpacks"]}
