{"sku":"821819","manufacturer_id":"U11001025","brand_name":"Atlas","product_name":" Atlas 1025 Snowshoes","long_description":"The Atlas 1025 snowshoes remind us that hiking need not be a 3-season pursuit! With easy-to-use features designed with comfort in mind, these snowshoes will take you where you want to go. Durable frames are crafted from 6061 aluminum to create a stiff yet lightweight chassis. Nose and tail shapes are optimized to provide a balanced platform for stable footing and to facilitate an easy, natural stride. Spring-Loaded(TM) Suspension (SLS) uses offset webbing straps to create a springy platform beneath your feet that absorbs impact and allows natural side-to-side foot flex. Heel-lift bar provides relief for tired calf muscles on steep ascents while matching slope angle for better traction. Wrapp(TM) Swift bindings cradle your feet with easy-to-cinch straps, warm EVA padding and a technical, comfortable fit. Abrasion-resistant, lightweight Nytex(TM) nylon decks stay flexible when cold and stand up to the elements for lasting use. Steel instep crampons supply sure-footed traction on icy and snowy terrain; heel cleats provide superior downhill traction and parallel side rails secure grip during traverses. The recommended load specification for Atlas 1025 snowshoes includes weight of hiker with gear.","short_description":"The Atlas 1025 snowshoes remind us that hiking need not be a 3-season pursuit! With easy-to-use features designed with comfort in mind, these snowshoes will take you where you want to go.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Men's Snowshoes","thumb_url":"http://i1.avlws.com/115/s432087.png","image_url":"http://i1.avlws.com/115/l432087.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432087&tt=df","retail_price":"199.95","sale_price":"159.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432087\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432087.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=821819&amp;link=&amp;tabs=-Details\"></script>","variants":{"8218190001":{"sku":"8218190001","vendor_sku":"U11001025","upc":"714636753543","size":"25 IN","color":"CARAMEL","retail_price":"159.93","sale_price":"159.93"}},"categories":["snow","snowshoes","mens-snowshoes"]}
