{"sku":"821818","manufacturer_id":"U11000027","brand_name":"Atlas","product_name":" Atlas 1027 Elektra Snowshoes - Women's","long_description":"The women's Atlas Elektra 1027 snowshoes make getting lost in the woods fun again, with gender-specific articulation, aggressive traction and fatique-reducing features for your comfort. Women-specific, V-shaped frames are made from sturdy 6061 aluminum and are designed to facilitate a woman's natural stride. Nose and tail shapes are optimized to provide a balanced platform for stable footing and to facilitate an easy, natural stride. Spring-Loaded(TM) Suspension (SLS) uses offset webbing straps to create a springy platform beneath your feet that absorbs impact and allows natural side-to-side foot flex. Heel-lift bar provides relief for tired calf muscles on steep ascents while matching slope angle for better traction. Wrapp(TM) Swift bindings cradle your feet with easy-to-cinch straps, warm EVA padding and a technical, comfortable fit. Abrasion-resistant, lightweight Nytex(TM) nylon decks stay flexible when cold and stand up to the elements for lasting use. Steel instep crampons supply sure-footed traction on icy and snowy terrain; heel cleats provide superior downhill traction and parallel side rails secure grip during traverses. The recommended load specification for Atlas Elektra 1027 snowshoes includes weight of hiker with gear.","short_description":"The women's Atlas Elektra 1027 snowshoes make getting lost in the woods fun again, with gender-specific articulation, aggressive traction and fatique-reducing features for your comfort.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Women's Snowshoes","thumb_url":"http://i1.avlws.com/115/s432143.png","image_url":"http://i1.avlws.com/115/l432143.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432143&tt=df","retail_price":"199.95","sale_price":"159.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432143\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432143.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=821818&amp;link=&amp;tabs=-Details\"></script>","variants":{"8218180001":{"sku":"8218180001","vendor_sku":"U11000027","upc":"714636753536","size":"27 IN","color":"PEACOCK","retail_price":"159.93","sale_price":"159.93"}}}
