{"sku":"822013","manufacturer_id":"SP140","brand_name":"Sawyer","product_name":" Sawyer Water Treatment Filter Bottle","long_description":"Fill the Sawyer Water Treatment bottle directly from a lake, stream or faucet, screw the top on and enjoy clean filtered water instantly. Hollow fiber membrane filter physically removes particles, protozoa, and bacteria down to 0.1 micron in size, including giardia, salmonella and cryptosporidia. All Sawyer water filters meet or exceed Environmental Protection Agency (EPA) recommendations for removal rates. Filter has a high flow rate and provides little resistance so you can easily squeeze water out of the bottle. Filter is fully field maintainable with the included backwash syringe to ensure a fast flow of water. Standard 63mm cap fits on other wide-mouth water bottles. Sawyer Water Treatment filter bottle comes with a Million Gallon Guarantee, essentially eliminating the need to ever have to replace the filter cartridge. Includes 32 fl. oz. bottle with cap, hollow fiber filter, backwash syringe, replacement straws, and instructions. Polyethylene bottle is 100% BPA free.","short_description":"Fill the Sawyer Water Treatment bottle directly from a lake, stream or faucet, screw the top on and enjoy clean filtered water instantly.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426319.png","image_url":"http://i1.avlws.com/115/l426319.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426319&tt=df","retail_price":"49.95","sale_price":"49.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426319\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426319.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822013&amp;link=&amp;tabs=-Details\"></script>","variants":{"8220130001":{"sku":"8220130001","vendor_sku":"SP140","upc":"050716001402","retail_price":"49.95","sale_price":"49.95"}}}
