{"sku":"822499","manufacturer_id":"X11003021","brand_name":"Tubbs","product_name":" Tubbs Frontier 21 Snowshoes - Women's","long_description":"The Tubbs Frontier 21 women's snowshoes offer gender-specific articulation, easy-to-use bindings and excellent traction for the novice snowshoer exploring flat terrain or packed trails. Lighweight, strong 6000-series aluminum frames feature an ergonomic, streamlined shape is that easy to walk in. Fit-Step(TM) frame design upturns the tail ends to help reduce strain on hip, knee and ankle joints and offer a more natural heel-to-toe transition. PVC-coated polyester deckings provide lightweight flotation and a smooth, soft texture. 180(TM)EZ binding offers simplicity and ease of use-a single buckle, coupled with an easy-to-use heel strap, secures your boots in place. Control Wings(TM) keep your heels aligned with snowshoes for optimal control. Carbon steel instep crampons rotate freely to bite into snow and let the tails drop to shed snow; heel crampons provide traction for heading down mild slopes. Recommended load specification for the Tubbs Frontier 21 women's snowshoes includes weight of hiker with gear.","short_description":"The Tubbs Frontier 21 women's snowshoes offer gender-specific articulation, easy-to-use bindings and excellent traction for the novice snowshoer exploring flat terrain or packed trails.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Women's Snowshoes","thumb_url":"http://i1.avlws.com/115/s448479.png","image_url":"http://i1.avlws.com/115/l448479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448479&tt=df","retail_price":"159.95","sale_price":"127.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822499&amp;link=&amp;tabs=-Details\"></script>","variants":{"8224990001":{"sku":"8224990001","vendor_sku":"X11003021","upc":"714636753796","size":"21 IN","color":"GRAY/TEAL","retail_price":"127.93","sale_price":"127.93"}}}
