{"sku":"822467","manufacturer_id":"127260","brand_name":"Salomon","product_name":" Salomon BBR 8.9 Skis - Men's - 2012/2013","long_description":"Designed to float in powder and carve up the corduroy, the Salomon BBR 8.9 skis bring an innovative new shape to the slopes. The Salomon BBR 8.9 skis work well if you're sticking to the groomed runs, but they are ideal if you find yourself switching between groomed runs and off-piste terrain. Full-wood core delivers direct transmission of power with precision and efficiency. Elastomer inserts placed over the front of the skis absorb vibrations, resulting in a smooth ride that softens ski-to-snow contact. Wide, surf-board inspired tips feature a very low profile rise that floats in powder and smooths out the ride in rough terrain. Tips are also shaped to reduce weight and minimize chatter when carving at high speeds. Relatively narrow waist offers a tight turning radius and enhances grip on firm snow. Narrowest part of waist is behind heels, allowing a versatile weight distribution on skis. Pintail releases out of turns easily and enhances control. Slightly raised tails let you ride backward and stick the occasional switch landing. Sandwich sidewall construction offers extremely smooth ski-to-snow contact and high adaptation to any terrain. Base or topsheet color may vary from online photo. Strong polyethylene fiber threaded between the edges of the skis increases edge strength to withstand big impacts.","short_description":"Designed to float in powder and carve up the corduroy, the Salomon BBR 8.9 skis bring an innovative new shape to the slopes.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s381915.png","image_url":"http://i1.avlws.com/115/l381915.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381915&tt=df","retail_price":"649.95","sale_price":"294.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381915\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381915.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822467&amp;link=&amp;tabs=-Details\"></script>","variants":{"8224670002":{"sku":"8224670002","vendor_sku":"127260","upc":"080694374663","size":"186 CM","color":"BLUE/BROWN","retail_price":"294.83","sale_price":"294.83"}},"categories":["snow","skis","downhill-skis"]}
