{"sku":"822425","manufacturer_id":"N391121,XS","brand_name":"Fischer","product_name":" Fischer Desire My Style Cross-Country Skis with Bindings - Women's","long_description":"Pre-mounted and ready to ride, the Fischer Desire My Style skis are a great value for intermediate female adventurers who want to ski in and out of tracks. Air channels are built into the fiberglass/wood cores to reduce weight and enable good pressure distribution when the skis are flexed. Wide Body Technology increases the width of the skis under the skier's feet, resulting in greater stability and grip. Premium Crown features less-aggressive Single Crown in the front and rear, and dual-cut Double Crown in the middle for a powerful kick with optimum glide. Sintec sintered bases feature a graphite composition for good glide; bases are tuned to be fast in most types of snow. Fischer Desire My Style skis are suitable for both in- and out-of-track skiing. No-hassle, pre-mounted NNN Touring Classic My Style auto cross-country bindings allow easy in and out and feature a full-length ridge plate for excellent control.","short_description":"Pre-mounted and ready to ride, the Fischer Desire My Style skis are a great value for intermediate female adventurers who want to ski in and out of tracks.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s381843.png","image_url":"http://i1.avlws.com/115/l381843.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381843&tt=df","retail_price":"199.95","sale_price":"79.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381843\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381843.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822425&amp;link=&amp;tabs=-Details\"></script>","variants":{"8224250004":{"sku":"8224250004","vendor_sku":"N391121,XS","size":"XS","color":"WHITE/BLUE","retail_price":"79.93","sale_price":"79.93"}},"categories":["snow","skis","crosscountry-skis"]}
