{"sku":"822449","manufacturer_id":"N30111","brand_name":"Fischer","product_name":"Fischer Luna Skate My Style NIS Skis - Women's","long_description":"The high-performance Fischer Luna Skate My Style NIS skis are specifically adapted to meet the requirements of experienced female skiers who like a fast and fun ride on the snow. Lightweight Air Core features volcanic basalt fibers instead of fiberglass to reduce weight and create a consistent flex in all temperatures. PowerEdge construction provides lateral reinforcement for edge durability and optimal power transfer. Arrow-shaped World Cup sidecut keeps the skis running flat as long as possible for excellent speed and glide. World Cup Pro graphite bases retain wax well for good glide. Speed Grinding universal stone grinding glides well in all snow conditions. Movable bindings (sold separately) click securely into Nordic Integrated System (NIS) plates; quickly adjust binding position to adapt to snow, wax or skier weight. NIS uses a factory-bonded plate, eliminating screws that can compromise the strength and integrity of skis. NIS bindings fit boots with NNN racing/touring soles; bindings do not accommodate NNN BC soles. .","short_description":"The high-performance Fischer Luna Skate My Style NIS skis are specifically adapted to meet the requirements of experienced female skiers who like a fast and fun ride on the snow.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s458795.png","image_url":"http://i1.avlws.com/115/l458795.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458795&tt=df","retail_price":"199.95","sale_price":"159.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458795\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458795.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822449&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","skis","crosscountry-skis"]}
