{"sku":"822423","manufacturer_id":"N25111","brand_name":"Fischer","product_name":" Fischer CRS Vasa NIS Skate Skis","long_description":"Enjoy the fast and fun Fischer CRS Vasa NIS skate skis on your next trip to the groomed trails. They're a good choice whether you're just learning to skate ski or have already been doing it for years. Lightweight Air Core features volcanic basalt fibers instead of fiberglass to reduce weight and create a consistent flex in all temperatures. PowerEdge construction provides lateral reinforcement for edge durability and optimal power transfer. Arrow-shaped World Cup sidecut keeps the skis running flat as long as possible for excellent speed and glide. World Cup Universal bases feature structure that is ideal for a variety of snow conditions. Fully automated Computer Flex Control process examines individual skis and matches them according to camber height, length and pressure. Movable bindings (sold separately) click securely into Nordic Integrated System (NIS) plates; quickly adjust binding position to adapt to snow, wax or skier weight. NIS uses a factory-bonded plate, eliminating screws that can compromise the strength and integrity of skis. NIS bindings fit boots with NNN racing/touring soles; bindings do not accommodate NNN BC soles. .","short_description":"Enjoy the fast and fun Fischer CRS Vasa NIS skate skis on your next trip to the groomed trails. They're a good choice whether you're just learning to skate ski or have already been doing it for years.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s381839.png","image_url":"http://i1.avlws.com/115/l381839.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381839&tt=df","retail_price":"209.95","sale_price":"149.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381839\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381839.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822423&amp;link=&amp;tabs=-Details\"></script>","variants":{"8224230001":{"sku":"8224230001","vendor_sku":"N25111","size":"177 CM","color":"YELLOW/BLACK","retail_price":"149.93","sale_price":"149.93"}},"categories":["snow","skis","crosscountry-skis"]}
