{"sku":"822405","manufacturer_id":"X11003125","brand_name":"Tubbs","product_name":" Tubbs Frontier 25 Snowshoes","long_description":"These Tubbs Frontier 25 snowshoes are great for families and first-time snowshoers alike, offering ease-of-use and great flotation for checking out local trails with packed snow. Lighweight, strong 6000-series aluminum frames feature an ergonomic, streamlined shape that makes walking easy. Fit-Step(TM) frame design upturns the tail ends to help reduce strain on hip, knee and ankle joints and offer a more natural heel-to-toe transition. PVC-coated polyester deckings provide lightweight flotation and offer a smooth, soft texture. 180(TM)EZ binding offers simplicity and ease of use-a single buckle, coupled with an easy-to-use heel strap, secures your boots in place. Control Wings(TM) keep your heels aligned with snowshoes for optimal control. Carbon steel instep crampons rotate freely to bite into snow and let the tails drop to shed snow; heel crampons provide traction for heading down mild slopes. Recommended load specification for the Tubbs Frontier 25 snowshoes includes weight of hiker with gear.","short_description":"These Tubbs Frontier 25 snowshoes are great for families and first-time snowshoers alike, offering ease-of-use and great flotation for checking out local trails with packed snow.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Men's Snowshoes","thumb_url":"http://i1.avlws.com/115/s432091.png","image_url":"http://i1.avlws.com/115/l432091.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432091&tt=df","retail_price":"159.95","sale_price":"127.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432091\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432091.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822405&amp;link=&amp;tabs=-Details\"></script>","variants":{"8224050001":{"sku":"8224050001","vendor_sku":"X11003125","upc":"714636753826","size":"25 IN","color":"TAN/BLUE","retail_price":"127.93","sale_price":"127.93"}},"categories":["snow","snowshoes","mens-snowshoes"]}
