{"sku":"822462","manufacturer_id":"127148","brand_name":"Salomon","product_name":"Salomon Lord Skis - Men's - 2011/2012","long_description":"Hard-charging, big-mountain skiers will dominate the slopes with the fun and lively Salomon Lord skis. The Salomon Lord skis work well if you're sticking to the groomed runs, but they are ideal if you find yourself switching between groomed runs and off-piste terrain. Full-wood core delivers direct transmission of power with precision and efficiency; designed for demanding skiers who require high performance. Monocoque construction uses a single-layer cap design to promote responsiveness and maneuverability. Additional layer underneath surface provides precise edge grip and efficient energy transfer from skier to snow for pulling off freeski maneuvers. Elastomer inserts placed over the edges absorb vibrations, resulting in a smooth ride that softens ski-to-snow contact. All-terrain rockered tips excel in soft snow and deliver fluid performance on hardpack; when put on edge, 95% of skis contact snow to offer precision on groomed runs. Directional twin-tip sidecut favors skiing forward, and slightly raised tails let you ride backward and stick the occasional switch landing. Strong polyethylene fiber threaded between the edges of the skis increases edge strength to withstand big impacts. Base or topsheet color may vary from online photo. Fiber reinforcement laid directly on the edges adds torsional rigidity and improves edge durability, and wide metal edges withstand big impacts and improve shock resistance.","short_description":"Hard-charging, big-mountain skiers will dominate the slopes with the fun and lively Salomon Lord skis.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s458587.png","image_url":"http://i1.avlws.com/115/l458587.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458587&tt=df","retail_price":"549.95","sale_price":"314.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458587\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458587.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822462&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","skis","downhill-skis"]}
