{"sku":"822572","manufacturer_id":"327640","brand_name":"Salomon","product_name":" Salomon Snowscape 7 Siam Cross-Country Skis with Bindings - Women's","long_description":"The stable Salomon Snowscape 7 Siam cross-country skis com premounted with bindings and are great for beginner-to-intermediate women who want to explore terrain in and out of groomed tracks. Shorter-than-traditional ski length enhances maneuverability and control; ski camber is optimized for women, working with the shorter length for excellent grip and glide. Densolite 1000 cores feature preshaped Densolite foam with a unidirectional fiberglass wrap to keep the skis light and lively. Light carving sidecut puts the narrowest point near the binding area for control while gliding and sliding. G2 Plus waxless patterns on the bases of the skis have sharp grip edges that bite into snow for good climbing performance. G1 sintered bases provide good glide in all conditions with little maintenance required. Salomon Snowscape 7 Siam cross-country skis are pre-mounted with Salomon Pilot(R) Sport Classic bindings; bindings have automatic step-in system and pole or manual step-out. Pilot system uses 2 connection points on each binding and a rigid link to enhance torsional rigidity and boost energy from every stride. Bindings are compatible with all SNS(R) Pilot classic boots (sold separately).","short_description":"The stable Salomon Snowscape 7 Siam cross-country skis com premounted with bindings and are great for beginner-to-intermediate women who want to explore terrain in and out of groomed tracks.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s381855.png","image_url":"http://i1.avlws.com/115/l381855.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381855&tt=df","retail_price":"229.95","sale_price":"160.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381855\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381855.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822572&amp;link=&amp;tabs=-Details\"></script>","variants":{"8225720005":{"sku":"8225720005","vendor_sku":"327640","upc":"080694178797","size":"173 CM","color":"WHITE/GRAY","retail_price":"160.93","sale_price":"160.93"}}}
