{"sku":"822566","manufacturer_id":"RH0WF02","brand_name":"Rossignol","product_name":"Rossignol X-Tour Escape Cross-Country Skis with NIS plates","long_description":"Find the groomed trails and enjoy a day on the snow! The Rossignol X-Tour Escape cross-country skis with NIS plates are ideal for beginner and intermediate skiers. Wood cores with air channels create a skier-friendly flex and keep the skis light and maneuverable. Active Cap construction wraps seamlessly across the top and sides of the ski for added durability and improved glide. AR Plus waxless kick zones feature patterns that are cut into the bases of the Rossignol X-Tour Escape cross-country skis for a good balance of grip and glide. Nordic Integrated System (NIS) uses a factory-bonded plate, eliminating screws that can compromise the strength and integrity of skis. Movable NIS bindings (sold separately) securely click into NIS plates; quickly adjust binding position to adapt to snow, wax or skier weight. NIS bindings fit boots with NNN racing/touring soles; bindings do not accommodate NNN BC soles.","short_description":"Find the groomed trails and enjoy a day on the snow! The Rossignol X-Tour Escape cross-country skis with NIS plates are ideal for beginner and intermediate skiers.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s461371.png","image_url":"http://i1.avlws.com/115/l461371.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461371&tt=df","retail_price":"169.95","sale_price":"69.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461371\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461371.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822566&amp;link=&amp;tabs=-Details\"></script>","variants":{"8225660001":{"sku":"8225660001","vendor_sku":"RH0WF02","size":"178 CM","color":"BLACK/GRAY","retail_price":"69.93","sale_price":"69.93"}},"categories":["snow","skis","crosscountry-skis"]}
