{"sku":"822501","manufacturer_id":"X11001021","brand_name":"Tubbs","product_name":"Tubbs Wilderness 21 Snowshoes - Women's","long_description":"The women's Tubbs Wilderness 21 snowshoes can handle any snowy trek you're game to tackle. Packed with features to boost your comfort, these snowshoes let you play all day. Lighweight, strong 6000-series aluminum frames feature an ergonomic, streamlined shape. Fit-Step(TM) frame design upturns the tail ends to help reduce strain on hip, knee and ankle joints and offer a more natural heel-to-toe transition. ActiveLift(TM) 16deg heel lifts reduce calf fatigue and Achilles tendon strain on moderately steep terrain; lifts can be easily pulled up and down with a snowshoe pole. PVC-coated polyester deckings provide lightweight flotation and offer a smooth, soft texture. Robust 180(TM) Pro bindings relieve pressure points and encourage comfort by pairing a secure heel strap and contoured, padded upper. Control Wings(TM) keep your heels aligned with snowshoes for optimal control. Bindings pivot on a shock-absorbent system that allows more natural side-to-side flex for improved comfort and traction on uneven terrain. Carbon steel instep crampons bite deeply for excellent traction in variable snow conditions; jagged teeth enhance grip on ice and packed snow. Heel crampons provide traction for added stability and downhill braking. Recommended load specification for the Tubbs Wilderness 21 snowshoes includes weight of hiker with gear.","short_description":"The women's Tubbs Wilderness 21 snowshoes can handle any snowy trek you're game to tackle. Packed with features to boost your comfort, these snowshoes let you play all day.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Women's Snowshoes","thumb_url":"http://i1.avlws.com/115/s458091.png","image_url":"http://i1.avlws.com/115/l458091.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458091&tt=df","retail_price":"199.95","sale_price":"159.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458091\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458091.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822501&amp;link=&amp;tabs=-Details\"></script>","variants":{"8225010001":{"sku":"8225010001","vendor_sku":"X11001021","upc":"714636753680","size":"21 IN","color":"CHAMPAGNE/PINK","retail_price":"159.93","sale_price":"159.93"}},"categories":["snow","snowshoes","womens-snowshoes"]}
