{"sku":"822747","manufacturer_id":"61728","brand_name":"Camelbak","product_name":"CamelBak Tycoon Hydration Snow Pack - 100 fl. oz.","long_description":"The CamelBak Tycoon(TM) hydration snow pack helps you stay hydrated in the lift-served backcountry of your local resort and features just the right amount of storage when hiking for your turns. CamelBak Tycoon carries skis diagonally or a snowboard vertically or horizontally. Main compartment holds backcountry must-haves as well as the small extras that keep you comfortable all day. Internal pockets organize backcountry cargo; pack easily carries probe, avalanche assessment equipment and other essentials. Drop-out probe pocket provides fast access to your probe in the event of an emergency; goggles pocket keeps your eyewear ready to shred. Padded waistbelt with convenience pocket supports a heavy load; harness optimizes fit and stability while you ski. Therminator(TM) harness features a pocket that's meant to store a handwarmer and prevent tube freeze-up; harness makes it easy to get to your mouthpiece. Camelbak has improved zipper placement to ease loading up the reservoir and to encourage frequent sipping. Improved reservoir features a lightweight fill port, a low-proflie design and a cap that opens and closes easily. HydroGuard(TM) technology inhibits bacterial growth on reservoir and tube surfaces (but does not protect user from disease organisms; please wash reservoir after each use). Delivery tube and bite valve run through the right shoulder strap to protect from freezing. Big Bite(TM) valve features a handy on/off switch.","short_description":"The CamelBak Tycoon(TM) hydration snow pack helps you stay hydrated in the lift-served backcountry of your local resort and features just the right amount of storage when hiking for your turns.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411699.png","image_url":"http://i1.avlws.com/115/l411699.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411699&tt=df","keywords":"day packs","retail_price":"115.00","sale_price":"91.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411699\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411699.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822747&amp;link=&amp;tabs=-Details\"></script>","variants":{"8227470001":{"sku":"8227470001","vendor_sku":"61728","upc":"713852617288","size":"One Size","color":"TOTAL ECLIPSE","retail_price":"91.93","sale_price":"91.93"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
