{"sku":"822746","manufacturer_id":"61722","brand_name":"Camelbak","product_name":" CamelBak Pit Boss Hydration Snow Pack - 100 fl. oz.","long_description":"The CamelBak Pit Boss(TM) hydration snow pack is designed for skiers who long for fresh, untracked lines, so don't limit your skiing to crowded, lift-served slopes! CamelBak Pit Boss carries skis diagonally or A-frame or a snowboard vertically or horizontally; external pocket stows a shovel. Drop-out probe pocket provides fast access to your probe in the event of an emergency; goggles pocket keeps your eyewear ready to shred. Specially designed zipper offers access to gear without having to remove your skis or board; zipper also opens pack along the side to provide wide-open access to contents. Main compartment holds backcountry must-haves as well as the small extras that keep you comfortable all day. Internal pockets organize backcountry cargo; pack easily carries probe, avalanche assessment equipment and other essentials. Padded waistbelt with convenience pocket supports a heavy load; harness optimizes fit and stability while you ski. The CamelBak Pit Boss hydration ski pack features a helmet carry loop that makes it easy to stash your helmet while hiking. Therminator(TM) harness features a pocket that's meant to store a hand warmer and prevent tube freeze-up; harness makes it easy to get to your mouthpiece. Camelbak has improved zipper placement to ease loading up the reservoir and to encourage frequent sipping. Improved reservoir features a lightweight fill port, a low-proflie design and a cap that opens and closes easily. HydroGuard(TM) technology inhibits bacterial growth on reservoir and tube surfaces (but does not protect user from disease organisms; please wash reservoir after each use). Delivery tube and bite valve run through the right shoulder strap to protect from freezing. Big Bite(TM) valve features a handy on/off switch.","short_description":"The CamelBak Pit Boss(TM) hydration snow pack is designed for skiers who long for fresh, untracked lines, so don't limit your skiing to crowded, lift-served slopes!","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411695.png","image_url":"http://i1.avlws.com/115/l411695.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411695&tt=df","keywords":"day packs","retail_price":"140.00","sale_price":"111.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411695\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411695.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822746&amp;link=&amp;tabs=-Details\"></script>","variants":{"8227460001":{"sku":"8227460001","vendor_sku":"61722","upc":"713852617226","size":"One Size","color":"BLACK","retail_price":"111.93","sale_price":"111.93"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
