{"sku":"822997","manufacturer_id":"3362-49","brand_name":"Transpack","product_name":" Transpack XTWS Ski/Snowboard Boot Backpack - Women's","long_description":"The Transpack XTW Boot backpack is perfect for transporting your gear to the slopes in style and comfort. XTW carries your boots, helmet and other personal gear. Isosceles Storage System(TM) carries boots, helmet and other gear; 2 side pockets hold boots and surround a large central compartment that accommodates a helmet and more. The weight and bulk from your boots are diverted to the sides, away from your back, to create a natural suspension that is ergonomic and comfortable. Boot pockets feature air and water drainage grommets that allow moisture vapor to escape. Adjustable, neoprene-padded shoulder straps ensure comfortable carrying. Store personal items in the internal zipper pocket. Includes ripstop mesh side pockets and zippered lid pocket. Self-repairing nylon coil zippers: the slider repairs a malfunctioning zipper when slid from end to end. Transpack XTW boot backpack is made from durable 600-denier, water-resistant coated polyester with a water-resistant tarpaulin bottom.","short_description":"The Transpack XTW Boot backpack is perfect for transporting your gear to the slopes in style and comfort. XTW carries your boots, helmet and other personal gear.","category":"Snowboarding","subcategory":"Snowboard Packs And Bags","product_group":"Snowboard Boot Bags","thumb_url":"http://i1.avlws.com/115/s381415.png","image_url":"http://i1.avlws.com/115/l381415.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381415&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381415\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381415.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=822997&amp;link=&amp;tabs=-Details\"></script>","variants":{"8229970001":{"sku":"8229970001","vendor_sku":"3362-49","upc":"607799004426","color":"WHITE FLORAL","retail_price":"79.95","sale_price":"79.95"}}}
