{"sku":"823051","manufacturer_id":"05081500 833","brand_name":"Nordica","product_name":" Nordica Ace of Spades Team Ski Boots - Juniors' - 2011/2012","long_description":"The juniors' Nordica Ace of Spades Team ski boots offers the shock-absorbent comfort of adult boots in a size that's perfect for up-and-coming shredders. The Nordica Ace of Spades Team ski boots feature a 3-piece shell construction that makes it easy to get feet into boots. Shock-absorbent technology helps them hone their park-and-pipe skills while enjoying comfort. Additional padding in the tongues and cuffs absorbs shock and damps vibrations, making the ride smooth and easy. Kids' liners feature soft padding and a warm fleece lining. Loop on tongues aids in putting the boots on and taking them off. 3-buckle closures offer solid leverage to ensure the best possible wrappings of the feet; instep retention promotes safe and comfortable landings. All 3 aluminum buckles are microadjustable, so young skiers can dial in the fit for comfort and performance. 30mm cuff straps act as a fourth buckle, letting the user adjust tightness around the upper ankle. Flex index of 80 offers resistance appropriate for young skiers.","short_description":"The juniors' Nordica Ace of Spades Team ski boots offers the shock-absorbent comfort of adult boots in a size that's perfect for up-and-coming shredders.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s456895.png","image_url":"http://i1.avlws.com/115/l456895.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456895&tt=df","keywords":"jstp7615","retail_price":"249.00","sale_price":"149.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456895\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456895.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823051&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","downhill-ski-boots"]}
