{"sku":"823019","manufacturer_id":"VN-0NFFBA2","brand_name":"Vans","product_name":"Vans Aura Double Boa Snowboard Boots - Women's - 2011/2012","long_description":"Vans Aura Double Boa snowboard boots deliver a forgiving flex and lightweight construction. Classic styling, impact-absorbing soles and the zonal Boa closure system bring joy to your ride! Double Boa(R) lacing system allows the upper and lower zones to tighten independently of each other providing greater freedom of flex and articulation. Boa lacing offers on-the-fly micro adjustments and never comes untied; you get quick on and off, and consistent closure without pressure points. 3D-molded tongues are shaped to wrap shins, ankles and insteps for a seamless and kink-free flex. Vanslite soles feature a 1-piece, injected-molded EVA midsole/bottom unit with strategically placed rubber in high-wear areas for enhanced board feel and response. 3/4-wrap heel clips stabilize feet and increase torsional rigidity to enhance turning response and prevent twisting. Impact-absorbing damping technology in heels further cushions hard landings. Trifit X thermal-formable liners with asymmetric heel-holding inserts feature closed-seam fleece upper cuffs, comfort flex toe boxes and low-volume soles. Open-cell foam interior cushioning layer adds plush comfort. Internal web harness and lace locks boost heel hold, holding feet securely for increased comfort and response. Molded EVA high-rebound footbeds feature integrated arch support, anatomically placed dual-density metatarsal and heel impact-relief pads, and antimicrobial linings.","short_description":"Vans Aura Double Boa snowboard boots deliver a forgiving flex and lightweight construction. Classic styling, impact-absorbing soles and the zonal Boa closure system bring joy to your ride!","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Women's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s457291.png","image_url":"http://i1.avlws.com/115/l457291.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457291&tt=df","retail_price":"239.95","sale_price":"117.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457291\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457291.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823019&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboard-boots","womens-snowboard-boots"]}
