{"sku":"823013","manufacturer_id":"VN-0NF0Y61","brand_name":"Vans","product_name":" Vans Matlock Boa Snowboard Boots - 2011/2012","long_description":"Strap on the Vans Matlock snowboard boots and dial up the ultimate in freestyle versatility. Powerful top cuff closures and Boa(R) lacing from insteps down give quick and easy zonal adjustability. Side-mounted Boa lacing system provides closure to the forefoot and critical ankle/instep areas for a dialed-in fit that won't loosen up. Upper cuff power straps let you adjust tension and closure to the uppers at will; closure configuration provides quick, easy zonal closure and adjustability. Trifit X thermal formable liners with asymmetric heel-holding inserts feature closed-seam fleece upper cuffs, comfort flex toe boxes and low-volume soles. Open-cell foam interior cushioning layer adds plush comfort. Center tongue construction and internal web harnesses pad and secure feet down for controlled riding. Antimicrobial molded footbeds feature integrated arch support and anatomically placed, dual-density metatarsal and heel relief pads. Skate-influenced, low-profile outsoles offer lightweight performance; aggressive tacky rubber perimeter lugs provide high traction in wet and slippery slop. Internal power plates increase turning response; impact-absorbing heel cassettes damp vibrations.","short_description":"Strap on the Vans Matlock snowboard boots and dial up the ultimate in freestyle versatility. Powerful top cuff closures and Boa(R) lacing from insteps down give quick and easy zonal adjustability.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s454011.png","image_url":"http://i1.avlws.com/115/l454011.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454011&tt=df","retail_price":"199.95","sale_price":"92.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454011\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454011.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823013&amp;link=&amp;tabs=-Details\"></script>","variants":{"8230130002":{"sku":"8230130002","vendor_sku":"VN-0NF0Y61","upc":"637439421887","size":"8.5","color":"BLACK/BLUE","retail_price":"92.83","sale_price":"92.83"}}}
