{"sku":"823048","manufacturer_id":"05024900 6Z7","brand_name":"Nordica","product_name":" Nordica Hot Rod XW Ski Boots - Women's - 2011/2012","long_description":"Have a blast carving up the slopes with the women's Nordica Hot Rod XW ski boots-available only at REI! As compared to men's liners, women-specific liners feature extra padding in the tongue, more insulation throughout and a contoured top edge designed to fit women's calves. Dual-density plastic maximizes ease of entry regardless of temperature; even if you have high insteps, getting your foot in the boot is hassle free. Shock-absorbent technology of the Hot Rod 80 X boots help you push your limits and hone your skills while maintaining comfort. Additional padding in the tongue and cuff absorbs shock and damps vibrations, making your ride smooth and easy. Quilted liners provide a personalized fit when custom molded; the liners of the Hot Rod 80 XW include additional, custom-moldable padding to ensure a precision fit. Shock-absorbent toe boxes pad the front of your feet, reducing painful toe bang. Anatomically shaped footbeds with contoured arches and heel cups optimize foot position and provide responsive performance. Offering a comfortable fit from your instep to your calf, 4 microadjustable buckles precisely dial in the pressure. Top buckles make it easy to engage and close the top portion of the boot: a sliding cam shifts the point of leverage while closing the buckle, reducing effort. 45mm cuff strap acts as a fifth buckle, allowing you to set the firmness around the upper ankle to favor comfort or performance. If pressure becomes too great along the back of the calf, simply adjust the shock-absorbent rear spoiler to fine-tune your comfort. Single canting adjustment on lateral side of boot personalizes fit. Flex adjustment on spine decreases flex index by 10 if desired. With a flex index of 70 - 80, the Nordica Hot Rod XW ski boots provide medium resistance against a forward lean, appropriate for most female intermediate skiers.","short_description":"Have a blast carving up the slopes with the women's Nordica Hot Rod XW ski boots-available only at REI!","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s447787.png","image_url":"http://i1.avlws.com/115/l447787.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=447787&tt=df","retail_price":"399.00","sale_price":"199.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=447787\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m447787.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823048&amp;link=&amp;tabs=-Details\"></script>","variants":{"8230480001":{"sku":"8230480001","vendor_sku":"05024900 6Z7","upc":"885315068644","size":"Mondo 23.5","color":"TRUE SILVER/BLACK","retail_price":"199.83","sale_price":"199.83"}}}
