{"sku":"823101","manufacturer_id":"EMGF2B216","brand_name":"Giustaforza","product_name":" Effetto Mariposa Giustaforza II Deluxe Torque Wrench Kit","long_description":"The Giustaforza II Deluxe torque wrench kit supplies a precise torque range of 2 - 16 Nm for working on sensitive bike components, especially carbon. Great for the smaller, more-sensitive screws and bolts on your bike, such as the binding and clamping bolts for handlebars, seatpost clamps, chain rings and more. User-friendly design makes setting the torque simple and intuitive with a twist of the adjustment knob; makes an audible \"click\" when one reaches the desired torque setting. Offers a torque range of 2-16 Nm (17.70 in. lbs. - 141.62 in. lbs.) with graduated 0.5 Nm increments. Rounded head facilitates easy access to hard-to-reach bolts in tight spaces. Kit comes in its own aluminum case and includes 13 bits: 2, 2.5, 3, 4, 5, 6, T10, T15, T20, T25, T30, 3/16 flat head, PH1 Phillips head and an extender. Body of wrench is constructed out of lightweight aluminum while the adjustment knob and bit holder are made of sturdy steel for excellent durability. Torque accuracy of +/-4% is guaranteed for 5,000 clicks (torque applications). Each Giustaforza II Deluxe torque wrench has its own unique serial number. Please note: it is recommended that you always return the torque setting back to 2 Nm when the wrench is not in use, helping to ensure long-term accuracy.","short_description":"The Giustaforza II Deluxe torque wrench kit supplies a precise torque range of 2 - 16 Nm for working on sensitive bike components, especially carbon.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Tools And Maintenance","thumb_url":"http://i1.avlws.com/115/s379447.png","image_url":"http://i1.avlws.com/115/l379447.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379447&tt=df","retail_price":"185.00","sale_price":"185.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379447\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379447.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823101&amp;link=&amp;tabs=-Details\"></script>","variants":{"8231010001":{"sku":"8231010001","vendor_sku":"EMGF2B216","color":"BLACK","retail_price":"185.00","sale_price":"185.00"}},"categories":["cycling","bike-accessories","bike-tools-and-maintenance"]}
