{"sku":"823100","manufacturer_id":"EMGF2PB216","brand_name":"Giustaforza","product_name":" Giustaforza II Professional Ratchet Torque Wrench Kit","long_description":"With precision and ease, the Giustaforza Professional Ratchet torque wrench kit offers controlled wrenching force for use with many of the smaller clamping bolts and screws used on bicycles. Great for the smaller, more-sensitive screws and bolts on your bike, such as the binding and clamping bolts for handlebars, seatpost clamps, chain rings and more. User-friendly design makes setting the torque simple and intuitive with a twist of the adjustment knob; makes an audible \"click\" when one reaches the desired torque setting. Offers a torque range of 2-16 Nm (17.70 in. lbs. - 141.62 in. lbs.) with graduated 0.5 Nm increments. Rounded, ratcheting head facilitates easy access to hard-to-reach bolts in tight spaces. Kit comes in its own aluminum case and includes 13 bits: 2, 2.5, 3, 4, 5, 6, T10, T15, T20, T25, T30, 3/16 flat head, PH1 Phillips head, extender and coupler. Body of wrench is constructed out of red anodized aluminum while the adjustment knob and bit holder are made of sturdy steel for excellent durability. Torque accuracy of +/-4% is guaranteed for 5,000 clicks (torque applications). Each Giustaforza II Professional Ratchet torque wrench has its own unique serial number; 1st recalibration is free. Please note: it is recommended that you always return the torque setting back to 2 Nm when the wrench is not in use, helping ensure long-term accuracy.","short_description":"With precision and ease, the Giustaforza Professional Ratchet torque wrench kit offers controlled wrenching force for use with many of the smaller clamping bolts and screws used on bicycles.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Tools And Maintenance","thumb_url":"http://i1.avlws.com/115/s379443.png","image_url":"http://i1.avlws.com/115/l379443.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379443&tt=df","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379443\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379443.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823100&amp;link=&amp;tabs=-Details\"></script>","variants":{"8231000001":{"sku":"8231000001","vendor_sku":"EMGF2PB216","color":"RED","retail_price":"250.00","sale_price":"250.00"}},"categories":["cycling","bike-accessories","bike-tools-and-maintenance"]}
