{"sku":"823297","manufacturer_id":"S11300179","brand_name":"K2","product_name":"K2 Pon2oon Skis - Men's - 2012/2013","long_description":"Inspired by Shane McConkey, the updated super-fat K2 Pon2oons will keep you afloat when the snow's so deep you wish you had a snorkel. Straight skinny skis are a thing of the past! Perfect for the days when the sky opens up and dumps fresh powder, these skis will also work well when you're hiking for your turns. Fir-and-aspen core produces a natural flex, allowing the ski to achieve full contact with the snow throughout the turn. Torsion Box design utilizes a Triaxial-braided wood core to create a high degree of rebound and performance. Triaxial braiding wraps an interlocking fiberglass weave around the wood core providing torsional stiffness. Powder Rocker offers unparalleled performance in deep and soft snow, offering a surf-like feel; camber under foot for edge hold in firm conditions. Powder-specific sidecut tapers from a massive 157mm in the tip to 132mm in the waist and 122mm in the tail (179cm length)-now that's fat! Dimensions of the Pon2oon increase as the ski gets longer, maxing out at 134mm under foot in the 189cm length. A touch of standard sidecut underfoot gives you control and stability to navigate your way back to the trailhead, heli, cat or lift. Asymmetrical graphics line up to inspire flight while you pilot these big boys down the mountain. Requires bindings with wide brakes. K2 recommends using the Pon2oon skis for 90% soft snow and 10% variable snow. Base or topsheet color may vary from online photo.","short_description":"Inspired by Shane McConkey, the updated super-fat K2 Pon2oons will keep you afloat when the snow's so deep you wish you had a snorkel. Straight skinny skis are a thing of the past!","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s461375.png","image_url":"http://i1.avlws.com/115/l461375.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461375&tt=df","retail_price":"699.95","sale_price":"419.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461375\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461375.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823297&amp;link=&amp;tabs=-Details\"></script>","variants":{"8232970002":{"sku":"8232970002","vendor_sku":"S11300179","upc":"714636828258","size":"179 CM","retail_price":"419.93","sale_price":"419.93"}},"categories":["snow","skis","downhill-skis"]}
