{"sku":"823752","manufacturer_id":"12040/501","brand_name":"Scarpa","product_name":" Scarpa Maestrale Randonee Boots - Men's - 2011/2012","long_description":"The folks at Scarpa tell us the Maestrale is the world's lightest 4-buckle randonee boot. We haven't weighed every boot ever made, but at only 3,032g (6 lbs. 10 oz.) per pair, it's easy to believe. The Maestrale boots are perfect for backcountry tours that involve miles of hiking and skinning to reach fresh tracks off the summit of an alpine peak. Boots feature lightweight Pebax Rnew(R) plastic that is made from castor plant oil rather than petroleum as most plastics are. Pebax Rnew performs exceptionally well across a wide range of temperatures, ensuring consistent flex, strength and stability. Shell design combines the best of both the overlap and cabrio constructions to allow easy entry/exit, excellent volume control and strong support for downhill performance. Touring-style Intuition Pro Flex liners use 100% Ultralon(R) foam for a custom fit; liners offer good range of motion yet provide support with stiff tongues for the descent. Tongue-style liners (as opposed to a wrap-style liners) provide easy entry and comfortable flex through the shins when touring. See an REI ski shop professional to have the liners custom molded to your feet to maximize comfort and performance. Boots are compatible with all randonee bindings; tech fittings at the toes of the boots accept Dynafit-style bindings. Tech fittings have grooves that make getting into Dynafit-style bindings easy; fitting indicators can be seen from above to help you line the boot toes up with the bindings. 4 magnesium buckles are strong and light; asymmetric tongues transfer power precisely. Wide rip-and-stick power straps wrap securely around the outside of the cuffs, distributing pressure and bringing the cuffs as close as possible your lower legs. Rear ski/walk mechanisms free the cuffs for walking comfort; flip the switches to ski mode and you can lock the cuffs at 18deg or 22deg of forward lean.","short_description":"The folks at Scarpa tell us the Maestrale is the world's lightest 4-buckle randonee boot. We haven't weighed every boot ever made, but at only 3,032g (6 lbs. 10 oz.) per pair, it's easy to believe.","category":"Skiing","subcategory":"Ski Boots","product_group":"Randonee Ski Boots","thumb_url":"http://i1.avlws.com/115/s382707.png","image_url":"http://i1.avlws.com/115/l382707.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382707&tt=df","retail_price":"599.00","sale_price":"479.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382707\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382707.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823752&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","randonee-ski-boots"]}
