{"sku":"823973","manufacturer_id":"B11514192","brand_name":"K2","product_name":" K2 Yeah Yeah Snowboard Bindings - Women's - 2011/2012","long_description":"K2 Yeah Yeah bindings feature women-specific Tweakback highbacks. With a soft, forgiving flex and just the right amount of support you'll easily find your own tweaked-out style. Tweakback highbacks are made from a pliable urethane and designed for maximum freestyle flexibility; stable and supportive when engaged, loose and bendy when you get grabby. Highbacks have a smooth, asymmetric flex for comfort and efficient power transfer. Highback/heel cup design eliminates gap between boots and highbacks, ensuring a snug union between you and your board. Laid-back forward lean; maximum forward lean is achieved by an increased range of tool-free adjustment. Chassis feature a lightweight 1-piece design with fiberglass-reinforced nylon and a women-specific dialed-in flex; EVA baseplate covers add comfort and prevent snow buildup. Yeah Yeah bindings feature tool-free adjustable power ramps with multi-compatible discs and pop-top disc covers. Caddi ankle straps feature a contoured 3D shape for free-flexing mobility and durable EVA padding for a cushioned fit; tool-free centering adjustment. Hinge-mounted straps provide easy entry and exit from the bindings by allowing the ankle straps to move freely away from the footbeds. Cored toe straps save weight and provide a super-snug fit over the toes of your boots; easy, tool-free centering adjustment. Lightweight aluminum ratchets secure over the toes and provide on-the-fly strap adjustability; lift release for smooth and speedy exit.","short_description":"K2 Yeah Yeah bindings feature women-specific Tweakback highbacks. With a soft, forgiving flex and just the right amount of support you'll easily find your own tweaked-out style.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382947.png","image_url":"http://i1.avlws.com/115/l382947.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382947&tt=df","retail_price":"169.95","sale_price":"84.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382947\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382947.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823973&amp;link=&amp;tabs=-Details\"></script>","variants":{"8239730001":{"sku":"8239730001","vendor_sku":"B11514192","upc":"714636797691","size":"S","color":"BLACK","retail_price":"84.83","sale_price":"84.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
