{"sku":"823972","manufacturer_id":"B11515192","brand_name":"K2","product_name":"K2 Cassette Snowboard Bindings - Women's - 2011/2012","long_description":"K2 Cassette snowboard bindings spotlight personalized fit and function in a smooth and responsive package. Braving the trees or conquering the park, these bindings just want to have fun. Flare-frame asymmetric highbacks follow a woman's natural leg contours, provide great heel-side response and have a forgiving side-to-side flex; EVA calf pads add comfort. A-Line chassis feature a lightweight, 1-piece design with fiberglass-reinforced nylon; Cassette bindings feature a women-specific, dialed-in flex. Baseplates feature seamless EVA covers with polycarbonate support frames that prevent snow buildup. Tool-free power ramps adjust toe-side response. Caddi ankle traps feature a 3D shape with a narrow waist and thin construction for free-flexing mobility; durable EVA padding cushions the fit. Cored toe straps save weight and provide a super-snug fit over the toes of your boots; straps offer easy, tool-free centering adjustment. Lightweight Speed Ratchets feature an easy-feeding tapered ladder opening for fast entry; hinged mounts move the ankle straps away from the bindings for clean entry and exit. Cassette bindings feature a laid-back forward lean; increased range of adjustment offers many angles to choose from.","short_description":"K2 Cassette snowboard bindings spotlight personalized fit and function in a smooth and responsive package. Braving the trees or conquering the park, these bindings just want to have fun.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s457719.png","image_url":"http://i1.avlws.com/115/l457719.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457719&tt=df","retail_price":"149.95","sale_price":"63.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457719\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457719.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=823972&amp;link=&amp;tabs=-Details\"></script>","variants":{"8239720001":{"sku":"8239720001","vendor_sku":"B11515192","upc":"714636797738","size":"S","color":"BLACK","retail_price":"63.83","sale_price":"63.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
