{"sku":"824382","manufacturer_id":"561134","brand_name":"Granite Gear","product_name":"Granite Gear Nimbus Trace 62 Pack","long_description":"The Granite Gear Nimbus Trace 62 pack combines key elements of the award-winning Ozone pack with a removable floating lid, cooling back panel, 50 lb. capacity and a bevy of exterior pockets. TopoFlex frame mimics your back's natural curve; padded, pre-curved hipbelt and shoulder straps offer freedom of movement and let you comfortably distribute pack weight. Single pivot point on the harness provides freedom of movement; torso length adjustability fits a range of body sizes. Advection back panel lets air flow through, moving heat and moisture out while maintaining contact and following the topography of your back. Floating lid can be removed and used as a waistpack for short forays away from camp. Hydration-compatible design accommodates a reservoir and drink tube (sold separately). Arched Lineloc compression cords saves weight compared to traditional webbing and cinches the load down to the sides, top and bottom. Upper zippered side pockets, lower stretch mesh side pockets and a center lateral stretch mesh pocket offer plenty of organization options. The Granite Gear Nimbus Trace 62 pack is made of 70-denier ripstop and 210-denier Cordura(R) nylon.","short_description":"The Granite Gear Nimbus Trace 62 pack combines key elements of the award-winning Ozone pack with a removable floating lid, cooling back panel, 50 lb. capacity and a bevy of exterior pockets.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410459.png","image_url":"http://i1.avlws.com/115/l410459.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410459&tt=df","keywords":"multiday","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410459\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410459.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=824382&amp;link=&amp;tabs=-Details\"></script>","variants":{"8243820001":{"sku":"8243820001","vendor_sku":"561134","upc":"782922561134","size":"Short","color":"CACTUS/MOONMIST","retail_price":"299.95","sale_price":"299.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
