{"sku":"824913","manufacturer_id":"3859-A00","brand_name":"O'neill","product_name":"O'Neill Heat 4/3 Full Wetsuit - Men's","long_description":"Warm, comfortable and easy to get into, the O'Neill Heat 4/3mm full wetsuit allows you to enjoy the waves without the chills. Helps eliminate evaporative heat loss and protect against hypothermia if you capsize in chilly water. Stretchy 4/3mm neoprene forms to your body for a flexible, comfortable fit. Welded seams remain flexible and reduce chafing. Rear zipper secures fit, and protective internal flap shields your skin from abrasion. Zipper works in conjunction with a urethane-coated webbing to reduce water entry and retain heat. Rip-and-stick neck tab seals comfortably around neck, and interior lining feels soft around skin. Brushed neoprene panels feel soft against your chest and back, wick moisture and boost warmth. External key pocket on right calf is easy to access and offers excellent security. Seamless paneling under sleeves promotes unrestricted motion and won't irritate your skin. Tough fabric over knees increases durability. O'Neill recommends the Heat 4/3mm Full wetsuit for water temperatures ranging from 41degF to 50degF. Hand wash the O'Neill Heat 4/3mm full wetsuit in cold water, drip dry out of sun and store in a cool, dry place.","short_description":"Warm, comfortable and easy to get into, the O'Neill Heat 4/3mm full wetsuit allows you to enjoy the waves without the chills.","category":"Paddling","subcategory":"Paddling Clothing","product_group":"Wetsuits","thumb_url":"http://i1.avlws.com/115/s431691.png","image_url":"http://i1.avlws.com/115/l431691.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431691&tt=df","retail_price":"289.95","sale_price":"289.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431691\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431691.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=824913&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["paddling","paddling-clothing","wetsuits"]}
