{"sku":"825287","manufacturer_id":"4383372220","brand_name":"Deuter","product_name":" Deuter ACT Zero 45 + 15 SL Pack - Women's","long_description":"The Deuter ACT Zero 45 + 15 SL pack is ideal for the thru-hiking woman who travels light and fast. It carries all your necessities in comfort without the burden of extra pack weight. Slim-fitting, women-specific design has narrow, short shoulder straps and a short torso length. Aircontact Lite system features padded, contoured shoulder straps and hipbelt with 3D Air mesh lining and a cushioned, breathable back panel with hollow-chamber foam. Forward-pull hipbelt adjustment makes it easy to achieve a snug fit. X-frame with hollow-core aluminum stays transfers load weight to your hips and offers both torsional rigidity and flexibility to follow your body movements. Variquick system adjusts easily to any back length. Main compartment features a removable lid closure and an extension collar that adds 15 liters of space and a hydration sleeve that accommodates a reservoir (sold separately). Top lid features inside and outside pockets; mesh side pockets and hipbelt pocket hold water bottles, snacks and other small items. Large stuff-it pocket on the front compresses down-a perfect spot to stash an insulating layer or rainwear. Gear loops let you lash on trekking poles and an ice axe. SOS label inside the lid includes information to help if you're lost or need assistance. The Deuter ACT Zero 45 + 15 SL pack is made of tough, 500-denier Duratex and light, 210-denier ripstop nylon fabric that is polyurethane-coated for weather resistance.","short_description":"The Deuter ACT Zero 45 + 15 SL pack is ideal for the thru-hiking woman who travels light and fast. It carries all your necessities in comfort without the burden of extra pack weight.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s440655.png","image_url":"http://i1.avlws.com/115/l440655.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440655&tt=df","keywords":"multiday","retail_price":"185.00","sale_price":"185.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440655\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440655.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825287&amp;link=&amp;tabs=-Details\"></script>","variants":{"8252870002":{"sku":"8252870002","vendor_sku":"4383372220","color":"ANTHRACITE/EMERALD","retail_price":"185.00","sale_price":"185.00"}}}
