{"sku":"825358","manufacturer_id":"4384333070","brand_name":"Deuter","product_name":"Deuter ACT Zero 50 + 15 Pack","long_description":"The Deuter ACT Zero 50 + 15 pack is perfect for the thru-hiker who travels light and fast and carry all your necessities in comfort. In awarding the ACT Zero 50 + 15 its 2011 Gear of the Year Award, Outside Magazine had this to say:. \"It's the best kind of mutant. Part minimalist fast-packer, part monster hauler, the ACT Zero seemed like the perfect tool no matter what the mission.\". Aircontact Lite system features padded, contoured shoulder straps and hipbelt with 3D air-mesh lining and a cushioned, breathable back panel with hollow-chamber foam. Forward-pull hipbelt adjustment makes it easy to achieve a snug fit. X-frame with hollow-core aluminum stays transfers load weight to your hips and offers both torsional rigidity and flexibility to follow your body movements. Variquick system adjusts easily to any back length. Main compartment features a removable lid closure and an extension collar that adds 15 liters of space and a hydration sleeve that accommodates a reservoir (sold separately). Top lid features inside and outside pockets; mesh side pockets and hipbelt pocket hold water bottles, snacks and other small items. Large stuff-it pocket on the front compresses down-a perfect spot to stash an insulating layer or rainwear. Gear loops let you lash on trekking poles and an ice axe. SOS label inside the lid includes information to help if you're lost or need assistance. The Deuter ACT Zero 50 + 15 pack is made of tough, 500-denier Duratex and light, 210-denier ripstop nylon fabric that is polyurethane-coated for weather resistance.","short_description":"The Deuter ACT Zero 50 + 15 pack is perfect for the thru-hiker who travels light and fast and carry all your necessities in comfort.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410467.png","image_url":"http://i1.avlws.com/115/l410467.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410467&tt=df","keywords":"multiday","retail_price":"185.00","sale_price":"185.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410467\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410467.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825358&amp;link=&amp;tabs=-Details\"></script>","variants":{"8253580002":{"sku":"8253580002","vendor_sku":"4384333070","color":"STORM/MIDNIGHT.","retail_price":"185.00","sale_price":"185.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
