{"sku":"825346","manufacturer_id":"7537","brand_name":"Msr","product_name":"MSR Lightning Flash 25 Snowshoes - Women's","long_description":"Great for novices, the women's MSR Lightning Flash 25 snowshoes provide a lightweight, comfortable fit and reliable traction for gentle winter treks. Sturdy aluminum 360deg Traction frame provides security on any terrain, thanks to teeth integrated in the frame along the outside edges and underfoot. Urethane-impregnated nylon decking is lightweight, waterproof and durable; heel strike area features a welded-on reinforcement patch. SpeedLock(TM) system offers quick and easy, glove-friendly adjustment of your bindings. Make use of optional instep straps (sold separately) for even greater security; straps stay pliable and easy-to-adjust in cold temperatures, even when wearing mittens. Steel crampons underfoot not only grip well, but also provide stability and reduce heel drift for an efficient gait. All materials are waterproof, so they don't soak up water, freeze and get heavy. Compatible with MSR Lightning Snowshoe Flotation tails (sold separately) for an easy-on/off flotation boost when in deep snow or carrying extra weight. Please note: without tails, recommended load is 120 - 220 lbs., and with 5 in. tails, recommended load is up to 280 lbs. Recommended load specification for the women's MSR Lightning Flash 25 snowshoes includes weight of hiker with gear; flotation will vary with snow condition.","short_description":"Great for novices, the women's MSR Lightning Flash 25 snowshoes provide a lightweight, comfortable fit and reliable traction for gentle winter treks.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Women's Snowshoes","thumb_url":"http://i1.avlws.com/115/s463823.png","image_url":"http://i1.avlws.com/115/l463823.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463823&tt=df","retail_price":"199.95","sale_price":"149.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463823\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463823.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825346&amp;link=&amp;tabs=-Details\"></script>","variants":{"8253460001":{"sku":"8253460001","vendor_sku":"7537","upc":"040818075371","size":"25 IN","color":"ICE WHITE","retail_price":"149.93","sale_price":"149.93"}},"categories":["snow","snowshoes","womens-snowshoes"]}
