{"sku":"825497","manufacturer_id":"010-00924-02","brand_name":"Garmin","product_name":"Garmin Montana 650t GPS","long_description":"The waterproof Garmin Montana 650t GPS is big, versatile and tough. It features a large touch-screen display , preloaded TOPO U.S. 100K maps and a 5-megapixel camera. 4 in. display is sunlight-readable and offers crystal-clear colors and high-resolution images. Touch-screen interface lets you spend more time enjoying the outdoors and less time searching for information. Built to withstand the elements, the Montana 650t shrugs off bumps, dust, dirt, humidity and water. 5-megapixel camera lets you capture great photos that are automatically geotagged with the location where they are taken, so you can easily navigate back to the exact spot. Dual-orientation display lets you take pictures and view them in landscape or portrait orientation. Keep track of your photos and show their location on a map with Garmin's free Basecamp(TM) software. MicroSD card slot lets you expand memory, add additional maps (sold separately) and view pictures from other devices (microSD card sold separately). Garmin Montana 650t GPS is compatible with BirdsEye satellite imagery (subscription required) and free Custom Maps software that transforms paper maps into downloadable files. Add Garmin City Navigator NT(R) mapping software and an auto mount (not included) and the Montana 650t will give you spoken turn-by-turn driving directions. Enjoy effortless sharing of waypoints, tracks, routes and geocache locations among the Montana, Oregon and Colorado series units with ANT wireless communication function. High-sensitivity, WAAS-enabled receiver and HotFix(R) satellite prediction locate and maintain your position quickly and precisely-even in heavy cover or deep canyons. 3-axis tilt-compensated compass shows your heading even when you're standing still, without having to hold the unit level.","short_description":"The waterproof Garmin Montana 650t GPS is big, versatile and tough. It features a large touch-screen display , preloaded TOPO U.S. 100K maps and a 5-megapixel camera.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412535.png","image_url":"http://i1.avlws.com/115/l412535.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412535&tt=df","keywords":"hiking","retail_price":"600.00","sale_price":"600.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412535\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412535.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825497&amp;link=&amp;tabs=-Details\"></script>","variants":{"8254970001":{"sku":"8254970001","vendor_sku":"010-00924-02","upc":"753759975760","retail_price":"600.00","sale_price":"600.00"}},"categories":["camping-hiking","camp-electronics","gps"]}
