{"sku":"825439","manufacturer_id":"10020021","brand_name":"Novara","product_name":" Novara Pixie 20\" Single-Speed Bike - 2014","long_description":"The Novara Pixie 20 in. single-speed is made for kids who are ready to toss the training wheels. Single-speed pedaling and hand-operated rear brake keep things simple; mudguards help keep it tidy. Built to endure frequent use, the high-tensile steel frame offers strength everywhere it counts while remaining a fun, responsive ride for the kids. Single-speed drivetrain keeps things simple and low maintenance and lets kids master the basics of pedaling without having to worry about shifting. Rear coaster brake and hand-operated rear brake give kids 2 options to control their speed, letting them learn the nuances of hand-operated brakes with backup of coaster brake. Alloy rims, steel hubs and versatile Kenda tires roll smoothly along pavement and dirt paths. Front down tube deflector helps guard against flying mud. Also features a sturdy chainring guard and kickstand. Specs on our Novara Pixie 20\" single-speed kids' bike are subject to change.","short_description":"The Novara Pixie 20 in. single-speed is made for kids who are ready to toss the training wheels. Single-speed pedaling and hand-operated rear brake keep things simple; mudguards help keep it tidy.","category":"Cycling","subcategory":"Bikes","product_group":"Kids' Bikes","thumb_url":"http://i1.avlws.com/115/s376315.png","image_url":"http://i1.avlws.com/115/l376315.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376315&tt=df","retail_price":"179.00","sale_price":"179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376315\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376315.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825439&amp;link=&amp;tabs=-Details\"></script>","variants":{"8254390001":{"sku":"8254390001","vendor_sku":"10020021","upc":"482543900014","color":"LAVENDER","retail_price":"179.00","sale_price":"179.00"}}}
