{"sku":"825494","manufacturer_id":"010-00868-21","brand_name":"Garmin","product_name":"Garmin GPSMAP 62stc GPS","long_description":"The robust Garmin GPSMAP 62stc offers all the features of the GPSMAP 62sc, plus preloaded TOPO 100K mapping. Detailed, 100k topographic map includes national, state and local parks and forests along with terrain contours, elevation, trails, rivers, lakes and points of interest. Snap photos with the built-in 5 megapixel digital camera with auto focus; photos are automatically geotagged so you can find your way back to that exact spot in the future. 3-axis, tilt-compensated electronic compass shows your heading even when you're standing still and holding the unit upright or at an angle. Altimeter tracks changes in barometric pressure to pinpoint your altitude; it also plots pressure over time to help you keep an eye on changing weather conditions. Share your waypoints, tracks, routes and geocaches wirelessly with other compatible Garmin devices so your friends can easily enjoy your favorite hike or cache. Built-in worldwide basemap with shaded relief helps you navigate with ease; photo navigation lets you download Garmin Connect(TM) photos and navigate to their locations. Quad helix antenna and high-sensitivity, WAAS-enabled receiver with Hotfix(R) satellite prediction locate your position quickly and maintain reception under heavy cover. 1.7 gigabytes of onboard memory make it easy to add maps; choose from Garmin's wide array of detailed topographic, marine and road maps (sold separately). Garmin GPSMAP 62stc supports BirdsEye(TM) satellite imagery (subscription required) that lets you download satellite images and integrate them with your maps. Compatible with free Custom Maps maps software that transforms paper and electronic into downloadable map files. Easily connect GPSMAP 62stc to your computer and the Internet to get a detailed analysis of your activities and add tracks using Garmin Connect(TM).","short_description":"The robust Garmin GPSMAP 62stc offers all the features of the GPSMAP 62sc, plus preloaded TOPO 100K mapping.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s447499.png","image_url":"http://i1.avlws.com/115/l447499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=447499&tt=df","keywords":"hiking","retail_price":"500.00","sale_price":"500.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=447499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m447499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825494&amp;link=&amp;tabs=-Details\"></script>","variants":{"8254940001":{"sku":"8254940001","vendor_sku":"010-00868-21","upc":"753759974435","retail_price":"500.00","sale_price":"500.00"}},"categories":["camping-hiking","camp-electronics","gps"]}
