{"sku":"825490","manufacturer_id":"010-00970-00","brand_name":"Garmin","product_name":" Garmin eTrex 10 GPS","long_description":"The compact Garmin eTrex 10 GPS gives you quick and easy GPS functionality at a great value. It's perfect for geocaching and hiking. Includes a worldwide basemap so you can know where you are and where you're going. WAAS-enabled receiver locates your position quickly and maintains reception under heavy cover. Compatibility with Russian Glonass system allows about 20% faster and more reliable satellite acquisition, helpful in challenging spots such as deep canyons or tall buildings. Monochrome display is easily viewed in bright sunlight. Supports geocaching GPX files for downloading geocache locations and details straight to the unit using the high-speed USB connection. Stores and displays geocache location, terrain, difficulty, hints and descriptions-no more manually entering coordinates or toting around paper printouts! Operational buttons are located along the sides of the device for easy 1-hand operation. 2 AA batteries (sold separately) provide up to 25 hrs. of use of the Garmin eTrex 10 GPS. Waterproof design meets IEC 60529 lPX7 standards (can be submerged to 1m for up to 30 min.).","short_description":"The compact Garmin eTrex 10 GPS gives you quick and easy GPS functionality at a great value. It's perfect for geocaching and hiking.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s445591.png","image_url":"http://i1.avlws.com/115/l445591.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445591&tt=df","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445591\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445591.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825490&amp;link=&amp;tabs=-Details\"></script>","variants":{"8254900001":{"sku":"8254900001","vendor_sku":"010-00970-00","upc":"753759975845","retail_price":"109.95","sale_price":"109.95"}}}
