{"sku":"825518","manufacturer_id":"010-00928-01","brand_name":"Garmin","product_name":" Garmin Rino 650 GPS/2-Way Radio","long_description":"The Garmin Rino 650 GPS/2-way radio combines a GPS with FRS/GMRS radio, altimeter, compass and weather radio into 1 rugged and convenient unit. With its high-sensitivity GPS receiver and quad helix antenna, Rino 650 quickly finds your position and maintains it- even in heavy cover. Bright and colorful touch screen makes it easy to view maps and data and navigate through the Rino 650's functions. Easily add TOPO and City Navigator(R) maps (sold separately) with the microSD card slot. Supports BirdsEye(TM) satellite imagery (subscription required) that lets you download satellite images and integrate them with your maps. Rino 650 is compatible with Custom Maps, free software that transforms paper and electronic maps into downloadable maps for your device. Position Reporting capability lets you send your exact location to other Rino users so they can see it on their map page. FRS/GMRS 2-way radio with improved audio performance makes it easy to communicate with any other FRS/GMRS radios. 2-way radio features 22 channels, 121 squelch codes, 5 watts transmitting power on GMRS, voice activation and vibration alerts. Send unit-to-unit text messages to other Rino users and share your waypoints, tracks, routes and geocaches wirelessly with other compatible Garmin handheld devices. Barometric altimeter and Tilt-compensated, 3-axis electronic compass let you get your altitude and bearings without having to hold the unit level. NOAA weather radio helps you avoid hazardous weather; it supports Specific Area Message Encoding, which allows you to see National Weather Service warnings on the screen. Weatherproof case keeps unit functioning in wet conditions (waterproof to lPX7 standards). Garmin Rino 650 also features a hunt/fish calendar and sunrise/sunset and moonrise/moonset information. Rechargeable lithium ion battery provides up to 14 hrs. of outdoor use.","short_description":"The Garmin Rino 650 GPS/2-way radio combines a GPS with FRS/GMRS radio, altimeter, compass and weather radio into 1 rugged and convenient unit.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412703.png","image_url":"http://i1.avlws.com/115/l412703.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412703&tt=df","keywords":"walkie talkies","retail_price":"470.00","sale_price":"470.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412703\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412703.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825518&amp;link=&amp;tabs=-Details\"></script>","variants":{"8255180001":{"sku":"8255180001","vendor_sku":"010-00928-01","upc":"753759975791","retail_price":"470.00","sale_price":"470.00"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
