{"sku":"825766","manufacturer_id":"S1212012010","brand_name":"K2","product_name":" K2 Pilchuck Backcountry Pack Kit","long_description":"Stocked with an avalanche shovel and probe, the compact K2 Pilchuck Backcountry Pack kit is designed for skiers and snowboarders who like to hike for fresh snow. Minimalist backpack is thin enough to not get in the way while you ride lifts; 11liter (671 cu. in.) volume lets you pack the gear you need for short trips out of the ski area. K2 Pilchuck Backcountry Pack kit includes the K2 Rescue shovel and the K2 Avalanche Probe Alu 300. Rescue shovel has a strong aluminum blade and a shaft that extends from 28 - 64cm (11 in. - 25.25 in). Designed for utility, the shovel can be used as a standard shovel or you can convert it to hoe mode, which facilitates digging in tight locations. Holes in the shovel blade let you build a rescue sled with K2 BackSide skis and many Factory Team skis (sold separately); hardware to construct sled is not included. Included Avalanche Probe Alu 300 assembles quickly so you won't waste precious seconds while searching for a victim. Probe extends to 300cm (9 ft. 10 in.) and packs down to 42cm (16.5 in.); 1cm markings on the probe come in handy while you're recording snow pit data. Probe comes in a convenient storage bag. Remember to always wear an avalanche transceiver (sold separately) when you're backcountry skiing.","short_description":"Stocked with an avalanche shovel and probe, the compact K2 Pilchuck Backcountry Pack kit is designed for skiers and snowboarders who like to hike for fresh snow.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s352415.png","image_url":"http://i1.avlws.com/115/l352415.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=352415&tt=df","keywords":"day packs","retail_price":"199.95","sale_price":"159.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=352415\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m352415.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=825766&amp;link=&amp;tabs=-Details\"></script>","variants":{"8257660001":{"sku":"8257660001","vendor_sku":"S1212012010","upc":"886745047407","color":"BLACK","retail_price":"159.93","sale_price":"159.93"}},"categories":["snow","ski-packs-and-bags","ski-packs"]}
