{"sku":"826069","manufacturer_id":"BUS05236","brand_name":"Novara","product_name":"Novara Express XX Women's Bike - 2014","long_description":"Blending comfort and speed, our Novara Express(R) XX women's bike offers all the agility and efficiency of a road bike with an upright, comfortable riding position. 6061 aluminum frame is strong and stiff, supplying quick acceleration and efficient power transfer; shaped seatstays and top tube enhance comfort and performance. Fork boasts a tapered alloy steerer with a 1-piece alloy crown for strength and stiffness where it counts; carbon legs help damp road vibrations and reduce weight. Flat handlebar positions the rider upright, thereby reducing the stress to hands, neck and back while also improving heads-up visibility. Bar ends help you stand over the pedals to power up steep ascents; platform pedals with toe cages let you wear everyday shoes while helping keep feet positioned on pedals. Shimano triple crankset and 9-speed cassette provide 27 speeds to handle any grade. Shimano trigger shifters and derailleurs offer smooth, precise and dependable shifts. Linear-pull brakes ensure easy speed management. Shimano hubs are laced onto Weinmann rims and outfitted with puncture-resistant, smooth-rolling and reflective Vittoria Randonneur tires for all-around riding. Frame features eyelets for fenders or a rear rack (sold separately) for easy utilitarian upgrading. Replaceable rear derailleur hanger helps extend the usable life of the frame. Specs on our Novara Express XX women's bike are subject to change.","short_description":"Blending comfort and speed, our Novara Express(R) XX women's bike offers all the agility and efficiency of a road bike with an upright, comfortable riding position.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374515.png","image_url":"http://i1.avlws.com/115/l374515.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374515&tt=df","retail_price":"849.00","sale_price":"678.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374515\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374515.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826069&amp;link=&amp;tabs=-Details\"></script>","variants":{"8260690001":{"sku":"8260690001","vendor_sku":"BUS05236","upc":"482606900012","size":"XS","color":"WHITE","retail_price":"678.93","sale_price":"678.93"},"8260690002":{"sku":"8260690002","vendor_sku":"BUS05236","upc":"482606900029","size":"S","color":"WHITE","retail_price":"678.93","sale_price":"678.93"},"8260690003":{"sku":"8260690003","vendor_sku":"BUS05236","upc":"482606900036","size":"M","color":"WHITE","retail_price":"678.93","sale_price":"678.93"}},"categories":["cycling","bikes","road-bikes"]}
