{"sku":"826027","manufacturer_id":"13626","brand_name":"Rei","product_name":"REI Kimtah Rain Pants - Women's","long_description":"The women's REI Kimtah pants are an awesome choice for spring and summer backpacking adventures. They offer protection for activities where windy, wet weather is a concern. eVent(R) fabric has a unique membrane structure that allows sweat vapor to quickly escape to the outside of the fabric. No matter how hard you work, overheating is unlikely due to this Direct Venting(TM) technology. And because you remain dry on the inside, the likelihood of an uncomfortable, post-exercise chill is eliminated. eVent technology works so efficiently, no vent zippers are needed; all seams are sealed for complete waterproof protection. Windproof to 60 mph. Fabric is reinforced at backside to increase durability. Drawcord waistband supplies a personalized fit. Knee darts shape pant legs for a non-binding, comfortable range of motion. Lower legs have water-resistant zipper openings for easy on/off. Hem drawcords cinch down securely over boots; gaiter grommets allow you to add your own instep cords. 2 zip hand pockets and 1 back zip pocket. REI Kimtah pants have an active fit that allows a full range of motion and enhances performance.","short_description":"The women's REI Kimtah pants are an awesome choice for spring and summer backpacking adventures. They offer protection for activities where windy, wet weather is a concern.","category":"Women's Clothing","subcategory":"Women's Pants","product_group":"Women's Rain Pants","thumb_url":"http://i1.avlws.com/115/s462535.png","image_url":"http://i1.avlws.com/115/l462535.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=462535&tt=df","keywords":"hardshell,outerwear","retail_price":"189.00","sale_price":"189.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=462535\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m462535.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826027&amp;link=&amp;tabs=-Details\"></script>","variants":{"8260270005":{"sku":"8260270005","vendor_sku":"13626","upc":"482602700050","size":"XL","color":"GRAPHITE","retail_price":"189.00","sale_price":"189.00"}},"categories":["womens","womens-pants","womens-rain-pants"]}
