{"sku":"826162","manufacturer_id":"010-00829-13","brand_name":"Garmin","product_name":" Garmin Edge 500 Bundle Wireless Bike Computer","long_description":"Take your riding to the next level with the Garmin Edge 500 bundle, which includes the GPS-based wireless cycling computer, a premium heart rate monitor and a speed/cadence sensor for data galore! Low-profile bike mount attaches easily to your stem or handlebar; high-sensitivity GPS receiver with HotFix(R) satellite prediction offers fast position calculation. Edge 500 measures your speed, distance, time, calories burned, altitude, climb and descent, and records this data for your review. Works with 3rd-party ANT+-enabled devices or power meters for even more robust data analysis (power meter sold separately). For extra-precise climb and descent data, Edge 500 also incorporates a barometric altimeter to pinpoint changes in elevation. Virtual Partner(R) ups the ante by letting you train against a digital \"competitor\" on a stored course, indicating your speed relative to past performances. Courses feature helps you compare successive rides over the same route; other features include Auto Pause, Auto Lap and temperature readings. Premium chest strap heart rate monitor tracks your heart's beats per minute for advanced calorie usage data, zoned heart rate training or comparisons between rides. Once your ride is done, use the included USB cable to connect Edge 500 to your computer and the internet to analyze your performance. With a simple click, you can join a worldwide network of cyclists and outdoor enthusiasts through Garmin Connect(TM), a free website for ride data analysis and sharing. Unit measures 1.9 x 2.7 x .09 in.; display area is 1.2 x 1.4 in., and 128 x 160 pixels; screen is readable in daylight. Rechargeable internal lithium ion battery lasts up to 18 hrs. with typical use. Edge 500 comes with premium heart rate monitor, speed/cadence sensor, bike mount, AC charger, USB cable and manuals.","short_description":"Take your riding to the next level with the Garmin Edge 500 bundle, which includes the GPS-based wireless cycling computer, a premium heart rate monitor and a speed/cadence sensor for data galore!","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375163.png","image_url":"http://i1.avlws.com/115/l375163.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375163&tt=df","retail_price":"320.00","sale_price":"320.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375163\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375163.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826162&amp;link=&amp;tabs=-Details\"></script>","variants":{"8261620001":{"sku":"8261620001","vendor_sku":"010-00829-13","upc":"753759980207","color":"RED/BLACK","retail_price":"320.00","sale_price":"320.00"}}}
