{"sku":"826163","manufacturer_id":"010-00978-00","brand_name":"Garmin","product_name":"Garmin Edge 200 Wireless Bike Computer","long_description":"The new, compact Garmin Edge 200 wireless bike computer brings loads of GPS-based ride data to your fingertips in an easy-to-use and budget-friendly design. Provides valuable data bike training, touring, commuting or casual everyday rides, measuring speed, distance, time, calories burned and location. Very easy to use: simply affix the included bike mount to a bike handlebar or stem, and then attach the Edge 200; you're ready to roll! Auto Pause feature stops the timer when you're not moving, then resumes recording data automatically when you're rolling again. Auto Lap automatically starts a new lap once you reach a set point; you can also set alerts for distance, time or calories to make it easier and more fun to achieve your goals. Virtual Partner(R) ups the ante by letting you train against a digital \"competitor\" on a stored course, indicating your speed relative to past performances. It's easy to access up to 130 hrs. of ride data and sort your activities so you can quickly look up the fastest, longest or last ride. Garmin Connect website lets you upload ride data online to see the path you traveled on a map, analyze it, share it or view more detail, such as elevation. Unit measures 1.9 x 2.7 x .08 in.; display area is 1.2 x 1.4 in., and 128 x 160 pixels; screen is readable in daylight. Rechargeable internal lithium ion battery lasts up to 14 hrs. with typical use. The Garmin Edge 200 wireless bike computer comes with a low-profile bike mount, USB cable, AC charger and relevant manuals.","short_description":"The new, compact Garmin Edge 200 wireless bike computer brings loads of GPS-based ride data to your fingertips in an easy-to-use and budget-friendly design.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375167.png","image_url":"http://i1.avlws.com/115/l375167.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375167&tt=df","retail_price":"130.00","sale_price":"130.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375167\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375167.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826163&amp;link=&amp;tabs=-Details\"></script>","variants":{"8261630001":{"sku":"8261630001","vendor_sku":"010-00978-00","upc":"753759977566","color":"BLACK/GREY","retail_price":"130.00","sale_price":"130.00"}},"categories":["cycling","bike-accessories","bike-computers"]}
