{"sku":"826290","manufacturer_id":"PDPCUGMBW","brand_name":"Smith","product_name":" Smith Parallel D-Max Sunglasses - Men's","long_description":"Providing maximum coverage, these Smith Parallel D-Max interchangeable sunglasses allow unobstructed peripheral vision-ideal for trail running, cycling or a day on the water. Each frame includes 1 set of blue mirror lenses and 2 additional sets of lenses for a total of 3 sets of lenses. 2 additional sets of lenses include: rose Ignitor for optimal depth perception in medium light/overcast conditions and clear for low light to night conditions. Frames are made from bio-plastic Rislan(R) Clear (derived from non-GMO castor seeds) and Grilamid(R) TR90 lightweight nylon for a resilient, durable and consistent fit. Scratch- and impact-resistant Carbonic lenses use Smith Tapered Lens Technology(TM) to provide distortion-free vision. Tapered Lens Technology progressively tapers the lens so that light travels through without distortion-what you see is what you get. Hydrophilic Megol(TM) nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. 9-base-curve lenses; (the higher the number the more curved the lens-Smith features sunglasses with 6, 7, 8 and 9 base curvature). Smith Parallel D-Max frames have a medium fit with extra-large lenses for greater coverage.","short_description":"Providing maximum coverage, these Smith Parallel D-Max interchangeable sunglasses allow unobstructed peripheral vision-ideal for trail running, cycling or a day on the water.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422923.png","image_url":"http://i1.avlws.com/115/l422923.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422923&tt=df","keywords":"Cycling","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422923\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422923.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826290&amp;link=&amp;tabs=-Details\"></script>","variants":{"8262900001":{"sku":"8262900001","vendor_sku":"PDPCUGMBW","upc":"715757376093","size":"BLUE MIRROR","color":"BLACK/WHITE","retail_price":"129.00","sale_price":"129.00"}}}
