{"sku":"826288","manufacturer_id":"HYPPGYGBL","brand_name":"Smith","product_name":" Smith Heyday Women's Polarized Sunglasses","long_description":"The women's Smith Heydey polarized sunglasses nurture your active spirit by providing compact, lightweight protection for your eyes. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Carbonic TLT lenses provide 100% UVA/B/C protection and incorporate Smith Tapered Lens Technology(TM) to optimize viewing clarity. Tapered Lens Technology contours the thickness of the lens so that light travels through without distortion-what you see is what you get. 6 base-curve lens; (the higher the number the more curved the lens-Smith features sunglasses with 6, 7, 8 and 9 base curvature). Frames are made from bio-plastic Rislan(R) Clear (derived from non-GMO castor seeds) and Grilamid(R) TR90 lightweight nylon for a resilient, durable and consistent fit. Vintage Tortoise frames feature polarized brown lenses, ideal for medium to bright conditions, that reduce glare and enhance contrast while maintaining true colors. Blue Savanna frames feature polarized gray gradient lenses, ideal for bright days, that reduce glare and sharpen detail; gradient gets progressively lighter from top to bottom. Lightweight frames have a small fit with small coverage. Smith Heyday polarized sunglasses include a protective case.","short_description":"The women's Smith Heydey polarized sunglasses nurture your active spirit by providing compact, lightweight protection for your eyes.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Casual Sunglasses","thumb_url":"http://i1.avlws.com/115/s422367.png","image_url":"http://i1.avlws.com/115/l422367.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422367&tt=df","retail_price":"119.00","sale_price":"119.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422367\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422367.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826288&amp;link=&amp;tabs=-Details\"></script>","variants":{"8262880001":{"sku":"8262880001","vendor_sku":"HYPPBRTT","upc":"715757375638","size":"POLAR BROWN","color":"VINTAGE TORTOISE","retail_price":"119.00","sale_price":"119.00"},"8262880002":{"sku":"8262880002","vendor_sku":"HYPPGYGBL","upc":"715757375614","size":"POLAR GRAY GRADIENT","color":"BLUE SAVANNA","retail_price":"119.00","sale_price":"119.00"}}}
