{"sku":"826300","manufacturer_id":"383122","brand_name":"Julbo","product_name":"Julbo Bivouak Glacier Sunglasses - Men's","long_description":"The Julbo Bivouak glacier sunglasses provide total coverage and protection from harsh sunlight and extreme weather while skiing or mountaineering. Spectron 4 polycarbonate lenses block 100% of UV rays and 95% of visible light, reducing glare and creating a clear image. Flash treatment gives lenses a mirror effect that enhances light filtration; anti-glare treatment to lenses eliminates glare reflections. Lightweight, tough nylon frames flex to allow a natural fit to various face shapes. Ear stem ends bend in every direction for a good hold and a snug, comfortable fit when worn under helmet, beanie or alone. Grippy inserts at ear stem ends become tacky as you perspire, holding eyewear in place during strenuous activity; does not stick to hair. Unique magnetic shields block light coming from sides; magnetic shields can be easily and quickly removed and repositioned as needed. Front venting incorporated into lenses allows natural airflow to eliminate fog and condensation. Julbo Bivouak glacier sunglasses include a protective case for storage.","short_description":"The Julbo Bivouak glacier sunglasses provide total coverage and protection from harsh sunlight and extreme weather while skiing or mountaineering.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Glacier Glasses","thumb_url":"http://i1.avlws.com/115/s422639.png","image_url":"http://i1.avlws.com/115/l422639.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422639&tt=df","retail_price":"120.00","sale_price":"120.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422639\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422639.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826300&amp;link=&amp;tabs=-Details\"></script>","variants":{"8263000001":{"sku":"8263000001","vendor_sku":"383122","size":"Spectron 4","color":"MATTE BLACK","retail_price":"120.00","sale_price":"120.00"}},"categories":["camping-hiking","sunglasses","glacier-glasses"]}
