{"sku":"826437","manufacturer_id":"OO4057-04","brand_name":"Oakley","product_name":" Oakley Plaintiff Polarized Sunglasses","long_description":"The Oakley Plaintiff polarized sunglasses feature shatterproof polycarbonate lenses, flexible metal frames and glare-reducing polarization, all in a time-honored style. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Optically correct, shatterproof and scratch-resistant Plutonite(R) polycarbonate lenses offer great durability. Ultra-lightweight C-5(TM) metal alloy frame material offers premium, durable comfort. Titanium Mono Shock(TM) hinges can hyper flex when necessary, offering functional flexibility for vigorous activity. Unique 3-point fit from Oakley includes optical alignment for sharp accurate vision, impact absorption for improved safety and geometry that extends the peripheral view. Gray-tinted polarized lenses cut through glare to reduce eyestrain in moderate-to-bright conditions while enhancing true color perception. Oakley Plaintiff polarized sunglasses feature relatively high 8.75 base-curve lens geometry for optimized peripheral view and side coverage.","short_description":"The Oakley Plaintiff polarized sunglasses feature shatterproof polycarbonate lenses, flexible metal frames and glare-reducing polarization, all in a time-honored style.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Casual Sunglasses","thumb_url":"http://i1.avlws.com/115/s422375.png","image_url":"http://i1.avlws.com/115/l422375.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422375&tt=df","retail_price":"200.00","sale_price":"200.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422375\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422375.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826437&amp;link=&amp;tabs=-Details\"></script>","variants":{"8264370001":{"sku":"8264370001","vendor_sku":"OO4057-04","upc":"700285443294","size":"GREY POLARIZED","color":"LEAD","retail_price":"200.00","sale_price":"200.00"}}}
