{"sku":"826741","manufacturer_id":"00.5016.173.000","brand_name":"Avid","product_name":"Avid Elixir 9 Disc Brake - 160mm","long_description":"The featherweight Avid Elixir 9(TM) disc brake offers the reliable performance you've come to expect from the Elixir family of disc brakes, and it also offers tool-free adjustment. The Avid Elixir 9 disc brake features a tool-free adjument for reach and contact point; allowing instant personalization in the shop or on the trail. Taperbore Technology(TM) supplies excellent control and enhances feedback for great feel; integrated reservoir provides a clean, sleek look. Get more forceful braking with less effort with the Power Reserve Geometry design, which places the lever pivot point closer to your fingers' natural motion. Stiff 2-piece caliper uses DOT 5.1 brake fluid which increases heat resistance on the large, powerful pistons for consistent power that doesn't fade away as things heat up. Tri-Align(TM) system makes installing and adjusting brake a snap and ensures the caliper is always centered and straight over the rotor. Brake pads load from the top so changing them is about as easy as it gets. Avid Elixir 9 disc brake includes 1 lever, 1 caliper, hydraulic line and a 160mm rotor; choose from front or rear.","short_description":"The featherweight Avid Elixir 9(TM) disc brake offers the reliable performance you've come to expect from the Elixir family of disc brakes, and it also offers tool-free adjustment.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Brakes","thumb_url":"http://i1.avlws.com/115/s388503.png","image_url":"http://i1.avlws.com/115/l388503.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=388503&tt=df","retail_price":"220.00","sale_price":"175.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=388503\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m388503.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=826741&amp;link=&amp;tabs=-Details\"></script>","variants":{"8267410001":{"sku":"8267410001","vendor_sku":"00.5016.173.000","upc":"710845670268","size":"FRONT","retail_price":"175.93","sale_price":"175.93"}},"categories":["cycling","bike-components","bike-brakes"]}
