{"sku":"827094","manufacturer_id":"PRW2500T-7","brand_name":"Casio","product_name":"Casio ProTrek PRW2500T-7 Multifunction Watch","long_description":"Designed with input from meteorologists, the Casio ProTrek PRW2500T-7 multifunction watch is a tough, titanium timepiece that keeps time via the Atomic Clock and reliably draws its power from the sun. Watch automatically receives Atomic Clock time calibration signals in the U.S., England, Germany and Japan for incredibly accurate timekeeping. No batteries to replace! Efficient, large-capacity solar battery requires very little light to recharge and lasts up to 5 months without recharging. Duplex LCD layout provides a 2-layer display for clear information at an easy glance when you're on the go. Triple sensors enable easy, 1-touch operation of an altimeter/barometer, compass and thermometer. Altimeter tracks elevation gain/loss from -2,300 to 32,800 ft. (-700 to 10,000m); stores up to 40 records of high/low altitude, cumulative ascent/descent and date/month/time. Numerical/trend graph data and distinctive arrow icons indicate barometric pressure patterns; barometer tracks atmospheric pressure from 260 to 1,100 hPa (7.68 to 32.49 inHg). Digital compass displays current heading; reports bearing in 1deg increments. Thermometer ranges from 14 to 140degF (-10 to 60degC) measured in 0.2degF increments (0.1degC). The Casio ProTrek PRW2500T-7 multifunction watch features a tide/moon data graph that provides convenient information for sea kayaking and fishing. 1/100-second stopwatch measures elapsed time, split time and first- and second-place times. Features countdown timer, time in 12- or 24-hr. format, world time with 29 time zones, date, day, auto calendar (through 2039), 5 daily alarms and hourly chime. Electroluminescent backlight allows reading at night. 200m water resistance helps protect the watch while rafting, swimming or other activities that may involve strong water pressure.","short_description":"Designed with input from meteorologists, the Casio ProTrek PRW2500T-7 multifunction watch is a tough, titanium timepiece that keeps time via the Atomic Clock and reliably draws its power from the sun.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413367.png","image_url":"http://i1.avlws.com/115/l413367.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413367&tt=df","keywords":"waterproof","retail_price":"350.00","sale_price":"350.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413367\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413367.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=827094&amp;link=&amp;tabs=-Details\"></script>","variants":{"8270940001":{"sku":"8270940001","vendor_sku":"PRW2500T-7","upc":"079767464325","color":"TITANIUM","retail_price":"350.00","sale_price":"350.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
