{"sku":"827110","manufacturer_id":"13570","brand_name":"Rei","product_name":"REI Flash 18 Pack","long_description":"With the REI Flash 18 pack, versatility is the name of the game. For use in your larger backpack or duffel, this lightweight daypack cleverly converts into a stuff sack when you turn it inside out! Turn inside out and it's a stuff sack to help organize your gear; once at basecamp, reverse it and use it as a daypack for short hikes away from camp. Removable back panel pad doubles as a sit pad; removable hipbelt and sternum strap make the pack customizable for different uses. Interior zippered pocket secures keys and other small items. Hydration-compatible design has a hose exit port and an internal sleeve to hold a hydration reservoir, sold separately. Top-loading entry features an efficient, single drawcord that cinches skirt closed with a single tug; a small flap covers the opening when cinched closed. Front of pack features twin daisy chains running vertically and a tool loop at the bottom for attaching items on the front of the pack. 140-denier ripstop nylon increases durability without adding weight; polyurethane coating offers weather resistance.","short_description":"With the REI Flash 18 pack, versatility is the name of the game. For use in your larger backpack or duffel, this lightweight daypack cleverly converts into a stuff sack when you turn it inside out!","category":"Camping & Hiking","subcategory":"Daypacks, Hydration Packs And Waistpacks","product_group":"Daypacks","thumb_url":"http://i1.avlws.com/115/s218615.png","image_url":"http://i1.avlws.com/115/l218615.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=218615&tt=df","keywords":"back,rucksack,pack,day,daypack","retail_price":"34.50","sale_price":"24.09","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=218615\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m218615.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=827110&amp;link=&amp;tabs=-Details\"></script>","variants":{"8271100005":{"sku":"8271100005","vendor_sku":"13570","upc":"482711000058","size":"One Size","color":"BLACK/TITANIUM","retail_price":"24.09","sale_price":"24.09"}}}
