{"sku":"827135","manufacturer_id":"13586","brand_name":"Rei","product_name":"REI Stoke 19 Pack","long_description":"The streamlined REI Stoke 19 pack will keep you hydrated and carry your gear as you fly down trails. Take your multisport fitness training into the great outdoors! Sculpted foam panel reduces sweaty contact areas with multiple peaks and valleys releasing vapor; foam structure allows pack to conform to your back for a stable fit. Adjustable, padded and wrapped with breathable mesh, the perforated foam shoulder straps enhance air circulation. Stabilizer wings connect the shoulder straps to the bottom of the pack to stabilize the load and reduce unwanted bouncing. Hipbelt webbing system cinches with a natural forward pulling motion for quick, precise adjustments. Panel-loading zippered main compartment carries the essentials you need for a workout on the trail. Separate hydration pocket holds a reservoir (sold separately) for hands-free drinking on the trail; hydration tube can be routed through either shoulder strap. Front mesh pocket is perfect for quickly stashing a jacket or other items; pocket adjusts to help stabilize and compress the pack's load. Twin hipbelt zip pockets store those small essentials you want at your finger tips, such as energy gel packs, lip balm and sunscreen. The REI Stoke 19 pack features Quick Clip tool loops that hold an ice axe or trekking poles; clip loop is perfect for attaching a safety strobe (sold separately).","short_description":"The streamlined REI Stoke 19 pack will keep you hydrated and carry your gear as you fly down trails. Take your multisport fitness training into the great outdoors!","category":"Camping & Hiking","subcategory":"Daypacks, Hydration Packs And Waistpacks","product_group":"Daypacks","thumb_url":"http://i1.avlws.com/115/s225363.png","image_url":"http://i1.avlws.com/115/l225363.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=225363&tt=df","keywords":"day,pack,rucksack,daypack,back","retail_price":"79.50","sale_price":"54.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=225363\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m225363.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=827135&amp;link=&amp;tabs=-Details\"></script>","variants":{"8271350002":{"sku":"8271350002","vendor_sku":"13586","upc":"482713500020","size":"One Size","color":"CHILI POWDER/GREY MIST","retail_price":"54.73","sale_price":"54.73"}}}
