{"sku":"827807","manufacturer_id":"13640","brand_name":"Rei","product_name":"REI Kingdom 6 Tent - 2012","long_description":"The REI Kingdom 6 tent is a 3-season campground palace for families. A center divider creates 2 private rooms, or you can roll the fly back to convert one room into an airy, bug-free haven. Vertical walls maximize livable space, and multiple pockets make easy work of organizing small gear and clothing. Rectangular floor plan makes it easy to arrange sleeping bags and gear. Stable, freestanding design with 2 hubbed pole assemblies, pole clips and sleeves is quick to set up. Advanced frame design maximizes headroom, interior volume and strength. Zip-open divider wall with hanging pockets separates the Kingdom into 2 private rooms. End doors offer private access to each room; a roomy, pull-out vestibule covers 1 door and the other end features a weather-protective awning over a weatherproof door. Huge doors with 4 zipper sliders provide multiple entry options for adults and children; doors tuck away into adjacent stuff pockets. Seam-sealed polyester fly provides a waterproof, durable and sag-free cover; seam-sealed, cut-in floor provides a taut pitch and waterproof protection. Generous bug-proof mesh paneling and doors aid air circulation and minimize condensation. Rainfly sides roll up or roll back and secure open over the mesh sidewalls for ventilation and views. Combinations of mesh side pockets and hang loops located throughout the REI Kingdom 6 tent provide multiple interior storage options. Includes 8 stakes and 6 guylines with tighteners, pole repair tube and pole and stake bags. Connect Tech zipper attachment lets you add more living space or storage with add-on accessories, sold separately. Convenient backpack-style carry bag organizes tent, fly and poles with extra space for footprint; footprint is sold separately.","short_description":"The REI Kingdom 6 tent is a 3-season campground palace for families. A center divider creates 2 private rooms, or you can roll the fly back to convert one room into an airy, bug-free haven.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424375.png","image_url":"http://i1.avlws.com/115/l424375.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424375&tt=df","retail_price":"439.00","sale_price":"439.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424375\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424375.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=827807&amp;link=&amp;tabs=-Details\"></script>","variants":{"8278070001":{"sku":"8278070001","vendor_sku":"13640","upc":"482780700019","color":"SAGE/PLATINUM","retail_price":"439.00","sale_price":"439.00"}}}
