{"sku":"827809","manufacturer_id":"13637","brand_name":"Rei","product_name":"REI Passage 1 Tent","long_description":"The REI Passage 1 is a classic, freestanding dome tent with an X-pole design. Passage 1 offers a simple setup and low weight for 1 backpacker. Asymmetrical shape and side entry vestibule maximize interior volume and livable versatility. Easy setup using equal-length aluminum poles, quick-attachment clips and color coding. Angled poles maximize usable interior volume. Seam-sealed polyester fly ensure a waterproof, durable and sag-free shelter. Seam-sealed insider floor provides the waterproofness of a bathtub floor and the taut pitch of a cut-in floor, combined with the abrasion resistance of nylon. No-Wick welded construction ensures that moisture won't wick through susceptible areas such as guyout points, pole wraps or zippers in wet conditions. Fully adjustable, high-level vents mitigate condensation, drawing cool air under the fly from the lower perimeter and exhausting warm, moist air. The REI Passage 1 tent offers multiple interior storage options provided by various combinations of mesh side pockets and hang loops located throughout. Packaged in compression storage/carry sack with 5 stakes and 2 guylines and tensioners.","short_description":"The REI Passage 1 is a classic, freestanding dome tent with an X-pole design. Passage 1 offers a simple setup and low weight for 1 backpacker.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s304079.png","image_url":"http://i1.avlws.com/115/l304079.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=304079&tt=df","keywords":"tent,backpacktent","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=304079\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m304079.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=827809&amp;link=&amp;tabs=-Details\"></script>","variants":{"8278090001":{"sku":"8278090001","vendor_sku":"13637","upc":"482780900013","color":"SAGE/PLATINUM","retail_price":"129.00","sale_price":"129.00"}}}
