{"sku":"827972","manufacturer_id":"13532","brand_name":"Rei","product_name":"REI Tech Beast Wheeled Duffel - 22\"","long_description":"The REI Tech Beast 22 is built for the short haul and keeps you organized and your travel simplified. It fits in most overhead bins and is suited for adventures that require tough luggage. High performance components, tough fabric and thoughtful design elements are blended into a small profile and targeted for space-constrained travelers. Rugged telescopic pull handle locks in up/down position; soft-touch handle grip ensures comfort and control through the twists and turns of travel. Rugged wheels and housings provide durability and smooth wheeling for the long haul. Interior frame provides structure and upright stability for transport ease. Full zippered panel-opening main compartment offers easy access. Lower front pocket has an internal expansion zipper to provide extra storage for laundry bag or shoes/boot storage. Fully lined interior features 2 compression straps and 2 side zippered mesh pockets for organization. Slip-out Travel Organizer holds essentials and has a clear panel for storing travel bottles; tethered and easy to remove for airport security screenings. Zippered front pocket allows quick stashing of last-minute items such as toothbrush or journal. Zippered pocket on back panel is sized for magazines and travel documents. Top and side grab handles make handling a breeze. REI Tech Beast is constructed of abrasion-, moisture- and tear-resistant ballistic nylon for exceptional durability.","short_description":"The REI Tech Beast 22 is built for the short haul and keeps you organized and your travel simplified. It fits in most overhead bins and is suited for adventures that require tough luggage.","category":"Luggage & Travel","subcategory":"Luggage","product_group":"Wheeled Duffels","thumb_url":"http://i1.avlws.com/115/s233579.png","image_url":"http://i1.avlws.com/115/l233579.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=233579&tt=df","keywords":"rolling,wheeled duffel,duffel,wheeled,travel","retail_price":"199.00","sale_price":"118.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=233579\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m233579.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=827972&amp;link=&amp;tabs=-Details\"></script>","variants":{"8279720002":{"sku":"8279720002","vendor_sku":"13532","upc":"482797200021","color":"BLACK","retail_price":"118.93","sale_price":"118.93"}}}
