{"sku":"827971","manufacturer_id":"13533","brand_name":"Rei","product_name":"REI Stratocruiser Wheeled Luggage - 25\"","long_description":"The REI Stratocruiser 25 combines the long-haul convenience of wheeled luggage and the flexible travel style of a backpack. Stratocruiser holds enough to keep you going for week-plus journeys. Also included is a handy detachable daypack; the daypack securly attaches to main pack via front panel buckles and a zipper attachment. Backpack-style shoulder harness, full lumbar pad and padded waistbelt with ergonomic contouring provide a great fit and secure, comfortable carrying. Suspension system hides cleanly away quickly with a single zipper. Rugged telescopic pull handle locks in up/down position; soft-touch handle grip ensures comfort and control through the twists and turns of travel. Rugged wheels and housings provide durability and smooth wheeling for the long haul; kickstand lets you park Stratocruiser upright. Interior frame provides structure and upright stability for transport ease; top and side grab handles ease hauling. Panel opening zipper provides easy access to main compartment; interior mesh pockets and compression straps provide packing convenience and organization. Main front zip pocket is roomy enough for a travel jacket; side stash pocket with elastic closure allows quick access to essentials. All exterior zippers can be secured with standard travel locks, sold separately. Accessory daypack quickly attaches for secure transport to the front panel buckles and zipper; or slide it over the telescoping handle of the main bag. Daypack has a roomy compartment, organizer panel and back panel security pocket; interior neoprene pocket fits digital e-books and most 13 in. laptops. Lightweight, mesh shoulder straps let you comfortably carry the REI Stratocruiser 25 daypack.","short_description":"The REI Stratocruiser 25 combines the long-haul convenience of wheeled luggage and the flexible travel style of a backpack. Stratocruiser holds enough to keep you going for week-plus journeys.","category":"Luggage & Travel","subcategory":"Luggage","product_group":"Wheeled Backpacks","thumb_url":"http://i1.avlws.com/115/s304343.png","image_url":"http://i1.avlws.com/115/l304343.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=304343&tt=df","keywords":"backpack,pack,back,wheeled,rolling","retail_price":"279.00","sale_price":"279.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=304343\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m304343.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=827971&amp;link=&amp;tabs=-Details\"></script>","variants":{"8279710001":{"sku":"8279710001","vendor_sku":"13533","upc":"482797100017","color":"BLACK","retail_price":"279.00","sale_price":"279.00"},"8279710002":{"sku":"8279710002","vendor_sku":"13533","upc":"482797100024","color":"ATMOSPHERE","retail_price":"279.00","sale_price":"279.00"}}}
