{"sku":"827970","manufacturer_id":"13534","brand_name":"Rei","product_name":"REI Stratocruiser Wheeled Luggage - 22\"","long_description":"The REI Stratocruiser 22 provides you with the convenience of carry-on sized wheeled luggage with the stylish look, feel and flexible performance of a backpack. Detachable daypack extends versatility. REI Stratocruiser 22 combines performance fabric, quality components and semistructured construction to create a light, tough and flexible wheeled travel pack. Backpack-style shoulder straps store easily away with single zipper closure when not is use; top and side grab handles ease hauling. Rugged telescopic pull handle locks in up/down position; a soft-touch handle grip ensures comfort and control through the twists and turns of travel. Rugged wheels and housings provide durability and smooth wheeling for the long haul; kickstand lets you park Stratocruiser upright. Interior frame provides structure and upright stability for transport ease. Panel opening zipper provides easy access to main compartment; interior mesh pockets and compression straps provide packing convenience and organization. Main front zip pocket is roomy enough for a travel jacket; side stash pocket with elastic closure allows quick access to essentials. All exterior zippers can be secured with standard travel locks, sold separately. Accessory daypack quickly attaches for secure transport to either the front panel buckles or by sliding it over the telescoping handle of the main bag. Daypack has a main compartment, organizer panel and back panel security pocket; interior neoprene pocket fits digital e-books and most 13 in. laptops. Lightweight, mesh shoulder straps comfortably carry the REI Stratocruiser 22 daypack. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"The REI Stratocruiser 22 provides you with the convenience of carry-on sized wheeled luggage with the stylish look, feel and flexible performance of a backpack. Detachable daypack extends versatility.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433759.png","image_url":"http://i1.avlws.com/115/l433759.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433759&tt=df","retail_price":"239.00","sale_price":"166.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433759\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433759.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=827970&amp;link=&amp;tabs=-Details\"></script>","variants":{"8279700001":{"sku":"8279700001","vendor_sku":"13534","upc":"482797000010","color":"BLACK","retail_price":"166.93","sale_price":"166.93"},"8279700002":{"sku":"8279700002","vendor_sku":"13534","upc":"482797000027","color":"ATMOSPHERE","retail_price":"166.93","sale_price":"166.93"}}}
