{"sku":"828002","manufacturer_id":"AXTMJK3","brand_name":"The North Face","product_name":"The North Face Better Than Naked Race Cool Capri Pants - Women's","long_description":"From the first time you put them on, The North Face Better Than Naked Race Cool capris will surpass your expectations for great workout clothing. VaporWick(R) fabric seriously keeps up with hard-working pores, taking moisture from your skin and moving to the outside surface for quick evaporation. Fabric in body of capris is partially recycled. Supportive fabric and back-of-the-knee mesh panels keep hard-working muscles comfortable when it's go time. Fabric protects skin from the sun with a UPF rating of 15. Mesh panels placed over high-heat areas enhance ventilation. Silver-salt treatment at gusset fights odors so you don't have to worry about funky capris. Elastic waist with drawstring ensures a comfortable fit. Need to stash some extra fuel for that last mile? A rear zipperless pocket stores a key, card and energy food using 2 separate mesh compartments. Simply separate the exterior and interior elastic mesh layers and insert contents, then fold the exterior layer over the interior to lock items in place. A pocket at the side of capris is designed specifically to hold an energy gel. The North Face Better Than Naked Race Cool capris feature reflective highlights that increase visibility in low light.","short_description":"From the first time you put them on, The North Face Better Than Naked Race Cool capris will surpass your expectations for great workout clothing.","category":"Women's","subcategory":"Women's Pants","product_group":"Women's Running Pants/Tights","thumb_url":"http://i1.avlws.com/115/s217927.png","image_url":"http://i1.avlws.com/115/l217927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=217927&tt=df","keywords":"tights,moisture,sweatpant,training,aerobic","retail_price":"70.00","sale_price":"48.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=217927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m217927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828002&amp;link=&amp;tabs=-Details\"></script>","variants":{"8280020001":{"sku":"8280020001","vendor_sku":"AXTMJK3","upc":"689914642768","size":"XS","color":"TNF BLACK","retail_price":"48.93","sale_price":"48.93"}}}
