{"sku":"828028","manufacturer_id":"13822","brand_name":"Rei","product_name":"REI Transit Shoulder Bag","long_description":"Urban organization and outdoor attitude! The REI Transit shoulder bag is sized and featured to meet all the challenges of the daily urban grind, and adds outdoor-inspired details to make hauling easy. Messenger bag styling; main flap has hidden security zipper closure in addition to rip-and-stick and buckle closures for quick access. Easy access organizer panel under front flap has pen slots, a fleece-lined phone pocket and additional slot pockets for small essentials. Sleek neoprene sleeve provides protection for laptop computers; sized to fit 15 in. and 16 in. laptops. Exterior zipper provides quick access to the laptop compartment. Side pockets can stretch to vary capacity, providing a convenient place to stash a water bottle or allow quick access to small essentials. Carry handle is padded with soft edge design for a comfortable grip. Durable ballistic nylon bottom panel and foam padding protect interior contents. Removable shoulder strap offers sliding shoulder pad; length is easy to adjust. Front flap has zippered pocket for quick access to small items.","short_description":"Urban organization and outdoor attitude! The REI Transit shoulder bag is sized and featured to meet all the challenges of the daily urban grind, and adds outdoor-inspired details to make hauling easy.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s215983.png","image_url":"http://i1.avlws.com/115/l215983.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=215983&tt=df","keywords":"courier,purse,day bag,commute,travel","retail_price":"84.50","sale_price":"62.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=215983\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m215983.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828028&amp;link=&amp;tabs=-Details\"></script>","variants":{"8280280001":{"sku":"8280280001","vendor_sku":"13822","upc":"482802800017","color":"BLACK","retail_price":"62.93","sale_price":"62.93"}}}
