{"sku":"828150","manufacturer_id":"27110","brand_name":"Marmot","product_name":" Marmot Limelight 3P Tent","long_description":"The Marmot Limelight 3P tent offers 3 backpackers a comfortable space and tough yet lightweight construction. Limelight also offers great value as it comes complete with footprint and gear loft! Large side doors provide convenient access; 2 vestibules offer storage space for personal gear. Color coded poles and webbing simplify setup; snag-free zipper flaps won't get hung up. DAC Pressfit(R) aluminum poles feature a pressed-in ferrule, ensuring the poles remain strong and reliable. DAC/Marmot double clips disperse stress over a large area and won't slide; plus, they have an incredible breaking strength and are easy to use with gloves. UV-resistant, seam-sealed polyester rainfly won't stretch or expand when wet, ensuring a consistently taut pitch. Catenary cut floor provides a tight pitch with reduced weight; fully seam-taped bathtub floor maintains waterproofness. Window Weld(TM) design gives views to the outside, lets in light and reduces weight; fly vent increases air circulation inside tent. Light-reflective points help you find your tent at night; jingle-free nylon zipper pulls remain quiet in windy weather. Interior pockets organize your equipment and provide storage up off the floor while inside the Marmot Limelight 3 tent. As a convenient option, poles and rainfly can be set up with the footprint to create a lightweight shelter.","short_description":"The Marmot Limelight 3P tent offers 3 backpackers a comfortable space and tough yet lightweight construction. Limelight also offers great value as it comes complete with footprint and gear loft!","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423823.png","image_url":"http://i1.avlws.com/115/l423823.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423823&tt=df","retail_price":"279.00","sale_price":"279.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423823\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423823.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828150&amp;link=&amp;tabs=-Details\"></script>","variants":{"8281500001":{"sku":"8281500001","vendor_sku":"27110","upc":"785562008571","color":"HATCH/DK CEDAR","retail_price":"279.00","sale_price":"279.00"},"8281500002":{"sku":"8281500002","vendor_sku":"27110","upc":"785562008601","color":"ALPENGLOW","retail_price":"279.00","sale_price":"279.00"}}}
