{"sku":"828305","manufacturer_id":"21190-4724","brand_name":"Marmot","product_name":" Marmot Trestles 30 Sleeping Bag","long_description":"Cold, damp weather calls for the synthetic Marmot Trestles 30 mummy sleeping bag. Bag offers lofty warmth, low bulk and excellent packability, and continues to insulate even if wet. Synthetic high-loft insulation and wave construction-overlapping shingles of insulation-combine to prevent cold spots. With a European Norm (EN) lower-limit rating of 33degF, the Trestles 30 is a versatile bag for mild-weather 3-season adventures. A blend of spiral hollow fibers and polyester fibers provides loft, warmth and compressibility. Polyester shell and lining fabrics are treated with a Durable Water Repellent finish to repel moisture and stains. 3D hood envelops your head in warmth; draw cords around hood allows face muff to be cinched snug without digging into face. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make top opening adjustments easy. 2-way, dual side zippers-1 full-zip that extends around footbox, 1 partial-zip-allow top of bag to fold back allowing easy entry. Trapezoid footbox is wide in toe area and narrow at the heels for comfort that does not compromise warmth. Zipper guard along draft tube keeps fabric from snagging in the coils. Stash pocket stows nighttime essentials. The Marmot Trestles +30 sleeping bag includes a compression stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Cold, damp weather calls for the synthetic Marmot Trestles 30 mummy sleeping bag. Bag offers lofty warmth, low bulk and excellent packability, and continues to insulate even if wet.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421259.png","image_url":"http://i1.avlws.com/115/l421259.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421259&tt=df","keywords":"compact","retail_price":"109.00","sale_price":"109.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421259\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421259.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828305&amp;link=&amp;tabs=-Details\"></script>","variants":{"8283050001":{"sku":"8283050001","vendor_sku":"21180-4724","upc":"785562007550","size":"Regular Left","color":"DARK GRASS/GREENER PASTUR","retail_price":"99.00","sale_price":"99.00"},"8283050002":{"sku":"8283050002","vendor_sku":"21190-4724","upc":"785562007574","size":"Long Left","color":"DARK GRASS/GREENER PASTUR","retail_price":"109.00","sale_price":"109.00"}}}
