{"sku":"828303","manufacturer_id":"21270-2422","brand_name":"Marmot","product_name":" Marmot Trestles 15 Sleeping Bag - Women's","long_description":"Designed for 3-season backpacking, the Marmot Trestles 15 Sleeping Bag for women provides lofty warmth, low bulk and excellent packability; plus, it continues to insulate even if wet. Women-specific bags are cut to match a woman's shape, and provide extra insulation and warmth in the hood and feet areas. Synthetic high-loft insulation and wave construction-overlapping shingles of insulation-combine to prevent cold spots. A blend of spiral hollow fibers and polyester fibers provides loft, warmth and compressibility. With a European Norm (EN) comfort rating of 14degF, the Trestles 15 isa versatile bag for lightweight 3-season adventures into the mountains. Polyester shell and lining fabrics are treated with a Durable Water Repellent finish to repel moisture and stains. 3D hood envelops your head in warmth; draw cords around hood allows face muff to be cinched snug without digging into face. Insulated draft collar features easy-access drawcord. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make top opening adjustments easy. 2-way, dual-side zippers-1 full-zip that extends around footbox, 1 partial-zip-allow top of bag to fold back, allowing easy entry. Trapezoid footbox is wide in toe area and narrow at the heels for comfort that does not compromise warmth. Zipper guard along draft tube keeps fabric from snagging in the coils. Stash pocket stows nighttime essentials. The Marmot Trestles 15 women's sleeping bag includes a compression stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Designed for 3-season backpacking, the Marmot Trestles 15 Sleeping Bag for women provides lofty warmth, low bulk and excellent packability; plus, it continues to insulate even if wet.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421255.png","image_url":"http://i1.avlws.com/115/l421255.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421255&tt=df","keywords":"compact","retail_price":"119.00","sale_price":"119.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421255\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421255.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828303&amp;link=&amp;tabs=-Details\"></script>","variants":{"8283030001":{"sku":"8283030001","vendor_sku":"21260-2422","upc":"785562007789","size":"Regular Right","color":"CEYLON BLUE/LAPIS BLUE","retail_price":"109.00","sale_price":"109.00"},"8283030002":{"sku":"8283030002","vendor_sku":"21270-2422","upc":"785562007802","size":"Long Right","color":"CEYLON BLUE/LAPIS BLUE","retail_price":"119.00","sale_price":"119.00"}}}
