{"sku":"828301","manufacturer_id":"21310-9512","brand_name":"Marmot","product_name":" Marmot Trestles 0 Sleeping Bag","long_description":"Pack the warm, compressible Marmot Trestles 0 mummy sleeping bag along on your next cold-weather trip and sleep easy! SpiraFil 120 high loft insulation and Wave Construction fight the cold to keep you comfortable all night. Unique blend of 3-denier conjugated spiral hollow fibers and 1-denier polyester fibers provides loft, warmth and compressibility. Wave construction, consisting of overlapping shingles of insulation throughout the bag, prevents cold spots. With a European Norm (EN) lower limit rating of 0degF, the Trestles 0 sleeping bag is suitable for fall, winter and spring use. Polyester shell and lining fabrics are treated with a Durable Water Repellent finish to repel moisture and stains. 3D hood envelops your head in warmth; draw cords around hood allows face muff to be cinched snug without digging into face. Insulated draft collar features easy-access drawcord. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make top opening adjustments easy. 2-way, dual-side zippers-1 full-zip that extends around footbox, 1 partial-zip-allow top of bag to fold back, allowing easy entry. Trapezoid footbox is wide in toe area and narrow at the heels for comfort that does not compromise warmth. Zipper guard along draft tube keeps fabric from snagging in the coils. Stash pocket stows nighttime essentials. The Marmot Trestles +0 sleeping bag includes a compression stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Pack the warm, compressible Marmot Trestles 0 mummy sleeping bag along on your next cold-weather trip and sleep easy!","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421247.png","image_url":"http://i1.avlws.com/115/l421247.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421247&tt=df","keywords":"compact","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421247\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421247.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828301&amp;link=&amp;tabs=-Details\"></script>","variants":{"8283010001":{"sku":"8283010001","vendor_sku":"21300-9512","upc":"785562007819","size":"Regular Left","color":"MALAIA GOLD/FLINT","retail_price":"139.00","sale_price":"139.00"},"8283010002":{"sku":"8283010002","vendor_sku":"21310-9512","upc":"785562007857","size":"Long Left","color":"MALAIA GOLD/FLINT","retail_price":"149.00","sale_price":"149.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
