{"sku":"828494","manufacturer_id":"13598","brand_name":"Rei","product_name":"REI Magma Sleeping Bag","long_description":"Our premium cold weather bag, the REI Magma sleeping bag features goose down insulation and a waterproof, breathable shell for protection from damp and chilly nights. Tested by an independent third-party lab using European Norm protocol, the EN temperature ratings allow direct comparisons across brands with other EN-rated bags. Waterproof, breathable shell is an ultralight, coated ripstop nylon designed to dissipate moisture from the inside and repel moisture from the outside, keeping the down dry. 800-fill-power goose down is efficiently distributed for maximum warmth and compressibility; ultralight polyester mini-ripstop lining has a soft hand-feel. Exclusive REI Down Fill Calculator optimizes the amount of down per baffle for the most warmth with the least amount of down. 60% of insulation is put on top of bag where it contributes the most warmth and loft. In-the-round pattern wraps vertical baffles around perimeter of sleeping bag, from head to foot, creating a 3-dimensional bag that wraps you in warmth. Performance fit saves weight by reducing girth at shoulders, hips and lower legs while increasing thermal efficiency. Baffle spacing is optimized to keep down in place and prevent cold spots. Multichambered contour hood, insulated full-face muffler, and full-length zipper draft tube with ground-level seams all work to keep heat in and cold out. Anatomically contoured draft collar drapes lower in the front and higher in the back for a better fit; cinch adjustable to seal in warmth. Trapezoidal footbox mirrors sleeping position for room to move and thermal efficiency. External chest pocket keeps small essentials-headlamp, watch, glasses-right at hand and easy to find in the dark. Includes nylon stuff sack and large cotton storage bag. Differentiated drawcords (1 round, 1 flat) allow quick identification, even in the dark, so neck and hood adjustments are a cinch.","short_description":"Our premium cold weather bag, the REI Magma sleeping bag features goose down insulation and a waterproof, breathable shell for protection from damp and chilly nights.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s218191.png","image_url":"http://i1.avlws.com/115/l218191.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=218191&tt=df","keywords":"insulated,sleeping,winter,bag,cold","retail_price":"419.00","sale_price":"299.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=218191\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m218191.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828494&amp;link=&amp;tabs=-Details\"></script>","variants":{"8284940001":{"sku":"8284940001","vendor_sku":"13598","upc":"482849400010","size":"Long Left","color":"PERSIMMON/STEEL","retail_price":"299.93","sale_price":"299.93"}}}
