{"sku":"828440","manufacturer_id":"038110-654-1-O/","brand_name":"Osprey","product_name":" Osprey Poco Premium Child Carrier","long_description":"The Osprey Poco Premium child carrier incorporates a reputation for cutting-edge pack technology and design into a kid hauler that offers comfort, durability and user-friendly features. For the adult, Poco Premium features a ventilated, tensioned mesh back panel, effortless torso adjustment and a wide range of adjustability for the plushly padded hipbelt. Your child will enjoy the ride in a soft, ventilated and height-adjustable cockpit; padded, secure shoulder straps feature buckles that attach out of the child's reach. Child's cockpit is surrounded by padded framing and features adjustable stirrups for a comfortable ride. Drool pad is machine-washable and easy to remove. Hydration sleeve behind the back panel holds a reservoir of your choice (reservoir sold separately). Use the detachable daypack as an onboard diaper bag, or lighten your load and let someone else carry it. Plenty of pockets and a spacious storage compartment make it a simple endeavor to pack and organize snacks, drinks, clothes and other essentials. Innovative, built-in sunshade quickly folds flat and stows away in a zippered pocket when not in use. Strong, powder-coated aluminum frame with injection-molded hinges stands upright on the ground and folds easily for storage or travel. The Osprey Poco Premium child carrier features a diaper changing pad that makes your youngster's response to the call of nature a lot less unpleasant to manage.","short_description":"The Osprey Poco Premium child carrier incorporates a reputation for cutting-edge pack technology and design into a kid hauler that offers comfort, durability and user-friendly features.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Baby Carrier Packs","thumb_url":"http://i1.avlws.com/115/s410319.png","image_url":"http://i1.avlws.com/115/l410319.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410319&tt=df","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410319\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410319.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828440&amp;link=&amp;tabs=-Details\"></script>","variants":{"8284400002":{"sku":"8284400002","vendor_sku":"038110-590-1-O/","upc":"877257012120","size":"One Size","color":"KOALA GREY","retail_price":"299.95","sale_price":"299.95"}}}
