{"sku":"828489","manufacturer_id":"13596","brand_name":"Rei","product_name":"REI Igneo Sleeping Bag","long_description":"In awarding its 2012 Gear of the Year Award,. Further, \"The ... real standout feature was the new waterproof coating ... designed to repel condensation without the weight, bulk, and annoying ... crinkle of a waterproof shell.\". The REI Igneo 3-season premium backpacking sleeping bag features goose down insulation and a waterproof, breathable shell fabric for slaying cold nights in the backcountry. Tested by an independent third-party lab using European Norm protocol, the EN temperature ratings allow direct comparisons across brands with other EN-rated bags. Waterproof, breathable shell fabric is an ultralight, coated ripstop nylon designed to dissipate moisture from the inside, repel moisture from the outside and keep down dry. 800-fill-power goose down is efficiently distributed for maximum warmth and compressibility; ultralight polyester mini-ripstop lining has a soft hand-feel. Exclusive REI Down Fill Calculator optimizes the amount of down per baffle for the most warmth with the least amount of down. 60% of insulation is put on top of bag where it contributes the most warmth and loft. In-the-round pattern wraps vertical baffles around perimeter of sleeping bag, from head to foot, creating a 3-dimensional bag that wraps you in warmth. Performance fit saves weight by reducing girth at shoulders, hips and lower legs while increasing thermal efficiency. Baffle spacing is optimized to keep down in place and prevent cold spots. Multichambered contour hood, insulated full-face muffler, puffy interior yoke, and full-length zipper draft tube with ground-level seams all work to keep heat in and cold out. Trapezoidal footbox mirrors sleeping position for room to move and thermal efficiency. External chest pocket keeps small essentials-headlamp, watch, glasses-right at hand and easy to find in the dark. Includes nylon stuff sack and large cotton storage bag.","short_description":"In awarding its 2012 Gear of the Year Award, Outside magazine said, \"The Igneo has all the features you want in a sleeping bag, and lacks two things you don't: extra weight and a high price.\".","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s218187.png","image_url":"http://i1.avlws.com/115/l218187.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=218187&tt=df","keywords":"cold,sleep,sleeping,bag,insulated","retail_price":"359.00","sale_price":"259.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=218187\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m218187.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828489&amp;link=&amp;tabs=-Details\"></script>","variants":{"8284890001":{"sku":"8284890001","vendor_sku":"13596","upc":"482848900016","size":"Long Left","color":"HYPER BLUE/STEEL","retail_price":"259.93","sale_price":"259.93"},"8284890002":{"sku":"8284890002","vendor_sku":"13596","upc":"482848900023","size":"Regular Left","color":"HYPER BLUE/STEEL","retail_price":"249.93","sale_price":"249.93"}}}
