{"sku":"828432","manufacturer_id":"033732-771-2-M/","brand_name":"Osprey","product_name":"Osprey Kestrel 32 Pack","long_description":"The Osprey Kestrel 32 pack sports a svelte design with lightweight materials and all the features you need for done-in-a-day climbing, cragging and other outdoor adventures. Mesh-covered, die-cut EVA hipbelt saves weight and enhances breathability. Pack fits a wide variety of backs thanks to rip-and-stick, torso-length adjustability: just rip it, adjust it and stick it. Back panel features ridge-molded foam with channels covered in mesh to allow airflow. Peripheral-hoop alloy frame and HDPE framesheet provide a flexible and light structure. Trekking pole attachment lets you stow and remove poles (not included) while wearing pack. Poles tuck away between your arm and pack; adjustable shockcord on left-hand shoulder strap and a side loop hold poles in tightly. Front and side stretch-woven pockets are ideal for stashing a jacket and other often-used gear. Hipbelt features 2 zippered pockets for stashing a digital camera and snacks. Hydration-compatible design features reservoir sleeve and drink tube exit port for on-the-go hydration (reservoir sold separately). 2 ice axe loops with bungee tool tie-offs let you lash extra gear outside. Side compression straps let you cinch down loads for jostle-free carrying. The Osprey Kestrel 32 pack features an integrated raincover that pulls out in a flash to protect contents from sudden downpours.","short_description":"The Osprey Kestrel 32 pack sports a svelte design with lightweight materials and all the features you need for done-in-a-day climbing, cragging and other outdoor adventures.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411031.png","image_url":"http://i1.avlws.com/115/l411031.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411031&tt=df","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411031\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411031.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828432&amp;link=&amp;tabs=-Details\"></script>","variants":{"8284320001":{"sku":"8284320001","vendor_sku":"033732-500-1-S/","upc":"877257011741","size":"S/M","color":"TALUS GREY","retail_price":"149.95","sale_price":"149.95"},"8284320003":{"sku":"8284320003","vendor_sku":"033732-771-1-S/","upc":"877257011789","size":"S/M","color":"CONIFER GREEN","retail_price":"149.95","sale_price":"149.95"}},"categories":["camping-hiking","backpacks","day-packs"]}
