{"sku":"828490","manufacturer_id":"14165","brand_name":"Rei","product_name":"REI Lyra Sleeping Bag - Women's","long_description":"The women's REI Lyra 3-season backpacking synthetic sleeping bag features amazing compressibility and warmth while balancing price and performance. Women-specific bags are cut to match a woman's shape, and provide extra insulation for warmth. Tested by an independent third-party lab using European Norm protocol, the EN temperature ratings allow direct comparisons across brands with other EN-rated bags. Synthetic Thermawave polyester insulation is durable and highly compressible; synthetic polyester fill retains some insulating properties even when wet. 60% of insulation is put on top of bag where it contributes the most warmth and loft. Relaxed fit through the shoulders and hips gives you room to move for a better night's rest. Mummy shape is thermally efficient, yet roomy enough to ensure sleeping comfort. Ripstop nylon shell fabric has a nice hand feel, is lightweight, durable, water- and abrasion resistant; nylon taffeta lining is soft and tear-resistant. Shell fabric is treated with a Durable Water Repellent finish for water resistance and quick drying. Contoured hood, insulated full-face muffler, puffy interior yoke, roomy footbox and full-length-zipper draft tube with ground-level seams all work to keep heat in and cold out. External chest pocket keeps small essentials-headlamp, watch, glasses-right at hand and easy to find in the dark. Special pocket in hood can be stuffed with clothing layers to make a pillow that stays in place; no need for a pillow to take up valuable space in your backpack. Pad loops provide attachment points to keep your sleeping bag and pad together, so you needn't worry about rolling onto the cold ground (straps sold separately). Full-length zipper is backed by wide, antisnag binding tape. Differentiated drawcords (1 round, 1 flat) allow quick identification, even in the dark, so neck and hood adjustments are a cinch.","short_description":"The women's REI Lyra 3-season backpacking synthetic sleeping bag features amazing compressibility and warmth while balancing price and performance.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s218019.png","image_url":"http://i1.avlws.com/115/l218019.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=218019&tt=df","keywords":"cold,sleep,sleeping,bag,winter","retail_price":"169.00","sale_price":"124.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=218019\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m218019.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828490&amp;link=&amp;tabs=-Details\"></script>","variants":{"8284900001":{"sku":"8284900001","vendor_sku":"14165","upc":"482849000012","size":"Long Right","color":"TARO LEAF/NETTLE","retail_price":"124.93","sale_price":"124.93"},"8284900002":{"sku":"8284900002","vendor_sku":"14165","upc":"482849000029","size":"Regular Right","color":"TARO LEAF/NETTLE","retail_price":"114.93","sale_price":"114.93"}}}
