{"sku":"828565","manufacturer_id":"40812012","brand_name":"Kelty","product_name":" Kelty Trail Ridge 2 Tent","long_description":"It's all about livable space with the Kelty Trail Ridge 2 tent. This is an affordable, trail-worthy tent designed for performance on your next backpacking adventure. Near-vertical walls result in increased chill space. Dual doors offer convenient access without having to climb over your partner; 2 vestibules provide convenient and protected gear storage. Freestanding design is easy to move around for ideal campsite placement. Color-coded clip construction is quick and easy to set up, and eliminates guesswork. DAC Pressfit(R) poles feature a securely fixed, pressed-in ferrule, ensuring the poles will remain strong and reliable. All seams are factory-taped to ensure excellent weather protection. Mesh wall panels offer cross ventilation and visibility. ArcEdge(TM) floor stays taut; design keeps waterproof seams off the ground. Fly attaches to tent via easy-to-use and secure side-release buckles. Fly vents keep air circulating within the tent while guyout points let you batten down the hatches in windy weather. Noiseless zipper pulls are quiet in windy weather. Internal storage pockets and included gear loft keep your tent neat. Kelty Trail Ridge 2 tent comes with stuff sacks and stakes.","short_description":"It's all about livable space with the Kelty Trail Ridge 2 tent. This is an affordable, trail-worthy tent designed for performance on your next backpacking adventure.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423831.png","image_url":"http://i1.avlws.com/115/l423831.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423831&tt=df","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423831\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423831.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828565&amp;link=&amp;tabs=-Details\"></script>","variants":{"8285650001":{"sku":"8285650001","vendor_sku":"40812012","upc":"727880028732","color":"COOL GRAY/APPLE GREEN","retail_price":"199.95","sale_price":"199.95"}}}
