{"sku":"828610","manufacturer_id":"N0815012","brand_name":"Kelty","product_name":" Kelty Acadia 6 Tent","long_description":"You'll live comfortably in the Acadia 6 tent from Kelty. It boasts large doors, dual vestibules and easy setup. Large dual doors offer easy access; a large front vestibule and a smaller rear one offer covered storage and protected entrances. 3-pole design and clip construction ensure a fast and easy setup. High-quality fiberglass poles offer excellent performance at a lower cost than aluminum. Freestanding design is easy to move around for ideal campsite placement. All seams are factory-taped to ensure excellent weather protection. Mesh wall panels offer good cross ventilation and visibility. ArcEdge(TM) floor stays taut; design keeps waterproof seams off the ground. UV-resistant polyester rainfly will not stretch when wet, ensuring a consistently taut pitch. Fly attaches to tent via easy-to-use and secure side-release buckles. Fly vents keep air circulating within the tent. Features multiple guyout points and noiseless zipper pulls. Internal storage pockets store small essentials. Kelty Acadia 6 tent comes with stuff sacks and stakes.","short_description":"You'll live comfortably in the Acadia 6 tent from Kelty. It boasts large doors, dual vestibules and easy setup.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424379.png","image_url":"http://i1.avlws.com/115/l424379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424379&tt=df","retail_price":"279.95","sale_price":"279.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828610&amp;link=&amp;tabs=-Details\"></script>","variants":{"8286100001":{"sku":"8286100001","vendor_sku":"N0815012","upc":"727880030179","color":"COOL GRAY/APPLE GREEN","retail_price":"279.95","sale_price":"279.95"}}}
