{"sku":"828737","manufacturer_id":"010-00970-25","brand_name":"Garmin","product_name":"Garmin eTrex 30 Topo GPS Bundle","long_description":"The Garmin eTrex 30 Topo GPS bundle combines the user-friendly eTrex 30 with TOPO U.S. 100K mapping, 1-year BirdsEye subscription and a handy carrying case. With a 3-axis compass, full-color display and geocaching, the compact Garmin eTrex 30 offers a fun and easy GPS experience for outdoor enthusiasts. TOPO U.S. 100K mapping and a built-in worldwide basemap with shaded relief that helps you navigate with ease. 1-year subscription to BirdsEye Satellite Imagery adds a high-resolution satellite view. 3-axis, tilt-compensated electronic compass shows your heading even when you're standing still and holding the unit upright or at an angle. Features a 2.2 in., 65k color display that can be viewed in bright sunlight. WAAS-enabled receiver locates your position quickly and maintains reception under heavy cover. Compatibility with Russian Glonass system allows about 20% faster and more reliable satellite acquisition, helpful in challenging spots such as deep canyons or tall buildings. Allows wireless unit-to-unit transfer of routes, tracks, waypoints and geocaches; works with Montana-series, Oregon-series, Dakota 20, GPSMAP 62S, 62ST, 78S and 78SC devices. 1.7 gigabytes of memory make it easy to add maps; choose from Garmin TOPO U.S. 24k maps, BlueChart(R) g2 marine maps and City Navigator(R) road maps (sold separately). Altimeter tracks changes in barometric pressure to pinpoint your altitude while you're on the trail. Supports geocaching GPX files for downloading geocache locations and details straight to the unit using the high-speed USB connection. Stores and displays geocache location, terrain, difficulty, hints and descriptions-no more manually entering coordinates or toting around paper printouts! MicroSD(TM) card slot for storing additional data. Operational buttons are located along the sides of the device for easy 1-hand operation. 2 AA batteries (sold separately) provide up to 25 hrs.","short_description":"The Garmin eTrex 30 Topo GPS bundle combines the user-friendly eTrex 30 with TOPO U.S. 100K mapping, 1-year BirdsEye subscription and a handy carrying case.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412539.png","image_url":"http://i1.avlws.com/115/l412539.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412539&tt=df","keywords":"hiking","retail_price":"369.95","sale_price":"369.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412539\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412539.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828737&amp;link=&amp;tabs=-Details\"></script>","variants":{"8287370001":{"sku":"8287370001","vendor_sku":"010-00970-25","upc":"753759979379","retail_price":"369.95","sale_price":"369.95"}},"categories":["camping-hiking","camp-electronics","gps"]}
