{"sku":"828736","manufacturer_id":"010-00970-15","brand_name":"Garmin","product_name":" Garmin eTrex 20 Topo GPS Bundle","long_description":"The Garmin eTrex 20 Topo GPS bundle combines the eTrex 20 GPS with a TOPO U.S. 100K preprogrammed card, case and PC cable. eTrex 20 GPS features an full-color display, expandable memory and geocaching to offer a fun and easy GPS experience for outdoor enthusiasts. Comes with TOPO U.S. 100K mapping and a built-in worldwide basemap with shaded relief that helps you navigate with ease. Features a 2.2 in., 65k color display can be viewed in bright sunlight;. WAAS-enabled receiver locates your position quickly and maintains reception under heavy cover. Compatibility with Russian Glonass system allows about 20% faster and more reliable satellite acquisition, helpful in challenging spots such as deep canyons or tall buildings. 1.7 gigabytes of memory make it easy to add maps; choose from Garmin TOPO U.S. 24k maps, BlueChart(R) g2 marine maps and City Navigator(R) road maps (sold separately). Supports geocaching GPX files for downloading geocache locations and details straight to the unit using the high-speed USB connection. Stores and displays geocache location, terrain, difficulty, hints and descriptions-no more manually entering coordinates or toting around paper printouts! Operational buttons are located along the sides of the device for easy 1-hand operation. 2 AA batteries (sold separately) provide up to 25 hrs. of use of the Garmin eTrex 20 GPS. Waterproof design meets IEC 60529 lPX7 standards (can be submerged to 1m for up to 30 min.).","short_description":"The Garmin eTrex 20 Topo GPS bundle combines the eTrex 20 GPS with a TOPO U.S. 100K preprogrammed card, case and PC cable.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s447995.png","image_url":"http://i1.avlws.com/115/l447995.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=447995&tt=df","retail_price":"249.95","sale_price":"249.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=447995\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m447995.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=828736&amp;link=&amp;tabs=-Details\"></script>","variants":{"8287360001":{"sku":"8287360001","vendor_sku":"010-00970-15","upc":"753759979362","retail_price":"249.95","sale_price":"249.95"}}}
