{"sku":"829207","brand_name":"The North Face","product_name":"The North Face Bastion 4 Tent","long_description":"This 4-season expedition base camp tent is built to withstand the worst Mother Nature has to offer. The Bastion 4 is part of The North Face Summit Series(TM) gear. Front door has both mesh and fabric panels, providing user-friendly entry/exit and good ventilation; large pole-supported front vestibule with snowflap adds stability. Rear door allows entry and exit, and access to items in the rear vestibule; half mesh panel assists ventilation while saving overall weight. Color-matched canopy and rainfly webbing allow easy set-up; side-release buckles at pole intersection points ensure a strong connection. Fusion Pitch combines continuous pole sleeves with clip construction for easy setup and improved ventilation without sacrificing strength. Internal guyout system adds extra stability during high winds and extreme conditions. Ground level stakeout points allow side poles to be staked down at ground level on a bivy platform to secure against winds that blow up the slope and underneath the tent. Rainfly vestibule features flat-sleeve construction; pole initiation is quick and easy especially in bad weather, and the sleeve sheds weather effectively. High-low ventilation design harnesses convection and cross-flow to help expel moisture vapor and prevent interior condensation. DAC Featherlite(R) NSL poles utilize unique inserts to create strong, functional poles that save weight and reduce breakage. Rainfly and floor feature a waterproof polyurethane coating for superior protection and durability. Taped, seam-tensioned bucket floor offers clean angles and usable space. Abundant pockets keep small gear organized. No-stretch Kevlar(R) guylines with self-locking cams hold the fly taut for the severe conditions 4-season tents might encounter. Polyurethane vestibule window, cold crack tested to -60deg F, improves living conditions by increasing light and views.","short_description":"This 4-season expedition base camp tent is built to withstand the worst Mother Nature has to offer. The Bastion 4 is part of The North Face Summit Series(TM) gear.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s238723.png","image_url":"http://i1.avlws.com/115/l238723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=238723&tt=df","keywords":"backpacktent,tent","retail_price":"799.00","sale_price":"799.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=238723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m238723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829207&amp;link=&amp;tabs=-Details\"></script>","variants":{"8292070001":{"sku":"8292070001","vendor_sku":"AWKN56P","upc":"617932903493","color":"SUMMIT GOLD","retail_price":"799.00","sale_price":"799.00"}}}
