{"sku":"829302","manufacturer_id":"T-415","brand_name":"Vargo","product_name":"Vargo Titanium Hexagon Backpacking Wood Stove","long_description":"Shave even more weight off your load by leaving the fuel at home. With the Vargo Titanium Hexagon backpacking wood stove you can use sticks and twigs to cook your meals. Lightweight titanium design weighs only 4.1 oz.; titanium panels stand up to regular use and hot temperatures without damage. Stove folds flat for compact storage in your backpack; unfold the hinged panels and snap the stove together when you're ready to cook. Conical shape focuses heat upward for efficient cooking; notches at the top of the side panels allow the flames to spread out around your pot (sold separately). Hinged access door can be opened or closed to control the amount of air that reaches the fire; door also allows you to add more sticks to the fire. Vargo recommends cooking with a pot no larger than 1.5 liters (50.7 fl. oz.). The Vargo Titanium Hexagon backpacking wood stove includes a nylon carrying case. Remember to practice responsible Leave No Trace principles by only burning downed sticks; gather wood from a wide area away from your camp and scatter any unused wood.","short_description":"Shave even more weight off your load by leaving the fuel at home. With the Vargo Titanium Hexagon backpacking wood stove you can use sticks and twigs to cook your meals.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416523.png","image_url":"http://i1.avlws.com/115/l416523.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416523&tt=df","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416523\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416523.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829302&amp;link=&amp;tabs=-Details\"></script>","variants":{"8293020001":{"sku":"8293020001","vendor_sku":"T-415","upc":"818881004150","retail_price":"59.95","sale_price":"59.95"}},"categories":["camping-hiking","camp-kitchen","stoves"]}
