{"sku":"829372","manufacturer_id":"4348224400","brand_name":"Deuter","product_name":" Deuter Aircontact 70 + 10 SL Pack - Women's","long_description":"The women's Deuter Aircontact 70 + 10 SL pack is a feature-rich gear hauler. Enjoy its quality, durability, capacity and comfort on your next multiday adventure in the great outdoors. SL (Slimline) fit is specifically designed with narrow, short shoulder straps and short torso proportions for women. Aircontact system features anatomically shaped, 3D air-mesh covered shoulder straps and a Variflex hipbelt that pivots to follow your movement and help you keep your balance. Forward-pull hipbelt features an anatomic cut with bi-laminate foam and a reinforced polyethylene sheet that provide freedom of movement and great load transfer. Breathable, hollow-chamber foam back panel offers excellent ventilation with a \"pump\" effect that circulates air through the cushioning for comfort and reduced perspiration. Variquick adjustable harness lets you easily change the height to create the perfect individualized fit. Hollow-core aluminum X-frame stays are anatomically shaped, helping create comfortable and flexible support for heavy loads. Top-loading main compartment offers lots of room for your gear; U-shaped zipper on the front panel offers easy access to the main compartment. Hydration-compatible design features reservoir pocket and drink tube exit port for on-the-go hydration (reservoir sold separately). Separate bottom compartment lets you stuff your sleeping bag directly into the pack; bottom compartment shares a zippered separator with the main compartment. Top lid features inside and outside zippered pockets and is height-adjustable to create extra space for ropes or other bulky items. Pack exterior features a zippered map pocket, 2 side stretch pockets, compression straps, daisy chains and dual ice axe/trekking pole loops. Deuter Aircontact 70 + 10 SL pack features an integrated, detachable raincover that helps keep your pack and its contents dry.","short_description":"The women's Deuter Aircontact 70 + 10 SL pack is a feature-rich gear hauler. Enjoy its quality, durability, capacity and comfort on your next multiday adventure in the great outdoors.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410515.png","image_url":"http://i1.avlws.com/115/l410515.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410515&tt=df","keywords":"multiday","retail_price":"289.00","sale_price":"289.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410515\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410515.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829372&amp;link=&amp;tabs=-Details\"></script>","variants":{"8293720001":{"sku":"8293720001","vendor_sku":"4348224400","size":"One Size","color":"PINE/SILVER","retail_price":"289.00","sale_price":"289.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
