{"sku":"829380","manufacturer_id":"268-6-2000","brand_name":"Timbuk2","product_name":" Timbuk2 Command Messenger Bag - Large","long_description":"The large-size Timbuk2 Command Messenger bag is TSA-compliant and offers sophisticated laptop portage for the urban jungle. More Berlin than Berkeley, the Command's oxford nylon and anodized hardware make it the most sophisticated bag from Timbuk2. Durable Oxford nylon fabric feels smooth and has a subtle sheen; waterproof thermoplastic urethane liner. Fits up to a 15 in. laptop; TSA-compliant external laptop compartment unzips and lies flat for going through security without removing your laptop. Grab-and-go carry handle: grab your bag from the security line without worrying that the laptop will fall out; you can zip it up later at your convenience. External laptop compartment is easy to access while carrying the Command Messenger by the shoulder strap; rubber nubs inside the foam pocket ensure superb protection. 3 pockets underneath front flap have 2 different colored zippers for easier identification; also includes a drop-in pocket and side-entry zip pocket. Internal organization includes 2 large internal slot pockets and zippered pocket, including additional pen slots and business card slot. Luggage pass-through allows you to strap the Command Messenger over your wheeled luggage handle, or it can be used as another stash pocket. Adjustable cam buckle enables you to strap on the Command with ease; coordinating strap pad ensures comfort.","short_description":"The large-size Timbuk2 Command Messenger bag is TSA-compliant and offers sophisticated laptop portage for the urban jungle.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Messenger Bags","thumb_url":"http://i1.avlws.com/115/s456051.png","image_url":"http://i1.avlws.com/115/l456051.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456051&tt=df","keywords":"courier","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456051\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456051.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829380&amp;link=&amp;tabs=-Details\"></script>","variants":{"8293800001":{"sku":"8293800001","vendor_sku":"268-6-2000","upc":"631364507197","color":"BLACK","retail_price":"149.00","sale_price":"149.00"}},"categories":["travel","day-bags-and-packs","messenger-bags"]}
