{"sku":"829590","manufacturer_id":"20651212 - RR","brand_name":"Kelty","product_name":" Kelty Pathfinder 3.0 Frame Child Carrier","long_description":"The top-of-the-line Kelty Pathfinder 3.0 child carrier is loaded with convenient features and offers the ultimate in comfort for you and your little hitchhiker. Premium features, such as a zip-off daypack, diaper-changing pad and secure leg straps for your child, elevate this child carrier to a new standard of convenience. Laminated, padded and contoured hipbelt and shoulder straps ensure carrying comfort; easy torso-length adjustment allows easy fitting changes between short and tall parents. Height-adjustable child cockpit features a padded, 5-point harness, toy loops and removable, washable chin pad; removable sunshade enhances comfort and protection. Lightweight aluminum frame and patented Auto-Deploy(TM) kickstand with no-pinch hinges provide a stable platform for loading and unloading your child. Front compartment, hipbelt pocket, side water bottle pocket and under-seat storage offer room for food, bottles and diapers. The Kelty Pathfinder 3.0 child carrier features a hydration-ready design that accommodates a reservoir and drink tube (sold separately).","short_description":"The top-of-the-line Kelty Pathfinder 3.0 child carrier is loaded with convenient features and offers the ultimate in comfort for you and your little hitchhiker.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Baby Carrier Packs","thumb_url":"http://i1.avlws.com/115/s410323.png","image_url":"http://i1.avlws.com/115/l410323.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410323&tt=df","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410323\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410323.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829590&amp;link=&amp;tabs=-Details\"></script>","variants":{"8295900001":{"sku":"8295900001","vendor_sku":"20651212 - BK","upc":"727880029579","size":"One Size","color":"BLACK","retail_price":"299.95","sale_price":"299.95"}}}
