{"sku":"829549","manufacturer_id":"E87 P2","brand_name":"Petzl","product_name":" Petzl Myo RXP Headlamp","long_description":"Take on any nighttime adventure with the Petzl Myo RXP LED headlamp. It's programmable so you can choose the order and intensity of the brightness levels to meet your needs. Features 3 lighting levels that can each be programmed to output a different amount of lumens; choose from 10 possible lumen outputs, ranging from 13 - 141 lumens. Being able to program the output lets you determine the balance between light intensity and battery life that you need for a short nighttime run or a multiday backpacking trip. Strobe mode can also be programmed to flash slow, fast or as an SOS signal. Single powerful LED outputs 141 lumens on high and features a Boost mode that gives you a temporary blast of light that outputs 205 lumens and throws light up to 90m (295 ft.). Wide-angle lens flips up and down to let you quickly switch between flood proximity lighting and focused long-distance lighting. Light automatically switches to reserve power mode when the batteries are running low; battery power indicator shows you when batteries are 70% and 90% discharged. Headlamp includes 3 AA alkaline batteries; also compatible with lithium, rechargeable NiMH and rechargeable NiCad batteries (sold separately). 3 AA alkaline batteries provide up to 53 hrs. of use on high and 86 hrs. on low. Regulated output ensures consistent light levels throughout the life of the batteries. Provides IPX4 water resistance for protection against sprayed water. On/off switches are protected from accidental operation when the light body is in the upright position. Petzl Myo RXP headlamp has an adjustable elastic headband that fits most heads; top strap is included (not attached) and can be worn to increase stability.","short_description":"Take on any nighttime adventure with the Petzl Myo RXP LED headlamp. It's programmable so you can choose the order and intensity of the brightness levels to meet your needs.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417059.png","image_url":"http://i1.avlws.com/115/l417059.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417059&tt=df","retail_price":"94.95","sale_price":"94.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417059\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417059.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829549&amp;link=&amp;tabs=-Details\"></script>","variants":{"8295490001":{"sku":"8295490001","vendor_sku":"E87 P2","color":"BLACK","retail_price":"94.95","sale_price":"94.95"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
