{"sku":"829610","manufacturer_id":"30260100","brand_name":"Pacsafe","product_name":" Pacsafe Metrosafe 350 GII Daypack","long_description":"The Pacsafe Metrosafe 350 GII keeps you well-organized with 5 anti-theft features. It's large enough to fit a 13 in. laptop and is an ideal companion that maneuvers well around busy city streets. RFID-reader-blocking pocket prevents access to your personal data stored on micro chips in your passport and credit cards. Features eXomesh(R) slashguards: lightweight stainless-steel wire mesh is built discreetly into the bottom and side panels, which are areas targeted by bag slashers. Flexible, lightweight stainless-steel wire is integrated into adjustable carry strap to prevent bag slashers from slicing through and running off with your gear. Shoulder strap has a releasable security hook at 1 end that allows the strap to be attached to a fixture so nobody can walk off with your bag. Large main zippered compartment with padded slip pocket; front zippered organizer pocket. Bright colored liner adds some fun and helps you easily locate what you need, when you need it; padded electronic pocket fits up to a 13 in. laptop or tablet. Padded back adds support and comfort. Rear zippered pocket with concealable zipper pull prevents a pickpocket from reaching into your bag. 2 water bottle/umbrella side pockets. Pacsafe Metrosafe 350 includes a pen holder and key clip.","short_description":"The Pacsafe Metrosafe 350 GII keeps you well-organized with 5 anti-theft features. It's large enough to fit a 13 in. laptop and is an ideal companion that maneuvers well around busy city streets.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s432995.png","image_url":"http://i1.avlws.com/115/l432995.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432995&tt=df","keywords":"backpack","retail_price":"100.00","sale_price":"100.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432995\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432995.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829610&amp;link=&amp;tabs=-Details\"></script>","variants":{"8296100001":{"sku":"8296100001","vendor_sku":"30260100","upc":"688334004361","color":"BLACK","retail_price":"100.00","sale_price":"100.00"}}}
