{"sku":"829603","manufacturer_id":"010-00743-70","brand_name":"Garmin","product_name":"Garmin FR70 Heart Rate Monitor - Men's","long_description":"The easy-to-use Garmin FR70 heart rate monitor keeps track of your time, calories burned, heart rate and more so you make the most of every workout. Included heart rate monitor chest strap communicates with the watch to provide you with accurate heart rate data while running. FR70 tracks beats per minute and displays your heart rate zone so you can monitor and improve your fitness level. Features an advanced calorie-consumption formula that calculates calories burned based on changes in the user's heart rate during aerobic activity. ANT+(TM) technology allows the FR70 to wirelessly connect with the included heart rate monitor and send your workout data to your computer for later analysis. ANT+ also enables the watch to connect with a foot pod, speed/cadence sensor, fitness equipment and weight scales (all sold separately). Upload data wirelessly to the Garmin Connect community website for in-depth analysis of time, speed, distance and route; store and share data with other community users. Add the optional foot pod to capture your speed and distance while you run; when paired with foot pod, use your FR70 to race against previous times and for interval workouts. FR70 tracks your cycling workouts when paired with a GSC 10 Speed and Cadence Sensor, sold separately. Water resistant to 50m (165 ft.). Standard watch functions include time of day (12/24 hr.), dual time zone, calendar (day/date) and a daily alarm. User-replaceable CR2032 battery (included) provides up to 1 year of use. Includes the Garmin FR70 wrist unit, heart rate strap, USB ANT Stick(TM) and a quick start manual.","short_description":"The easy-to-use Garmin FR70 heart rate monitor keeps track of your time, calories burned, heart rate and more so you make the most of every workout.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427075.png","image_url":"http://i1.avlws.com/115/l427075.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427075&tt=df","keywords":"watch","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427075\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427075.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829603&amp;link=&amp;tabs=-Details\"></script>","variants":{"8296030001":{"sku":"8296030001","vendor_sku":"010-00743-70","upc":"753759980955","color":"BLACK/BLUE","retail_price":"129.95","sale_price":"129.95"}},"categories":["fitness","running","fitness-electronics"]}
