{"sku":"829631","manufacturer_id":"L35677300","brand_name":"Salomon","product_name":" Salomon Techamphibian 3 Water Shoes - Women's","long_description":"From land to sea, the women's Salomon Techamphibian 3 water shoes keep your feet supported and cushioned with an agile, water-shedding design. Lightweight, water-friendly synthetic leather and nylon mesh uppers offer support and durability; mesh is designed to keep grit out and let water flow freely. Lycra(R) nylon and neoprene linings are soft and quick drying. Light, fast and strong Quicklace(TM) lacing system ensures a secure fit; just pull, lock the toggle, tuck into lace pocket and go. Adjustable heel straps with collapsible backs let you wear these with neoprene booties or socks, or as convenient slides. Rubber toe caps protect toes and uppers from bumps and abrasion. Smooth internal stitching minimizes abrasion points. Molded EVA midsoles absorb shock and offer ample cushioning for all-day wear; drainage ports ensure quick movement of water for fast drying. Nonmarking Contagrip(R) rubber outsoles on the Salomon Techamphibian 3 water shoes deliver excellent traction in wet or dry conditions.","short_description":"From land to sea, the women's Salomon Techamphibian 3 water shoes keep your feet supported and cushioned with an agile, water-shedding design.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s445391.png","image_url":"http://i1.avlws.com/115/l445391.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445391&tt=df","retail_price":"95.00","sale_price":"95.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445391\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445391.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829631&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
