{"sku":"829850","brand_name":"Therm-A-Rest","product_name":"Therm-a-Rest NeoAir XTherm Sleeping Pad","long_description":"The Therm-a-Rest NeoAir XTherm sleeping pad lets you sleep outside in any season. The high R-value, thickness and layers of reflective barriers bring greater comfort and warmth to backcountry outings. Therm-a-Rest combines advanced, patent-pending technology and materials with decades of experience to offer a lightweight, warm and incredibly compactible sleeping pad. With double the insulating properties of the NeoAir Trekker, this pad incorporates a patent-pending Triangular Core Matrix(TM) technology for high warmth and low weight. Innovative baffling creates over 100 internal cells along with 4 layers of reflective barriers that trap warm air and return heat back to your body for year-round warmth. With an R-value of 5.7 and 2.5 in. thickness, this sleeping pad provides excellent insulation from the cold ground. Supple, yet rugged 30-denier polyester fabric on top and a durable 70-denier nylon on the bottom provide a quiet sleep surface. Therm-a-Rest NeoAir XTherm pad includes a repair kit and combination pump sack/stuff sack. 40-liter pump sack features a valve at the bottom that connects to a valve on air mattress; to use as pump, loft the sack, seal, roll and then push air into mattress.","short_description":"The Therm-a-Rest NeoAir XTherm sleeping pad lets you sleep outside in any season. The high R-value, thickness and layers of reflective barriers bring greater comfort and warmth to backcountry outings.","category":"Camping And Hiking","subcategory":"Sleeping Pads, Cots And Hammocks","product_group":"Sleeping Pads","thumb_url":"http://i1.avlws.com/115/s422159.png","image_url":"http://i1.avlws.com/115/l422159.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422159&tt=df","keywords":"mats,mattress","retail_price":"219.95","sale_price":"219.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422159\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422159.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829850&amp;link=&amp;tabs=-Details\"></script>","variants":{"8298500001":{"sku":"8298500001","upc":"040818066508","size":"M","color":"REFLEX GRAY/GRAY","retail_price":"179.95","sale_price":"179.95"}},"categories":["camping-hiking","sleeping-pads-cots-and-hammocks","sleeping-pads"]}
