{"sku":"829852","manufacturer_id":"06646","brand_name":"Therm-A-Rest","product_name":" Therm-a-Rest NeoAir XLite Sleeping Pad - Women's","long_description":"Shattering the ceiling of low weight, surprising warmth and packability, the Therm-a-Rest NeoAir XLite women's sleeping pad sets a new standard for gram-counting backpackers and adventure racers. With a slightly higher R-value than the other NeoAir XLite, this pad is designed for women, who on average sleep colder than men. Therm-a-Rest combines advanced, patent-pending technology and material with decades of experience to offer a virtually weightless, warm and incredibly compactible sleeping pad. New streamlined shaped and advanced fabrics reduce the weight-almost 15% lighter than the original. Therm-a-Rest NeoAir XLite incorporates a reflective layer that returns heat to your body and creates dual air pockets that conserve warmth. Pad incorporates a welded-nylon grid of chambers for high warmth and low weight. Working together with the reflective layer, the innovative construction creates over 100 internal cells that trap warm air and return heat to your body for year-round warmth. Innovative baffling creates an internal truss system that minimizes the movement of air-shift less and rest better! Therm-a-Rest NeoAir XLite women's sleeping pad includes a stuff sack and repair kit.","short_description":"Shattering the ceiling of low weight, surprising warmth and packability, the Therm-a-Rest NeoAir XLite women's sleeping pad sets a new standard for gram-counting backpackers and adventure racers.","category":"Camping And Hiking","subcategory":"Sleeping Pads, Cots And Hammocks","product_group":"Sleeping Pads","thumb_url":"http://i1.avlws.com/115/s422167.png","image_url":"http://i1.avlws.com/115/l422167.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422167&tt=df","keywords":"mattress,mats","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422167\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422167.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829852&amp;link=&amp;tabs=-Details\"></script>","variants":{"8298520001":{"sku":"8298520001","vendor_sku":"06646","upc":"040818066461","size":"Regular","color":"RADIANT YELLOW PRINT","retail_price":"159.95","sale_price":"159.95"}},"categories":["camping-hiking","sleeping-pads-cots-and-hammocks","sleeping-pads"]}
