{"sku":"829836","manufacturer_id":"06625","brand_name":"Msr","product_name":"MSR Nook 2 Tent","long_description":"The MSR Nook 2 offers 2 backpackers the enjoyment of an unencumbered outdoor experience. This 3-season tent maximizes living space and easily fits in backcountry campsites. Nook tent's light weight is easy for 2 packers to carry, and allows them to move fast; ample shoulder room allows both campers to sit up comfortably side by side. 1 end door simplifies access while saving weight; main pole and arch pole are all connected for fast and easy set up-even in the dark. In tight spots where staking out may be a challenge, the versatile MSR Nook can be set up and fully tensioned by using a trekking pole, not included. Attach a trekking pole across the foot of the tent on the outside with the included pole adaptor; this fully tensions the rear and ensures all space is available. Color coded stake-out loops, webbing, and poles make set up easy and intuitive. Clip construction ensures a fast and easy setup and keeps air circulating between tent and fly. 2 rainfly vents provide cross ventilation near the peak of the tent; vents line up with mesh canopy windows to help move warm moist air from the interior of the tent. Additionally, the No-Drip Door(TM) system allows further ventilation adjustment for any weather condition you might encounter. Since the vestibule comes out over the top of the vertical door, the vestibule can be left completely open in mild rain or mostly open in strong storms. 20-denier, high tenacity nylon rainfly material with a DuraShield(TM) coating provides an exceptionally weatherproof layer at minimal weight. 40-denier nylon floor material resists tears, cuts and abrasion to provide great performance over many years of adventure. Areas of extreme stress (rainfly corners and clip attachment points) are reinforced for extra durability. Bathtub floor wraps up the sides of the tent 10 in.","short_description":"The MSR Nook 2 offers 2 backpackers the enjoyment of an unencumbered outdoor experience. This 3-season tent maximizes living space and easily fits in backcountry campsites.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423847.png","image_url":"http://i1.avlws.com/115/l423847.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423847&tt=df","retail_price":"399.95","sale_price":"399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423847\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423847.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829836&amp;link=&amp;tabs=-Details\"></script>","variants":{"8298360001":{"sku":"8298360001","vendor_sku":"06625","upc":"040818066256","color":"MOSS GREEN","retail_price":"399.95","sale_price":"399.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
