{"sku":"829929","manufacturer_id":"30120100","brand_name":"Pacsafe","product_name":"Pacsafe Metrosafe 100 GII Hip and Shoulder Bag","long_description":"The Pacsafe Metrosafe GII is a slash-proof and tamper-resistant shoulder bag-it carries all your daily essentials and must-have electronic gadgets, as well as a small travel book or planner. Make a simple adjustment to the detachable strap to wear it as either a shoulder bag or hip pack. RFID-reader-blocking pocket prevents access to your personal data stored on micro chips in your passport and credit cards. Features eXomesh(R) slashguards: lightweight stainless-steel wire mesh is built discreetly into areas normally targeted by bag slashers. Flexible, lightweight stainless-steel wire is integrated into the adjustable carry strap to prevent bag slashers from slicing through and running off with your gear. Shoulder strap has a releasable security hook at 1 end that allows the strap to be attached to a fixture so no one can walk off with your bag. Zippered main pocket and front compartment. Pacsafe Metrosafe 100 GII sports 2 padded pockets, pen slot, key clip and headphone port.","short_description":"The Pacsafe Metrosafe GII is a slash-proof and tamper-resistant shoulder bag-it carries all your daily essentials and must-have electronic gadgets, as well as a small travel book or planner.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s432471.png","image_url":"http://i1.avlws.com/115/l432471.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432471&tt=df","keywords":"sling,purses,courier","retail_price":"60.00","sale_price":"60.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432471\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432471.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829929&amp;link=&amp;tabs=-Details\"></script>","variants":{"8299290002":{"sku":"8299290002","vendor_sku":"30120100","upc":"688334004811","color":"BLACK","retail_price":"60.00","sale_price":"60.00"}},"categories":["travel","day-bags-and-packs","shoulder-bags"]}
