{"sku":"829916","manufacturer_id":"CTE12512","brand_name":"Nemo","product_name":"NEMO Bugout Shelter","long_description":"The NEMO Bugout(TM) is a simple shelter consisting of a well-designed tarp and mesh walls. The mesh walls stow securely away or easily drop down for coverage, offering instant no-see-um protection. NEMO Bugout fits over campsite tables and provides a haven from the elements without cumbersome poles or tricky setup. String the tarp between 2 trees and your trekking poles or individual height-adjustable aluminum poles (poles sold separately) to create an escape from rain, bugs or sun. Adjustable height and multiple configurations make this a versatile shelter. Specially developed mesh with high water repellency protects against side-blown rain and effortlessly sheds moisture when it's time to pack up. Mesh sides can be rolled up and secured away. Corners attach via cords to trekking poles or nearby trees; multiple stake points at each corner allow shelter height adjustment. Includes stuff sacks, stakes and repair kit. Please note: you'll want 4 points of contact to set up the Bugout; any combinations of above-mentioned support will work fine.","short_description":"The NEMO Bugout(TM) is a simple shelter consisting of a well-designed tarp and mesh walls. The mesh walls stow securely away or easily drop down for coverage, offering instant no-see-um protection.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Shelters","thumb_url":"http://i1.avlws.com/115/s424615.png","image_url":"http://i1.avlws.com/115/l424615.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424615&tt=df","keywords":"canopy,beach","retail_price":"249.95","sale_price":"249.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424615\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424615.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829916&amp;link=&amp;tabs=-Details\"></script>","variants":{"8299160001":{"sku":"8299160001","vendor_sku":"CTE1259","upc":"814041011655","size":"9x9 FT","color":"GREEN","retail_price":"199.95","sale_price":"199.95"}},"categories":["camping-hiking","tents","shelters"]}
