{"sku":"829936","manufacturer_id":"30180112","brand_name":"Pacsafe","product_name":"Pacsafe Metrosafe 200 Shoulder Bag","long_description":"The Pacsafe Metrosafe 200 GII keeps you well-organized and protected with 5 anti-theft features. When you're out for the entire day and need storage that won't weigh you down, look no further. RFID-reader-blocking pocket prevents access to your personal data stored on micro chips in your passport and credit cards. Features eXomesh(R) slashguards: lightweight stainless-steel wire mesh is built discreetly into areas normally targeted by bag slashers. Flexible, lightweight stainless-steel wire is integrated into the adjustable carry strap to prevent bag slashers from slicing through and running off with your gear. Shoulder strap has a releasable security hook at 1 end that allows the strap to be attached to a fixture sonobody can walk off with your bag. Large main zippered compartment; zippered organizer pocket includes large slip pocket. Bright colored liner adds some fun and helps you easily locate what you need, when you need it; padded electronic pocket fits up to a 10 in. laptop. Rear zippered pocket with concealable zipper pull prevents a pickpocket from reaching into your bag. 2 water bottle/umbrella side pockets. Pacsafe Metrosafe 200 includes a headphone port, pen holder and key clip.","short_description":"The Pacsafe Metrosafe 200 GII keeps you well-organized and protected with 5 anti-theft features. When you're out for the entire day and need storage that won't weigh you down, look no further.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s432475.png","image_url":"http://i1.avlws.com/115/l432475.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432475&tt=df","keywords":"purses,courier,sling","retail_price":"90.00","sale_price":"90.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432475\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432475.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=829936&amp;link=&amp;tabs=-Details\"></script>","variants":{"8299360001":{"sku":"8299360001","vendor_sku":"30180100","upc":"688334004842","color":"BLACK","retail_price":"90.00","sale_price":"90.00"},"8299360003":{"sku":"8299360003","vendor_sku":"30180112","upc":"688334009489","color":"TWEED GREY","retail_price":"90.00","sale_price":"90.00"}},"categories":["travel","day-bags-and-packs","shoulder-bags"]}
