{"sku":"830264","manufacturer_id":"61802","brand_name":"Camelbak","product_name":" CamelBak Agent Hydration Pack - 100 fl. oz. - Men's","long_description":"CamelBak Agent 100 fl. oz. hydration pack is designed to carry a full-face helmet, armor and more for a full, demanding day of mountain biking. 100 fl. oz. Antidote(TM) reservoir is equipped with the Quick Link(TM) connection system for hassle-free removal of the insulated drinking tube. Quick Link system also lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director or flow meter (accessories sold separately). Big Bite(TM) valve is ergonomically positioned for easy drinking and can be easily shut off with a quarter turn. N.V.I.S.(TM) back panel combines maximum breathability and airflow with EVA foam padding that eases lumbar pressure and elevates pack off back. Main compartment is lined with hi-vis material to make it easy to find contents; full-length clamshell zipper means you can open the main compartment fully. Organizing small essentials is easy: top zippered and lined media pocket, zippered and lined side goggles pocket, expandable overflow storage and front zip organizer pocket. Small, easy-access stash pocket on shoulder strap holds an energy bar, gel or other small item. Adjustable straps help keep everything secure and use side-release buckles for quick, easy access; all straps have retainer bands to keep loose ends from flapping around. Slider sternum strap and a removable hipbelt allow you to adjust the fit of the pack. CamelBak Agent 100 fl. oz. hydration pack is designed to carry a full-face helmet, body armor, goggles, extra layer, lunch, tools, pump, tubes, phone, wallet and keys.","short_description":"CamelBak Agent 100 fl. oz. hydration pack is designed to carry a full-face helmet, armor and more for a full, demanding day of mountain biking.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s443411.png","image_url":"http://i1.avlws.com/115/l443411.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=443411&tt=df","keywords":"day packs","retail_price":"140.00","sale_price":"104.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=443411\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m443411.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830264&amp;link=&amp;tabs=-Details\"></script>","variants":{"8302640001":{"sku":"8302640001","vendor_sku":"61802","upc":"886798618029","size":"100 FL OZ","color":"IMPERIAL PURPLE","retail_price":"104.93","sale_price":"104.93"}}}
