{"sku":"830282","manufacturer_id":"2717","brand_name":"Rei","product_name":"REI Comet Pack - Kids' - Special Buy","long_description":"The REI Comet pack outfits young adventurers for overnight trips. And the 4 inches of torso length adjustment means it can continue to fit them as they grow. Top-loading backpack easily holds child's sleeping bag and a few extras. With a rip-and-stick adjustment, shoulder strap system slides easily up and down pack's frame to fit torsos of varying lengths. Hipbelt wraps around and adjusts for the best fit; 2 zippered mesh pockets keep snacks or other small items within easy reach. Hydration-compatible, zippered side pocket with a tube exit port holds up to a 1-liter reservoir, not included. Top zippered pocket lets kids stash their headlamp, camp toys and other gadgets; a parent-friendly handle on top helps with putting on the pack. Unique panels on 2 zippered stash pockets let kids see inside, helping them find their gear quickly. Oversize front mesh stuff pocket easily swallows a jacket or favorite stuffed animal. Bottom zippered storage compartment lets them keep dirty shoes or clothes separate from main compartment. Sized to fit kids ages 6 - 10 yrs. old. Special buy.","short_description":"The REI Comet pack outfits young adventurers for overnight trips. And the 4 inches of torso length adjustment means it can continue to fit them as they grow.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Kids' Backpacks","thumb_url":"http://i1.avlws.com/115/s243155.png","image_url":"http://i1.avlws.com/115/l243155.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=243155&tt=df","keywords":"bag,child,ruck,rucksack,pack","retail_price":"89.50","sale_price":"59.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=243155\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m243155.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830282&amp;link=&amp;tabs=-Details\"></script>","variants":{"8302820001":{"sku":"8302820001","vendor_sku":"2717","upc":"483028200018","color":"MESA ORANGE/STEEL","retail_price":"59.73","sale_price":"59.73"}}}
