{"sku":"830267","manufacturer_id":"ONLK-DH","brand_name":"Eno","product_name":"ENO One Link Hammock Shelter System","long_description":"The ENO One Link(TM) Hammock Shelter system is the simple way to get equipped for a camping trip. It has everything you need to enjoy a bug-free, rain-free overnight. One Link system includes a DoubleNest hammock, ProFly(TM) rain tarp, Guardian bug net, Atlas Suspension straps, 2 steel carabiners and 4 aluminum stakes. DoubleNest hammock has room for 2 adults yet it packs up to the size of a grapefruit for convenient transportation. High-strength, breathable woven nylon and triple interlocking stitching holds up to use and abuse; has a maximum capacity of 400 lbs. Polyurethane-treated ripstop nylon rain tarp offers long-lasting wear with excellent water-shedding capabilities; use the 4 stakes when setting up the tarp. Guardian bug net is quick and easy to set up and keeps bugs away. Atlas Hammock Suspension straps help you set up the hammock around large trees and posts, and they offer 30 combined adjustment points so you get it set up just right. All items in the ENO One Link(TM) Hammock Shelter system come packed together in a stuff sack so you won't leave anything at home.","short_description":"The ENO One Link(TM) Hammock Shelter system is the simple way to get equipped for a camping trip. It has everything you need to enjoy a bug-free, rain-free overnight.","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Hammocks","thumb_url":"http://i1.avlws.com/115/s414067.png","image_url":"http://i1.avlws.com/115/l414067.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414067&tt=df","retail_price":"219.95","sale_price":"219.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414067\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414067.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830267&amp;link=&amp;tabs=-Details\"></script>","variants":{"8302670001":{"sku":"8302670001","vendor_sku":"ONLK-DH","upc":"811201010510","retail_price":"219.95","sale_price":"219.95"}},"categories":["camping-hiking","camp-furniture","hammocks"]}
