{"sku":"830399","manufacturer_id":"ARB43","brand_name":"Thule","product_name":" Thule AeroBlade Bars - 43\" - Pair","long_description":"Reducing noise and lowering drag, the new Thule AeroBlade 43 in. load bars work with the rest of your Thule system to haul your gear safely, securely and quietly to your destination. Aluminum bars feature a textured cover that diffuses airflow better than a smooth surface, greatly reducing wind noise. Bars also feature SwingBlade(TM) end caps that pivot open allowing full access to the T-slot for easy accessory installation. Another smart feature of the bars, the SmartSlide(TM) system is a tape-measure-free, hassle-free molded measurement system on the underbar for easy foot installation. Using a vertical load test, the AeroBlade bars can sustain over 800 lbs. of force. Thule AeroBlade bars work with all of the Thule Rapid Foot Packs and are just 1 component of a Thule car top rack system. These load bars are available in 4 different sizes, so be sure to refer to Thule's Fit Guide for the minimum size recommended for a specific vehicle.","short_description":"Reducing noise and lowering drag, the new Thule AeroBlade 43 in. load bars work with the rest of your Thule system to haul your gear safely, securely and quietly to your destination.","category":"Car Racks","subcategory":"Base Roof Racks","product_group":"Roof Rack Cross Bars","thumb_url":"http://i1.avlws.com/115/s408063.png","image_url":"http://i1.avlws.com/115/l408063.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408063&tt=df","retail_price":"169.95","sale_price":"169.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408063\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408063.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830399&amp;link=&amp;tabs=-Details\"></script>","variants":{"8303990001":{"sku":"8303990001","vendor_sku":"ARB43","upc":"091021314078","retail_price":"169.95","sale_price":"169.95"}}}
