{"sku":"830343","manufacturer_id":"06636","brand_name":"Msr","product_name":" MSR WindPro II Backpacking Stove","long_description":"The MSR WindPro(TM) II backpacking stove maintains the efficiency and versatility of the original WindPro while adding the ability to burn inverted fuel canisters for cold-weather performance. Easy to operate-no priming, pre-heating or pressurizing is necessary; attach an isobutane-propane canister and start cooking (canister not included). Includes a stand for inverting isobutane-propane canisters for better cold weather performance and more consistent output over the life of each canister. At only 6.6 oz., the WindPro II is the lightest remote canister stove on the market. Wide burner head evenly distributes the flame for scorch-free cooking. Includes windscreen and heat reflector for increased operating performance; windscreen is designed to accommodate cookware up to 10 in. in diameter. 3 legs/pot supports fan out to form a stable 6 in. cooking surface; folds for compact storage. Flame is easily adjusted from a steady simmer to a full boil; long fuel line keeps control valve well away from the flame. MSR WindPro II stove is totally field maintainable; every stove part is designed to be taken apart and easily replaced in the field. Weight includes stove, not the canister. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"The MSR WindPro(TM) II backpacking stove maintains the efficiency and versatility of the original WindPro while adding the ability to burn inverted fuel canisters for cold-weather performance.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416543.png","image_url":"http://i1.avlws.com/115/l416543.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416543&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416543\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416543.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830343&amp;link=&amp;tabs=-Details\"></script>","variants":{"8303430001":{"sku":"8303430001","vendor_sku":"06636","upc":"040818066362","retail_price":"99.95","sale_price":"99.95"}}}
