{"sku":"830342","manufacturer_id":"06630","brand_name":"Msr","product_name":"MSR WhisperLite Universal Backpacking Stove","long_description":"The legend continues with the MSR WhisperLite(TM) Universal backpacking stove. The trail-worthy stove gives you the option to burn nearly any fuel source, including white gas and isobutane-propane. From BACKPACKER 2012 Editors' Choice Awards: \"For years, we've been hunting for a multifuel stove that burns both liquid gas and canister fuel, burns them equally well, .... ... and easily converts from one mode to another. The Universal is that stove-and possibly the last one you'll need to buy.\". WhisperLite Universal burns a variety of fuels available worldwide-it runs on white gas, kerosene, unleaded gasoline and isobutane-propane canisters (sold in REI stores). Simply swap out 1 of 3 self-cleaning Shaker Jets(TM) and 1 of 2 source couplers to match your fuel source and you're ready to cook. Boils 1 liter of water in only 3 min. 30 sec. when using white gas and 3 min. 45 sec. when using an isobutane-propane canister. Stove allows excellent control of simmering when you're burning isobutane-propane and good control when burning white gas. Aluminum mixer tube, stainless-steel legs and a smart design keep the weight down to 11.5 oz. Shaker Jet technology makes cleaning as simple as shaking the stove. Includes a stand for inverting isobutane-propane canisters for better cold weather performance and more consistent output over the life of each canister. Also includes a fuel pump, windscreen, heat reflector, small-parts kit, instructions and storage sack. MSR WhisperLite Universal backpacking stove requires an MSR fuel bottle and fuel or an isobutane-propane canister for operation (both sold separately). Weight of liquid fuel stove includes only stove and fuel pump. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"The legend continues with the MSR WhisperLite(TM) Universal backpacking stove. The trail-worthy stove gives you the option to burn nearly any fuel source, including white gas and isobutane-propane.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416539.png","image_url":"http://i1.avlws.com/115/l416539.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416539&tt=df","retail_price":"139.95","sale_price":"139.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416539\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416539.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830342&amp;link=&amp;tabs=-Details\"></script>","variants":{"8303420001":{"sku":"8303420001","vendor_sku":"06630","upc":"040818066300","retail_price":"139.95","sale_price":"139.95"}},"categories":["camping-hiking","camp-kitchen","stoves"]}
