{"sku":"830341","manufacturer_id":"06633","brand_name":"Msr","product_name":" MSR WhisperLite International Backpacking Stove","long_description":"The redesigned MSR WhisperLite(TM) International backpacking stove has the same fundamental design as its predecessor, only it's now 10% lighter for even greater portability. Built tough for travel, the compact, multifuel MSR WhisperLite International stove allows you to use a variety of fuels available worldwide. WhisperLite International can run on white gas, kerosene and unleaded gasoline, making it the perfect stove for globetrotters. New design features an aluminum mixer tube and stainless-steel legs that keep the weight down to 10.9 oz., 10% lighter than the original WhisperLite International. Stove boils 1 liter of water in only 3 min. 30 sec. when using white gas and 4 min. 20 sec. when using kerosene. Shaker Jet technology makes cleaning as simple as shaking the stove. Includes a fuel pump, windscreen, heat reflector, small-parts kit, instructions and storage sack. MSR WhisperLite International backpacking stove requires an MSR fuel bottle for operation, sold separately. Weight of liquid fuel stove includes only stove and fuel pump.","short_description":"The redesigned MSR WhisperLite(TM) International backpacking stove has the same fundamental design as its predecessor, only it's now 10% lighter for even greater portability.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416535.png","image_url":"http://i1.avlws.com/115/l416535.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416535&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416535\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416535.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830341&amp;link=&amp;tabs=-Details\"></script>","variants":{"8303410001":{"sku":"8303410001","vendor_sku":"06633","upc":"040818066331","retail_price":"99.95","sale_price":"99.95"}}}
