{"sku":"830304","manufacturer_id":"11358","brand_name":"Rei","product_name":"REI Flash 65 Pack - Women's - Special Buy","long_description":"The REI Flash 65 women's pack sports a balanced mix of light weight, comfortable suspension and versatile features to keep you trail ready. Removable framesheet, stays and top lid let you create a minimalist configuration for incredible weight savings. Minimalist configuration weighs a scant 2 lbs. Precurved hipbelt is designed specifically to fit a woman's contours; it cradles the hips for a natural fit and evenly distributes load weight without sagging. Hipbelt webbing system allows you to use a natural forward pulling motion for quick, easy cinching and precise adjustment. Hipbelt has a zippered pocket for on-the-go access to essentials such as snacks and lip balm; lash points on the other side let you attach a camera bag or GPS pouch. Precurved, dual-density padded shoulder straps match your anatomy for nonbinding comfort and stability. Back panel features mesh-covered, perforated foam for breathability and a fixed suspension system for low weight and easy use. Twin aluminum tubular stays and a precurved, perforated HDPE framesheet maximize structure and minimize weight. Under the lid, an over-the-top compression strap pulls the load in close to your back and provides a place for lashing on climbing ropes or other bulky items. Over-the-top compression strap has a thin storage pocket to stash a few small essentials; includes a key clip and a rip-and-stick closure to secure cash and ID. Deep, catch-all front pocket keeps large, often-used items within easy reach. 2 mesh pockets on each side hold water bottles and other stowables. Water-resistant zippers on top and front pockets and a rip-and-stick closure on the pocket underneath the lid allow you to safely store valuables away from the elements. Multiple lash points on the top pocket and front of pack provide attachment points to carry additional gear.","short_description":"The REI Flash 65 women's pack sports a balanced mix of light weight, comfortable suspension and versatile features to keep you trail ready.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Internal Frame Packs","thumb_url":"http://i1.avlws.com/115/s241195.png","image_url":"http://i1.avlws.com/115/l241195.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=241195&tt=df","keywords":"frame,Internal,BACKPACK FOR backpacking","retail_price":"169.00","sale_price":"105.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=241195\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m241195.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830304&amp;link=&amp;tabs=-Details\"></script>","variants":{"8303040003":{"sku":"8303040003","vendor_sku":"11358","upc":"483030400031","size":"L","color":"STEEL/MAGNESIUM","retail_price":"105.73","sale_price":"105.73"}}}
