{"sku":"830457","manufacturer_id":"BD681098STONMD_","brand_name":"Black Diamond","product_name":"Black Diamond Mercury 65 Pack","long_description":"The Black Diamond Mercury 65 pack sports an active suspension and harness system that offer excellent load support and a wide range of free mobility for the wearer. Patent-pending ergoACTIV hipbelt, breathable back panel and soft, 3D mesh lining on hipbelt and shoulder straps provide topnotch support and comfort. SwingArm(TM) shoulder straps move in concert with a hiker's stride or a climber's reach by sliding through the bottom of the pack with a low-friction cable and housing. Shoulder straps are linked to the other by the cable which helps maintain an even, balanced load across the shoulders. An ideal blend of volume, comfort and mobility lets you bring everything you need without slowing you down or limiting your range of motion. Top-loading pack body features a floating lid to accommodate large or small loads; giant U-shape front-panel zipper offers easy access. Hydration compatibility lets you add a reservoir of your choice (reservoir sold separately). Hipbelt stash pocket, side stretch pockets and large zippered front pocket offer plenty of storage for water bottles, snacks and other essentials. The Black Diamond Mercury 65 pack features retractable tool loops that allow ice axes or trekking poles to be lashed to the outside of the pack.","short_description":"The Black Diamond Mercury 65 pack sports an active suspension and harness system that offer excellent load support and a wide range of free mobility for the wearer.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410535.png","image_url":"http://i1.avlws.com/115/l410535.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410535&tt=df","keywords":"multiday","retail_price":"269.95","sale_price":"269.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410535\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410535.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830457&amp;link=&amp;tabs=-Details\"></script>","variants":{"8304570001":{"sku":"8304570001","vendor_sku":"BD681098STONMD_","upc":"793661158424","size":"M","color":"STONE","retail_price":"269.95","sale_price":"269.95"},"8304570002":{"sku":"8304570002","vendor_sku":"BD681098STONLG_","upc":"793661158431","size":"L","color":"STONE","retail_price":"269.95","sale_price":"269.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
