{"sku":"830459","manufacturer_id":"35162 67010","brand_name":"Deuter","product_name":" Deuter Quantum 55+10 SL Travel Backpack - Women's","long_description":"World travelers will love the quality and the practical slim shape of the Deuter Quantum 55+10 SL travel backpack. Even when fully loaded you won't get stuck in bus doorways or train passages. This roomy companion unites excellent features with a modern design and a practical detachable daypack; the Quantum 55+10 SL pack is built specifically for women. Variquick shoulder harness/back system lets you adjust torso length from 13.5 - 20 in. Contoured and padded air-mesh shoulder straps and breathable foam back provide ladies a comfortable carry; sternum strap keeps pack in place. Load-bearing aluminum frame and anatomically formed hipbelt make carrying heavy loads comfortable. Height-adjustable lid and extension collar extend main pack's capacity by approximately 10 liters. Access the main compartment through the lid or via the U-shaped zipper on the front of the pack. Zip-access bottom compartment with removable separator provides easy access to gear and allows load adjustability. Zippered lid pocket allows quick access to quick-grab gear; attachment rings provide quick and easy attachment of bulky, lightweight gear. Stretch mesh side pockets hold water bottle or quick-access items. Side compression straps reduce pack's volume and stabilize the load; they can be also be joined at the center front of the pack to carry additional gear. 3 grab handles. Sleek, removable daypack with zippered outer pocket quickly buckles on and off main pack; zippered bellow expands daypack for long day trips. Integrated transport cover with name tag and grab handles protects and identifies the Deuter Quantum bag on flights and doubles as a raincover. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"World travelers will love the quality and the practical slim shape of the Deuter Quantum 55+10 SL travel backpack. Even when fully loaded you won't get stuck in bus doorways or train passages.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s433691.png","image_url":"http://i1.avlws.com/115/l433691.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433691&tt=df","retail_price":"239.00","sale_price":"239.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433691\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433691.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830459&amp;link=&amp;tabs=-Details\"></script>","variants":{"8304590001":{"sku":"8304590001","vendor_sku":"35162 67010","color":"COFFEE/BLACK","retail_price":"239.00","sale_price":"239.00"}}}
