{"sku":"830418","manufacturer_id":"53381","brand_name":"Camelbak","product_name":" CamelBak eddy Stainless Steel Water Bottle - 24 fl. oz.","long_description":"Take comfort in knowing your drinking water is securely stowed in the sleek and clean CamelBak eddy(TM) stainless-steel water bottle. Stainless-steel bottle is naturally BPA free, stain resistant and taste free; no coatings or liners are used on the interior. Redesigned cap and Big Bite valve provide faster flow than previous versions; just bite and sip, and your beverage flows through the valve. But if lifting and tipping is your preferred method, no problem; just remove the straw inside. Big Bite valve has an articulating stem, so when not in use it folds down next to the bottle and stays clean. Carry the integrated handle in the crook of a finger, or connect it to a pack or waistbelt with a small carabiner (sold separately). Simply unscrew the cap to uncover bottle's wide-mouth opening for easy filling and cleaning; opening is compatible with standard 63mm caps, filters and accessories. Specially shaped bottle fits nicely in your hand and in most automobile cup holders. CamelBak does not recommend the use of carbonated beverages with the straw configuration; remove straw and drink by tipping and sipping. Please note: CamelBak eddy Stainless-Steel water bottle is single walled and may get hot to the touch when used with hot liquids.","short_description":"Take comfort in knowing your drinking water is securely stowed in the sleek and clean CamelBak eddy(TM) stainless-steel water bottle.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Bottles, Flasks And Jugs","thumb_url":"http://i1.avlws.com/115/s425643.png","image_url":"http://i1.avlws.com/115/l425643.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=425643&tt=df","retail_price":"24.00","sale_price":"24.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=425643\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m425643.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830418&amp;link=&amp;tabs=-Details\"></script>","variants":{"8304180001":{"sku":"8304180001","vendor_sku":"53381","upc":"886798533810","color":"LOGO","retail_price":"24.00","sale_price":"24.00"}}}
