{"sku":"830455","manufacturer_id":"681105","brand_name":"Black Diamond","product_name":"Black Diamond EXL Pack","long_description":"The lightweight Black Diamond EXL pack is a prime choice for fast trail pursuits and ridge scrambles with all-day comfort, clean design and the perfect volume for your essential gear. SwingArm(TM) shoulder straps move in concert with a hiker's stride or a climber's reach by sliding through the bottom of the pack with a low-friction cable and housing. Shoulder straps are linked to the other by the cable which helps maintain an even, balanced load across the shoulders. Webbing hipbelt helps stabilize the pack; padded back panel features perforated, mesh covered foam and an air channel for enhanced breathability. Zippered panel access to the main compartment provides access to layers, water and other essentials. Hydration-compatible design accommodates a reservoir and drink tube (sold separately) for on-the-go hydration. Side stretch pockets hold gels or snacks; front compression cord secures rain gear or other items. The Black Diamond EXL pack features a retractable trekking pole/ice axe loop and bike light slot that lets you lash gear to the exterior of the pack.","short_description":"The lightweight Black Diamond EXL pack is a prime choice for fast trail pursuits and ridge scrambles with all-day comfort, clean design and the perfect volume for your essential gear.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411055.png","image_url":"http://i1.avlws.com/115/l411055.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411055&tt=df","retail_price":"99.95","sale_price":"74.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411055\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411055.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830455&amp;link=&amp;tabs=-Details\"></script>","variants":{"8304550002":{"sku":"8304550002","vendor_sku":"681105","upc":"793661158707","size":"One Size","color":"COBALT/COOL GRAY","retail_price":"74.93","sale_price":"74.93"}},"categories":["camping-hiking","backpacks","day-packs"]}
