{"sku":"830583","manufacturer_id":"11140","brand_name":"Rei","product_name":"REI Flash 50 Pack - Women's - Special Buy","long_description":"The multiday REI Flash 50 women's pack has a balanced mix of light weight, versatile features and comfortable suspension-keep comfortable while exploring the backcountry. Removable framesheet/stays and top lid let you create a minimalist configuration for incredible weight savings. Minimalist configuration weighs a scant 29 oz. Precurved hipbelt is designed to cradle hip bones for a natural fit and to distribute weight without sagging. Hipbelt webbing system lets you use a natural forward pulling motion for quick, easy cinching and precise adjustment. Hipbelt has a zippered pocket for on-the-go access to essentials such as snacks and lip balm; lash points on the other side let you attach camera and GPS pouches. Precurved, dual-density padded shoulder straps match your anatomy for nonbinding comfort and stability on and off the trail. Backpanel and lumbar feature mesh-covered perforated foam for breathability and a fixed suspension system for low weight and easy use. Twin aluminum tube stays and precurved, perforated HDPE framesheet maximize structure and minimize weight. Underneath the lid, over-the-top compression strap pulls load in close to your back and provides a place for lashing on bulky items such as climbing ropes. Over-the-top compression strap has a thin storage pocket to stash a few small essentials; clip for key and a rip-and-stick closure keep cash and ID secure. Deep catch-all front pocket keeps large often-used items within easy reach for long day trips and peak bagging. Large, gusseted mesh side pockets hold items for quick access. Water-resistant zippers on top and front pockets, and a rip-and-stick closure on pocket underneath lid allow you to stash valuables away from the elements. Multiple lash points on top pocket and front of pack let you strap on bulky gear (such as a bear-proof canister) or add your own bungee system.","short_description":"The multiday REI Flash 50 women's pack has a balanced mix of light weight, versatile features and comfortable suspension-keep comfortable while exploring the backcountry.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Internal Frame Packs","thumb_url":"http://i1.avlws.com/115/s241199.png","image_url":"http://i1.avlws.com/115/l241199.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=241199&tt=df","keywords":"BACKPACK FOR backpacking,frame,Internal","retail_price":"149.00","sale_price":"99.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=241199\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m241199.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830583&amp;link=&amp;tabs=-Details\"></script>","variants":{"8305830003":{"sku":"8305830003","vendor_sku":"11140","upc":"483058300030","size":"L","color":"MAGNESIUM","retail_price":"99.73","sale_price":"99.73"}}}
