{"sku":"830552","manufacturer_id":"M56","brand_name":"Hennessy Hammock","product_name":"Hennessy Hammock Hyperlight Asym Zip Hammock","long_description":"The Hennessy Hyperlight Asym Zip hammock shelter combines durability and comfort with light weight and packability- perfect for thru-hikers and those who want to minimize their load. Asymmetric shape of hammock bed improves comfort; asymmetric rainfly improves coverage. Hammock also functions as a chair/lounger; with a pair of trekking poles (sold separately), it functions as a tent. Integral ridgeline design holds a comfortable shape each time the hammock is set up; keeps your back straight and level when resting diagonally. Heavy-duty, double-slider zipper ensures easy adjustments to the hammock and mesh; entry is from the side on this Hennessy model. No-see-um mesh canopy keeps the bugs away while allowing air circulation. Gear pocket suspended from ridgeline holds small personal items. Waterproof, asymmetric sil-nylon rainfly can be adjusted at any angle for weather protection; can be rolled up or completely removed for separate use. Support ropes are lightweight 1200 lb. test, polyester-covered Spectra(R) cord. Low-impact design requires no ground leveling, trenching or staking; polyester webbing straps protect tree bark. Floor dimensions: 108 x 48 in. diagonally; weight capacity: 200 lbs. Includes stuff sack with setup instructions printed on the back.","short_description":"The Hennessy Hyperlight Asym Zip hammock shelter combines durability and comfort with light weight and packability- perfect for thru-hikers and those who want to minimize their load.","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Hammocks","thumb_url":"http://i1.avlws.com/115/s414087.png","image_url":"http://i1.avlws.com/115/l414087.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414087&tt=df","retail_price":"259.95","sale_price":"259.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414087\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414087.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830552&amp;link=&amp;tabs=-Details\"></script>","variants":{"8305520001":{"sku":"8305520001","vendor_sku":"M56","upc":"832667225249","color":"BARK","retail_price":"259.95","sale_price":"259.95"}},"categories":["camping-hiking","camp-furniture","hammocks"]}
