{"sku":"830586","manufacturer_id":"71861","brand_name":"Outdoor Research","product_name":" Outdoor Research Alti Gloves","long_description":"The warm and tough Outdoor Research Alti gloves excel at technical climbing in frigid temperatures. The shells are waterproof and insulated, and the reinforced palms stand up to friction from ropes. Alti gloves feature waterproof, breathable Gore-Tex(R) inserts and integrated, removable liner gloves for maximum comfort and versatility. Soft-shell stretch fabric on the back of the hand allows for flexible movements; ripstop nylon shells withstand harsh use in the outdoors. Non-bulky PrimaLoft(R) One insulation in both the shell gloves and integrated liner gloves ensures fingers stay warm in frigid temperatures. Smooth tricot shell lining wicks moisture and adds warmth to the glove system. Alti gloves have a target comfort range from -20degF - 10degF. Pile fleece lines the palms on the liner gloves to keep hands warm while gripping tools and working with gear; ripstop nylon exteriors stand up to regular wear. Rip-and-stick tabs hold liners in place inside the shells. Grippy palms on the shell gloves are waterproof and highly abrasion resistant. Precurved construction and updated thumb design create great comfort and articulation. Liner gloves have internal pockets on the backs of the hands that hold hand warmer packets (sold separetely) to boost the warmth on especially cold days. Gauntlet closures seal out cold air and are easy to adjust; ladderlock wrist cinches snug the shells at the wrists. Outdoor Research Alti gloves include removable wrist cords that secure the gloves to your wrists. Average weight per pair, size Large, is 11.2 oz.","short_description":"The warm and tough Outdoor Research Alti gloves excel at technical climbing in frigid temperatures. The shells are waterproof and insulated, and the reinforced palms stand up to friction from ropes.","category":"Men's Clothing","subcategory":"Men's Clothing Accessories","product_group":"Men's Gloves And Mittens","thumb_url":"http://i1.avlws.com/115/s400015.png","image_url":"http://i1.avlws.com/115/l400015.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=400015&tt=df","retail_price":"159.00","sale_price":"159.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=400015\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m400015.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830586&amp;link=&amp;tabs=-Details\"></script>","variants":{"8305860002":{"sku":"8305860002","vendor_sku":"71861","upc":"727602202853","size":"M","color":"BLACK","retail_price":"159.00","sale_price":"159.00"},"8305860003":{"sku":"8305860003","vendor_sku":"71861","upc":"727602202860","size":"L","color":"BLACK","retail_price":"159.00","sale_price":"159.00"}},"categories":["mens","mens-clothing-accessories","mens-gloves-and-mittens"]}
