{"sku":"830747","manufacturer_id":"8018342","brand_name":"Katadyn","product_name":" Katadyn MyBottle Water Filter","long_description":"The Katadyn MyBottle water filter is the simple solution for making water potable when traveling, kayaking or setting out on a backpacking trip. Simply fill the MyBottle from a tap or a lake, screw the cap on and start sipping; inner microfilter eliminates bacteria and protozoa. Uses a carbon filter and a glass fiber cyst cartridge to physically remove particles, protozoa and bacteria down to 0.3 microns in size, including giardia and cryptosporidia. Carbon pre- and post-filter improves the taste of stale, swampy water. Bottle filters up to 26 gal. (100 liters) of water before it is necessary to replace the filter cartridge; replacement filter cartridges are sold separately. Food-grade polyethylene plastic bottle and cap are 100% BPA free; bottle holds 24 fl. oz. of water after displacement of the microfilter. Flip-up mouthpiece is easy to access. Integrated loop on cap lets you clip the bottle to a pack strap with an accessory carabiner, not included. Bottle fits in bike bottle holders and most waistbelt bottle carriers. Remove the filter cartridge and attach the included straw to use the Katadyn MyBottle as a standard water bottle when filtration isn't required. Convert the Katadyn MyBottle water filter to a water purifier by purchasing the Katadyn MyBottle/Exstream Virustat replacement kit (sold separately).","short_description":"The Katadyn MyBottle water filter is the simple solution for making water potable when traveling, kayaking or setting out on a backpacking trip.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426339.png","image_url":"http://i1.avlws.com/115/l426339.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426339&tt=df","retail_price":"44.95","sale_price":"44.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426339\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426339.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830747&amp;link=&amp;tabs=-Details\"></script>","variants":{"8307470001":{"sku":"8307470001","vendor_sku":"8018342","upc":"604375183421","color":"RED","retail_price":"44.95","sale_price":"44.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
