{"sku":"830770","manufacturer_id":"55120703","brand_name":"Pacsafe","product_name":"Pacsafe Ultimatesafe 32L Daypack","long_description":"The Ultimatesafe daypack from Pacsafe is a 3-in-1 adventure daypack that will keep your gear and electronics secure. It meets international maximum carry-on standards and is ideal for weekends away. Removable padded laptop sleeve carries up to a 15 in. laptop. Removable 20 liter portable safe; this slashproof safe can be locked closed and attached to a fixed object to provide protection from thieves. High-tensile, slash-proof stainless-steel wire is laminated between fabric to form a portable safe; locks closed and to a secure fixture with heavy-duty lock. Flexible, lightweight stainless-steel wire is also integrated into adjustable carry straps to prevent bag slashers from slicing through and running off with your gear. State-of -the-art RFIDtec material blocks out transmissions and stops personal information from being accessed by identity thieves. Zippers fasten to concealed clips, making it hard for pickpockets to unzip and snatch your valuables. Features large main zippered compartment; 2 exterior front zip pockets and side water bottle pockets. RFID-reader-blocking pocket prevents access to your personal data stored on micro chips in your passport and credit cards. Back panel with sturdy padding and jersey fabric rests comfortably against skin. Ultimatesafe has a top carry handle, adjustable padded waistbelt with zippered pocket and side compression straps; sternum strap helps stabilize the pack. Zipper pulls can be attached to discreet security hooks to prevent a pickpocket from reaching into your bag. Shoulder strap has a releasable security hook at one end that allows the strap to be attached to a fixture so no one can walk off with your bag.","short_description":"The Ultimatesafe daypack from Pacsafe is a 3-in-1 adventure daypack that will keep your gear and electronics secure. It meets international maximum carry-on standards and is ideal for weekends away.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s433003.png","image_url":"http://i1.avlws.com/115/l433003.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433003&tt=df","keywords":"backpack","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433003\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433003.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830770&amp;link=&amp;tabs=-Details\"></script>","variants":{"8307700001":{"sku":"8307700001","vendor_sku":"55120703","upc":"688334004309","color":"BLACK","retail_price":"250.00","sale_price":"250.00"}},"categories":["travel","day-bags-and-packs","travel-daypacks"]}
