{"sku":"830775","manufacturer_id":"50180","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors Pinnacle Backpacker Cookset","long_description":"Just because you're camping doesn't mean you can't enjoy a gourmet meal. Whip up a feast that will satisfy the appetites of 2 hungry hikers with the GSI Pinnacle Backpacker cookset. Designed to accommodate 2 people, the Backpacker set includes 2 bowls, 2 insulated mugs, 2 Sip-It lids, a 2-liter pot with lid, a frypan, a pot gripper and a stuff sack. All items nest neatly inside the pot with room to spare for an ultralight backpacking stove and utensils (both sold separately). Pinnacle-series hard-anodized aluminum pot and frypan distribute heat evenly for efficient cooking; Teflon(R) Radiance technology offers supreme scratch resistance. Teflon Radiance features a specially formulated topcoat to enhance heat dispersion for quick heating; nonstick coating is tough enough to handle use with most metal utensils. Lightweight, BPA-free plastic pot lid features an integrated strainer ideal for use with pasta and steamed vegetables; flip-up tab on top makes for easy lid removal. BPA-free Infinity plastic mugs nest securely inside Infinity bowls, which in turn nest within the pot; color-coded mugs and bowls make it easy to remember which are yours. Infinity polypropylene has a high melting temperature, offers good impact resistance, won't retain odors and is dishwasher safe. EVA foam sleeves keep your beverages hot while the dual-port Sip-It tops help prevent spills; compact mug shape is comfortable for both left- and right-hand use. Included folding pot gripper locks to and removes easily from exterior brackets on the pot and frypan; gripper design prevents scratching of the nonstick surfaces. GSI Pinnacle Backpacker cookset includes a welded sink basin that doubles as a carry bag.","short_description":"Just because you're camping doesn't mean you can't enjoy a gourmet meal. Whip up a feast that will satisfy the appetites of 2 hungry hikers with the GSI Pinnacle Backpacker cookset.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414767.png","image_url":"http://i1.avlws.com/115/l414767.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414767&tt=df","keywords":"messkit","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414767\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414767.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830775&amp;link=&amp;tabs=-Details\"></script>","variants":{"8307750001":{"sku":"8307750001","vendor_sku":"50180","upc":"090497501807","retail_price":"89.95","sale_price":"89.95"}}}
