{"sku":"830774","manufacturer_id":"50148","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors Pinnacle Dualist Ultralight Cookset","long_description":"The fully integrated, self-contained GSI Pinnacle Dualist Ultralight cookset gives 2 backpackers the lightweight essentials for backcountry dining. Kit includes a hard-anodized 1.8 liter pot with strainer lid, 2 insulated mugs with lids, 2 bowls, 2 telescoping foons, a welded sink and a stove bag. Mugs nest securely inside the bowls, which in turn nest within the pot; color-coded mugs and bowls prevent mix-ups. Insulated mugs have a low center of gravity and include lids with Sip-It openings that virtually eliminate spills. Ultralight backpacking stove and 220g isobutane fuel canister (both sold separately) can also nest within for a complete and compact cooking system. Pinnacle-series aluminum pot distributes heat evenly for fast and efficient cooking and is extremely lightweight and abrasion resistant. Pinnacle-series cookware utilizes hard-anodized aluminum and Teflon(R) Radiance technology for supreme scratch and abrasion resistance. Teflon Radiance technology features a specially formulated topcoat to enhance heat dispersion for quick and even heating. Nonstick coating is tough enough to handle use with most metal utensils. 2 telescoping foons give you the functionality of a fork and spoon, and they fit compactly inside the cook system. BPA-free plastic lid is lightweight and features an integrated strainer ideal for use with pasta and steamed vegetables. Flip-up tab on top of lid makes for easy lid removal. Coated handle provides a comfortable, secure grip; handle locks into place for cooking and secures the entire set for transport. Mugs, bowls, foons and pot lid are made from BPA-free plastics that have high melting temperatures and are dishwasher safe; mugs and bowls are completely recyclable. GSI Pinnacle Dualist Ultralight cookset includes a welded sink basin that doubles as a carry bag.","short_description":"The fully integrated, self-contained GSI Pinnacle Dualist Ultralight cookset gives 2 backpackers the lightweight essentials for backcountry dining.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414763.png","image_url":"http://i1.avlws.com/115/l414763.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414763&tt=df","keywords":"messkit","retail_price":"64.95","sale_price":"64.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414763\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414763.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830774&amp;link=&amp;tabs=-Details\"></script>","variants":{"8307740001":{"sku":"8307740001","vendor_sku":"50148","upc":"090497501487","retail_price":"64.95","sale_price":"64.95"}},"categories":["camping-hiking","camp-kitchen","cookware-and-dinnerware"]}
