{"sku":"830717","manufacturer_id":"620599","brand_name":"Black Diamond","product_name":" Black Diamond Icon Headlamp","long_description":"Don't let the setting sun slow your progress. The professional-level Black Diamond Icon headlamp features a massive 200-lumen output to light up the darkest trails, campsites and rappel stations. Headlamp includes a QuadPower LED that outputs 200 lumens and throws a beam up to 100m for stunning illumination at night. 2 standard white LEDs and 2 standard red LEDs output 35 lumens and throw a beam up to 10m on high-ideal for tasks close at hand. Use the red LEDs to preserve night vision while hanging out at camp or making your way down the trail; red LEDs activate without having to cycle through the white LEDs. Dimmer switch lets you choose the light output needed for the task at hand, from a blazing 200 lumens down to 4 lumens. Use the 2 strobe functions to flash red or white light. 4 AA batteries (included) provide up to 75 hrs. of use on high and 175 hrs. on low; battery indicator light helps you determine how much battery power you have left. Regulated output ensures consistent lighting levels even as battery power is reduced. Lock mode prevents accidental battery drain while the headlamp is in your pack. The Black Diamond Icon headlamp has an IPX7 rating (protected against water immersion down to 1m for 30 min.). Please note: the 2012 version of the Icon headlamp does not work with the Black Diamond NRG Rechargeable Battery kit. NRG kit is compatible with the Apollo lantern and the Fall 2011 and older Icon headlamp.","short_description":"Don't let the setting sun slow your progress. The professional-level Black Diamond Icon headlamp features a massive 200-lumen output to light up the darkest trails, campsites and rappel stations.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417071.png","image_url":"http://i1.avlws.com/115/l417071.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417071&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417071\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417071.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830717&amp;link=&amp;tabs=-Details\"></script>","variants":{"8307170001":{"sku":"8307170001","vendor_sku":"620599","upc":"793661157526","color":"ALUMINUM","retail_price":"79.95","sale_price":"79.95"}}}
