{"sku":"830777","manufacturer_id":"44220","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors Bugaboo Backpacker Cookset","long_description":"Spark your stove and get a hot meal going with the GSI Bugaboo Backpacker cookset. It has just what you need to feed 2 hungry backpackers. Set includes 2 bowls, 2 insulated mugs, 2 Sip-It lids, a 2-liter pot with lid, a frypan, a pot gripper and a stuff sack. Bugaboo-series frypan and pot feature durable and attractively painted finishes that protect the aluminum cores from abrasion and oxidation. Teflon(R) Classic nonstick cooking surface on the pot and frypan speeds cleanup and resists scratches. BPA-free plastic lid is lightweight and features an integrated strainer ideal for use with pasta and steamed vegetables; flip-up tab on top of lid makes for easy lid removal. Cascadian-series mugs nest securely inside bowls, which in turn nest within the 2-liter pot; color-coded mugs and bowls help you keep track of which set is yours. Insulated mugs use lightweight and flexible food-grade polypropylene plastic, making them easy to pack, stack and carry. EVA foam sleeves keep your beverages hot while the dual-port Sip-It tops help prevent spills. Compact mug shape is comfortable for both left- and right-hand use. Folding pot gripper locks to and removes easily from exterior brackets on pot and frypan; gripper design prevents scratching. Ultralight backpacking stove and stacking cutlery (both sold separately) can also nest within for a complete and compact cooking system. GSI Bugaboo Backpacker cookset includes a welded sink basin that doubles as a carry bag.","short_description":"Spark your stove and get a hot meal going with the GSI Bugaboo Backpacker cookset. It has just what you need to feed 2 hungry backpackers.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414775.png","image_url":"http://i1.avlws.com/115/l414775.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414775&tt=df","keywords":"messkit","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414775\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414775.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830777&amp;link=&amp;tabs=-Details\"></script>","variants":{"8307770001":{"sku":"8307770001","vendor_sku":"44220","upc":"090497442209","retail_price":"69.95","sale_price":"69.95"}}}
