{"sku":"830862","manufacturer_id":"90783","brand_name":"Camelbak","product_name":" CamelBak All Clear Water Purifier Bottle","long_description":"The CamelBak All Clear(TM) water purifier bottle uses UV light to effectively neutralize viruses, bacteria and protozoa so you can enjoy safe drinking water while backpacking and traveling. All-in-1 system is simple to use! Fill the bottle with water, screw on the All Clear cap, press the power button and agitate the bottle until the treatment is complete. Fast and efficient design lets you treat 25 fl. oz. (0.75 liter) of water in only 60 sec. LCD screen on the All Clear purifier cap verifies the success of the treatment. Long-lasting UV bulb is rated at 10,000 cycles; shock-resistant design protects the UV bulb for effective purification every time. Once the treatment cycle is complete, remove the All Clear UV purifier cap, stow it in the protective case and screw on the included CamelBak Classic cap. CamelBak All Clear water purifier bottle operates on a built-in rechargeable lithium ion battery; fully charged battery provides 80 treatments (equivalent to 16 gal. of water). Use the included USB cable to recharge the battery with a portable power source, a solar panel or a home computer; battery fully recharges in about 4 hrs. Includes All Clear purifier cap, 25 fl. oz. (0.75 liter) BPA-free bottle, CamelBak Classic cap, carrying case for the All Clear cap and a USB cable for recharging the battery.","short_description":"The CamelBak All Clear(TM) water purifier bottle uses UV light to effectively neutralize viruses, bacteria and protozoa so you can enjoy safe drinking water while backpacking and traveling.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426343.png","image_url":"http://i1.avlws.com/115/l426343.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426343&tt=df","retail_price":"99.00","sale_price":"99.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426343\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426343.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830862&amp;link=&amp;tabs=-Details\"></script>","variants":{"8308620001":{"sku":"8308620001","vendor_sku":"90783","upc":"886798907833","color":"BLUE","retail_price":"99.00","sale_price":"99.00"}}}
