{"sku":"830818","manufacturer_id":"620608","brand_name":"Black Diamond","product_name":" Black Diamond Sprinter Headlamp","long_description":"Don't let darkness limit your running routine. With the Black Diamond Sprinter headlamp, you can keep your training goals clearly in view. Designed specifically for running, the low-profile Sprinter weighs in at only 3.4 oz. and has excellent fore and aft balance so it doesn't bounce up and down while you run. DoublePower LED has a maximum output of up to 75 lumens and throws a strong oval-shape beam up to 45m; beam is optimized for running to illuminate the ground around your feet. Hold down the on/off button to activate the dimmer and fine-tune your lighting needs; press the on/off button twice to activate the front strobe. Regulated output ensures consistent lighting levels even as battery power is reduced. Rear red safety strobe helps keep you visible to cars, bikers and other runners; rear light can be turned on and off. Headlamp is powered by a lithium polymer rechargeable battery that provides up to 42 hrs. of use on low and 6 hrs. on high; battery fully recharges in about 5 hrs. Removable top strap provides increased stabilization. Sealed construction provides IPX7 water resistance (submersible to 1m). Black Diamond Sprinter headlamp includes a USB charger.","short_description":"Don't let darkness limit your running routine. With the Black Diamond Sprinter headlamp, you can keep your training goals clearly in view.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417075.png","image_url":"http://i1.avlws.com/115/l417075.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417075&tt=df","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417075\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417075.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830818&amp;link=&amp;tabs=-Details\"></script>","variants":{"8308180001":{"sku":"8308180001","vendor_sku":"620608","upc":"793661157601","color":"TITANIUM","retail_price":"69.95","sale_price":"69.95"}}}
