{"sku":"830891","manufacturer_id":"D17 O","brand_name":"Petzl","product_name":" Petzl Reverso 4 Belay Device","long_description":"At only 59g, the Petzl Reverso 4 belay device is 25% lighter than the previous version yet offers the same versatility for belaying and rappelling. Features an intuitive self-braking Reverso mode that allows the lead climber to belay 1 or 2 seconding climbers directly from an anchor point. Clip a carabiner to the carabiner hole and give a tug to easily and gradually release the loaded device while in Reverso mode. Device can be quickly changed from self-braking mode to belaying the leader when climbing long multipitch routes. Reverso 4 provides effective braking on half and twin ropes 7.5mm in diameter and larger; works with 8.9mm and larger single ropes. Hot-forged aluminum construction and smart design make it one of the lightest belays devices available. V-shaped channels with asymmetric grooved sidewalls increase friction on thin ropes for controlled belaying and lowering. Rope-friendly design will not kink ropes regardless of the mode used. Usage diagrams for standard belay and Reverso modes are laser etched onto the Petzl Reverso 4 belay device.","short_description":"At only 59g, the Petzl Reverso 4 belay device is 25% lighter than the previous version yet offers the same versatility for belaying and rappelling.","category":"Climbing","subcategory":"Climbing Hardware","product_group":"Belay And Rappel Devices","thumb_url":"http://i1.avlws.com/115/s380123.png","image_url":"http://i1.avlws.com/115/l380123.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380123&tt=df","keywords":"ring,rappel,belay","retail_price":"29.95","sale_price":"29.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380123\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380123.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830891&amp;link=&amp;tabs=-Details\"></script>","variants":{"8308910001":{"sku":"8308910001","vendor_sku":"D17 O","color":"ORANGE","retail_price":"29.95","sale_price":"29.95"}}}
