{"sku":"830893","manufacturer_id":"T24 LLU","brand_name":"Petzl","product_name":" Petzl Charlet Lynx Leverlock Modular Crampons","long_description":"From snow couloirs to mixed climbing routes, the Petzl Lynx Leverlock Modular crampons have a versatile design that will keep you climbing higher no matter the terrain. Crampons come with interchangeable front bindings to adapt to boots with or without toe welts; steel wires fit boots with toe welts and flexible bindings fit boots without. Configuration and length of front points can be modified with 1 screw-set the crampons up with dual points in short, long or asymmetric position. You can also set the crampons up with offset mono-points in the short or long position. Leverlock heel bails are designed for boots with heel welts; height of bails can be adjusted. Low-profile Antisnow(R) plates help prevent sticky snow from balling up beneath your feet without interfering with the projection of the points. Crampons come with medium-length linking bars that fit boot sizes U.S. 5 - 11 (EU 35 - 45); long linking bars are sold separately. Petzl Lynx Leverlock Modular crampons come with the Fakir carrying bag.","short_description":"From snow couloirs to mixed climbing routes, the Petzl Lynx Leverlock Modular crampons have a versatile design that will keep you climbing higher no matter the terrain.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Crampons","thumb_url":"http://i1.avlws.com/115/s407503.png","image_url":"http://i1.avlws.com/115/l407503.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407503&tt=df","retail_price":"245.00","sale_price":"245.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407503\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407503.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830893&amp;link=&amp;tabs=-Details\"></script>","variants":{"8308930001":{"sku":"8308930001","vendor_sku":"T24 LLU","retail_price":"245.00","sale_price":"245.00"}},"categories":["climbing","mountaineering-gear","crampons"]}
