{"sku":"830830","manufacturer_id":"50147","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors Halulite Microdualist Cookset","long_description":"The compact GSI Halulite Microdualist cookset helps you shave weight from your pack without giving up all the comforts of a full cookset. Set includes hard-anodized 1.4 liter pot with strainer lid, 2 insulated mugs with lids, 2 small bowls, 2 telescoping foons, a small stove bag and a welded sink. Hard-anodized Halulite alloy pot distributes heat evenly for fast and efficient cooking, and is extremely lightweight and abrasion resistant. Clear polypropylene mugs nest securely inside the polypropylene bowls, which in turn nest within the pot; color-coded mugs and bowls prevent mix-ups. Insulated mugs have a low center of gravity and include lids with Sip-It openings that virtually eliminate spills. Ultralight backpacking stove and 110g isobutane fuel canister (both sold separately) can also nest within for a complete and compact cooking system. 2 telescoping foons give you the functionality of a fork and spoon, and they fit compactly inside the cook system. BPA-free nylon lid is lightweight and features an integrated strainer ideal for use with pasta and steamed vegetables. Flip-up tab on top of lid makes for easy lid removal. Coated handle provides a comfortable, secure grip; handle locks into place for cooking and secures the entire set for transport. Mugs, bowls and foons are made from BPA-free Infinity polypropylene plastic, which has a high melting temperature and is dishwasher safe and completely recyclable. GSI Halulite Microdualist cookset includes a welded sink that doubles as a carry bag; included stove bag holds your backpacking stove (sold separately).","short_description":"The compact GSI Halulite Microdualist cookset helps you shave weight from your pack without giving up all the comforts of a full cookset.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414791.png","image_url":"http://i1.avlws.com/115/l414791.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414791&tt=df","keywords":"messkit","retail_price":"54.95","sale_price":"54.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414791\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414791.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830830&amp;link=&amp;tabs=-Details\"></script>","variants":{"8308300001":{"sku":"8308300001","vendor_sku":"50147","upc":"090497501470","retail_price":"54.95","sale_price":"54.95"}}}
