{"sku":"830828","manufacturer_id":"44221","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors Bugaboo Camper Cookset","long_description":"The GSI Bugaboo Camper cookset is fully equipped to meet your needs on a 4-person backpacking trip or car camping adventure. Set includes 4 polypropylene plates, 4 bowls, 4 insulated mugs, 4 Sip-It lids, a 2-liter pot with lid, a 3-liter pot with lid, a frypan, a pot gripper and a stuff sack. Bugaboo-series cookware features a durable and attractively painted finish that protects the aluminum core from abrasion and oxidation. Teflon(R) Classic nonstick cooking surface on the pots and frypan speeds cleanup and resists scratches. BPA-free plastic lids are lightweight and feature integrated strainers ideal for use with pasta and steamed vegetables; flip-up tabs on top of lids make for easy lid removal. Cascadian-series mugs nest securely inside bowls, which in turn nest within the 2-liter pot; 4 plates nest within the 3-liter pot. Color-coded mugs, bowls and plates prevent mix-ups at the campsite. Mugs, bowls and plates are made from lightweight and flexible food-grade polypropylene plastic, making them easy to pack, stack and carry. EVA foam sleeves on the mugs keep your beverages hot while the dual-port Sip-It tops help prevent spills. Compact mug shape is comfortable for both left- and right-hand use. Folding pot gripper locks to and removes easily from exterior brackets on pots and frypan; gripper design prevents scratching. GSI Bugaboo Camper cookset includes a rugged stuff sack that doubles as a sink or wash basin.","short_description":"The GSI Bugaboo Camper cookset is fully equipped to meet your needs on a 4-person backpacking trip or car camping adventure.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414783.png","image_url":"http://i1.avlws.com/115/l414783.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414783&tt=df","keywords":"messkit","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414783\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414783.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830828&amp;link=&amp;tabs=-Details\"></script>","variants":{"8308280001":{"sku":"8308280001","vendor_sku":"44221","upc":"090497442216","retail_price":"99.95","sale_price":"99.95"}}}
