{"sku":"830930","manufacturer_id":"90245","brand_name":"Emotion Kayaks","product_name":" Emotion Kayaks Spitfire 8 Sit-On-Top Kayak","long_description":"With its full array of features, the Emotion Kayaks Spitfire 8 sit-on-top kayak brings the fun of sit-on-top kayaks to the water at an incredible value. Highly maneuverable 8 ft. length excels at fun and games in still waters and light surf, and stable hull inspires confidence. Slight rocker adds maneuverability and defined keel aids in tracking. Specially compounded polyethylene hull resists abrasion and UV light and offers durable good looks. Specialized blow molding process produces a strong hull of consistent quality. Seat back increases support and folds down when storing the boat. Molded-in footwells offer comfortable bracing for paddlers of different heights. Molded-in cup holder keeps beverages handy. Paddle ledges offer a secure place to store paddle when you need your hands free. Aft storage tank well with bungee rigging and cargo netting secures your gear; cargo netting works well with bulky items such as an extra paddling jacket or PFD. Scupper holes drain water from cockpit to ensure a dry ride. 39 lb. weight allows kayak to be transported by the solo paddler. Toggled carry handles and 2 side handles of the Emotion Kayaks Spitfire 8 ease transport to the water.","short_description":"With its full array of features, the Emotion Kayaks Spitfire 8 sit-on-top kayak brings the fun of sit-on-top kayaks to the water at an incredible value.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s448107.png","image_url":"http://i1.avlws.com/115/l448107.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448107&tt=df","retail_price":"269.00","sale_price":"269.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448107\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448107.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830930&amp;link=&amp;tabs=-Details\"></script>","variants":{"8309300001":{"sku":"8309300001","vendor_sku":"90245","upc":"081483014074","size":"8 FT","color":"LIME","retail_price":"269.00","sale_price":"269.00"},"8309300002":{"sku":"8309300002","vendor_sku":"90244","upc":"081483014081","size":"8 FT","color":"RED","retail_price":"269.00","sale_price":"269.00"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
