{"sku":"830931","manufacturer_id":"90247","brand_name":"Emotion Kayaks","product_name":"Emotion Kayaks Spitfire 9 Sit-On-Top Kayak","long_description":"Outfitted with comfortable features, the Emotion Kayaks Spitfire 9 sit-on-top kayak offers fun on the water at a great value. 9 ft. length adds a touch of speed but maintains the confidence-inspiring stability of the smaller Spitfire 8 model. Slight rocker adds maneuverability and defined keel aids in tracking. Specially compounded polyethylene hull resists abrasion and UV light and offers durable good looks. Specialized blow molding process produces a strong hull of consistent quality. Seat back increases support and folds down when storing the boat, and bottom cushion enhances comfort on the water. Easily accessible cockpit hatch stores items out of splashes. Molded-in footwells offer supportive bracing for paddlers of different heights. Paddle ledges with bungees secure paddle when you need your hands free. Aft storage tank well with bungee rigging and cargo netting secures your gear; cargo netting works well with bulky items such as an extra paddling jacket or PFD. Small bow storage area secures accessories with bungees. Scupper holes drain water from cockpit to ensure a dry ride. 45 lb. weight allows kayak to be transported by the solo paddler. Toggled carry handles and 2 side handles of the Emotion Kayaks Spitfire 9 ease transport to the water.","short_description":"Outfitted with comfortable features, the Emotion Kayaks Spitfire 9 sit-on-top kayak offers fun on the water at a great value.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s449203.png","image_url":"http://i1.avlws.com/115/l449203.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449203&tt=df","retail_price":"379.00","sale_price":"379.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449203\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449203.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830931&amp;link=&amp;tabs=-Details\"></script>","variants":{"8309310001":{"sku":"8309310001","vendor_sku":"90248","upc":"814236013532","size":"9 FT","color":"GLACIER BLUE","retail_price":"379.00","sale_price":"379.00"},"8309310003":{"sku":"8309310003","vendor_sku":"90247","upc":"081483013909","size":"9 FT","color":"TANGERINE","retail_price":"379.00","sale_price":"379.00"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
