{"sku":"830965","manufacturer_id":"90256","brand_name":"Emotion Kayaks","product_name":" Emotion Kayaks Glide Sport Kayak","long_description":"The Emotion Kayaks Glide Sport kayak offers a blend of stability, control and comfort that will take you from first stroke to seasoned veteran. Beginners will love the confidence-inspiring initial stability and lightweight responsiveness of the Glide Sport. As you progress, the hull offers tracking and performance that will sharpen your skills and enhance your experience. Short length and 42 lb. weight allows the Emotion Kayaks Glide Sport to be transported by the solo paddler. Specially compounded polyethylene hull resists abrasion and UV light, and offers durable good looks. Specialized blow molding process produces a strong hull of consistent quality. Large cockpit opening makes it easy to get into the boat with some extra gear; recessed coaming maximizes paddle stroke area. Dual-density foam seat and back rest offer padded comfort from launch until takeout; adjustable footbraces keep you poised to paddle. Seat adjusts using a strap and pull tab; back rest features an adjustable angle and folds down during storage. Thigh padding offers a bit of extra comfort. Fore and aft deck rigging keeps essential gear within easy reach; paddle ledge with bungee holder secures paddle when you need both hands. Stern flotation pillar enhances flotation in a water-logged boat. Toggled carry handles ease transport to the water.","short_description":"The Emotion Kayaks Glide Sport kayak offers a blend of stability, control and comfort that will take you from first stroke to seasoned veteran.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s449195.png","image_url":"http://i1.avlws.com/115/l449195.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449195&tt=df","retail_price":"349.00","sale_price":"349.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449195\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449195.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=830965&amp;link=&amp;tabs=-Details\"></script>","variants":{"8309650002":{"sku":"8309650002","vendor_sku":"90256","upc":"081483011615","color":"LIME","retail_price":"349.00","sale_price":"349.00"}},"categories":["paddling","kayaks","recreational-kayaks"]}
