{"sku":"831180","manufacturer_id":"2HE04M/BLKGRN","brand_name":"Cannondale","product_name":" Cannondale Ryker Bike Helmet","long_description":"The Ryker bike helmet from Cannondale offers excellent protection, comfortable adjustment and padding and 20 air-scooping vents, all at a fantastic value. 20 vents help move air into, through and out of the helmet to control heat and comfort. Tough polycarbonate shell is molded directly to the EPS foam for resilient protection. Alloy exoskeleton works along with the internal roll cage to supply reinforcement across the vent bridges, helping to maintain high levels of safety and ventilation. Rear retention harness is easily adjusted with the single, micro-adjusting dial; soft EVA padding offers high levels of comfort and doesn't absorb moisture or odors. As an added bonus, the rear harness is ponytail-friendly. Comfortable webbing straps with cam-lock dividers offer easy, secure adjustment for a personalized fit. Wicking pads keep sweat under control and enhance comfort. Removable visor. The Cannondale Ryker bike helmet complies with one or more of the following standards: USA CPSC, CE EN1078, AS/NZ 2063.","short_description":"The Ryker bike helmet from Cannondale offers excellent protection, comfortable adjustment and padding and 20 air-scooping vents, all at a fantastic value.","category":"Cycling","subcategory":"Bike Helmets","product_group":"Mountain Bike Helmets","thumb_url":"http://i1.avlws.com/115/s383571.png","image_url":"http://i1.avlws.com/115/l383571.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383571&tt=df","retail_price":"85.00","sale_price":"62.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383571\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383571.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831180&amp;link=&amp;tabs=-Details\"></script>","variants":{"8311800006":{"sku":"8311800006","vendor_sku":"2HE04M/BLKGRN","upc":"884603397381","size":"S/M","color":"MATTE BLACK/GREEN","retail_price":"62.93","sale_price":"62.93"}}}
