{"sku":"831288","manufacturer_id":"SAFE-T-SEAT PF2","brand_name":"Ibert","product_name":" iBert safe-T-seat Child Carrier","long_description":"Keep your kids front and center with the iBert safe-T-seat child carrier, which offers passengers a great view and allows easy interaction as you ride! safe-T-seat offers a solid center of gravity, positioning protects against dirt, dust, rocks or water off the bike reaching child's face. Mounting bracket attaches to most bikes in about 2 min.; minimum of 0.75 in. of space between the headset and stem is necessary to fit the mounting bracket. Once the mounting bracket is installed, affixing the safe-T-seat is a quick, easy process that can be done in about 15 seconds. In addition, you can install extra brackets on other bikes, allowing you to quickly swap the safe-T-seat between bikes. Designed for children age 4 and under; minimum age is 12 mos. as the child needs to be able to sit up well and hold the weight of a helmet on his or her head. Maximum height of child is 44 in.; maximum weight is 38 lbs. Safety shoulder straps keep child in place; padded steering wheel at front of child features a small bit of friction so they can \"steer\" as you ride. Meets British Safety Standard (BS EN 14344) which tests construction, strength and durability, attachment of seat to the cycle, restraint system, foot guarding and retention. The iBert safe-T-seat child carrier is also designed to meet all ASTM 1625-00 standards, which only apply to rear child carriers at this time.","short_description":"Keep your kids front and center with the iBert safe-T-seat child carrier, which offers passengers a great view and allows easy interaction as you ride!","category":"Cycling","subcategory":"Bike Accessories","product_group":"Child Bike Seats","thumb_url":"http://i1.avlws.com/115/s379647.png","image_url":"http://i1.avlws.com/115/l379647.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379647&tt=df","keywords":"toddler","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379647\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379647.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831288&amp;link=&amp;tabs=-Details\"></script>","variants":{"8312880001":{"sku":"8312880001","vendor_sku":"SAFE-T-SEAT GF2","upc":"898496001027","color":"GREEN","retail_price":"109.95","sale_price":"109.95"},"8312880002":{"sku":"8312880002","vendor_sku":"SAFE-T-SEAT PF2","upc":"898496001034","color":"PINK","retail_price":"109.95","sale_price":"109.95"}}}
