{"sku":"831492","manufacturer_id":"93217240","brand_name":"Perception","product_name":"Perception Expression 15.0 Kayak with Skeg","long_description":"The Perception Expression 15.0 kayak with skeg effectively bridges the gap between a fun, maneuverable day-tripping kayak and a stable, load bearing touring model. Rigid polyethylene hull withstands years of use without the need for maintenance. Touring-style hull offers excellent versatility; great for those seeking a boat for everything from ocean swells to local lakes. Peaked deck and upswept bow sheds water quickly and enhances speed, and progressive rocker enhances handling. Zone DLX seat features a foam-encased pocket that cradles the lower back. Seat back adjusts forward and backward, up and down, and leg lifters offer additional support if needed. Backrest may be raised by pulling strap in front of seat forward or by pushing the button on front of seat to lower. Leg lifters raise seat pan to increase support and take pressure of the ankles. Padded foam thighbraces may be repositioned to personalize cockpit for performance or comfort. Slidelock footbraces are easy to adjust from inside the boat; simply raise the black plastic rod to unlock and slide footbrace into desired position. Fully bulkheaded bow and stern hatches provide dry cargo storage for overnight trips. Cockpit-deployable skeg enhances tracking in rough water and windy conditions; sliding skeg controls are located on left side of cockpit. Deck rigging on bow and stern lets you stash items you'll want readily available such as a bilge pump, extra paddle and map with weatherproof case, not included. Soft-to-the-touch carry handles at bow and stern make trips from the water easy; unlike hard, plastic handles, the soft-touch handles are easy on cold, paddle-weary hands. The Perception Expression 15.0 kayak with skeg weighs approximately 57 lbs.","short_description":"The Perception Expression 15.0 kayak with skeg effectively bridges the gap between a fun, maneuverable day-tripping kayak and a stable, load bearing touring model.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s454199.png","image_url":"http://i1.avlws.com/115/l454199.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454199&tt=df","retail_price":"1129.00","sale_price":"1129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454199\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454199.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831492&amp;link=&amp;tabs=-Details\"></script>","variants":{"8314920001":{"sku":"8314920001","vendor_sku":"93217240","upc":"729282184610","size":"15 FT","color":"RED","retail_price":"1129.00","sale_price":"1129.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
