{"sku":"831488","manufacturer_id":"93220916","brand_name":"Perception","product_name":"Perception Carolina 12.0 Kayak","long_description":"Whether used for a day trip or overnighting, the Perception Carolina 12.0 kayak offers versatile performance and smooth paddling. A V-shaped hull with soft chines makes Perception Carolina 12.0 kayak stable and easy to paddle in relatively calm waters. Upswept, flared bow improves handling while crossing waves. Rigid polyethylene hull withstands years of use without need for maintenance. Zone DLX seat features a foam-encased pocket that cradles the lower back. Seat adjusts forward and backward, up and down, and leg lifters offer additional support if needed. Backrest may be raised by pulling strap in front of seat forward or by pushing the button on front of seat to lower. Leg lifters raise seat pan to increase support and take pressure off the ankles. Knee pads allow you to place knees inside cockpit or outside without discomfort. Slidelock footbraces are easy to adjust from inside the boat; simply raise the black plastic rod to unlock and slide foot peg into desired position. Great for day trips or overnight adventures, the 10 in. bow and oval stern hatches provide access to dry storage space for fishing supplies, picnic staples and camping gear. Dual-density hatch covers are stiff and durable, yet their soft, flexible edges make them easy to use; plus, they form a tight seal to keep contents dry. To seal hatch cover, simply catch the lip under the rim and press it on like the top of a rubberized food-storage container. Deck rigging on bow and stern lets you stash items you'll want readily available, such as a bilge pump, extra paddle, and map with weatherproof case, not included. Reflective perimeter deck lines boost visibility and provide a firm handhold for re-entering kayak after a wet exit. Soft-to-the-touch carry handles at bow and stern make trips from the water easy; unlike hard, plastic handles, the soft-touch handles are easy on cold, paddle-weary hands.","short_description":"Whether used for a day trip or overnighting, the Perception Carolina 12.0 kayak offers versatile performance and smooth paddling.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s450271.png","image_url":"http://i1.avlws.com/115/l450271.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450271&tt=df","retail_price":"889.00","sale_price":"889.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450271\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450271.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831488&amp;link=&amp;tabs=-Details\"></script>","variants":{"8314880001":{"sku":"8314880001","vendor_sku":"93220916","upc":"729282174444","size":"12 FT","color":"WHITE/AZURE","retail_price":"889.00","sale_price":"889.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
