{"sku":"831526","manufacturer_id":"AE1010","brand_name":"Advanced Elements","product_name":" Advanced Elements Hula Inflatable Stand Up Paddleboard - 11'","long_description":"Suited for easy storage and rough waters, the Advanced Elements Hula 11 ft. inflatable stand up paddleboard also provides substantial advantages to the traveling paddler. High-pressure, drop-stitched material and heavy-duty PVC tarpaulin allows for performance that will surprise you for an inflatable-this is no pool toy! The secret to the performance of the Hula 11 is the high inflation pressure that's possible with drop-stitching; a pump with gauge is included to achieve optimal pressure. Double layer of outer skin enhances durability against rocks, barnacles and the perils of paddling. Raised board tip cuts through the chop with ease. Soft traction pad offers solid grip when wet. 7 stainless-steel D-rings let you tie down gear on long paddles. Includes a hand pump with attached gauge. Removable center fin and 2 removable side fins help with tracking on flatwater. The Advanced Elements Hula 11 inflatable stand up paddleboard stows in included duffel bag when not in use; also includes a repair kit. Do not under inflate your SUP! Advanced Elements recommends inflate with a 12V electric pump, and then top off with a quality hand pump to get up to the recommended pressure.","short_description":"Suited for easy storage and rough waters, the Advanced Elements Hula 11 ft. inflatable stand up paddleboard also provides substantial advantages to the traveling paddler.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s456947.png","image_url":"http://i1.avlws.com/115/l456947.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456947&tt=df","retail_price":"899.95","sale_price":"899.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456947\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456947.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831526&amp;link=&amp;tabs=-Details\"></script>","variants":{"8315260001":{"sku":"8315260001","vendor_sku":"AE1010","upc":"832994000809","color":"WHITE/ORANGE","retail_price":"899.95","sale_price":"899.95"}}}
