{"sku":"831682","manufacturer_id":"MS2GG","brand_name":"Camp Chef","product_name":" Camp Chef Rainier Camper Grill Griddle Stove Combo","long_description":"Don't let your camp stove put a limit on the meals you make. The versatile Camp Chef Rainier Camper grill, griddle and stove combo lets you whip up gourmet breakfasts and dinners. Single burner puts out 10,000 BTUs to quickly bring a pot of water to a boil; use the 8,000 BTU nonstick aluminum grill to make hamburgers, hot dogs and chicken. Put the nonstick aluminum griddle on the stove and make a hearty breakfast before the day's adventures. Piezo igniter sparks the stove to life with the push of a button, eliminating worries about wet matches and burning your hand. Lid and side shields block wind from the burners. Stainless-steel drip tray is easy to clean up; includes a removable grease tray under the grill. Convenient carry handle makes it easy to transport the Camp Chef Rainier Camper grill, griddle and stove combo. When it's time to pack things up, the Rainier Camper combo stows nicely in the included carry bag; bag includes space for 2 fuel canisters, sold separately. Operates on 16.4 oz. propane canisters, sold separately. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"Don't let your camp stove put a limit on the meals you make. The versatile Camp Chef Rainier Camper grill, griddle and stove combo lets you whip up gourmet breakfasts and dinners.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416567.png","image_url":"http://i1.avlws.com/115/l416567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416567&tt=df","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831682&amp;link=&amp;tabs=-Details\"></script>","variants":{"8316820001":{"sku":"8316820001","vendor_sku":"MS2GG","upc":"033246211466","color":"RED","retail_price":"129.95","sale_price":"129.95"}}}
