{"sku":"831755","manufacturer_id":"1-MP-MFDR-V2HP","brand_name":"Lezyne","product_name":"Lezyne HP Micro Floor Drive Mini Pump","long_description":"Compact and powerful, the Lezyne HP Micro Floor Drive mini pump offers floor-pump-like power in a take-it-with-you size and weight, making fast work of reinflating tubes. Precise CNC-machined aluminum construction ensures lasting use and keeps the weight low; stainless-steel wire foot peg offers stability while pumping. Flip-Thread chuck threads directly onto Presta or Schrader valves for a secure, airtight connection; also included is the Presta-only Speed Chuck, which works with disc wheels. Air bleed system cleverly eliminates chance of unthreading removable Presta valves; also lets you adjust tire pressure when inflating via Schrader valves. 24 in. long rubber hose makes it easy to inflate tires. Lezyne HP Micro Floor Drive mini pump comes with a mounting bracket for easy pump storage while riding; bracket mounts to frame via water bottle bosses. Compatible with Presta and Schrader valves; maximum inflation pressure of 160 psi (11bar).","short_description":"Compact and powerful, the Lezyne HP Micro Floor Drive mini pump offers floor-pump-like power in a take-it-with-you size and weight, making fast work of reinflating tubes.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Pumps","thumb_url":"http://i1.avlws.com/115/s375819.png","image_url":"http://i1.avlws.com/115/l375819.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375819&tt=df","retail_price":"45.00","sale_price":"45.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375819\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375819.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831755&amp;link=&amp;tabs=-Details\"></script>","variants":{"8317550001":{"sku":"8317550001","vendor_sku":"1-MP-MFDR-V2HP","color":"SILVER","retail_price":"45.00","sale_price":"45.00"}},"categories":["cycling","bike-accessories","bike-pumps"]}
