{"sku":"831926","manufacturer_id":"9026","brand_name":"Thule","product_name":"Thule Apex 5 Bike Hitch Rack","long_description":"With a new shape and less wobbling, the Thule Apex 5 bike hitch rack securely carries up to 5 bikes, and has greater distance between bikes and better ground clearance than previous Thule hitch racks. Increased mast height improves ground clearance and arc design in mast and arms offers easy bike loading and carrying. Tilt-down design with Hitch Switch(TM) quick-release lever allows arms to fold down when not in use and tilts carrier away from vehicle for fast rear vehicle access. Included Snug-Tite(TM) Stinger receiver lock secures rack to the hitch receiver; 4 walls of fastening contact within receiver eliminate vertical and horizontal movement. New Hold Fast Cradles are shaped to cushion bike frames and feature Thermal Plastic Elastomer (TPE) road damping pads that absorb road forces and vibrations to protect bikes. Anti-Sway Cages with integrated soft-touch TPE strips protect bike frame finishes and prevent bike-to-bike and bike-to-vehicle contact; reinforced rubber cradle straps. Thule Apex 5 accommodates only 2 in. receiver hitches. Integrated locking cable secures bikes and stores conveniently in the rack's support arms. Easy mounting of hitch rack requires no tools; push rack into receiver until auto-pin engages, tighten knob and lock the hood of the housing. Not intended for tandem or recumbent bikes; carrying bikes with step-through frames requires the purchase of an adapter (sold separately).","short_description":"With a new shape and less wobbling, the Thule Apex 5 bike hitch rack securely carries up to 5 bikes, and has greater distance between bikes and better ground clearance than previous Thule hitch racks.","category":"Car Racks","subcategory":"Bike Racks","product_group":"Trailer Hitch Bike Racks","thumb_url":"http://i1.avlws.com/115/s247999.png","image_url":"http://i1.avlws.com/115/l247999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=247999&tt=df","keywords":"rear,mount,hitch-mount","retail_price":"439.95","sale_price":"439.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=247999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m247999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831926&amp;link=&amp;tabs=-Details\"></script>","variants":{"8319260001":{"sku":"8319260001","vendor_sku":"9026","upc":"091021008175","retail_price":"439.95","sale_price":"439.95"}},"categories":["car-racks","bike-racks","trailer-hitch-bike-racks"]}
