{"sku":"831925","manufacturer_id":"9027","brand_name":"Thule","product_name":"Thule Apex Swing 4 Bike Hitch Rack","long_description":"The Thule Apex Swing 4 bike hitch rack carries up to 4 bikes and is easy to load and unload with the unique arc design that provides better ground clearance and creates greater distance between bikes. Increased mast height improves ground clearance and a unique arc design in mast and arms offers easy bike loading and carrying. Swing-away design allows a fully loaded hitch rack to swing away from vehicle providing access to rear of vehicle. Tilt-down design with Hitch Switch(TM) quick-release lever allows arms to fold down when not in use. Included Snug-Tite(TM) Stinger receiver lock secures your rack to the car receiver; 4 walls of fastening contact within receiver eliminate vertical and horizontal movement. New Hold Fast Cradles are shaped to cushion bike frames and feature Thermal Plastic Elastomer (TPE) road damping pads that absorb road forces and vibrations to protect bikes. Anti-Sway Cages with integrated soft-touch TPE strips protect bike frame finishes and prevent bike-to-bike and bike-to-vehicle contact; reinforced rubber cradle straps. Thule Apex Swing 4 accommodates 2 in. receiver hitches. Integrated locking cable secures bikes and stores conveniently in the rack's support arms. Easy mounting of hitch rack requires no tools; push rack into receiver until auto-pin engages, tighten knob and lock the hood of the housing. Not intended for tandem or recumbent bikes; carrying bikes with step-through frames requires the purchase of an adapter (sold separately).","short_description":"The Thule Apex Swing 4 bike hitch rack carries up to 4 bikes and is easy to load and unload with the unique arc design that provides better ground clearance and creates greater distance between bikes.","category":"Car Racks","subcategory":"Bike Racks","product_group":"Trailer Hitch Bike Racks","thumb_url":"http://i1.avlws.com/115/s227339.png","image_url":"http://i1.avlws.com/115/l227339.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=227339&tt=df","keywords":"hitch-mount,rear,mount","retail_price":"499.95","sale_price":"499.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=227339\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m227339.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=831925&amp;link=&amp;tabs=-Details\"></script>","variants":{"8319250001":{"sku":"8319250001","vendor_sku":"9027","upc":"091021508910","retail_price":"499.95","sale_price":"499.95"}},"categories":["car-racks","bike-racks","trailer-hitch-bike-racks"]}
