{"sku":"832031","manufacturer_id":"9028","brand_name":"Thule","product_name":"Thule Vertex 2 Bike Hitch Rack","long_description":"The new Thule Vertex 2 bike hitch rack carries up to 2 bikes and is easy to load and unload with the unique arc design that provides better ground clearance and creates greater distance between bikes. Increased mast height improves ground clearance and a unique arc design in mast and arms offers easy bike loading and carrying. Tilt-down design with Hitch Switch(TM) quick-release lever allows arms to fold down when not in use and tilts carrier away from vehicle for fast rear vehicle access. New Hold Fast Cradles are shaped to cushion bike frames and provide security. Anti-Sway Cages with reinforced rubber straps prevent bike-to-bike and bike-to-vehicle contact. Snug-Tite(TM) receiver lock (sold separately) locks your rack to the car receiver. Thule Vertex 2 accommodates both 2 in. and 1.25 in. receiver hitches with included hitch adapter. Not intended for tandem or recumbent bikes; carrying bikes with step-through frames requires the purchase of an adapter (sold separately).","short_description":"The new Thule Vertex 2 bike hitch rack carries up to 2 bikes and is easy to load and unload with the unique arc design that provides better ground clearance and creates greater distance between bikes.","category":"Car Racks","subcategory":"Bike Racks","product_group":"Trailer Hitch Bike Racks","thumb_url":"http://i1.avlws.com/115/s219167.png","image_url":"http://i1.avlws.com/115/l219167.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=219167&tt=df","keywords":"mount,rear,hitch-mount","retail_price":"249.95","sale_price":"249.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=219167\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m219167.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=832031&amp;link=&amp;tabs=-Details\"></script>","variants":{"8320310001":{"sku":"8320310001","vendor_sku":"9028","upc":"091021329959","retail_price":"249.95","sale_price":"249.95"}},"categories":["car-racks","bike-racks","trailer-hitch-bike-racks"]}
