{"sku":"832243","manufacturer_id":"9626","brand_name":"Rei","product_name":"REI Backpacker First-Aid Kit - Special Buy","long_description":"The REI Backpacker first-aid kit offers quick access to needed first-aid items, and it keeps items organized so they're easy to find. The REI Backpacker first-aid kit contains a wide assortment of bandages and essentials for treating anything from blisters and splinters to larger wounds. For wound management: irrigation syringe, 9 x 5 in. abdominal or pressure pad and 1 pair latex-free gloves. Bandages: two 3 x 4 non-stick pads, four 2 x 2 in. gauze pads, two 3 x 3 in. gauze pads and eight 4 x 4 in. gauze sponges. Also includes 3 in. x 4.1 yds. stretch gauze roll, 2 in. x 4.1 yds. stretch gauze roll and 5 each of knuckle elastic bandages and fingertip elastic bandages. 10 butterfly closures, five 3/4 x 3 in. adhesive bandages and ten 1 x 3 in. adhesive bandages. For blisters: three 3 x 4 in. moleskin, 1 in. x 10 yds. tape; for sprains or breaks: 3 in. elastic bandage and 3.75 x 30 in. wire splint. 3 antibacterial wipes, 3 triple antibiotic ointment, 3 sting relief wipes, 2 hydrocortisone packets, 9 iodine wipes and an antimicrobial hand wipe. Medications include: 6 Cetafen acetaminophen, 6 Nutralox(R) mint antacid tablets, 6 Proprinal(R) ibuprofen and 4 antihistamine. Other necessities: 4.5 in. bandage scissors and 3.5 in. splinter forceps. All of this, plus. Compact, lightweight kit weighs only 25 oz. Special buy.","short_description":"The REI Backpacker first-aid kit offers quick access to needed first-aid items, and it keeps items organized so they're easy to find.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s420435.png","image_url":"http://i1.avlws.com/115/l420435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=420435&tt=df","retail_price":"49.75","sale_price":"32.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=420435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m420435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=832243&amp;link=&amp;tabs=-Details\"></script>","variants":{"8322430001":{"sku":"8322430001","vendor_sku":"9626","upc":"650332962615","retail_price":"32.73","sale_price":"32.73"}}}
