{"sku":"832242","manufacturer_id":"9624","brand_name":"Rei","product_name":" REI Hiker First-Aid Kit - Special Buy","long_description":"The REI Hiker first-aid kit is a 4-panel, fold-out kit that outfits you for multiday adventures. The REI Hiker first-aid kit features a zippered nylon case that corrals contents and hang loops for easy carrying or storage. Comes with \"The Wilderness First Aid Manual\" by Dr. William Forgey for quick reference while on the trail. Wound materials: five 0.75 x 3 in. adhesive bandages, five 1 x 3 in. adhesive bandages, 5 knuckle elastic bandages and 5 fingertip elastic bandages. Also includes two 2 x 2 in. gauze pads, a 9 x 5 in. abdominal/pressure pad and 6 butterfly closure strips. Two 4 x 4 in. gauze pads, two 3 x 2 in. non-adherent pads and a 2 in. x 4.1 yards stretch gauze roll. Prep and care for wounds with a SaniHands wipe, 3 antibacterial wipes, 3 triple-antibiotic ointment packets, 2 iodine wipes and 3 Soothe-A-Sting wipes. For sprains and blisters: a 2 in. elastic bandage, two 3 x 4 in. moleskin patche and a 1 in. x 10 yds. porous tape. Medications include 2 Cetafen acetaminophen, 2 Nutralox(R) mint antacid tablets, 2 Proprinal(R) ibuprofen and 1 antihistamine. Equipment includes 4.5 in. stainless-steel bandage scissors, 3.5 in. splinter forceps and NeoPro latex-free gloves. Special buy.","short_description":"The REI Hiker first-aid kit is a 4-panel, fold-out kit that outfits you for multiday adventures.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s445635.png","image_url":"http://i1.avlws.com/115/l445635.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445635&tt=df","retail_price":"34.50","sale_price":"21.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445635\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445635.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=832242&amp;link=&amp;tabs=-Details\"></script>","variants":{"8322420001":{"sku":"8322420001","vendor_sku":"9624","upc":"650332962417","retail_price":"21.73","sale_price":"21.73"}},"categories":["camping-hiking","health-and-safety","first-aid"]}
