{"sku":"832371","manufacturer_id":"S8310","brand_name":"Bic Sport","product_name":"BIC Sport ACE-TEC Wahine Stand Up Paddleboard - Women's - 10' 6\"","long_description":"The women's Bic Sport ACE-TEC Wahine 10' 6\" stand up paddleboard changes your local waterway into a fun way to get out and get some exercise. Paddleboarding develops core muscles and balance-it's the perfect training activity for surfers, skiers and paddlers. Perfect for cruising on flatwater and light surf, the Bic Sport ACE-TEC 10' 6\" Wahine combines durability and performance to create a great multipurpose board. 10 ft. 6 in. length maneuvers well in light surf and cruises swiftly in flatwater. Balanced rocker design and longboard-style outline offers excellent handling on flatwater and easy maneuverability in waves and light surf. EPS foam core wrapped with an epoxy resin/fiberglass cloth is encased in a styrene polymer outer shell; construction offers lightweight durability. Multiaxial fiberglass cloth distributes weight in multiple directions in the board, offering excellent stiffness and low weight. Padded deck supplies reliable wax-free traction when paddling in the standing or kneeling position, and it increases comfort on long paddles. 10 in. single fin and 2 side fins promote straight tracking in the water. FCS fin features injection-molded construction and a specialized structure on the inside face of the fin that reduces drag and enhances performance. Integrated carry handle on deck makes toting the 26 lb. Bic Sport ACE-TEC Wahine 10' 6\" stand up paddleboard quick and easy. Please note that the color of the deck pad on the tail of the board may be gray and not colored.","short_description":"The women's Bic Sport ACE-TEC Wahine 10' 6\" stand up paddleboard changes your local waterway into a fun way to get out and get some exercise.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430759.png","image_url":"http://i1.avlws.com/115/l430759.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430759&tt=df","retail_price":"1049.95","sale_price":"1049.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430759\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430759.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=832371&amp;link=&amp;tabs=-Details\"></script>","variants":{"8323710001":{"sku":"8323710001","vendor_sku":"S8310","upc":"883667003566","size":"10 FT 6 IN","color":"WHITE/PINK","retail_price":"1049.95","sale_price":"1049.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
