{"sku":"832334","manufacturer_id":"0120-0230","brand_name":"Adventure Medical Kits","product_name":" Adventure Medical Kits Family First-Aid Kit","long_description":"The Adventure Medical Kits Family First-Aid kit gives you everything you need to care for children and adults in the outdoors. Includes everything you need to treat cuts, scrapes, bites, stings, allergic reactions, muscle aches, fevers, strains and sprains for 1 - 4 family members for 1 - 4 days. All contents are packed together in easily identifiable, clear vinyl compartments. Treat wounds with 12 antiseptic wipes, 4 butterfly bandages, 16 fabric bandages, 12 plastic bandages, 4 knuckle bandages, 1 large adhesive bandage and 8 gauze pads. Also includes 4 triple antibiotic ointments, 2 non-adherent dressings, 4 cotton tip applicators, 10 yards of 0.5 in. tape and 1 pair of nitrile gloves. 14 precut and shaped moleskin pieces help prevent blisters; treat strains and sprains with an elastic bandage and 1 instant cold pack. Six 200mg ibuprofen tablets, six 500mg acetaminophen tablets and three 25mg antihistamine tablets knock out pain, fever and allergy symptoms. Medical instruments include 1 pair of blunt-tip scissors, splinter picker/tick remover forceps, 2 disposable thermometers and 2 safety pins. Includes 2 Natrapel(R) 8 hr. Tick and Insect repellent wipes and 1 tube of After Bite Kids(R). Learn how to treat your children's wounds by referencing the included copy of.","short_description":"The Adventure Medical Kits Family First-Aid kit gives you everything you need to care for children and adults in the outdoors.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s420439.png","image_url":"http://i1.avlws.com/115/l420439.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=420439&tt=df","retail_price":"29.95","sale_price":"29.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=420439\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m420439.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=832334&amp;link=&amp;tabs=-Details\"></script>","variants":{"8323340001":{"sku":"8323340001","vendor_sku":"0120-0230","upc":"707708302305","retail_price":"29.95","sale_price":"29.95"}},"categories":["camping-hiking","health-and-safety","first-aid"]}
