{"sku":"832614","manufacturer_id":"DSWEXPCH8","brand_name":"Kokatat","product_name":"Kokatat Gore-Tex Expedition Dry Suit - Women's","long_description":"The women's Kokatat Gore-Tex(R) Expedition dry suit fends off tough weather and rough waters to keep you warm and dry. Tough nylon with Gore-Tex Pro Shell laminate is completely waterproof, extremely breathable and highly durable. Tough reinforcements at knees and seat boost abrasion resistance and durability; fabric patches on exterior of Gore-Tex are self-draining. Neoprene neck gasket seals with skin to help keep water out. Stowable storm hood features adjustable drawstring and reflective tape; hood is designed to work with a paddling helmet. Adjustable neoprene band keeps suit snugly fitted around midsection using 2 large rip-and-stick tabs. Specialized sleeves enhance freedom of motion and won't restrict movement when paddling. Sleeve pockets on left and right arms store small essentials. Waterproof front-entry zipper eases dressing and zippered, drop-away seat makes pit stops quick and easy. Adjustable leg and arm cuffs with rip-and-stick closures dial in the fit; arm cuffs have latex gaskets to enhance protection. Reflective highlights on front of suit enhance visibility in low light. Integrated Gore-Tex socks are more comfortable than latex gaskets and prevent water from entering suit at legs. The Kokatat Gore-Tex Expedition dry suit is built for mild surface immersion; not intended to replace a full dry suit in more challenging conditions such as very cold water. Machine or hand wash in cold water with powdered detergent; do not bleach or dry clean; store dry, hanging or loosely folded.","short_description":"The women's Kokatat Gore-Tex(R) Expedition dry suit fends off tough weather and rough waters to keep you warm and dry.","category":"Paddling","subcategory":"Paddling Clothing","product_group":"Dry Suits","thumb_url":"http://i1.avlws.com/115/s431511.png","image_url":"http://i1.avlws.com/115/l431511.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431511&tt=df","retail_price":"1170.00","sale_price":"1170.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431511\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431511.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=832614&amp;link=&amp;tabs=-Details\"></script>","variants":{"8326140008":{"sku":"8326140008","vendor_sku":"DSWEXPCH8","upc":"606891037400","size":"XL","color":"CHILI/GRAY","retail_price":"1170.00","sale_price":"1170.00"},"8326140010":{"sku":"8326140010","vendor_sku":"DSWEXPCA3","upc":"606891039183","size":"M","color":"CANVAS/GRAY","retail_price":"1170.00","sale_price":"1170.00"},"8326140011":{"sku":"8326140011","vendor_sku":"DSWEXPCA4","upc":"606891039190","size":"L","color":"CANVAS/GRAY","retail_price":"1170.00","sale_price":"1170.00"}},"categories":["paddling","paddling-clothing","dry-suits"]}
