{"sku":"832773","manufacturer_id":"86102.02.100","brand_name":"Nrs","product_name":"NRS Baron 4 Inflatable Stand Up Paddleboard","long_description":"Designed for big paddlers that venture into rough waters, the NRS Baron 4 inflatable stand up paddleboard offers rigid stability with a soft touch. Not only does the NRS Big Baron handle like a composite board, but it deflates and offers a compact option for the traveling paddler. High air pressure creates a rigid hull without the use of frame parts; the performance is suited to surf, flatwater and whitewater applications. PVC-coated polyester stands up to heavy use, and a specialized drop stitching and coating process creates a board that can be inflated to 15 psi. 11 ft. 4 in. length turns responsively, making wave cruising easy; 36 in. width offers unusually high stability. Textured and grooved deck padding grips your feet and enhances maneuverability. Removable center fin and 2 side fins promote easy tracking; includes a 9 in. fin, two 5 in. fins and two 2 in. fins. Recessed center webbing strap makes transport easy, and bow and stern webbing handles with D-rings offer a great place to clip accessories. The NRS Baron 4 inflatable stand up paddleboard includes carrying case with shoulder straps, extra fin, K-Pump 100, pressure gauge and a repair kit. 3 webbing handles make it easy to get the Big Baron to and from the water. Uses Leafield C7 valves.","short_description":"Designed for big paddlers that venture into rough waters, the NRS Baron 4 inflatable stand up paddleboard offers rigid stability with a soft touch.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s442939.png","image_url":"http://i1.avlws.com/115/l442939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442939&tt=df","retail_price":"1195.00","sale_price":"1195.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=832773&amp;link=&amp;tabs=-Details\"></script>","variants":{"8327730002":{"sku":"8327730002","vendor_sku":"86102.02.100","upc":"603403206439","color":"WHITE/RED","retail_price":"1195.00","sale_price":"1195.00"}},"categories":["paddling","paddleboarding","paddleboards"]}
