{"sku":"832888","manufacturer_id":"8005","brand_name":"Onguard","product_name":" OnGuard PitBull DT U-Lock with Cable","long_description":"OnGuard PitBull DT U-lock is paired with a 4 ft. cable to not only provide excellent locking security, but plenty of locking versatility as well. Burly 14mm (0.55 in.) hardened steel shackle resists cutting, prying and jacking; rubber-coated shackle and crossbar help protect your bike's finish. X4P Quattro locking mechanism secures the shackle to the crossbar in 4 places, maximizing strength to resist pulling, jacking, prying and twisting. Z-Cylinder tumbler is bump-proof and resists picking, pulling or drilling. Rounded design and centered keyhole eliminate pry points; all-metal end caps protect against drops and hits while the auto-closing keyhole cover protects lock internals. 4 ft. long fully coated, braided 10mm steel cable gives you lots of locking versatility, including leaving your front wheel on the bike. Comes with 5 laser-cut keys, 1 of which has an integrated LED light; mounting bracket Included. OnGuard rates the PitBull DT U-lock and cable as an 83 out of 100 on their 100-point security rating system, where higher-rated locks offer increased security.","short_description":"OnGuard PitBull DT U-lock is paired with a 4 ft. cable to not only provide excellent locking security, but plenty of locking versatility as well.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Locks","thumb_url":"http://i1.avlws.com/115/s376151.png","image_url":"http://i1.avlws.com/115/l376151.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376151&tt=df","retail_price":"64.95","sale_price":"64.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376151\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376151.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=832888&amp;link=&amp;tabs=-Details\"></script>","variants":{"8328880001":{"sku":"8328880001","vendor_sku":"8005","upc":"768661280055","size":"4.5 IN x 9 IN + 4 FT x 10","retail_price":"64.95","sale_price":"64.95"}},"categories":["cycling","bike-accessories","bike-locks"]}
