{"sku":"833004","manufacturer_id":"1TK4HW0000","brand_name":"Current Designs","product_name":"Current Designs Kestrel 140 Comp Kayak with Rudder","long_description":"If you're looking for fun and ease while touring, the Kestrel 140 Comp kayak with rudder from Current Designs offers an experience that's pretty close to ideal. 14 ft. length enhances speed, tracking and stability when covering distance on relatively calm waters. Shallow-V hull enhances tracking and offers friendly stability and a lively feel in the water. Swede-form construction enhances speed and maneuverability, and it allows bow to punch through waves instead of riding up and over them. Unusually light, strong and stiff, the Kestrel 140 comp kayak with rudder features a hybrid construction of fiberglass and a polyaramid (the same material as Kevlar(R)). Vacuum-bagged composite lamination eliminates excess resin, which improves strength and reduces weight to a scant 43 lbs. Roomy cockpit makes it easy for any paddler to enter kayak. Seat creates a natural, comfortable paddling position by tilting the entire seat pan up and away from cockpit floor. Use the lever-lock knob (it's similar to a quick-release fork on a bike wheel) to set the seat pan to the desired height. Locking mechanism prevents both side-to-side and up-and-down motion. To prevent numbness, seat pan features a contoured space for lower vertebrae and is covered with plush, nonabsorbent, very thick padding. Seat back moves up and down and back and forth, and it articulates to move with your paddling motion. Sliding bar adjusts foot pegs without having to get out and reach inside cockpit. Cockpit-deployable rudder enhances tracking in rough weather; toe pedals on top part of foot pegs direct the rudder and steer the kayak. Rear hatch provides enough storage for an overnight trip and features an easy-to-use, rubberized hatch cover. Bow hatch protects contents from water thanks to a strap-down hard cover. Glassed-in bulkheads enhance flotation when hatches are sealed.","short_description":"If you're looking for fun and ease while touring, the Kestrel 140 Comp kayak with rudder from Current Designs offers an experience that's pretty close to ideal.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s460231.png","image_url":"http://i1.avlws.com/115/l460231.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460231&tt=df","retail_price":"2299.00","sale_price":"2299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460231\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460231.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833004&amp;link=&amp;tabs=-Details\"></script>","variants":{"8330040001":{"sku":"8330040001","vendor_sku":"1TK4HW0000","upc":"483300400013","color":"WHITE/WHITE","retail_price":"2299.00","sale_price":"2299.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
