{"sku":"833099","manufacturer_id":"720018999508","brand_name":"Kryptonite","product_name":"Kryptonite New York Legend 1590 Chain Lock","long_description":"The New York Legend 1590 chain lock is the highest security lock from Kryptonite! Designed for ultimate security in the highest crime areas, it features an armored disc lock. Substantial 15mm round chain links are made of ultra-hardened steel for extreme strength and defense from would-be bike thiefs. Chain is covered with a protective nylon cover to ensure lasting use that also helps protect your frame's finish; rip-and-stick loops at ends hold cover in place. Uses a maximum-security New York Padlock with 16mm MAX-Performance steel shackle; reinforced, hardened-steel sleeve covers lock body. Highest security disc-style cylinder lock has more than 1 million key variations; hardened double-deadbolt locking mechanism offers stout holding power. Reinforced anti-drill/pull cylinder protection design further enhances lock security; sliding dust-cover shields the internals of the lock and helps extend cylinder life. The Kryptonite New York Legend 1590 chain lock comes with 3 new \"I\" keys, which enhance ergonomics. Kryptonite rates this lock a 12 on their 12-point system with 1 being simple, deterrent security and 12 being extreme security.","short_description":"The New York Legend 1590 chain lock is the highest security lock from Kryptonite! Designed for ultimate security in the highest crime areas, it features an armored disc lock.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Locks","thumb_url":"http://i1.avlws.com/115/s376195.png","image_url":"http://i1.avlws.com/115/l376195.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376195&tt=df","retail_price":"183.95","sale_price":"183.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376195\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376195.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833099&amp;link=&amp;tabs=-Details\"></script>","variants":{"8330990001":{"sku":"8330990001","vendor_sku":"720018999508","upc":"720018999508","retail_price":"183.95","sale_price":"183.95"}},"categories":["cycling","bike-accessories","bike-locks"]}
