{"sku":"833005","manufacturer_id":"1K13HW0000","brand_name":"Current Designs","product_name":"Current Designs Vision 130 Comp Kayak","long_description":"Featuring low weight, smooth lines and a feel that will make you one with the ocean, the Current Designs Vision 130 Comp kayak is a responsive boat that's designed for the smaller paddler. Offering superb performance and a confidence-inspiring feel, the Current Designs Vision 130 Comp kayak is slightly more nimble than its 15 ft. counterpart. Unusually lightweight, strong and stiff, the Vision 130 features a hybrid construction of fiberglass and a polyaramid (the same material found in Kevlar(R)). Vacuum-bagged composite lamination eliminates excess resin, which improves strength and reduces weight to a mere 40 lbs. 13 ft. length offers tracking and maneuverability, and 24 in. width provides stability. Swede-form construction enhances speed and maneuverability, and it allows bow to punch through waves instead of riding up and over them. Shallow-V hull enhances tracking and offers friendly stability and a lively feel in the water; low decks minimize wind resistance. Keyhole-shape cockpit is easy to enter and exit, and integrated foam thighbraces on interior coaming increase comfort when bracing or carving turns. Seat creates a natural, comfortable paddling position by tilting the entire seat pan up and away from cockpit floor. Use the lever-lock knob-similar to a quick-release fork on a bike wheel-to set the seat pan to the desired height. Locking mechanism prevents both side-to-side and up-and-down motion. To prevent numbness, seat pan features a contoured space for lower vertebrae and is covered with plush, nonabsorbent, very thick padding. Seat back moves up and down and back and forth, and it articulates to move with your paddling motion. Sliding bar adjusts foot pegs without having to get out and reach inside cockpit. Rear hatch provides enough storage for an overnight trip and features an easy-to-use, rubberized hatch cover.","short_description":"Featuring low weight, smooth lines and a feel that will make you one with the ocean, the Current Designs Vision 130 Comp kayak is a responsive boat that's designed for the smaller paddler.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s430695.png","image_url":"http://i1.avlws.com/115/l430695.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430695&tt=df","retail_price":"2099.00","sale_price":"2099.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430695\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430695.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833005&amp;link=&amp;tabs=-Details\"></script>","variants":{"8330050002":{"sku":"8330050002","vendor_sku":"1K13HW0000","upc":"818317010083","color":"RED","retail_price":"2099.00","sale_price":"2099.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
