{"sku":"833050","manufacturer_id":"154 361 528","brand_name":"Native Eyewear","product_name":" Native Eyewear Trango Polarized Sunglasses - Men's","long_description":"Dreaming of summer vacation or your next adventure? The Native Trango polarized sunglasses feature interchangeable lenses to protect you eyes from sunshine and glare wherever you go. Frames include 1 set of polarized Silver Reflex (gray tinted) lenses and 1 set of SportFlex(TM) lenses, for a total of 2 sets of lenses. Interchangeable lens system lets you switch lenses to accommodate a variety of light conditions and activities. Polarized lenses block 40% of infrared light (decreasing eye fatigue), offer UV protection and blue light filtering to minimize haze and enhance clarity. Lenses have the strongest hard coating available to protect against scratching. Frames endure extreme highs and lows in temperature. Frames are extremely lightweight, yet flexible and durable enough to withstand high velocity collisions. Self-adjusting Cushinol(TM) nosepads and ear stems create a nonslip grip that keeps sunglasses in place, ensuring a soft feel and personalized fit. Temple ends hug behind your ears to keep sunglasses in place. Cam-action spring hinges quickly lock temples into position. Polarized Reflex(TM) lenses provide superior glare reduction and enhanced styling. Polarized Silver Reflex lenses work well for all light conditions, especially extremely bright sunlight because the Reflex coating blocks more light. Additional SportFlex orange-yellow lenses have a mirror coating suitable for a range of low lighting-cloudy, overcast, dusk and dawn. Native Trango interchangeable polarized sunglasses include a protective case and a soft pouch that doubles as a cleaning cloth. Frames best fit medium to large profiles.","short_description":"Dreaming of summer vacation or your next adventure? The Native Trango polarized sunglasses feature interchangeable lenses to protect you eyes from sunshine and glare wherever you go.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422943.png","image_url":"http://i1.avlws.com/115/l422943.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422943&tt=df","keywords":"Cycling","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422943\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422943.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833050&amp;link=&amp;tabs=-Details\"></script>","variants":{"8330500001":{"sku":"8330500001","vendor_sku":"154 361 528","upc":"764824010620","size":"SILVER REFLEX","color":"WOOD","retail_price":"149.00","sale_price":"149.00"}}}
