{"sku":"833321","manufacturer_id":"CP 2 C31 220","brand_name":"Werner","product_name":"Werner Cyprus Kayak Paddle - Carbon Bent-Shaft","long_description":"Bring on the rough water! With the Werner Cyprus bent-shaft carbon paddle in your hands, maneuverability is simply a matter of putting the high-angle blades below the surface. Mid-size blades are designed with power and bracing in mind, yet are surprisingly easy to pull through the water during extended trips. High-quality, continuous-weave carbon fiber shaft delivers a superior strength-to-weight ratio. Bent shaft naturally aligns wrists, providing immediate comfort and reducing strain; a special grip area that fits the natural contour of your hand increases overall control. Smart View Adjustable Ferrule System allows elegant adjustment of feathering angle from 0deg - 60deg right or left in 15deg increments. Improved ferrule design eliminates external stickers by incorporating a small window which displays an internal printing of offset degrees. Low-profile button release makes paddle feel like 1 piece. Carbon fiber/foam core blades create a distinctive profile that enters and exits the water quietly while adding buoyancy for a light stroke. Blade design with ribless back smooths the sculling stroke and creates an elegant exit from the water. Pronounced dihedral power face reduces flutter to create exceptionally smooth, yet powerful, forward stroke. Asymmetrical shape reduces torque, allowing the paddle to pull smoothly through the water without the need for a tight grip. Remarkably light swing weight reduces overall fatigue on long paddling excursions. Drip rings help keep hands and lap dry. 2-piece design breaks down quickly and eases transport and storage. The Werner Cyprus kayak paddle is carefully handcrafted in Sultan, Washington, using a pressure molding process to achieve the right balance between weight and durability.","short_description":"Bring on the rough water! With the Werner Cyprus bent-shaft carbon paddle in your hands, maneuverability is simply a matter of putting the high-angle blades below the surface.","category":"Paddling","subcategory":"Paddles","product_group":"Kayak Paddles","thumb_url":"http://i1.avlws.com/115/s431031.png","image_url":"http://i1.avlws.com/115/l431031.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431031&tt=df","retail_price":"475.00","sale_price":"475.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431031\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431031.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833321&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["paddling","paddles","kayak-paddles"]}
