{"sku":"833411","manufacturer_id":"59550","brand_name":"Rola","product_name":" ROLA Dart Folding Hitch Mount Cargo Carrier","long_description":"The ROLA Dart Folding Hitch Mount cargo carrier makes loading luggage and gear for road trips simple. No more scrambling on top of cars for hard-to-reach gear; just unfold and load the platform. Powder-coated steel with ABS plastic trim provides rugged durability for all weather conditions and any kind of load from bikes to duffel bags. 450 lb. load capacity means you can carry more than just a suitcase; feel free to load up the carrier and give the passengers more space. Low-profile, hitch-mounted carrier keeps the load easily accessible without interfering with the driver's sightline. Cargo carrier is easily folded and stowed upright when not in use, minimizing the added length and making it easy to park your vehicle just as you would without it. Skid and side plates help secure the load; built-in license plate relocation holes keep you street-legal. The ROLA Dart Folding Hitch Mount cargo carrier platform measures 56 x 23 x 5.25 in. Cargo carrier requires a 2 in. hitch receiver on your vehicle.","short_description":"The ROLA Dart Folding Hitch Mount cargo carrier makes loading luggage and gear for road trips simple. No more scrambling on top of cars for hard-to-reach gear; just unfold and load the platform.","category":"Car Racks","subcategory":"Cargo Boxes, Baskets And Bags","product_group":"Roof Rack Baskets","thumb_url":"http://i1.avlws.com/115/s441555.png","image_url":"http://i1.avlws.com/115/l441555.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441555&tt=df","retail_price":"345.00","sale_price":"345.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441555\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441555.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833411&amp;link=&amp;tabs=-Details\"></script>","variants":{"8334110001":{"sku":"8334110001","vendor_sku":"59550","upc":"016118077261","color":"SILVER MIST/BLACK","retail_price":"345.00","sale_price":"345.00"}},"categories":["car-racks","cargo-boxes-baskets-and-bags","roof-rack-baskets"]}
