{"sku":"833599","manufacturer_id":"000147152304","brand_name":"Point 65","product_name":"Point 65 Apollo Sit-On-Top Kayak - Bow Section","long_description":"The Point 65 Apollo sit-on-top kayak bow section combines with the Apollo stern section to form a single kayak, and both sections combine with the Apollo center section to form a tandem kayak. Perfect for apartment dwellers, small car owners and anyone who doesn't have the space for a full-length kayak, the Apollo breaks down into easy-to-store pieces. Innovative system joins pieces together, creating a stable, rigid kayak that you'll love to paddle in light surf, calm rivers and flatwater. Assembly happens in a flash: just align the sections, feed a strap into a ratchet, and ratchet down straps on either side of the cockpit. Offering a great value and high durability, the Apollo features a durable blow-molded thermoplastic hull. Cockpit in bow and stern features a comfortable molded seat with multiple footrests. Stern section features a padded backrest and padded cushion that offer comfortable support; backrest folds down during storage. Small recessed areas in bow and stern are great places to stash a dry bag and water shoes (not included); stretchy cords secure gear. The Point 65 Apollo sit-on-top kayak includes rod holders, cup holders and and carrying handles at bow and stern.","short_description":"The Point 65 Apollo sit-on-top kayak bow section combines with the Apollo stern section to form a single kayak, and both sections combine with the Apollo center section to form a tandem kayak.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s430635.png","image_url":"http://i1.avlws.com/115/l430635.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430635&tt=df","retail_price":"225.00","sale_price":"225.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430635\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430635.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833599&amp;link=&amp;tabs=-Details\"></script>","variants":{"8335990001":{"sku":"8335990001","vendor_sku":"000147152304","color":"RED","retail_price":"225.00","sale_price":"225.00"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
