{"sku":"833689","manufacturer_id":"VNPCBRMPL","brand_name":"Smith","product_name":" Smith Pivlock V90 Sunglasses","long_description":"The rimless Smith Pivlock V90 sunglasses feature interchangeable lenses and provide an unobstructured field of vision for your high speed activities. With the Pivlock(TM) interchangeable system, simply rotate temple piece up 45deg and remove from lens; to remove nose piece, grasp lens and pull piece away. Scratch- and impact-resistant Carbonic(TM) lenses use Smith Tapered Lens Technology(TM) to provide distortion-free vision. Lens coating repels water, dirt, fingerprints and grease for smudge-free vision. Matte black frames feature a yellow mirror lens to reduce visible light and glare and preserve true color definition. 2 additional sets of lenses included: rose Ignitor lenses with mirror coating for medium light/overcast conditions; clear lenses for low light to night conditions. Includes a total of 3 sets of lenses. 7-base-curve lens (the higher the number the more curved the lens); Smith features sunglasses with 6, 7, 8 and 9 base curvature. Frames are made from bio-plastic Rilsan(R) Clear (derived from non-GMO castor seeds) for a resilient, durable and consistent fit. Megol(TM) temple and nose pads become tackier when wet for reliable grip during exercise and hot weather. Smith Pivlock V90 sunglasses have a small-medium fit with medium coverage. Includes coconut fiber storage bag.","short_description":"The rimless Smith Pivlock V90 sunglasses feature interchangeable lenses and provide an unobstructured field of vision for your high speed activities.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422955.png","image_url":"http://i1.avlws.com/115/l422955.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422955&tt=df","keywords":"Cycling","retail_price":"139.00","sale_price":"139.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422955\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422955.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833689&amp;link=&amp;tabs=-Details\"></script>","variants":{"8336890002":{"sku":"8336890002","vendor_sku":"VNPCBRMPL","upc":"715757403133","size":"BRONZE MIRROR","color":"PEARL","retail_price":"139.00","sale_price":"139.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
