{"sku":"833644","manufacturer_id":"12-2-01","brand_name":"Tern","product_name":"Tern Link Uno Folding Bike - 2013","long_description":"The Tern Link Uno folding bike is a quick-folding, agile-handling, all-arounding single-speed ride that's well-suited to exploring boroughs and towns. Capable of folding in under 10 seconds, the Link Uno is a study in simplicity and ease; folded dimensions are 31.1 x 28.3 x 14.1 in. Strong 6061 aluminum frame is designed to minimize flex and deliver a stiff, responsive platform for efficient transfer of your pedaling energy. OCL Joint frame hinge provides a strong, stiff frame joint that offers smooth, easy operation; large, smooth lever automatically locks into place. When frame is folded in half, the frame hinge surfaces lock together for a secure fit; lever folds flat and braces against joint for protection in transit. For confident handling, the Physis folding handlepost features a beefed-up, oversize hinge with machined surfaces and secure lock to minimize flexy play. Handlepost hinge lever automatically locks in place and is easy to use; if hinge is accidentally left unlocked, hinge won't open when handlebar is pushed forward. Also, the handlepost hinge features 3 rubber seals to keep weather out and the headset protected; redundant double bolts clamp handlepost to steerer. Single-speed drivetrain is the ultimate in low-maintenance and urban utility, taking away the fuss of cable adjustment and shifting. Chain features a continuous enclosure to keep clothing protected from grease and road gime. Rear coaster brake engages at the hub when one backpedals. Schwalbe Citizen tires feature double-layer puncture protection to deter flats. Accommodates riders up to 6 ft. 2 in. tall; recommended maximum weight of rider with gear is 243 lbs. Specs on the Tern Link Uno folding bike are subject to change.","short_description":"The Tern Link Uno folding bike is a quick-folding, agile-handling, all-arounding single-speed ride that's well-suited to exploring boroughs and towns.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378367.png","image_url":"http://i1.avlws.com/115/l378367.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378367&tt=df","retail_price":"650.00","sale_price":"650.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378367\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378367.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833644&amp;link=&amp;tabs=-Details\"></script>","variants":{"8336440002":{"sku":"8336440002","vendor_sku":"12-2-01","upc":"817378010865","color":"BLACK/GRAY","retail_price":"650.00","sale_price":"650.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
