{"sku":"833690","manufacturer_id":"VWPCSPTNG","brand_name":"Smith","product_name":"Smith Pivlock V2 Sunglasses","long_description":"The lightweight, rimless Smith PivLock V2 sunglasses feature an adjustable nose piece and interchangeable lens system that all will appreciate-especially runners and cyclists. Same as the PivLock V2 Max but with a smaller silhouette, the V2 sunglasses are medium-sized with wrap-around coverage. With the PivLock interchangeable system, simply rotate temple piece up 45deg and remove from lens; to remove nosepiece, grasp lens and pull piece away. Scratch- and impact-resistant Carbonic lenses use Tapered Lens Technology from Smith to provide distortion-free vision. Tapered Lens Technology contours the thickness of the lens so that light travels through without distortion-what you see is what you get. Permanent lens coating repels moisture, grease and grime to keep your vision clear. Both frames feature gray lenses with a platinum mirror finish to reduce visible light and glare while preserving natural colors in order to provide true color definition. 2 additional sets of lenses included: rose Ignitor lenses with mirror coating for medium light/overcast conditions; clear mirror lenses for low light to night conditions. Includes a total of 3 sets of lenses. 7 base curve lenses; Smith features sunglasses with 6, 7, 8 and 9 base curvature-the higher the number, the more curved the lenses. Frames are made from a bio-plastic derived from non-GMO castor seeds and lightweight nylon for a resilient, consistent fit. Hydrophilic temple and nose pads become tackier when wet for reliable grip during exercise and hot weather; slide-on temple tips. Adjustable nose bridge lets you customize the fit from narrow, medium or wide, to find your ideal fit and comfort level. Includes protective case.","short_description":"The lightweight, rimless Smith PivLock V2 sunglasses feature an adjustable nose piece and interchangeable lens system that all will appreciate-especially runners and cyclists.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422959.png","image_url":"http://i1.avlws.com/115/l422959.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422959&tt=df","keywords":"Cycling","retail_price":"159.00","sale_price":"159.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422959\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422959.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833690&amp;link=&amp;tabs=-Details\"></script>","variants":{"8336900001":{"sku":"8336900001","vendor_sku":"VWPCGYMBK","upc":"715757383756","size":"PLATINUM","color":"BLACK","retail_price":"159.00","sale_price":"159.00"},"8336900002":{"sku":"8336900002","vendor_sku":"VWPCGYMWT","upc":"715757392765","size":"PLATINUM","color":"WHITE","retail_price":"159.00","sale_price":"159.00"},"8336900003":{"sku":"8336900003","vendor_sku":"VWPCSPTNG","upc":"715757418748","size":"SUPER PLATINUM","color":"NEON GREEN","retail_price":"159.00","sale_price":"159.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
