{"sku":"833677","manufacturer_id":"CFGPGYBK","brand_name":"Smith","product_name":" Smith Chief Polarized Sunglasses","long_description":"Smith Chief polarized sunglasses sport optical precision and visual clarity that surpass all expectations. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Techlite polarized glass TLT lenses provide 100% UVA/B/C protection with exceptionally thin, sturdy construction for weight savings. Tapered Lens Technology(TM) contours the thickness of the lens so that light travels through without distortion. Frames are made from bio-plastic Rilsan(R) Clear (derived from non-GMO castor seeds) for a resilient, consistent fit. Black frames feature polarized gray green lenses to reduce reflected glare while sharpening detail. Special lens coating repels water, dirt, fingerprints and grease from surface of glass. 8 base-curve lens: the higher the number the more curved the lens-Smith features sunglasses with 6, 7, 8 and 9 base curvature. Lightweight frames have a medium fit with medium to large coverage. Smith Chief polarized sunglasses come with a coconut fiber storage bag.","short_description":"Smith Chief polarized sunglasses sport optical precision and visual clarity that surpass all expectations.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Casual Sunglasses","thumb_url":"http://i1.avlws.com/115/s422391.png","image_url":"http://i1.avlws.com/115/l422391.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422391&tt=df","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422391\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422391.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833677&amp;link=&amp;tabs=-Details\"></script>","variants":{"8336770001":{"sku":"8336770001","vendor_sku":"CFGPGYBK","upc":"715757375522","size":"POLAR GRAY GREEN","color":"BLACK","retail_price":"199.00","sale_price":"199.00"}}}
