{"sku":"833693","manufacturer_id":"PLPCBRMPL","brand_name":"Smith","product_name":"Smith Parallel Women's Sunglasses","long_description":"Sleek yet subtle, Smith Parallel interchangeable sunglasses allow unobstructed peripheral vision-ideal for trail running, cycling or a day on the boat. Each frame includes 1 set of lenses (tint depends on frame color) and 2 additional sets of lenses for a total of 3 sets of lenses. Violet frames feature pink mirror lenses that provide true color vision without affecting light reaching the eye. Ice blue frames feature blue mirror lenses that provide true color vision without affecting light reaching the eye. Pearl frames feature bronze mirror lenses that sharpen visual acuity while reducing glare. Of included extra sets of lenses, red lenses perform well in low-light conditions; clear lenses are ideal for nighttime. Scratch- and impact-resistant Carbonic(TM) lenses use Tapered Lens Technology from Smith(TM) to provide distortion-free vision. Tapered Lens Technology contours the thickness of the lens so that light travels through without distortion-what's to be seen is what you get. Frames are made from bio-plastic Rilsan(R) Clear (derived from non-GMO castor seeds) for a resilient, durable and consistent fit. Megol(TM) nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. 9-base-curve lenses; (the higher the number the more curved the lens-Smith features sunglasses with 6, 7, 8 and 9 base curvature). Smith Parallel sunglasses feature a medium fit with medium coverage. Includes a coconut fiber storage bag.","short_description":"Sleek yet subtle, Smith Parallel interchangeable sunglasses allow unobstructed peripheral vision-ideal for trail running, cycling or a day on the boat.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s422963.png","image_url":"http://i1.avlws.com/115/l422963.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422963&tt=df","keywords":"Cycling","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422963\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422963.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833693&amp;link=&amp;tabs=-Details\"></script>","variants":{"8336930003":{"sku":"8336930003","vendor_sku":"PLPCBRMPL","upc":"715757403089","size":"BRONZE MIRROR","color":"PEARL","retail_price":"129.00","sale_price":"129.00"},"8336930004":{"sku":"8336930004","vendor_sku":"PLPCGYMSP","upc":"715757421007","size":"PLATINUM","color":"SUGAR PLUM","retail_price":"129.00","sale_price":"129.00"},"8336930005":{"sku":"8336930005","vendor_sku":"PLPCGYMAQ","upc":"715757420994","size":"PLATINUM","color":"AQUA MARINE","retail_price":"129.00","sale_price":"129.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
