{"sku":"833728","manufacturer_id":"A92RD4D","brand_name":"The North Face","product_name":"The North Face Surge II Daypack - Women's","long_description":"The women's Surge II daypack from The North Face features a suspension designed to fit women, letting them carry their daily work or school essentials, including a laptop and a tablet, in comfort. Dedicated, zippered and padded laptop sleeve handles laptops up to 17 in.; neoprene sleeve holds up to a 10 in. tablet. Main pocket holds books, papers and files. Middle pocket features a deluxe organizer; front pocket features dual zip access to multiple pockets for must-have items. Zippered and padded bottom compartment is sized to hold a power cord and other accessories. Side stretch-woven pocket keeps your water bottles from bouncing around. Women-specific adjustable, padded shoulder straps and padded back panel offer load-carrying comfort; polyethylene sheet along back adds structure and support. Padded and stowable hipbelt enhances carrying support and stability. Constructed of abrasion-, moisture- and tear-resistant ballistic nylon for exceptional durability. The North Face women's Surge II daypack also has reflective hits to increase visibility in low light and a daisy chain to lash on gear. This pack is endorsed by the American Chiropractic Association, recognizing the comfort and function of its shoulder straps, back panel and interior organization.","short_description":"The women's Surge II daypack from The North Face features a suspension designed to fit women, letting them carry their daily work or school essentials, including a laptop and a tablet, in comfort.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s248847.png","image_url":"http://i1.avlws.com/115/l248847.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=248847&tt=df","keywords":"small,pack,travel,carry on,commute","retail_price":"125.00","sale_price":"125.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=248847\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m248847.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833728&amp;link=&amp;tabs=-Details\"></script>","variants":{"8337280001":{"sku":"8337280001","vendor_sku":"A92R JK3","upc":"053329799391","color":"TNF BLACK","retail_price":"125.00","sale_price":"125.00"},"8337280005":{"sku":"8337280005","vendor_sku":"A92RD4D","upc":"715752976519","color":"VAPOROUS GREY RIPSTOP","retail_price":"125.00","sale_price":"125.00"},"8337280007":{"sku":"8337280007","vendor_sku":"A92RVP1","upc":"887040684663","color":"GRAPHITE GREY/MAGIC MAGEN","retail_price":"125.00","sale_price":"125.00"}}}
