{"sku":"833708","manufacturer_id":"61750","brand_name":"Camelbak","product_name":" CamelBak StoAway 100 Reservoir","long_description":"Add the CamelBak StoAway 100 reservoir to your backpack and you're ready for year-round adventures. Its insulated design keeps water from freezing on winter trips. Burst-resistant 100 fl. oz. Antidote reservoir features a huge access port for easy filling and cleaning; new cap is easier to open and close than previous versions. Integrated baffle gives the reservoir a slim profile and also limits water from sloshing side to side as you move and twist while wearing your pack. HydroGuard(TM) technology inhibits bacterial growth on reservoir and tube surfaces (but does not protect user from disease organisms; please wash reservoir after each use). Insulated carrier and drinking tube, and a covered bite valve help prevent freeze-ups during a chilly day on the mountain. Polyurethane-coated polyester carrier features double the insulation of a traditional pack; zippered opening allows quick loading. Reservoir is equipped with the Quick Link(TM) connection system for hassle-free removal of the drinking tube. Big Bite(TM) valve is easy to use-just bite and sip. Multiple lash points make it easy to attach the StowAway to any backpack with accessory carabiners (sold separately). CamelBak StoAway 100 reservoir includes integrated folding dryer arms that help keep the reservoir open for easy drying when you're back home.","short_description":"Add the CamelBak StoAway 100 reservoir to your backpack and you're ready for year-round adventures. Its insulated design keeps water from freezing on winter trips.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Pack Accessories","thumb_url":"http://i1.avlws.com/115/s412183.png","image_url":"http://i1.avlws.com/115/l412183.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412183&tt=df","retail_price":"55.00","sale_price":"55.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412183\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412183.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=833708&amp;link=&amp;tabs=-Details\"></script>","variants":{"8337080001":{"sku":"8337080001","vendor_sku":"61750","upc":"713852617509","color":"BLACK","retail_price":"55.00","sale_price":"55.00"}}}
