{"sku":"834566","manufacturer_id":"8002452","brand_name":"Yakima","product_name":" Yakima DoubleDown Ace Hitch Rack - 5 Bike","long_description":"The Yakima DoubleDown Ace 5 bike rack gives you the best of both worlds by safely transporting up to 5 bikes, and then providing easy access to your vehicle. Installation to vehicle is a breeze and requires no tools; rack locks to hitch for security. Once bikes are removed, tilt-down mast lowers rack out of the way to provide access to back of vehicle. Fits most bikes, but an adapter (sold separately) may be required for women's or kids' bikes; not designed for use with tandem or recumbent bikes. Anti-sway bike cradles eliminate bike-to-bike contact and bike-to-vehicle contact. Rubber straps on each cradle securely anchor bike into place. Cradle arms can be lowered when not in use. Intuitive levers with anti-pinch trigger covers make folding cradle arms and mast a simple endeavor. Fits 1.25 in. and 2 in. receiver hitches; designed for Class II hitches and higher. DoubleDown Ace 5 bike rack has 2 integrated bottle openers-one on each end of the arms. Not intended for tandem or recumbent bikes; carrying bikes with step-through frames requires the purchase of an adapter (sold separately).","short_description":"The Yakima DoubleDown Ace 5 bike rack gives you the best of both worlds by safely transporting up to 5 bikes, and then providing easy access to your vehicle.","category":"Car Racks","subcategory":"Bike Racks","product_group":"Trailer Hitch Bike Racks","thumb_url":"http://i1.avlws.com/115/s237359.png","image_url":"http://i1.avlws.com/115/l237359.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=237359&tt=df","keywords":"mount,rear,hitch-mount","retail_price":"299.00","sale_price":"238.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=237359\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m237359.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=834566&amp;link=&amp;tabs=-Details\"></script>","variants":{"8345660001":{"sku":"8345660001","vendor_sku":"8002452","upc":"736745024525","color":"SILVER","retail_price":"238.93","sale_price":"238.93"}}}
