{"sku":"834613","manufacturer_id":"84080","brand_name":"Patagonia","product_name":"Patagonia Mixed Guide Hoodie Jacket - Men's","long_description":"The Patagonia Mixed Guide Hoodie jacket combines soft shell mobility and breathability with key area storm protection for the best alpinist protection around. With weather protection where you need it and breathability everywhere else, the hybrid design maximizes the benefits of hard- and soft-shell technology. Upper torso (hood, shoulders and upper arms, lower in front than in back) utilizes H2No(R) Performance 3-layer nylon ripstop fabric with a waterproof, breathable barrier. Remaining soft-shell areas are made of heavy-duty but highly breathable and wind resistant Polartec(R) Power Shield(R). Polartec Power Shield durable stretch woven blend dramatically enhances the Durable Water Repellent finish's resistance to wind, water, snow and abrasion. Brushed interior gives next-to-skin comfort. Helmet-compatible, 3-way-adjustable hood with laminated visor provides optimal visibility in bad conditions; microfleece-lined neck and chin for comfort. Patagonia Mixed Guide Hoodie features rip-and-stick adjustable cuffs and drawcord hem. Full-reach gusseted panels let you reach without raising the body of the jacket. Harness- and pack-compatible chest pockets with watertight reverse-coil zippers; 2 handwarmer pockets with reverse-coil zippers and storm flaps for secure storage.","short_description":"The Patagonia Mixed Guide Hoodie jacket combines soft shell mobility and breathability with key area storm protection for the best alpinist protection around.","category":"Men's","subcategory":"Men's Jackets","product_group":"Men's Soft Shell Jackets","thumb_url":"http://i1.avlws.com/115/s263983.png","image_url":"http://i1.avlws.com/115/l263983.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=263983&tt=df","keywords":"men,jacket,coat,men's soft shell jackets","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=263983\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m263983.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=834613&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
