{"sku":"834723","manufacturer_id":"14144","brand_name":"Rei","product_name":" REI Inside Passage Wheeled Luggage - 28\"","long_description":"When the trip takes you through parking lots, over curbs and conveyor belts, with a stop in the baggage compartment, the REI Inside Passage 28 is adept. Expansion zipper adds 7 liters of cargo space. Inside Passage 28 is sized perfectly to take full advantage of checking just 1 bag; whether for just 1 or shared between 2, you'll gladly avoid checked-bag fees. REI delivers thoughtful organization and durable materials for the long haul; this structured luggage is not only easy to pack, but sports stylish influences and handy details. Exterior pocket is sized for travel documents, tickets and boarding passes; contrasting inner color helps you locate items. Rugged telescoping pull handle locks in up/down position and has soft-touch handle grip for comfort and control; rugged wheels are smooth-rolling and quiet. Secure ID window on back panel. Interior zippered mesh and water-resistant pockets; 2 interior, adjustable straps compress and control of packed items. Rear-tilting design provides upright stability for transport ease and tip-over prevention. Top and side grab handles ensure easy hauling of the REI Inside Passage 28. Inside Passage Access cargo bag (sold separately) is a convenient companion piece designed to fit and function with the Inside Passage 28.","short_description":"When the trip takes you through parking lots, over curbs and conveyor belts, with a stop in the baggage compartment, the REI Inside Passage 28 is adept. Expansion zipper adds 7 liters of cargo space.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433779.png","image_url":"http://i1.avlws.com/115/l433779.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433779&tt=df","retail_price":"239.00","sale_price":"166.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433779\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433779.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=834723&amp;link=&amp;tabs=-Details\"></script>","variants":{"8347230001":{"sku":"8347230001","vendor_sku":"14144","upc":"483472300012","color":"SLATE","retail_price":"166.93","sale_price":"166.93"}}}
