{"sku":"834724","manufacturer_id":"14147","brand_name":"Rei","product_name":" REI Inside Passage Access Bag","long_description":"The Inside Passage Access bag is for travelers who seek organization with a bit of outdoor style. This bag has organizer pockets, fits underneath most airliner seats and will hold a 14 in. laptop. Main opening has side guessets to provide wide open access to content and security to keep things from spilling out. Exterior pocket is sized for travel documents, tickets and boarding passes; includes easy-access organizer panel with pen slots, zippered mesh pocket and phone slot. Padded side zip pocket keeps small belongings protected and accessible; opposite side pocket holds 1 liter bottle. Interior clip keeps keys secure. Adjustable-length shoulder strap with sliding shoulder pad provides comfort and secure single-shoulder carrying. Rear sleeve slides over rolling luggage pull handle for easy companion wheeling; 2 top handles for hand carrying. Fully padded on all sides to give extra protection to your belongings; sturdy fabric stands up to wear. REI Inside Passage Access is designed to fit and function with the Inside Passage Wheeled styles, sold separately.","short_description":"The Inside Passage Access bag is for travelers who seek organization with a bit of outdoor style. This bag has organizer pockets, fits underneath most airliner seats and will hold a 14 in. laptop.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Handbags","thumb_url":"http://i1.avlws.com/115/s432339.png","image_url":"http://i1.avlws.com/115/l432339.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432339&tt=df","retail_price":"79.50","sale_price":"54.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432339\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432339.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=834724&amp;link=&amp;tabs=-Details\"></script>","variants":{"8347240001":{"sku":"8347240001","vendor_sku":"14147","upc":"483472400019","color":"SLATE","retail_price":"54.93","sale_price":"54.93"}},"categories":["travel","day-bags-and-packs","handbags"]}
