{"sku":"834722","manufacturer_id":"14145","brand_name":"Rei","product_name":"REI Inside Passage Wheeled Luggage - 22\"","long_description":"When the trip takes you through parking lots, over curbs, past airport security and ends in a 737, the REI Inside Passage 22 is ready for the challenges you'll meet. Fits in most overhead bins. Frequent air and car travelers will appreicate the packing ease and protection of this structured luggage as well as its stylish influences and high-performance details. Removable quart-size clear pouch eases airport screening; tethers to any exterior handle or clips inside the front pocket. Exterior pocket is sized for travel documents, tickets and boarding passes; contrasting inner color helps you locate items. Rugged telescoping pull handle locks in up/down position and has soft-touch handle grip for comfort and control; rugged wheels are smooth-rolling and quiet. Rear-tilting design provides upright stability for transport ease and tipover prevention. Secure ID window on back panel. Interior zippered mesh pocket; 2 interior, adjustable straps provide compression and control of packed items. Top and side grab handles ensure easy hauling. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline). Inside Passage Access cargo bag (sold separately) is a convenient companion piece designed to fit and function with the Inside Passage 22.","short_description":"When the trip takes you through parking lots, over curbs, past airport security and ends in a 737, the REI Inside Passage 22 is ready for the challenges you'll meet. Fits in most overhead bins.","category":"Luggage & Travel","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s251931.png","image_url":"http://i1.avlws.com/115/l251931.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=251931&tt=df","keywords":"rolling,luggage,travel,wheeled","retail_price":"189.00","sale_price":"189.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=251931\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m251931.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=834722&amp;link=&amp;tabs=-Details\"></script>","variants":{"8347220001":{"sku":"8347220001","vendor_sku":"14145","upc":"483472200015","color":"SLATE","retail_price":"189.00","sale_price":"189.00"}}}
