{"sku":"834967","manufacturer_id":"TCRU-115","brand_name":"Thule","product_name":"Thule Crossover 38L Wheeled Convertible Luggage with Laptop Compartment","long_description":"Like to travel with your laptop? Roll the Thule Crossover 38L luggage through the airport or carry it on with hideaway backpack straps. Either way, your laptop goes with you in its own compartment. Padded laptop compartment holds most laptops up to 15 in. Wheels face away from the body; when roller is used as a backpack, this ensures a clean, comfortable carrying experience. Aluminum hardware and water-resistant fabrics combine to create a lightweight, durable bag. Durable exoskeleton and molded polypropylene back panel absorb the impact of rugged travel. Tough, oversized wheels and Thule V-Tubing(TM) telescoping handles guarantee a smooth, steady and straight pull for years to come. Heat-molded, crushproof SafeZone compartment protects eyewear, portable electronics and other fragile items; compartment locks and can be removed for extra room. Raised rails give your bag and gear extra protection. Piggyback strap attachment loops lets you hook an additional bag onto the Thule Crossover 38L bag when on the move. Divided main compartment separates clean from dirty, wet from dry, and work-from-play. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"Like to travel with your laptop? Roll the Thule Crossover 38L luggage through the airport or carry it on with hideaway backpack straps. Either way, your laptop goes with you in its own compartment.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s440239.png","image_url":"http://i1.avlws.com/115/l440239.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440239&tt=df","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440239\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440239.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=834967&amp;link=&amp;tabs=-Details\"></script>","variants":{"8349670001":{"sku":"8349670001","vendor_sku":"TCRU-115","upc":"085854224291","color":"BLACK","retail_price":"299.95","sale_price":"299.95"}},"categories":["travel","luggage","wheeled-luggage"]}
