{"sku":"835167","manufacturer_id":"COBS","brand_name":"C Crane","product_name":"C Crane CC Solar Observer Radio","long_description":"No power? No problem. The C Crane CC Solar Observer radio runs on sunlight! No sunlight? No problem. It runs on hand-crank generated power, too! Solar power offers approximately 4 - 6 hrs. of radio play time for 8 hours of charge time; hand crank provides about 15-30 minutes of play time for 90 seconds of cranking. Play time varies based on crank speed, volume level and band selection; Battery achieves more play time after conditioning (charging and discharging several times). Radio tunes in AM, FM and Weather bands and is perfect for use during camping trips, emergencies or severe weather when traditional power sources may be unavailable. Updated core radio chip achieves superior AM/FM reception and selectivity. Included radio-to-USB adapter lets you charge smartphones using the USB cord that came with your phone. Besides solar and hand-crank power, the radio also runs on 3 AA batteries (sold separately) or an AC adapter (not included). The C Crane CC Solar Observer radio features an analog display with backlight, built-in LED flashlight, 3.5mm headphone jack, internal AM antenna and telescoping FM antenna.","short_description":"No power? No problem. The C Crane CC Solar Observer radio runs on sunlight! No sunlight? No problem. It runs on hand-crank generated power, too!","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412739.png","image_url":"http://i1.avlws.com/115/l412739.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412739&tt=df","retail_price":"49.95","sale_price":"49.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412739\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412739.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=835167&amp;link=&amp;tabs=-Details\"></script>","variants":{"8351670001":{"sku":"8351670001","vendor_sku":"COBS","upc":"696714305045","color":"BLACK","retail_price":"49.95","sale_price":"49.95"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
