{"sku":"835155","manufacturer_id":"15629","brand_name":"Rei","product_name":"REI Airflyte Hybrid Jacket - Men's","long_description":"Go ahead, break a sweat. The men's REI Airflyte Hybrid jacket prevents the cold wind from creating a chill and offers a fit that encourages motion. Wind- and water-resistant recycled ripstop polyester houses lightweight synthetic insulation in a pattern that's similar to the baffles of your sleeping bag. The insulated section of the men's REI Airflyte Hybrid jacket extends from the hem to the collar, and it does not include the sleeves or side panels. Insulated section features a Durable Water Repellent finish and resists wind to 55 mph. The sleeves and side panels of jacket features a stretchy, breathable polyester jersey that dries in under 4 hrs. and protects skin with a UPF 50+ rating. Full-length zipper offers instant ventilation, and draft flap helps guard core heat. Zippered pockets shelter hands and feature a cord port for you earphones. Thumbholes help keep the sleeves in place during aerobic activities. You'll go farther without chafing thanks to the raglan sleeves, flatlock construction and specially placed seams. Reflective details enhance visibility in dim light. Athletic fit moves with you and stays close to your body; ergonomic seams complement your natural movements.","short_description":"Go ahead, break a sweat. The men's REI Airflyte Hybrid jacket prevents the cold wind from creating a chill and offers a fit that encourages motion.","category":"Men's","subcategory":"Men's Jackets","product_group":"Men's Running Jackets","thumb_url":"http://i1.avlws.com/115/s255275.png","image_url":"http://i1.avlws.com/115/l255275.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=255275&tt=df","keywords":"wind shell,windbreaker,windshirt,breaker,jacket","retail_price":"99.50","sale_price":"68.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=255275\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m255275.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=835155&amp;link=&amp;tabs=-Details\"></script>","variants":{"8351550029":{"sku":"8351550029","vendor_sku":"15629","upc":"483515500294","size":"L","color":"CORNMEAL/TITANIUM","retail_price":"68.93","sale_price":"68.93"}}}
