{"sku":"835894","manufacturer_id":"9644","brand_name":"Arc'teryx","product_name":"Arc'teryx Kappa Hoodie Jacket - Women's","long_description":"The Arc'teryx Kappa Hoodie jacket is ideal for active pursuits on freezing days. This insulated, windproof hoodie delivers serious warmth and superb breathability. WINDSTOPPER(R) fabric offers warmth and total windproof protection; you won't overheat or suffer from perspiration buildup because moisture vapor escapes easily. Lightweight, radiant Coreloft(TM) insulation traps heat inside and allows jacket to breathe; it continues to insulate even when damp. Non-quilted, laminated construction eliminates cold spots. Micro seams reduce bulk and weight. Durable Water Repellent finish causes water to bead up and roll off, fending off light rain showers and snow; seams are taped to block moisture seeping through. Insulated, helmet-compatible storm hood with laminated brim and drawcord adjustments; integrated fitted collar panel adds warmth and comfort. Full front zipper with internal windflap; chin guard has brushed microfleece facing. Laminated rip-and-stick cuff adjusters reduce bulk and won't catch or tear off. Dropped back hem with floating drawcord provides snug closure. 2 internal mesh pockets and 2 hand pockets with zippers. Kappa Hoodie has standard Arc'teryx fit; anatomical shaping and gussets minimize the bulkiness that can restrict motion. Easy layering over or under jacket extends seasonal versatility and comfort.","short_description":"The Arc'teryx Kappa Hoodie jacket is ideal for active pursuits on freezing days. This insulated, windproof hoodie delivers serious warmth and superb breathability.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s393487.png","image_url":"http://i1.avlws.com/115/l393487.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=393487&tt=df","retail_price":"399.00","sale_price":"278.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=393487\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m393487.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=835894&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["womens","womens-jackets","womens-insulated-jackets"]}
