{"sku":"835961","manufacturer_id":"12665","brand_name":"Arc'teryx","product_name":" Arc'teryx Gamma MX Pants - Women's","long_description":"The women's Arc'teryx Gamma MX pants are made from a breathable, lightly insulated soft-shell fabric. They're ideal for alpine and expedition climbing. Stretchy, breathable and weather-shedding fabric tackles everything from mixed routes to epic tours; it resists light winds and remains highly breathable. Soft microfleece backing adds light warmth, wicks moisture and feels really nice against skin. Durable Water Repellent finish causes water to bead up and roll off, fending off light rain showers and snow. Gusseted crotch facilitates freedom of movement for increased comfort. Front zipper fly with snap closure; waistband is lined with soft, brushed fabric. Adjustable, integrated webbing belt. Arc'teryx Gamma MX pants have adjustable cuff drawcords and reinforced instep patches. Includes 2 hand and 2 thigh pockets with rip-and-stick closures. Athletic, close-fitting cut aids warmth without inhibiting movement.","short_description":"The women's Arc'teryx Gamma MX pants are made from a breathable, lightly insulated soft-shell fabric. They're ideal for alpine and expedition climbing.","category":"Women's Clothing","subcategory":"Women's Pants","product_group":"Women's Soft-Shell Pants","thumb_url":"http://i1.avlws.com/115/s395615.png","image_url":"http://i1.avlws.com/115/l395615.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=395615&tt=df","retail_price":"299.00","sale_price":"208.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=395615\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m395615.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=835961&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
