{"sku":"836422","manufacturer_id":"11115","brand_name":"Arc'teryx","product_name":" Arc'teryx Sentinel Shell Pants - Women's","long_description":"The Arc'teryx Sentinel women's pants are built with downhill-specific shaping and features that riders and skiers appreciate. The fabric excels for the stop-and-go rhythm of resort skiing and riding. Durable Gore-Tex(R) Soft Shell 3L is lighty insulated and offers waterproof, breathable protection; 100% seam sealed. Features a brushed-knit polyester lining that slides easily over layers and wicks moisture away. Reduced quantity and thickness of seams saves weight and provides excellent breathability. Laminated powder cuffs feature elastic grippers, and are mounted high enough to fit underneath snowboard binding highbacks. Thigh vents with 2-way waterproof zippers enhance airflow when needed. Instep patches along hems provide extreme abrasion resistance. Large cargo pocket and hip stash pocket (with waterproof zippers) keep small essentials out of your way. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors for quicker acquisition of position in an avalanche. Sentinel pants are shaped with the most relaxed, freeride-friendly fit of all Arc'teryx pants. Slide-and-lock snaps attach pants to compatible jacket (sold separately).","short_description":"The Arc'teryx Sentinel women's pants are built with downhill-specific shaping and features that riders and skiers appreciate. The fabric excels for the stop-and-go rhythm of resort skiing and riding.","category":"Women's Clothing","subcategory":"Women's Pants","product_group":"Women's Snow Pants","thumb_url":"http://i1.avlws.com/115/s395471.png","image_url":"http://i1.avlws.com/115/l395471.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=395471&tt=df","keywords":"hardshell","retail_price":"450.00","sale_price":"359.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=395471\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m395471.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=836422&amp;link=&amp;tabs=-Details\"></script>","variants":{"8364220005":{"sku":"8364220005","vendor_sku":"11115","upc":"806955557756","size":"XL","color":"ANNABELLE GREEN","retail_price":"332.83","sale_price":"332.83"},"8364220019":{"sku":"8364220019","vendor_sku":"11115","upc":"806955650358","size":"L","color":"BLUE PYTHON","retail_price":"332.83","sale_price":"332.83"}}}
