{"sku":"836611","manufacturer_id":"A94V7D8","brand_name":"The North Face","product_name":"The North Face Patrol 24 ABS Avalanche Airbag Pack","long_description":"The North Face Patrol 24 ABS avalanche airbag pack enhances protection for winter pursuits in the backcountry. Its innovative airbag system helps prevent burial in an avalanche. With a 95% success rate in real-world use, the ABS airbag system can significantly increase your odds of survival if caught in an avalanche. When activated, compressed nitrogen inflates 2 large airbags that help keep you on the surface of an avalanche; highly visible airbags create visual markers to speed rescue. ABS activation pull handle is positioned on the left shoulder strap for quick access and deployment when every second counts. Auto-grade airbag pack fabric, high-denier internal materials, leg/body harness and a metal hipbelt buckle offer breaking resistance to help keep you attached to the pack. Panel-loading main compartment features internal pockets for organizing gear; large avalanche tool pocket features organization sleeves and a backcountry essentials checklist. Ski/snowboard carry system has been tested by athletes for simplicity and stability; it can be tucked away when not in use. Oversize, water-resistant YKK(R) zippers are built to resist zipper failure and slider damage. The North Face Patrol 24 ABS avalanche airbag pack features a small top pocket and dual hipbelt pockets that keep snacks or other items at your fingertips.","short_description":"The North Face Patrol 24 ABS avalanche airbag pack enhances protection for winter pursuits in the backcountry. Its innovative airbag system helps prevent burial in an avalanche.","category":"Camping & Hiking","subcategory":"Specialized Packs","product_group":"Ski And Snowboard Packs","thumb_url":"http://i1.avlws.com/115/s268315.png","image_url":"http://i1.avlws.com/115/l268315.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=268315&tt=df","keywords":"backpack,pack,back,board,ski","retail_price":"1179.00","sale_price":"1179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=268315\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m268315.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=836611&amp;link=&amp;tabs=-Details\"></script>","variants":{"8366110001":{"sku":"8366110001","vendor_sku":"A94V7D8","upc":"700054573566","size":"S/M","color":"CENTENNIAL RED/TNF BLACK","retail_price":"1179.00","sale_price":"1179.00"},"8366110002":{"sku":"8366110002","vendor_sku":"A94V7D8","upc":"700054573573","size":"M/L","color":"CENTENNIAL RED/TNF BLACK","retail_price":"1179.00","sale_price":"1179.00"}}}
