{"sku":"836756","manufacturer_id":"A29Y1F7","brand_name":"The North Face","product_name":"The North Face Kannon Insulated Pants - Women's","long_description":"Rip though the deep powder and mountain chutes in the women's highly breathable, waterproof and insulated Kannon pants from The North Face. 2.5-layer construction HyVent(R) with laminate offers waterproof, breathable protection over a wider range of temperatures and conditions. 40g synthetic insulation with FlashDry(TM) additive is extremely lightweight, warm and packable; plus, it retains warmth when wet and dries quickly. FlashDry microparticles are embedded in the insulation to dramatically improve dry time and breathability. Made of crushed coconut shells and crushed volcanic rock, the FlashDry additive leads to faster dry times and will not wash out. Fully taped seams create the ultimate seal against wind and snow. Rip-and-stick adjustment tabs at side of waist and zippered, snap-closure fly secure the fit. Inner thigh vents and internal leg gaiters with stretch-mesh gussets control airflow and temperature; waterproof, bonded zipper vents. Warmth is regulated by allowing cool, dry air to flow in through mesh gussests; as heated, moist air rises and exits upper thigh vents. 2 handwarmer pockets and a thigh cargo pocket with a waterproof, bonded zipper keep accessories organized. Pant-a-locks tabs secure Kannon pants to coordinating jackets from The North Face (sold separately). Reinforced edge guards resist abrasion from boots, boards and skis. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors for quicker acquisition of position in an avalanche.","short_description":"Rip though the deep powder and mountain chutes in the women's highly breathable, waterproof and insulated Kannon pants from The North Face.","category":"Skiing","subcategory":"Women's Ski Clothing","product_group":"Women's Ski Pants","thumb_url":"http://i1.avlws.com/115/s269383.png","image_url":"http://i1.avlws.com/115/l269383.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=269383&tt=df","keywords":"snowpant,pants,pant,hardshell pants,snow pants","retail_price":"249.00","sale_price":"124.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=269383\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m269383.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=836756&amp;link=&amp;tabs=-Details\"></script>","variants":{"8367560005":{"sku":"8367560005","vendor_sku":"A29Y1F7","upc":"053329580494","size":"XL","color":"TURQUOISE BLUE","retail_price":"124.83","sale_price":"124.83"}}}
