{"sku":"836739","manufacturer_id":"A92K173L","brand_name":"The North Face","product_name":"The North Face Slasher Cargo Shell Pants - Men's Tall Sizes","long_description":"The North Face Slasher Cargo long-length snow pants offer full coverage during deep powder days in big mountain chutes, so you stay warm, dry and comfortable. Quiet yet abrasion resistant, 2-layer HyVent(R) coated fabric is waterproof, windproof and breathable; fully taped seams stop moisture seepage. Thermoliner seat and knee lining provides warmth and moisture management. Articulated design allows complete range of motion and enhances comfort and durability. Features zippered front handwarmer pockets, twin back pockets and 2 flapped cargo pockets. Cargo pockets feature The North Face Lot Lift System; adjustable cords allow you to lift up the rear part of pant cuff, preventing them from dragging on the ground. Cool, dry air flows in through mesh gussets while upper thigh vents dump excess heat and moisture. Leg gaiters feature elastic grippers (and boot hook) to seal out snow around boots and help regulate warmth. Reinforced hem guards protect your cuffs from abrasion and sharp edges, improving overall durability. Waist features belt loops and lift ticket compatibility.","short_description":"The North Face Slasher Cargo long-length snow pants offer full coverage during deep powder days in big mountain chutes, so you stay warm, dry and comfortable.","category":"Snowboarding","subcategory":"Men's Snowboard Clothing","product_group":"Men's Snowboard Pants","thumb_url":"http://i1.avlws.com/115/s261595.png","image_url":"http://i1.avlws.com/115/l261595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=261595&tt=df","keywords":"shellpant,snow pants,pants,outerwear,uninsulated","retail_price":"160.00","sale_price":"111.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=261595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m261595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=836739&amp;link=&amp;tabs=-Details\"></script>","variants":{"8367390005":{"sku":"8367390005","vendor_sku":"A92K173L","upc":"617931981409","size":"S","color":"UTILITY BROWN","retail_price":"111.93","sale_price":"111.93"}}}
