{"sku":"836757","manufacturer_id":"A29XVB3","brand_name":"The North Face","product_name":"The North Face Free Thinker Shell Pants - Women's","long_description":"Stay warm, dry and comfortable in The North Face Free Thinker women's shell pants, offering full coverage during deep powder days in big mountain chutes. Sturdy Gore-Tex(R) Pro Shell uses 3-layer construction for superb durability, light weight and waterproof, breathable protection. Fully taped seams create the ultimate seal against wind and snow. Inner thigh vents and internal leg gaiters with stretch-mesh gussets control airflow and temperature; waterproof, bonded zipper vents. Warmth is regulated by allowing cool, dry air to flow in through mesh gussests; as heated, moist air rises and exits upper thigh vents. Rip-and-stick adjustment tabs at side of waist and zippered, snap-closure fly secure the fit. Hand pockets and thigh pockets, all with waterproof, bonded zippers, keep accessories organized. Pant-a-locks tabs secure pants to coordinating jackets from The North Face (jacket sold separately). Reinforced edge guards resist abrasion from boots, boards and skis. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors for quicker acquisition of position in an avalanche.","short_description":"Stay warm, dry and comfortable in The North Face Free Thinker women's shell pants, offering full coverage during deep powder days in big mountain chutes.","category":"Skiing","subcategory":"Women's Ski Clothing","product_group":"Women's Ski Pants","thumb_url":"http://i1.avlws.com/115/s268247.png","image_url":"http://i1.avlws.com/115/l268247.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=268247&tt=df","keywords":"pant,snowpant,pants,hardshell pants,snow pants","retail_price":"349.00","sale_price":"243.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=268247\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m268247.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=836757&amp;link=&amp;tabs=-Details\"></script>","variants":{"8367570005":{"sku":"8367570005","vendor_sku":"A29XVB3","upc":"053329580425","size":"XL","color":"YELLOW","retail_price":"243.93","sale_price":"243.93"}}}
