{"sku":"836863","manufacturer_id":"A93FD4D","brand_name":"The North Face","product_name":"The North Face Borealis Daypack - Women's","long_description":"The North Face Borealis daypack offers techical performance and serves double duty as a school bag or work briefcase. Form-fitting shoulder straps, hipbelt and back panel offer great fit and comfort. Flexible, ventilated shoulder straps are injection-molded and feature polyethylene foam for exceptional comfort; padded back panel features a breathable spine channel. Winged hipbelt can be stowed out of the way when not in use. Panel-loading main compartment offers plenty of room for gear and clothing; padded sleeve fits most 15 in. laptops. Drink-tube port accommodates your choice of hydration reservoir (sold separately). Secondary compartment features an internal organizer for pens, pencils, wallet, electronics and other necessities. Small front zippered stash pocket is great for on-the-go essentials; dual side mesh pockets give quick access to water bottles or an umbrella. Front bungee system lets you stash a jacket or bike helmet; reflective accents increase chances of visibility in low light. The North Face Borealis pack features side compression straps that help stabilize and control your load. This pack is endorsed by the American Chiropractic Association, recognizing the comfort and function of its shoulder straps, back panel and interior organization.","short_description":"The North Face Borealis daypack offers techical performance and serves double duty as a school bag or work briefcase. Form-fitting shoulder straps, hipbelt and back panel offer great fit and comfort.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s305559.png","image_url":"http://i1.avlws.com/115/l305559.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=305559&tt=df","keywords":"carry on,travel,daypack,small,commute","retail_price":"89.00","sale_price":"89.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=305559\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m305559.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=836863&amp;link=&amp;tabs=-Details\"></script>","variants":{"8368630008":{"sku":"8368630008","vendor_sku":"A93FE9E","upc":"887040685462","size":"One Size","color":"MAGIC MAGENTA DISTRESSED","retail_price":"89.00","sale_price":"89.00"},"8368630010":{"sku":"8368630010","vendor_sku":"A93FD4D","upc":"732075010157","size":"One Size","color":"VAPOROUS GREY RIPSTOP","retail_price":"89.00","sale_price":"89.00"}}}
