{"sku":"837087","manufacturer_id":"50184","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors Pinnacle Base Camper Cookset - Large","long_description":"Throw on your chef hat and make a meal that rivals restaurant cooking with the large GSI Outdoors Pinnacle Base Camper cookset. Set includes 5-liter pot with lid, 3-liter pot with lid, 9 in. frypan, pot gripper, cutting board and a welded sink/stuff sack. All items nest neatly within the 5-liter pot and stow in the welded sink/stuff sack for easy packing. Pinnacle-series hard-anodized aluminum pots and frypan distribute heat evenly for efficient cooking; Teflon(R) Radiance technology offers supreme scratch resistance. Teflon Radiance features a specially formulated topcoat to enhance heat dispersion for quick heating; nonstick coating is tough enough to handle use with most metal utensils. Lightweight, BPA-free plastic pot lids feature integrated strainers ideal for use with pasta and steamed vegetables; flip-up tabs on top make for easy lid removal. Sturdy cutting board has a flat side and a dished side to meet your food prep needs; when stowing the cookset put the cutting board between the pots to prevent clattering. Included folding pot gripper locks to and removes easily from exterior brackets on the 3-liter pot and frypan; gripper design prevents scratching of the nonstick surfaces. 5-liter pot features silicone-coated bail handles for a secure grasp while cooking up hearty meals. GSI Outdoors Pinnacle Camper cookset includes a welded sink basin that doubles as a carry bag.","short_description":"Throw on your chef hat and make a meal that rivals restaurant cooking with the large GSI Outdoors Pinnacle Base Camper cookset.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414823.png","image_url":"http://i1.avlws.com/115/l414823.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414823&tt=df","keywords":"messkit","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414823\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414823.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837087&amp;link=&amp;tabs=-Details\"></script>","variants":{"8370870001":{"sku":"8370870001","vendor_sku":"50184","upc":"090497501845","retail_price":"109.95","sale_price":"109.95"}},"categories":["camping-hiking","camp-kitchen","cookware-and-dinnerware"]}
