{"sku":"837023","manufacturer_id":"135226-550-1-O/","brand_name":"Osprey","product_name":" Osprey Contrail Daypack","long_description":"The Osprey Contrail Daypack adds protection and organization for all the necessities of travel. It's the perfect travel companion to the Osprey Contrail wheeled luggage, sold separately. AirScape spacer-mesh padded shoulder straps and back panel ventilate heat build-up away. Handle-It(TM) attachment flap quickly connects Contrail Daypack to extendable handle on most 6 in. wide roller handles; its design provides well-balanced carrying. Zippered security pocket is hidden underneath the Handle-It flap on back panel. Main compartment has wide-mouth panel access and lockable zippers; organize contents in the document sleeve, zip pocket and side mesh sleeves. Padded sleeve fits laptops to 17 in. and has direct zipper access. Padded, fleece-lined sleeve fits most tablet and e-reader devices. 2 external zippered side pockets feature internal spacer-mesh sleeves for organizing items; also includes 2 external stretch-mesh side pockets. While the Opsrey Contrail daypack is a beautiful complement to the Contrail wheeled luggage, this sharp, cosmopolitan backpack can certainly be carried on its own. Please note: although not removable, the Handle-It attachment flap lays down flush against the back panel when not in use so you won't even know its there.","short_description":"The Osprey Contrail Daypack adds protection and organization for all the necessities of travel. It's the perfect travel companion to the Osprey Contrail wheeled luggage, sold separately.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s433047.png","image_url":"http://i1.avlws.com/115/l433047.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433047&tt=df","keywords":"backpack","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433047\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433047.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837023&amp;link=&amp;tabs=-Details\"></script>","variants":{"8370230001":{"sku":"8370230001","vendor_sku":"135226-550-1-O/","upc":"877257014223","color":"BLACK","retail_price":"129.95","sale_price":"129.95"}},"categories":["travel","day-bags-and-packs","travel-daypacks"]}
