{"sku":"837020","manufacturer_id":"139525-641-1-O/","brand_name":"Osprey","product_name":" Osprey Sojourn Wheeled Convertible Pack - 25\"","long_description":"The Osprey Sojourn 25 is designed for travelers who need their luggage to be ready for anything. It can be easily worn as a pack or wheeled about, allowing you to readily adapt to your travel needs. For 2012, Sojourn's suspension has been fine-tuned to increase fit range; it is fully and easily adjustable to fit torso lengths from 16 to 22 in. For added versatility, the shoulder strap and waistbelt assemblies can be removed to free up extra packing space on trips where they won't be needed. High-clearance chassis is ready to roll practically anywhere; when the terrain gets too rough, the updated, ventilated backpack suspension lets you carry the bag in comfort. Updated, fully-padded spacer-mesh lumbar and hipbelt transfer load effectively; updated shoulder straps use upgraded foam and spacer-mesh for improved comfort. Padded sidewalls and StraightJacket(TM) compression combine to keep the contents protected, and ensure the pack carries comfortably whether half full or maxed out. Large panel zip with lockable sliders accesses the spacious main compartment. 4 zippered pockets in the main compartment keep gear organized; upgraded internal compression straps with fabric wings hold clothes securely. External zip top pocket is ideal for toiletries, liquids or frequently needed items. Front panel daisy chain maintains your organization. Padded top and side carry handles provide comfortable carrying. Comfortable, smooth-operating retractable handle with ergonomic grip; hideaway quick-release attachment strap simplifies carrying an extra bag. Rear panel magazine pocket and I.D. card window. Constructed of abrasion-, moisture- and tear-resistant 1690-denier ballistic and 420-denier nylon pack cloth. Frame is made from 6001 aluminum with a lightweight composite base, integrated foot/grab handle and sealed bearing, and polyurethane wheels.","short_description":"The Osprey Sojourn 25 is designed for travelers who need their luggage to be ready for anything. It can be easily worn as a pack or wheeled about, allowing you to readily adapt to your travel needs.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433811.png","image_url":"http://i1.avlws.com/115/l433811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433811&tt=df","retail_price":"289.95","sale_price":"289.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837020&amp;link=&amp;tabs=-Details\"></script>","variants":{"8370200001":{"sku":"8370200001","vendor_sku":"139525-563-1-O/","upc":"877257014414","color":"METAL GRAY","retail_price":"289.95","sale_price":"289.95"}}}
