{"sku":"837010","manufacturer_id":"134840-637-2-M/","brand_name":"Osprey","product_name":"Osprey Farpoint 40 Travel Pack","long_description":"LIghtweight and streamlined, the Osprey Farpoint 40 travel pack is ideal for fast-moving globetrotters. Despite its minimalist weight, it offers plenty of organization and lots of useful features. Farpoint 40 has a highly capable backpack suspension, and its compact size ensures carry-on compliance on most any flight. Main bag offers a panel-loading opening with lockable zippers, interior pocket and internal compression straps to cinch down contents. Second front zip padded pocket carries your tablet or e-reader inside pack. Small front zip pocket with key fob keeps small items handy. Dual front mesh pockets are ideal for water bottle, snacks and other quick-access items. Also features removable sleeping pad straps and top and side haul handles to offer additional carrying options. Zip away accessible, fixed unisex harness with adjustable sternum strap and rescue whistle buckle. Zip away accessible, 3/4-length hipbelt with ErgoPull(TM) closure; ErgoPull enhances leverage for cinching, drawing tension along top and bottom, not through the center. Spacer mesh back panel with LightWire frame promotes airflow and moisture dispersal during warm weather and heavy lugging. The Osprey Farpoint 40 travel pack sports external compression straps that cinch down loads for jostle-free carrying. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"LIghtweight and streamlined, the Osprey Farpoint 40 travel pack is ideal for fast-moving globetrotters. Despite its minimalist weight, it offers plenty of organization and lots of useful features.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Carry-On Luggage","thumb_url":"http://i1.avlws.com/115/s433427.png","image_url":"http://i1.avlws.com/115/l433427.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433427&tt=df","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433427\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433427.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837010&amp;link=&amp;tabs=-Details\"></script>","variants":{"8370100001":{"sku":"8370100001","vendor_sku":"134840-637-1-S/","upc":"877257014018","size":"S/M","color":"LAGOON BLUE","retail_price":"149.95","sale_price":"149.95"},"8370100002":{"sku":"8370100002","vendor_sku":"134840-637-2-M/","upc":"877257014025","size":"M/L","color":"LAGOON BLUE","retail_price":"149.95","sale_price":"149.95"}},"categories":["travel","luggage","carryon-luggage"]}
