{"sku":"837019","manufacturer_id":"138328-563-1-O/","brand_name":"Osprey","product_name":"Osprey Meridian Wheeled Convertible Luggage - 28\"","long_description":"The Osprey Meridian 28 wheeled convertible luggage, with a removable daypack, can be rolled or carried on your back. The 2012 model has a removable suspension for more packing space. Meridian's suspension has been fine-tuned to increase its fit range; it quickly adjusts to fit torso lengths from 16 to 22 in. For added versatility, the shoulder strap and waistbelt assemblies can be removed to free up extra packing space on trips where they won't be needed. High-clearance chassis is ready to roll almost anywhere; when the terrain gets too rough, the updated, ventilated backpack suspension system lets you carry the bag in comfort. Updated, fully-padded spacer-mesh lumbar and hipbelt transfer load effectively; updated shoulder straps sporting upgraded foam and spacer-mesh improve comfort. Large panel zip with lockable sliders accesses the spacious main compartment even with the daypackattached. 4 zippered pockets in the main compartment keep gear organized; upgraded internal compression straps with fabric wings hold clothes securely. External zip top pocket is ideal for toiletries, liquids or frequently needed items. Padded top and side carry handles provide comfortable carrying. Comfortable, smooth-operating retractable handle with ergonomic grip; hideaway quick-release attachment strap simplifies carrying an extra bag. Rear panel magazine pocket and I.D. card window. Osprey Meridian 28 has a zip-and-clip removable daypack; pouch clips on front panel retain daypack attachment buckles. Updated spacer mesh harness and back panel improves comfort and ventilation. Wide zip access to daypack main compartment; with 2 padded sleeves you can carry both a 15.4 in laptop and a 10 in. tablet or e-reader. Internal organizer panel and zip pocket keep travel necessities handy. Zip pocket plus twin mesh pocket on front panel offer convenient, accessible storage.","short_description":"The Osprey Meridian 28 wheeled convertible luggage, with a removable daypack, can be rolled or carried on your back. The 2012 model has a removable suspension for more packing space.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433807.png","image_url":"http://i1.avlws.com/115/l433807.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433807&tt=df","retail_price":"359.95","sale_price":"359.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433807\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433807.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837019&amp;link=&amp;tabs=-Details\"></script>","variants":{"8370190001":{"sku":"8370190001","vendor_sku":"138328-563-1-O/","upc":"877257014353","color":"METAL GRAY","retail_price":"359.95","sale_price":"359.95"},"8370190002":{"sku":"8370190002","vendor_sku":"138328-392-1-O/","upc":"877257014346","color":"RUSTED RED","retail_price":"359.95","sale_price":"359.95"}},"categories":["travel","luggage","wheeled-luggage"]}
