{"sku":"837021","manufacturer_id":"027617-781-1-O/","brand_name":"Osprey","product_name":" Osprey FlapJill Courier Bag - Women's","long_description":"With fresh styling and improved organization, the Osprey FlapJill Courier is an everyday bag that organizes your computer and gadgets, and fits in anywhere and everywhere. Quality materials, thoughtful function and trademark tailoring ensure it fits and performs in the real world whether commuting by bike or just walking around town. Top-loading design features an oversized flap to cover and protect pack; flap secures with 2 quick-release clips and adjustable, interchangeable webbing straps. Zip pocket on flap provides quick access to frequently used items. Main compartment keeps magazines and papers in order and an internal mesh pocket keeps cords and small gear sorted; padded sleeve protects your laptop or tablet. Large zip-access front pocket offers secure storage. Front organizer pocket keeps small items secure and accessible. Side zip pocket with interior spacer-mesh sleeve provides versatile storage. Osprey FlapJill Courier has an adjustable shoulder strap with an extra gippy silicone print for stay-put carrying. Constructed from tough 900-denier polyester treated with a Durable Water Repellent to cause water to bead up and roll off. Add personality to the pack by changing out the webbing straps between 3 of the included color choices: mix and match as you please. Top grab handle facilitates easy off-back carrying. Integrated loop allows convenient attachment of rear bike light (sold separately); reflective hits on pack increase visibility.","short_description":"With fresh styling and improved organization, the Osprey FlapJill Courier is an everyday bag that organizes your computer and gadgets, and fits in anywhere and everywhere.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s432487.png","image_url":"http://i1.avlws.com/115/l432487.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432487&tt=df","keywords":"sling,courier,purses","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432487\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432487.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837021&amp;link=&amp;tabs=-Details\"></script>","variants":{"8370210001":{"sku":"8370210001","vendor_sku":"027617-550-1-O/","upc":"877257013509","color":"BLACK","retail_price":"89.95","sale_price":"89.95"},"8370210002":{"sku":"8370210002","vendor_sku":"027617-781-1-O/","upc":"877257013523","color":"WILLOW GREEN","retail_price":"89.95","sale_price":"89.95"}}}
