{"sku":"837017","manufacturer_id":"138528-550-1-O/","brand_name":"Osprey","product_name":"Osprey Contrail Wheeled Luggage - 28\"","long_description":"The Osprey Contrail 28 wheeled luggage offers the frequent traveler a complete package. This highly organized roller offers clean, cosmopolitan good looks add 2 removable organizer components. Removable FlightLocker(TM) and LaundryBag(TM) components keep clothes neat and sorted over the course of your trip, and are included with the Contrail 28! HighRoad(TM) high-clearance chassis can roll almost anywhere; comfortable, smooth-operating retractable handle with ergonomic grip. Removable FlightLocker organizer accessory speeds packing/unpacking and keeps clothes neat along the journey; it slips onto a clothes hanger for storage use at destination. 2 front pockets hold socks and underwear and back pocket is big enough for shoes or T-shirts; sandwiched between the pockets is a folder to hold shirts and pants neatly. Removable LaundryBag provides separate storage for dirty or wet clothes and clips into the back panel compartment; it hangs on a coat hanger for easy access in hotel room. Large panel zip with lockable sliders accesses the main compartment; 2 zip pockets on inner front panel. Internal compression straps with fabric wings hold clothes securely. External zip top pocket is ideal for toiletries, liquids and frequently needed items. Externally accessed zip pocket on front panel and 2 on side panels keep small items accessible. Rear panel magazine pocket and I.D. card window. Padded top and side handles provide comfortable carry of the Osprey Contrail 28. FlightLocker weighs 1 lb. 9 oz. and LaundryBag weighs 6 oz.; weight given includes components. The Osprey Contrail Daypack (sold separately) is the perfect companion to the Contrail 28, and adds organization and protection for travel necessities.","short_description":"The Osprey Contrail 28 wheeled luggage offers the frequent traveler a complete package. This highly organized roller offers clean, cosmopolitan good looks add 2 removable organizer components.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433799.png","image_url":"http://i1.avlws.com/115/l433799.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433799&tt=df","retail_price":"339.95","sale_price":"339.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433799\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433799.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837017&amp;link=&amp;tabs=-Details\"></script>","variants":{"8370170001":{"sku":"8370170001","vendor_sku":"138528-550-1-O/","upc":"877257014391","color":"BLACK","retail_price":"339.95","sale_price":"339.95"}},"categories":["travel","luggage","wheeled-luggage"]}
