{"sku":"837013","manufacturer_id":"131018-711-1-O/","brand_name":"Osprey","product_name":"Osprey Ozone Wheeled Luggage - 18\"","long_description":"Osprey sets a new standard of weight and performance with the Ozone 18 wheeled luggage. They've channeled years of experience building lightweight packs and luggage into this fresh design. With a minimalist but robust body and a lighter, redesigned chassis, this full-featured package offers excellent roll, rugged performance and multiple organizational features. New HighRoad LT(TM) chassis is light, strong and smooth rolling; it shaves almost 20% off the weight of the original HighRoad chassis. HighRoad LT premium suspension features a 6001 aluminum frame, highly durable, injection-molded, high-clearance ABS base and large polyurethane wheels with sealed bearings. Extendable handle is ergonomically designed for comfortable gripping. Lightweight construction and fabrics feature strategic reinforcements at key wear areas. 3 external compression straps secure load and protect zippers. External zip top pocket is ideal for toiletries, liquids and frequently needed items. 2 fulll-length external zip pockets on front panel. Rear panel pocket with inner zip pocket keeps magazines and small items handy. Internal compression straps keep gear and clothing neat and secure. 3 large internal zip pockets keep gear organized. Low-profile, padded top and side handles provide comfortable carry for the Osprey Ozone 18.","short_description":"Osprey sets a new standard of weight and performance with the Ozone 18 wheeled luggage. They've channeled years of experience building lightweight packs and luggage into this fresh design.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433783.png","image_url":"http://i1.avlws.com/115/l433783.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433783&tt=df","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433783\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433783.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837013&amp;link=&amp;tabs=-Details\"></script>","variants":{"8370130001":{"sku":"8370130001","vendor_sku":"131018-711-1-O/","upc":"877257013929","color":"LIGHT GREEN","retail_price":"199.95","sale_price":"199.95"},"8370130002":{"sku":"8370130002","vendor_sku":"131018-511-1-O/","upc":"877257013912","color":"LIGHT GREY","retail_price":"199.95","sale_price":"199.95"}},"categories":["travel","luggage","wheeled-luggage"]}
