{"sku":"837489","manufacturer_id":"BUS05447","brand_name":"Novara","product_name":" Novara Barrow Bike - 2014","long_description":"Novara's first cargo bike, Barrow is made to deftly transport loads with a built-in basket and rear rack. A workhorse with a sturdy frame and 24 gears, the Barrow makes gear-hauling errands a joy. Basket is attached to the head tube using Novara's exclusive \"N-dock\" mounting system. Basket stays aligned and steady even in turns so contents aren't tossed around. A strong chromoly frame and fork deliver a smooth, sturdy ride on uneven city streets. SRAM Via 8-speed drivetrain provides 24 speeds for tackling hills and twisting paths. ProMax mechanical disc brakes stop securely, even in wet conditions. Joytech disc hubs, stout Weinmann rims and Kenda Kwick Trax tires sturdily power the load. Aluminum basket on the Barrow bike holds up to 20 lbs.; included stretchy cover keeps things in place. Sturdy rear rack quickly accepts panniers or trunk bag (not included). Rounding out the package are polished fenders to keep road grime and water off of you and the bike; bell on handlebars signals passing; kickstand makes storage/parking easy. Specs on our Novara Barrow bike are subject to change.","short_description":"Novara's first cargo bike, Barrow is made to deftly transport loads with a built-in basket and rear rack. A workhorse with a sturdy frame and 24 gears, the Barrow makes gear-hauling errands a joy.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378375.png","image_url":"http://i1.avlws.com/115/l378375.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378375&tt=df","retail_price":"749.00","sale_price":"749.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378375\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378375.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837489&amp;link=&amp;tabs=-Details\"></script>","variants":{"8374890003":{"sku":"8374890003","vendor_sku":"BUS05447","upc":"483748900038","size":"L/XL","color":"SEAFOAM GREEN","retail_price":"749.00","sale_price":"749.00"}}}
