{"sku":"837565","manufacturer_id":"AWMPZT1","brand_name":"The North Face","product_name":"The North Face Shellista Pull-On Winter Boots - Women's","long_description":"The North Face Shellista Pull-On winter boots boast PrimaLoft(R) insulation, waterproof construction and a convenient slip-on design for winter versatility and style. Quilted shafts are made of recycled PET ripstop polyester mesh; full-grain and suede leather trim provides resilient performance with smart looks. Faux fur collars add a touch of style and help keep snow out of boots; instep strap supplies an adjustable fit. Seam-sealed waterproof construction ensures your feet stay dry. 200g PrimaLoft Eco insulation uses recycled materials to provide insulating warmth. Dual-density EVA midsoles in TNF Shellista Pull-On boots provide cushioning against shock. 3/4-length nylon shanks offer torsional stability for trekking on uneven ground. Waterproof thermoplastic rubber rand and outsole shells keep the slush at bay and feature forefoot flex grooves for comfort when walking. TNF Winter Grip(TM) rubber outsoles supply tenacious traction in wet, slick conditions; omnidirectional lugs are both grippy and self-cleaning. Temperature-sensitive Ice Pick(TM) rubber lugs on outsoles harden when temps fall below freezing, providing extra bite into the terrain.","short_description":"The North Face Shellista Pull-On winter boots boast PrimaLoft(R) insulation, waterproof construction and a convenient slip-on design for winter versatility and style.","category":"Footwear","subcategory":"Women's Snow And Rain Boots","product_group":"Women's Multi-Sport Winter Boots","thumb_url":"http://i1.avlws.com/115/s275999.png","image_url":"http://i1.avlws.com/115/l275999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=275999&tt=df","keywords":"boots,winter boots,winter,insulated,winter hiking boots","retail_price":"130.00","sale_price":"64.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=275999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m275999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837565&amp;link=&amp;tabs=-Details\"></script>","variants":{"8375650001":{"sku":"8375650001","vendor_sku":"AWMPZT1","upc":"053329487670","size":"6","color":"SHINY TNF BLACK/TNF BLACK","retail_price":"64.83","sale_price":"64.83"}}}
