{"sku":"837513","manufacturer_id":"BD681124RVGRM_L","brand_name":"Black Diamond","product_name":" Black Diamond Outlaw AvaLung Ski Pack","long_description":"The Black Diamond Outlaw Avalung ski pack is ideal for backcountry snowplay. It can increase the time you have to breathe if trapped in an avalanche. Integrated AvaLung apparatus lets you breathe air directly from the snowpack via a mouthpiece. Exhaled carbon dioxide is directed out the exhaust port at the bottom right of the pack, extending the time available before an ice layer builds up and seals out oxygen. Breathing tube runs through the left shoulder strap and can be positioned such that the mouthpiece is readily available. . Suspension offers full range of motion, and optimal comfort for scrambling and climbing. Shoulder straps move in concert with your stride and reach by sliding through the bottom of the pack with a low-friction cable and housing. Shoulder straps are linked to together by the cable which helps maintain an even, balanced load across the shoulders. Front and back panel access to main compartment lets you get to your gear quickly and easily, even with skis or a snowboard attached. Dedicated avalanche tool pocket keeps a shovel and probe accessible. Insulated sleeve helps prevent your hydration reservoir (sold separately) from freezing up; drinking tube routes through insulated right shoulder strap. Hipbelt stash pocket keeps energy bars and other small items within reach. Bag is designed to carry skis A-frame or diagonal; also accommodates a snowboard. Note: The Black Diamond Outlaw AvaLung pack is not a substitute for wise assessment of hazardous avalanche terrain.","short_description":"The Black Diamond Outlaw Avalung ski pack is ideal for backcountry snowplay. It can increase the time you have to breathe if trapped in an avalanche.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Avalanche Safety Gear","thumb_url":"http://i1.avlws.com/115/s407351.png","image_url":"http://i1.avlws.com/115/l407351.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407351&tt=df","retail_price":"269.95","sale_price":"228.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407351\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407351.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837513&amp;link=&amp;tabs=-Details\"></script>","variants":{"8375130001":{"sku":"8375130001","vendor_sku":"BD681124RVGRS_M","upc":"793661150916","size":"S/M","color":"REVOLUTION GREEN","retail_price":"228.93","sale_price":"228.93"},"8375130002":{"sku":"8375130002","vendor_sku":"BD681124RVGRM_L","upc":"793661150923","size":"M/L","color":"REVOLUTION GREEN","retail_price":"228.93","sale_price":"228.93"}}}
