{"sku":"837625","manufacturer_id":"JOR-0002","brand_name":"Joos","product_name":" JOOS Orange Portable Solar Charger","long_description":"The JOOS Orange portable solar charger gives you access to endless solar energy. It charges devices in low light, shade and even light rain, up to 3.5 times faster than many other portable chargers. Charger is compatible with any USB device, including cell phones, smart phones, tablets, MP3 players, GPS units, portable game players and digital cameras. Tough and compact design is waterproof and portable for ease of use in a wide range of conditions. White case, internal heat sink and ventilation holes reduce heat absorption to help maximize energy-gathering efficiency. Internal, 5,400mAh battery can be charged with sunlight or from a USB power source; battery holds a charge for years and can charge an iPhone(R) up to 3.5 times. Fast and powerful charger converts 1 hr. in direct sunshine into as much as 2 hrs. of talk time on a 3G phone; it charges faster than your phone can use the power! myJoos dashboard displays the battery's charge level and how much solar power is being generated. Adjustable legs make it easy to keep the solar panel pointing toward the sun; lanyard hole lets you quickly clip the charger to carabiner or security cable. The JOOS Orange portable solar charger comes with PC/Mac software that monitors charging activity in real time.","short_description":"The JOOS Orange portable solar charger gives you access to endless solar energy. It charges devices in low light, shade and even light rain, up to 3.5 times faster than many other portable chargers.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Solar And Portable Power","thumb_url":"http://i1.avlws.com/115/s413115.png","image_url":"http://i1.avlws.com/115/l413115.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413115&tt=df","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413115\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413115.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837625&amp;link=&amp;tabs=-Details\"></script>","variants":{"8376250001":{"sku":"8376250001","vendor_sku":"JOR-0002","upc":"013964179804","color":"WHITE","retail_price":"149.00","sale_price":"149.00"}}}
