{"sku":"837720","manufacturer_id":"7084-8990-S","brand_name":"Ibex","product_name":"Ibex El Fito Bib 3/4 Bike Tights - Men's","long_description":"Breathe well and pedal well in the Ibex El Fito Bib 3/4 tights. Bibs allow for comfortable riding with the least constriction around your waist. Bikewear-exclusive fabric is made from New Zealand merino wool, a small amount of nylon for extra strength, and Lycra(R) spandex for a snug fit that moves with you. Wool provides excellent temperature regulation, especially for stop-and-go sports such as cycling; fabric blend is midweight, soft, durable, breathable and machine washable. Upper back and straps are made from a soft, breathable wool stretch-mesh fabric; it wicks moisture away from your body and dries quickly. Reinforced with flexible polyester/spandex fabric in the seat and inner thighs for durability and support; the fleecy brushed backing is extra soft next to skin. Bumps and vibrations are no problem for the multidensity foam pad; ergonomic pad absorbs sweat and dries quickly for comfort in the saddle. Soft-shell knee panels buffer against cold and wet weather and enhance warmth. Gripper elastic leg hems keeps tights in place. Soft-shell front knee panels buffer against cold and wet weather and enhance warmth. Ibex El Fito 3/4 Bibs have a reflective Ibex logo to boost your nighttime visibility.","short_description":"Breathe well and pedal well in the Ibex El Fito Bib 3/4 tights. Bibs allow for comfortable riding with the least constriction around your waist.","category":"Cycling","subcategory":"Cycling Clothing","product_group":"Cycling Tights And Pants","thumb_url":"http://i1.avlws.com/115/s392323.png","image_url":"http://i1.avlws.com/115/l392323.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=392323&tt=df","retail_price":"185.00","sale_price":"185.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=392323\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m392323.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837720&amp;link=&amp;tabs=-Details\"></script>","variants":{"8377200001":{"sku":"8377200001","vendor_sku":"7084-8990-M","upc":"843897137929","size":"M","color":"BLACK","retail_price":"185.00","sale_price":"185.00"}},"categories":["cycling","cycling-clothing","cycling-tights-and-pants"]}
