{"sku":"837824","manufacturer_id":"SP131","brand_name":"Sawyer","product_name":" Sawyer Squeeze Water Filter Plus","long_description":"With a field weight of only 3 oz., the Sawyer Squeeze Water Filter Plus is one of the lightest filtration systems available and it takes up very little space so it can go on your fastpacking trips. To use, simply fill up an included water pouch at a lake or stream, screw the hollow-fiber filter onto the pouch and squeeze the pouch to push water through the filter. Plus version includes a 16 fl. oz. pouch, a 32 fl. oz. pouch and a 64 fl. oz. pouch; collapsible pouches are made from durable Mylar foil and can be reused hundreds of times. Filter has a built-in push/pull cap so you can spray water straight into your mouth or use it to fill a water bottle; squeeze filter fills most water bottles in only 30 sec. Hollow-fiber membrane filter removes 99.99999% of all bacteria, such as salmonella, cholera and E.coli; removes 99.9999% of all protozoa, such as giardia and cryptosporidium. Use the included syringe to backflush the filter to maintain a high-flow rate. Filter will also fit the threads on most bottles of water that you buy at a grocery store. Sawyer Squeeze Water Filter Plus comes with cleaning and maintenance instructions. Avoid freezing this filter; freezing may ruin the hollow-fiber membrane.","short_description":"With a field weight of only 3 oz., the Sawyer Squeeze Water Filter Plus is one of the lightest filtration systems available and it takes up very little space so it can go on your fastpacking trips.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426351.png","image_url":"http://i1.avlws.com/115/l426351.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426351&tt=df","retail_price":"49.95","sale_price":"49.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426351\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426351.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837824&amp;link=&amp;tabs=-Details\"></script>","variants":{"8378240001":{"sku":"8378240001","vendor_sku":"SP131","upc":"050716001310","retail_price":"49.95","sale_price":"49.95"}}}
