{"sku":"837894","manufacturer_id":"275276","brand_name":"Burton","product_name":"Burton Tyro Snowboard Boots - 2012/2013","long_description":"Burton Tyro snowboard boots offer out-of-the-box comfort so you're feeling good on the slopes from day one. Shrinkage(TM) footprint reduction technology reduces the boots overall length by 1 size helping to eliminate toe drag. Streamlined Speed Dial lacing system lets you twist your laces tight; laces are constantly fully engaged when tightening or loosening. Exit is easy with a quick pull of the dial-top loop. Imprint 1 EVA liners with guick-fit harnesses and lace locks secure feet; lightweight power panels surround calves and ankles with supportive comfort. Soft-flexing, slim 3D molded tongues wrap the forefeet in comfort, offer a seamless flex and reduce performance-robbing shell/liner stack-up. Flexible backstay spines increase medial/lateral support, edge-to-edge response and durability. Snow-proof internal gussets on boot tongues completely seal lower boot zones to keep feet warm and dry. EVA footbeds cushion every step. Low-profile EST(TM) midsoles/outsoles with a reduced ramp angle lower your center of gravity for improved feel; ultra-damping B3 gel inserts cushion without added weight.","short_description":"Burton Tyro snowboard boots offer out-of-the-box comfort so you're feeling good on the slopes from day one.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s461579.png","image_url":"http://i1.avlws.com/115/l461579.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461579&tt=df","retail_price":"199.95","sale_price":"99.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461579\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461579.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837894&amp;link=&amp;tabs=-Details\"></script>","variants":{"8378940001":{"sku":"8378940001","vendor_sku":"275276","upc":"886057777931","size":"8.5","color":"BLACK/CHARCOAL","retail_price":"99.83","sale_price":"99.83"}},"categories":["snow","snowboard-boots","mens-snowboard-boots"]}
