{"sku":"837872","manufacturer_id":"E78AHB","brand_name":"Petzl","product_name":" Petzl Pixa 1 Pro Headlamp","long_description":"The Petzl Pixa 1 Pro headlamp keeps your hands free for tasks at home and around the campsite. Its wide, uniform beam is designed for close-range work. Single lighting mode outputs a uniform beam that lights up objects up to 15m away for 12 hrs.; LED outputs 25 lumens, which is plenty of light for close-range tasks. Regulated output keeps the brightness and distance consistent throughout the life of the batteries. When the batteries are almost dead, the headlamp will continue to shine a 5m beam for 10 hrs. so you can still work until you have a chance to change the batteries. Reliable, strong and durable light is constructed to withstand 2m (6.6 ft.) falls and crushing by weights of up to 80kg (176 lbs.). Can be worn as a standard headlamp or mounted on a helmet with the included plate; compatible with Petzl Vertex (2010 version) and Alveo helmets (not included). Take the back mounting plate off and the light can be placed on any flat surface and aimed up to light up tight spaces. Large on/off selector dial is easy to manipulate with gloves on. Light body rotates up to 45deg so you can aim the beam right where you need it. Always working in dirty, wet places? Not to worry! Pixa 1 Pro's IP67 rating indicates complete protection against dust and protection against submersion to 1m for 30 min. Operates on 2 AA batteries (included); battery case is easy to open and close for quick battery changes; compatible with alkaline, NiMH, NiCd and lithium batteries. When storing the light, pivot the body so the LED faces the backing plate to protect the glass from scratches; this position also prevents the light from being turned on. Comfortable headband easily detaches from the Petzl Pixa 1 Pro headlamp when you want to clean the light.","short_description":"The Petzl Pixa 1 Pro headlamp keeps your hands free for tasks at home and around the campsite. Its wide, uniform beam is designed for close-range work.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417083.png","image_url":"http://i1.avlws.com/115/l417083.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417083&tt=df","retail_price":"38.95","sale_price":"38.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417083\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417083.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837872&amp;link=&amp;tabs=-Details\"></script>","variants":{"8378720001":{"sku":"8378720001","vendor_sku":"E78AHB","color":"YELLOW","retail_price":"38.95","sale_price":"38.95"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
