{"sku":"837874","manufacturer_id":"E78CHB","brand_name":"Petzl","product_name":" Petzl Pixa 3 Pro Headlamp","long_description":"The Petzl Pixa 3 Pro headlamp keeps your hands free for tasks at home and around the campsite, and it has 2 LEDs and 3 lighting modes to meet all your lighting needs. Use the light on high to illuminate objects up to 55m away with 50 lumens of light; switch to medium when you're moving around and need a mix of distance and proximity light. Medium throws a 40-lumen beam up to 30m; use the headlamp on low for proximity lighting that shines 15m and outputs 30 lumens. 2 AA batteries (included) provide up to 3 hrs. of use on high, 6 hrs. on medium and 12 hrs. of use on low; battery indicator light lets you know when you need new batteries. Regulated output keeps the brightness and distance consistent throughout the life of the batteries. When the batteries are almost dead, the headlamp will continue to shine a 15m beam for 10 hrs. so you can still work until you have a chance to change the batteries. Reliable, strong and durable light is constructed to withstand 2m (6.6 ft.) falls and crushing by weights of up to 80kg (176 lbs.). Can be worn as a standard headlamp or mounted on a helmet with the included plate; compatible with Petzl Vertex (2010 version) and Alveo helmets (not included). Take the back mounting plate off and the light can be placed on any flat surface and aimed up to light up tight spaces. Large on/off and mode-selector dial is easy to manipulate with gloves on. Light body rotates up to 45deg so you can aim the beam right where you need it. Always working in dirty, wet places? Not to worry! Pixa 3 Pro's IP67 rating indicates complete protection against dust and protection against submersion to 1m for 30 min. Battery case is easy to open and close for quick battery changes; compatible with alkaline, NiMH, NiCd and lithium batteries.","short_description":"The Petzl Pixa 3 Pro headlamp keeps your hands free for tasks at home and around the campsite, and it has 2 LEDs and 3 lighting modes to meet all your lighting needs.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417091.png","image_url":"http://i1.avlws.com/115/l417091.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417091&tt=df","retail_price":"74.95","sale_price":"74.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417091\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417091.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837874&amp;link=&amp;tabs=-Details\"></script>","variants":{"8378740001":{"sku":"8378740001","vendor_sku":"E78CHB","color":"YELLOW","retail_price":"74.95","sale_price":"74.95"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
