{"sku":"837825","manufacturer_id":"SP181","brand_name":"Sawyer","product_name":"Sawyer All-In-One Water Filter","long_description":"Take the Sawyer All-In-One water filter on lightweight backpacking trips or use the included parts to adapt it to work on nearly any plastic bucket for a large-volume gravity filtration system. Parts install quickly and easily on nearly any plastic bucket (not included) to create a large-volume gravity filtration system for use at your rustic cabin. To use on backpacking trips, fill up the 32 fl. oz. water pouch at a lake or stream, screw the filter onto the pouch and squeeze the pouch to push water through the filter. Filter has built-in push/pull cap so you can spray water straight into your mouth or use it to fill up a water bottle; squeeze filter fills most water bottles in only 20 sec. Hollow-fiber membrane filter removes 99.99999% of all bacteria, such as salmonella, cholera and E.coli; removes 99.9999% of all protozoa, such as giardia and cryptosporidium. Attach the filter to the faucet adapter to filter water straight from a household faucet. Use the included syringe to backflush the filter to maintain a high flow rate. Filter will also fit the threads on most bottles of water that you buy at a grocery store. Includes filter, a 32 fl. oz. pouch, 2 pop-up drinking spouts, 1 bucket adapter kit, 1 faucet adapter, 1 filter cleaner and 1 filter hanger. Avoid freezing the Sawyer All-In-One water filter; freezing may ruin the hollow-fiber membrane.","short_description":"Take the Sawyer All-In-One water filter on lightweight backpacking trips or use the included parts to adapt it to work on nearly any plastic bucket for a large-volume gravity filtration system.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426355.png","image_url":"http://i1.avlws.com/115/l426355.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426355&tt=df","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426355\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426355.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837825&amp;link=&amp;tabs=-Details\"></script>","variants":{"8378250001":{"sku":"8378250001","vendor_sku":"SP181","upc":"050716001815","retail_price":"69.95","sale_price":"69.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
