{"sku":"837875","manufacturer_id":"E78CHR","brand_name":"Petzl","product_name":" Petzl Pixa 3 Pro Rechargeable Headlamp","long_description":"The Petzl Pixa 3R rechargeable headlamp lets you configure the lighting performance so you can put a priority on either battery power or beam brightness, depending on your needs. Configure lighting performance to your needs by simply twisting the on/off dial; choose from Standard, Max Power and Max Autonomy configurations. Standard configuration is a compromise between lighting power and battery life, and will meet your needs most of the time. Use the light in Max Power configuration for short tasks that require a bright beam; Max Power provides a 55-lumen beam in any mode. Switch to the Max Autonomy configuration to maximize battery power and guarantee 12 hrs. of battery life in any mode. In the Standard and Max Power configurations, the Pixa 3R illuminates objects up to 75m away with 55 lumens of light on high. Standard configuration on medium throws a 35-lumen beam up to 35m; use the headlamp on low for proximity lighting that shines 15m and outputs 25 lumens. Rechargeable lithium ion battery provides up to 12 hrs. of use on low, 6 hrs. on medium and 3 hrs. on high in the Standard configuration. Battery indicator light lets you know when the battery needs to be recharged. Plug the headlamp into the included charging dock to recharge the battery in only 3 hrs.; includes a wall charger with European and U.S. outlet adapters. Regulated output keeps the brightness and distance consistent throughout the life of the battery. When the batteries are almost dead, the headlamp will continue to shine a 5m beam for 2 hrs. so you can still work until you have a chance to charge the battery. Reliable, strong and durable light is constructed to withstand 2m (6.6 ft.) falls and crushing by weights of up to 80kg (176 lbs.). Can be worn as a standard headlamp or mounted on a helmet with the included plate; compatible with Petzl Vertex (2010 version) and Alveo helmets (not included).","short_description":"The Petzl Pixa 3R rechargeable headlamp lets you configure the lighting performance so you can put a priority on either battery power or beam brightness, depending on your needs.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417095.png","image_url":"http://i1.avlws.com/115/l417095.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417095&tt=df","retail_price":"140.00","sale_price":"140.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417095\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417095.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837875&amp;link=&amp;tabs=-Details\"></script>","variants":{"8378750001":{"sku":"8378750001","vendor_sku":"E78CHR","color":"YELLOW","retail_price":"140.00","sale_price":"140.00"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
