{"sku":"837929","manufacturer_id":"275273","brand_name":"Burton","product_name":"Burton Bootique Snowboard Boots - Women's - 2012/2013","long_description":"Comfort, fit and good looks perfectly describe the freestyle-focused Burton Bootique snowboard boots. With speedy lacing for easy entry, the enhanced feel of cushioned outsoles and hot pockets to keep your toes warm, you can just slide them on and start ripping. Get a comfortable fit right out of the box: Imprint 2 liners offer a quick break-in period and increase warmth and comfort. Imprint 2 liners wrap feet in comfortable EVA foam for cushioned support; Plush Cuff 1.0 offers comfort around calves; liners secure with rip-and-stick closures. Lightweight power panels surround calves and ankles with supportive comfort. Hot pockets are small neoprene sleeves sized for disposable foot warmers (2 pair included); they sit on top of your feet and warm up frigid toes. Soft-flexing, 3D molded tongues wrap the forefeet in comfort, offer a seamless flex and reduce performance-robbing shell/liner stack-up. Streamlined Speed Dial lacing system lets you twist your laces tight; laces are constantly fully engaged when tightening or loosening. Exit is easy with a quick pull of the dial-top loop. Low-profile EST(TM) midsoles with a reduced ramp angle lower your center of gravity for improved boot feel; ultra-damping B3 gel inserts cushion without added weight. Rubber outsoles provide traction on ice-covered terrain. Women-specific True Fit(TM) Design creates boots and bindings specifically for the way a woman rides, ensuring complete control, total power and ultimate fun.","short_description":"Comfort, fit and good looks perfectly describe the freestyle-focused Burton Bootique snowboard boots.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Women's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s461607.png","image_url":"http://i1.avlws.com/115/l461607.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461607&tt=df","retail_price":"199.95","sale_price":"99.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461607\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461607.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=837929&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboard-boots","womens-snowboard-boots"]}
