{"sku":"838088","manufacturer_id":"U120100901220","brand_name":"Atlas","product_name":" Atlas Run Snowshoes","long_description":"The Atlas Run snowshoes are designed to let you keep your pace high through winter, offering plenty of traction, flotation and agility to ensure you stride through winter smoothly. Tough frames made from 6061 aluminum offer a stiff, lightweight chassis; frame shape is optimized to reduce frame clipping, ensure straight tracking and maintain flotation. Spring-Loaded(TM) Suspension (SLS) uses offset webbing straps to create a springy platform beneath the foot that absorbs impact and allows natural side-to-side foot flex. 1-pull LightSpeed bindings cinch tight with a quick tug, supplying a snug, supportive fit that's lightweight and flexible; heel straps secure feet further. Lightweight Nytex(TM) nylon decks are abrasion-resistant and stay flexible when cold and stand up to the elements for lasting use. Aluminum instep crampons bite into snowy terrain with a front row of teeth and 2 side teeth to minimize twisting; aluminum heel crampons maximize downhill traction. Recommended load specification includes weight of runner with gear; the Atlas Run snowshoes can support up to 220 lbs. on packed trails.","short_description":"The Atlas Run snowshoes are designed to let you keep your pace high through winter, offering plenty of traction, flotation and agility to ensure you stride through winter smoothly.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Men's Snowshoes","thumb_url":"http://i1.avlws.com/115/s451767.png","image_url":"http://i1.avlws.com/115/l451767.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451767&tt=df","retail_price":"209.95","sale_price":"167.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451767\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451767.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838088&amp;link=&amp;tabs=-Details\"></script>","variants":{"8380880001":{"sku":"8380880001","vendor_sku":"U120100901220","upc":"714636946624","size":"22 IN","color":"STRAWBERRY","retail_price":"167.93","sale_price":"167.93"}}}
