{"sku":"838089","manufacturer_id":"U120101001220","brand_name":"Atlas","product_name":"Atlas Race Snowshoes","long_description":"Light and agile, the Atlas Race snowshoes make it easy to keep running through the snowy months, offering a full-stride-friendly design and aggressive traction so you can push the pace through winter. Lightweight and tough 7075 aluminum frames supply responsive performance; frame shape is optimized to reduce frame clipping, ensure straight tracking and maintain flotation. Spring-Loaded(TM) Suspension (SLS) uses offset webbing straps to create a springy platform beneath the foot that absorbs impact and allows natural side-to-side foot flex. 1-pull LightSpeed Pro bindings cinch tight with a quick tug, supplying a snug, supportive fit that's lightweight and flexible; heel straps secure feet further. Lightweight Nytex(TM) nylon decks are abrasion-resistant and stay flexible when cold and stand up to the elements for lasting use. Ultralight and tough titanium crampons bite into snowy terrain for sure footing and minimal twisting; titanium heel crampons maximize downhill traction and braking. Recommended load specification includes weight of runner with gear; the Atlas Race snowshoes can support up to 220 lbs. on packed trails.","short_description":"Light and agile, the Atlas Race snowshoes make it easy to keep running through the snowy months, offering a full-stride-friendly design and aggressive traction so you can push the pace through winter.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Men's Snowshoes","thumb_url":"http://i1.avlws.com/115/s432099.png","image_url":"http://i1.avlws.com/115/l432099.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432099&tt=df","retail_price":"329.95","sale_price":"263.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432099\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432099.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838089&amp;link=&amp;tabs=-Details\"></script>","variants":{"8380890001":{"sku":"8380890001","vendor_sku":"U120101001220","upc":"714636946631","size":"22 IN","color":"ACID GREEN","retail_price":"263.93","sale_price":"263.93"}},"categories":["snow","snowshoes","mens-snowshoes"]}
