{"sku":"838021","manufacturer_id":"303453-BLR","brand_name":"Dc","product_name":"DC Ceptor Snowboard Boots - 2012/2013","long_description":"Love traditional laces, but don't like lacing them in cold weather? DC Ceptor snowboard boots have solved the problem with the new DC Cinch closure system. Tighten the lower region to your liking and secure the laces with the Cinch; then comfortably lace the uppers without having to hold constant pressure to keep the lowers tight. Moisture-wicking system lets moisture vapor escape from the liners through vents in the shells to prevent feet from overheating and building up moisture; feet stay drier. Ergonomically-shaped 3D tongues with seamless construction prevent pinching and hot spots. Molded backstays in the shells save your legs when you land in the backseat, and won't wash out when you hit the gas and go fast. Articulated upper cuffs offer outstanding support and an easy, broken-in feel. Lightweight, low-profile outsoles allow maximum board-to-terrain feel; traction pattern grips well on and off the snow and prevents snow from building up and clogging bindings. Impact-absorbing padding won't change properties under varied climates or temperatures, so it always remains effective. Top-of-the-line liners have multidensity cushioning, neoprene ankle wraps and anatomic J-bars for the ultimate in comfort and support and heel hold. DC Ceptor boot liners have an antimicrobial treatment to hinder foot odor and vents that work with the shells to vent heat and help keep liners dry.","short_description":"Love traditional laces, but don't like lacing them in cold weather? DC Ceptor snowboard boots have solved the problem with the new DC Cinch closure system.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s461583.png","image_url":"http://i1.avlws.com/115/l461583.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461583&tt=df","retail_price":"250.00","sale_price":"122.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461583\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461583.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838021&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboard-boots","mens-snowboard-boots"]}
