{"sku":"838179","manufacturer_id":"523148","brand_name":"Stohlquist","product_name":"Stohlquist Cruiser PFD - Women's","long_description":"A half mesh back, short torso and supportive cups provide women wearing the Stohlquist Cruiser an extra measure of comfort while kayaking or canoeing. Contoured inner cups wrap around body without uncomfortable pressure, and specially constructed foam and seams conform to the natural shape of the body. Unique cross-chest cinch strap totally eliminates annoying ride up and keeps you floating high in the water. Wide side cinch-straps secure the fit and promote airflow. 1.5 in. webbing belt and shoulder straps easily adjust to create a low-profile fit. Open sides enhance ventilation, and mesh shoulders and back enhance comfort. Zippered bellows pockets with drainage ports store essential gear; rear 4-way lash tab lets you attach safety equipment. Durable Cordura(R) nylon shell resists abrasion and UV rays for long-lasting service. Reflective accents on front and back enhance visibility. Center-zip design with noncorroding zipper allows easy entry. Short length of the Stohlquist Cruiser won't interfere with seat backs.","short_description":"A half mesh back, short torso and supportive cups provide women wearing the Stohlquist Cruiser an extra measure of comfort while kayaking or canoeing.","category":"Paddling","subcategory":"Pfds","product_group":"Women's Pfds","thumb_url":"http://i1.avlws.com/115/s432011.png","image_url":"http://i1.avlws.com/115/l432011.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432011&tt=df","keywords":"kayaking","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432011\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432011.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838179&amp;link=&amp;tabs=-Details\"></script>","variants":{"8381790003":{"sku":"8381790003","vendor_sku":"523150","upc":"053242254120","size":"Plus","color":"POWDER BLUE","retail_price":"109.95","sale_price":"109.95"}},"categories":["paddling","pfds","womens-pfds"]}
