{"sku":"838205","manufacturer_id":"U120100501230","brand_name":"Atlas","product_name":" Atlas Elektra 923 Snowshoes - Women's","long_description":"Stroll through wintry snowscapes with these Atlas Elektra 923 snowshoes, which boast a women-specific design and great traction for use across rolling terrain. Women-specific, V-shaped frames are made from sturdy 6061 aluminum and are designed to facilitate a woman's natural stride. Nose and tail shapes are optimized to provide a balanced platform for stable footing and facilitate an easy, natural stride. Free-Rotating(TM) Suspension lets the binding rotate much farther forward than previous Atlas designs, freeing up the stride and reducing the amount of tail flip. The result of the design is that freedom of movement is increased, the toe crampon can bite into snow better and the foot is allowed a more natural rotation. Wrapp(TM) Trail bindings use a continuous webbing design that tightens snugly with a single pull; bindings also cradle feet and arches for a secure, comfortable fit. Abrasion-resistant, lightweight Nytex(TM) nylon decks stay flexible when cold and stand up to the elements for lasting use. Steel toe crampons supply sure-footed traction on icy and snowy terrain; heel crampons increase traction while traversing and descending. Recommended load specification for the Atlas Elektra 923 snowshoes includes weight of hiker with gear.","short_description":"Stroll through wintry snowscapes with these Atlas Elektra 923 snowshoes, which boast a women-specific design and great traction for use across rolling terrain.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Women's Snowshoes","thumb_url":"http://i1.avlws.com/115/s440883.png","image_url":"http://i1.avlws.com/115/l440883.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440883&tt=df","retail_price":"169.95","sale_price":"135.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440883\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440883.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838205&amp;link=&amp;tabs=-Details\"></script>","variants":{"8382050001":{"sku":"8382050001","vendor_sku":"U120100501230","upc":"714636946587","size":"23 IN","color":"WHITE/CORAL","retail_price":"135.93","sale_price":"135.93"}},"categories":["snow","snowshoes","womens-snowshoes"]}
