{"sku":"838378","manufacturer_id":"1603620","brand_name":"Cateye","product_name":" CatEye Strada CC-RD420DW Digital Wireless Bike Computer","long_description":"The CatEye Strada CC-RD420DW Digital wireless bike computer adds heart rate tracking to the simple, reliable and compact Strada design, making it easy to track performance on the go. Functions include current heart rate, current, average and maximum speed, trip distance, odometer, elapsed time, stop watch, clock and dual tire size recognition. The easily adjustable heart rate monitor chest strap is designed for high levels of comfort. Additional features include average speed pacing, automatic start/stop, power-saving and sleep modes and low battery alarm for both computer head and sensor. Large font size makes it easy to read trip details with a quick glance; display can be programmed to meet your preferences. FlexTight(TM) head unit bracket mounts quickly and securely, and without tools to a handlebar or stem measuring 22 - 32mm in diameter. Wireless transmission distance up to 196 in. (5 meters).; speed sensor works from either the front or rear wheel. CatEye Strada CC-RD420DW bike computer comes with 2 CR2032 batteries, 1 each for head unit and speed sensor.","short_description":"The CatEye Strada CC-RD420DW Digital wireless bike computer adds heart rate tracking to the simple, reliable and compact Strada design, making it easy to track performance on the go.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375179.png","image_url":"http://i1.avlws.com/115/l375179.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375179&tt=df","retail_price":"120.00","sale_price":"120.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375179\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375179.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838378&amp;link=&amp;tabs=-Details\"></script>","variants":{"8383780001":{"sku":"8383780001","vendor_sku":"1603620","upc":"725012024034","retail_price":"120.00","sale_price":"120.00"}}}
