{"sku":"838486","manufacturer_id":"E36 A","brand_name":"Petzl","product_name":" Petzl NAO Headlamp","long_description":"The Petzl NAO headlamp revolutionizes hands-free lighting with a sensor that automatically adjusts the beam pattern and light output so you don't have to. Whether you're reading a map or running a trail, the built-in light sensor measures the ambient light in order to adjust the 2 high-output LEDs instantly to meet your needs. When you're looking at an object at very close range, such as a map or piece of equipment, the light adjusts to a very wide beam with low output. As you make your way down the trail, the beam widens and adjusts to a medium light output in order to illuminate objects in the path. If you raise your head to see something in the distance, the beam becomes focused and the light intensity increases. Reactive lighting keeps your hands free longer because you don't need to press a button to adjust light output; it also extends battery life by efficiently using power. Download OS by Petzl software to modify the functionality of your NAO headlamp; you can adjust light intensity, burn time and distance according to an activity. Create custom activity profiles or select from pre-configured profiles such as trail running, mountaineering and hiking; load these onto the NAO and you're ready to go. OS by Petzl software is available for download from Petzl at www.petzl.com/OS. Headlamp can also be operated in Constant mode, which disables the sensor and gives you standard high and low output settings. Give the on/off switch a quick twist to navigate between high and low Reactive modes; hold the switch for 2 sec. to switch to Constant mode. 2 LEDs shine light up to 108m and output 355 lumens on high Reactive mode and 55m and 98 lumens on low Reactive mode. Single Lithium-ion polymer 2,300 mAh battery can be recharged up to 300 times, making the battery life equivalent to that of hundreds of alkaline batteries. Battery provides 4 hrs. 40 min. of use in high Reactive mode and 8 hrs.","short_description":"The Petzl NAO headlamp revolutionizes hands-free lighting with a sensor that automatically adjusts the beam pattern and light output so you don't have to.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417099.png","image_url":"http://i1.avlws.com/115/l417099.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417099&tt=df","retail_price":"175.00","sale_price":"175.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417099\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417099.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838486&amp;link=&amp;tabs=-Details\"></script>","variants":{"8384860001":{"sku":"8384860001","vendor_sku":"E36 A","retail_price":"175.00","sale_price":"175.00"}}}
