{"sku":"838472","manufacturer_id":"VN-0NFF6SU","brand_name":"Vans","product_name":" Vans Aura Snowboard Boots - Women's - 2012/2013","long_description":"The Vans Aura snowboard boots are a foundation style in the Vans lineup. They maintain classic styling with a soft, forgiving flex, lightweight construction and zonal Boa(R) lacing. This season, the Vans Aura boots feature new outsoles that provide a slimmer profile and reduced weight over last season. Double Boa lacing has two reels that control two specific zones of closure; the tongue dials the upper portion of the boots while the side-mounted dial adjusts lower portion. Boa lacing offers on-the-fly micro adjustments and never comes untied; you get quick on and off, and consistent closure without pressure points. Full instep articulation allows the upper and lower zones of the boots to flex independently, creating a fluid forward motion and minimizing shell distortion. Trifit X thermal-formable liners with asymmetric heel-holding inserts feature closed-seam fleece upper cuffs, comfort flex toe boxes and low-volume soles. Open-cell foam interior cushioning layer adds plush comfort. Molded EVA high-rebound footbeds feature integrated arch support, anatomically placed dual-density metatarsal and heel impact-relief pads, and antimicrobial linings. Internal web harnesses hold liners closed for secure fit and prevent them from slipping inside shells; lace locks maintain desired tension. Low-profile soles work with the integrated liner construction to shorten the boots' footprint, thus decreasing toe and heel drag. Inverted waffle tread pattern design delivers a functional snow-specific spin on the classic Vans waffle sole.","short_description":"The Vans Aura snowboard boots are a foundation style in the Vans lineup. They maintain classic styling with a soft, forgiving flex, lightweight construction and zonal Boa(R) lacing.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Women's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s451511.png","image_url":"http://i1.avlws.com/115/l451511.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451511&tt=df","retail_price":"249.95","sale_price":"123.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451511\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451511.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838472&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
