{"sku":"838571","manufacturer_id":"B120200301162","brand_name":"K2","product_name":"K2 Peace Keeper Snowboard - 2012/2013","long_description":"If searching out fresh tracks and deep pow is your passion, choose the K2 Peace Keeper snowboard for all your days on the hill. BC Rocker delivers the most rocker in the K2 line, offering effortless turns on the hardpack and ample float on the freshies. Tweekend baseline profile features a flat base between the feet and a rockered tip for a great feel when sliding rails, landing jumps and carving powder. BC shaping features a longer tip blend-zone for more control; compact sidecut locks a turn at any speed; longer tail blend and shorter tail gives you control in tight trees. Directional shape provides plenty of overall float and control, offering a balanced ride that's equally versatile ridden regular or switch. WH4 wood core, with generous Honeykomb material between the bindings and rails, provides a fine-tuned response; it's engineered to maintain durability with minimal weight. Bamboo is blended into the core for increased strength and added durability. A pre-loaded, camber-shaped Ollie Bar is placed in the center backbone section between the bindings to enhance ollie pop and pressing power. ICG 20 support integrates carbon into the fiberglass, reducing overall weight and creating a super-smooth release of power. Triaxial glass laminated in directional layers adds torsional stiffness, improving edge hold and increasing stability during off-axis landings. 0 Sintered Base is an ultrathin, super-conductive base; lightweight with lower material usage, it's the highest quality sintered base offered by K2. .","short_description":"If searching out fresh tracks and deep pow is your passion, choose the K2 Peace Keeper snowboard for all your days on the hill.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Powder Snowboards","thumb_url":"http://i1.avlws.com/115/s461523.png","image_url":"http://i1.avlws.com/115/l461523.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461523&tt=df","retail_price":"599.95","sale_price":"294.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461523\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461523.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838571&amp;link=&amp;tabs=-Details\"></script>","variants":{"8385710001":{"sku":"8385710001","vendor_sku":"B120200301159","upc":"714636980574","size":"159 CM","retail_price":"294.83","sale_price":"294.83"}},"categories":["snow","snowboards","powder-snowboards"]}
