{"sku":"838548","manufacturer_id":"E02 P3","brand_name":"Petzl","product_name":" Petzl e+LITE Headlamp","long_description":"Ultralight (less than 1 oz.!) and very compact, the Petzl e+LITE(R) headlamp with retractable cord is a great replacement for that bulky flashlight in your glove box or emergency kit. e+LITE is always ready for use and it can be stored with batteries for up to 10 years; uses 2 CR2032 lithium batteries (included). 3 white LEDs provide even lighting throughout your field of view, without blank spots in the beam; LEDs output 26 lumens and throw a beam up to 29m. Red LED aids your ability to see in the dark without experiencing night blindness caused by rush of bright light against the eye; also is good for signaling. White and red flashing modes can be used for signaling. Retractable cord allows the headlamp to be worn on the head or wrist, or attached to any other support, such as a tent pole or bicycle seatpost. Rotating lockable power switch controls light modes: maximum, economy and flashing strobe. Light source rotates 360deg on a ball joint, increasing versatility in tight quarters. 2 CR2032 batteries provide 70 hrs. of use on enconomy mode and 55 hrs. on maximum mode. Waterproof down to 1m for 30 min., making the Petzl e+LITE safe to use in a downpour.","short_description":"Ultralight (less than 1 oz.!) and very compact, the Petzl e+LITE(R) headlamp with retractable cord is a great replacement for that bulky flashlight in your glove box or emergency kit.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417103.png","image_url":"http://i1.avlws.com/115/l417103.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417103&tt=df","retail_price":"29.95","sale_price":"29.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417103\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417103.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838548&amp;link=&amp;tabs=-Details\"></script>","variants":{"8385480001":{"sku":"8385480001","vendor_sku":"E02 P3","retail_price":"29.95","sale_price":"29.95"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
