{"sku":"838788","manufacturer_id":"VN-0NFN6VC","brand_name":"Vans","product_name":" Vans Encore Snowboard Boots - Women's - 2012/2013","long_description":"A proven performer, the Vans Encore women's snowboard boots just keep getting better. They provide a great fit, forgiving flex and a quick and easy closure system. Boa(R) Coiler lacing system, with ankle and cable guides along entire edge of eyestays, distributes closure force evenly for a dialed-in fit that won't loosen up. Boa(R) lacing offers on-the-fly adjustment and never comes untied; you get consistent closure without pressure points. Flexible cuffs provide comfortable and secure closure around ankles and lower legs, and enhance body-to-board responsiveness. Trifit X thermal-formable liners with asymmetric heel-holding inserts feature closed-seam fleece upper cuffs, comfort flex toe boxes and low-volume soles. Open-cell foam interior cushioning layer adds plush comfort. Molded EVA, high-rebound footbeds feature integrated, molded arch supports and breathable airflow perforations; footbeds are treated to fight odors. Internal web harnesses hold liners closed for secure fit and prevent them from slipping inside shells; lace locks maintain desired tension. Full instep articulation allows the upper and lower zones of the boots to flex independently, creating a fluid forward motion and minimizing shell distortion. ClassicLite outsoles ensure a featherlight feel, a slim profile and high durability; oversize waffle tread pattern increases traction and improves snow release.","short_description":"A proven performer, the Vans Encore women's snowboard boots just keep getting better. They provide a great fit, forgiving flex and a quick and easy closure system.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Women's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s451515.png","image_url":"http://i1.avlws.com/115/l451515.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451515&tt=df","retail_price":"199.95","sale_price":"97.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451515\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451515.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838788&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
