{"sku":"838880","manufacturer_id":"L-AN-KIT-GRN","brand_name":"Uco","product_name":" UCO Original Candle Lantern Kit","long_description":"Enjoy the soft glow of candlelight on your outings with the Uco Original Candle Lantern kit. The kit includes the lantern, a clip-on reflector and protective neoprene case. Lantern is super easy to use-just slide the glass down, light the exposed candle and you're good to go. Clip the included reflector to the top edge of the lantern to direct the light to where you need it most; reflector weighs only 0.3 oz. Compact lantern is ideal for backpacking and home emergency kits; it collapses down to 4.25 in. in height for compact storage. Includes a single candle that provides up to 9 hrs. of warm light. Viewing slot on the side of the lantern lets you monitor the slow-burning candle to see how much is left. Spring-loaded system keeps the candle at a consistent height. Pack the lantern in the included impact-resistant neoprene Cocoon(TM) case; it helps prevent scratches, dents and broken glass while you're transporting the lantern. Hang the Uco Original Candle lantern up or carry it around camp with the metal handle.","short_description":"Enjoy the soft glow of candlelight on your outings with the Uco Original Candle Lantern kit. The kit includes the lantern, a clip-on reflector and protective neoprene case.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Lanterns","thumb_url":"http://i1.avlws.com/115/s417331.png","image_url":"http://i1.avlws.com/115/l417331.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417331&tt=df","retail_price":"24.95","sale_price":"24.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417331\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417331.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838880&amp;link=&amp;tabs=-Details\"></script>","variants":{"8388800001":{"sku":"8388800001","vendor_sku":"L-AN-KIT-GRN","upc":"054269000417","color":"GREEN","retail_price":"24.95","sale_price":"24.95"}}}
