{"sku":"838875","manufacturer_id":"LB22240","brand_name":"Lange","product_name":"Lange Exclusive RX 80 LV Ski Boots - Women's - 2012/2013","long_description":"Warm and comfortable, the women's Lange Exclusive RX 80 LV ski boots feature an expert fit for narrow feet. Shells made from a single, uniform material ensure the power transfer of the Lange Exclusive RX 80 LVs is highly efficient, even in varying temperatures. Shells are designed to create a centered, balanced stance using a low heel lift and an upright forward lean. Upright stance makes it easy to stay balanced on today's shaped and rockered skis, reducing fatigue and increasing efficiency of skiing technique. Women-specific fit accommodates narrow heels and low calf muscles with anatomically shaped liners and upper cuffs. Liners comfortably conform to your feet and precisely match the internal shape of the shell to create instant responsiveness. Liners may be custom molded using a heat treatment. Very light synthetic insulation increases warmth throughout the liner. Boots hold to ankles and heels thanks to specialized, anatomic padding and resist packing out. Reinforced wedges in tongues remove gaps between liners and shells and enhance wrap on upper leg. Specially designed instep provides excellent midfoot fit, resulting in heightened responsiveness, increased circulation and greater warmth. 1-piece toe boxes and tongues eliminate seams and overlaps in the tongue attachment area, reducing pressure points at the instep and top of the toes. Low-profile buckles sit low on the shell and creates a strong, precise closure. Adjust cuff tightness with a simple rotation of the buckle catches; catches adjust 20mm, corresponding to the 3 positions of a conventional catch. 40mm power straps provide uniform and progressive cuff flex. Rubber soles offer traction for walking on slippery surfaces. With a flex index of 80, Lange Exclusive RX 80 LV ski boots provide a flex that's welcoming for intermediate skiers.","short_description":"Warm and comfortable, the women's Lange Exclusive RX 80 LV ski boots feature an expert fit for narrow feet.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s457287.png","image_url":"http://i1.avlws.com/115/l457287.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457287&tt=df","retail_price":"399.95","sale_price":"239.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457287\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457287.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838875&amp;link=&amp;tabs=-Details\"></script>","variants":{"8388750005":{"sku":"8388750005","vendor_sku":"LB22240","size":"Mondo 26.5","color":"BLACK/WHITE","retail_price":"239.83","sale_price":"239.83"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
