{"sku":"838871","manufacturer_id":"A120301601165","brand_name":"Line","product_name":"Line Celebrity 90 Skis - Women's - 2012/2013","long_description":"The fabulous Line Celebrity 90 skis offer a lively, fun feel that you'll love to ski all season, and their rockered tips boost comfort and control. The Line Celebrity 90 skis work well if you're sticking to the groomed runs, but they are ideal if you find yourself switching between groomed runs and off-piste terrain. Aspen core consists of a blend of high-quality wood laminates that reduce weight and enhance overall strength. Fiberglass is layered in 4 directions around the core of the ski, providing uncompromised strength and snappy responsiveness. Line Celebrity 90s feature a progressively stiffer flex from tip to tail, resulting in powerful acceleration out of turns, stability on uneven terrain and easy turn initiation. Very subtle rockered tips makes it easy to start turns on hardpack and helps flotation in deep snow. Geometry of skis incorporates 5 different turn radii to create effortless turn initiation with solid edge hold and responsive exits. Directional twin-tip design slightly favors skiing forward. Steel edges seamlessly wrap around the entire tip, delivering superior carving and long-lasting performance. Increased thickness of a standard base and edges adds significant durability and impact resistance, and it lets you tune your skis many times throughout the season. High-quality sintered base retains wax and glides easily over snow. Base or topsheet color may vary from online photo. Requires bindings with wide brakes.","short_description":"The fabulous Line Celebrity 90 skis offer a lively, fun feel that you'll love to ski all season, and their rockered tips boost comfort and control.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s457035.png","image_url":"http://i1.avlws.com/115/l457035.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457035&tt=df","retail_price":"499.95","sale_price":"299.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457035\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457035.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838871&amp;link=&amp;tabs=-Details\"></script>","variants":{"8388710003":{"sku":"8388710003","vendor_sku":"A120301601165","upc":"714636953684","size":"165 CM","retail_price":"299.83","sale_price":"299.83"}},"categories":["snow","skis","downhill-skis"]}
