{"sku":"838870","manufacturer_id":"LB27010","brand_name":"Lange","product_name":"Lange XT 130 Ski Boots - Men's - 2012/2013","long_description":"Hike up a sidecountry ridge for your turns in the Lange XT 130 ski boots, then lock 'em down and ski as hard as you like. Specialized ski/hike mechanism frees the upper shell from the lower part of the boot and offers a large range of motion for hiking. When you're ready to ski, the upper shell lock directly into the lower shell to maximize power transmission on the descent. Lange XT 130 shells are made from a single, uniform material to ensure that power transfer is highly efficient, even in varying temperatures. Single-material shells are also much easier for boot fitters to grind and punch. Shells are designed to create a centered, balanced stance using a low heel lift and an upright forward lean. Upright, natural stance makes it easy to stay balanced on today's shaped and rockered skis, reducing fatigue and increasing efficiency of skiing technique. Lange has created lightweight liners specifically designed for hiking; liners lace-up to ensure a comfortable fit while hiking. Liners comfortably conform to your feet and precisely match the internal shape of the shell to create instant responsiveness. Liners may be custom molded using a heat treatment. Boots hold to ankles and heels thanks to specialized, anatomic padding that resists packing out. Reinforced wedges in tongues remove gaps between liners and shells and enhance wrap on upper leg. Specially designed insteps provide excellent midfoot fit, resulting in heightened responsiveness, increased circulation and greater warmth. 1-piece toe boxes and tongues eliminate seams and overlaps in the tongue attachment area, reducing pressure points at the instep and top of the toes. You'll ski longer without hotspots thanks to the saddle-stitched seams in remainder of liners. Low-profile buckles sit low on the shell and creates a strong, precise closure.","short_description":"Hike up a sidecountry ridge for your turns in the Lange XT 130 ski boots, then lock 'em down and ski as hard as you like.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382439.png","image_url":"http://i1.avlws.com/115/l382439.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382439&tt=df","retail_price":"699.95","sale_price":"559.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382439\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382439.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838870&amp;link=&amp;tabs=-Details\"></script>","variants":{"8388700001":{"sku":"8388700001","vendor_sku":"LB27010","size":"Mondo 25.5","color":"WHITE/GREEN","retail_price":"559.93","sale_price":"559.93"},"8388700004":{"sku":"8388700004","vendor_sku":"LB27010","size":"Mondo 28.5","color":"WHITE/GREEN","retail_price":"559.93","sale_price":"559.93"},"8388700005":{"sku":"8388700005","vendor_sku":"LB27010","size":"Mondo 29.5","color":"WHITE/GREEN","retail_price":"559.93","sale_price":"559.93"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
