{"sku":"838964","manufacturer_id":"8205000101-001","brand_name":"Thirtytwo","product_name":"thirtytwo Lashed Fast Track Snowboard Boots - Women's - 2012/2013","long_description":"The thirtytwo women's Lashed Fast Track snowboard boots feature everything you love about the classic Lashed boots, but now include the Fast Track lacing system. Fast Track lacing reduces lace friction and offers a secure fit; 4 lacing zones secure each part of boot-simply pull each zone, flip the lock and you're good to go. Level 3F liners feature dual-density, Soft-touch Intuition Ultralon(TM) foam for comfort and warmth and Achilles overlays that hold heels in place. Liners conform to your feet after a few days of riding or you can custom mold them at your local shop. Level 2 molded footbeds with heel pads and perforated mesh topsheets provide anatomic support and cushioning; molded heel and arch frames add additional support. 3D molded tongues wrap feet for easy lacing, improved fit and solid heel hold; design allows you to vary the stiffness to customize the flex and improve responsiveness. Articulating cuffs lessen shell distortion, ease lacing, improve durability and provide consistent heel hold throughout the flex range of motion. STI Evolution Foam(TM) midsoles/outsoles provide awesome cushioning and dramatically decrease boot weight by eliminating the need for heavy rubber outsoles.","short_description":"The thirtytwo women's Lashed Fast Track snowboard boots feature everything you love about the classic Lashed boots, but now include the Fast Track lacing system.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Women's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s461635.png","image_url":"http://i1.avlws.com/115/l461635.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461635&tt=df","retail_price":"219.95","sale_price":"109.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461635\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461635.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=838964&amp;link=&amp;tabs=-Details\"></script>","variants":{"8389640005":{"sku":"8389640005","vendor_sku":"8205000101-001","upc":"886744027905","size":"9","color":"BLACK","retail_price":"109.83","sale_price":"109.83"}},"categories":["snow","snowboard-boots","womens-snowboard-boots"]}
