{"sku":"839035","manufacturer_id":"8150013","brand_name":"Dakine","product_name":"DAKINE Quest 28L Photo Pack","long_description":"The DAKINE Quest Photo pack allows you to capture your most amazing moments on backcountry adventures with this photography-specific snowboard pack. Customizable photo compartment features a removable padded camera block that accommodates multiple lenses; offers side and front entry to camera gear. Top pocket lets you stash extra gear such as snacks and clothing layers; front zip pocket has individual sleeves that stash small items such as phone and pens. Vertical straps let you carry your snowboard in a stable, secure manner on your trek to the top. Waterproof zippers on lower photo pockets. Padded interior sleeve fits most 15 in. laptops when off the slopes. Constructed from 600-denier polyester and 420-denier nylon mini ripstop fabric for light weight, durability and water resistance. Readily deployable raincover keeps your gear protected from sudden rain and snow showers. External straps can be quickly deployed to carry a tripod for steady shots in the backcountry. DAKINE Quest Photo pack features padded shoulder straps and a precurved hipbelt for a comfortable, adjustable fit.","short_description":"The DAKINE Quest Photo pack allows you to capture your most amazing moments on backcountry adventures with this photography-specific snowboard pack.","category":"Snowboarding","subcategory":"Snowboard Packs And Bags","product_group":"Snowboard Packs","thumb_url":"http://i1.avlws.com/115/s266647.png","image_url":"http://i1.avlws.com/115/l266647.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=266647&tt=df","keywords":"day packs","retail_price":"210.00","sale_price":"146.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=266647\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m266647.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839035&amp;link=&amp;tabs=-Details\"></script>","variants":{"8390350001":{"sku":"8390350001","vendor_sku":"8150013","upc":"610934726732","color":"BLACK","retail_price":"146.83","sale_price":"146.83"}},"categories":["snow","snowboard-packs-and-bags","snowboard-packs"]}
