{"sku":"839163","manufacturer_id":"8200100000","brand_name":"Dakine","product_name":" DAKINE Heli-Pro DLX 18L Snow Pack - Women's","long_description":"The DAKINE Heli-Pro DLX 18L snow pack is a girl's best friend, offering an easy, comfortable way to haul your ride and gear to whatever peaks you're gaming to tackle. Snug-fitting design keeps the weight close to your body for balance on uneven terrain and ease on chairlifts. 600-denier polyester fabric is lightweight, durable and water resistant. Straps let you securely carry your snowboard vertically or horizontally-whichever you prefer. Retractable cable carrying straps hold alpine or backcountry skis. Quick draw ice axe sleeve and external shovel pocket offer space to pack your backcountry essentials. Integrated load compression straps steamline pack and keep bulkiness down. Insulated compartment for hydration reservoir (sold separately) and insulated shoulder pads prevent frozen hose, ensuring convenient and reliable hydration. Fleece-lined goggles pocket protects your lenses from getting scratched when not in use. DAKINE Heli-Pro DLX 18L snow pack features a padded hipbelt and a harness contoured to comfortably fit a woman's frame; sternum strap buckle doubles as a rescue whistle.","short_description":"The DAKINE Heli-Pro DLX 18L snow pack is a girl's best friend, offering an easy, comfortable way to haul your ride and gear to whatever peaks you're gaming to tackle.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s376499.png","image_url":"http://i1.avlws.com/115/l376499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376499&tt=df","keywords":"day packs","retail_price":"105.00","sale_price":"72.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839163&amp;link=&amp;tabs=-Details\"></script>","variants":{"8391630002":{"sku":"8391630002","vendor_sku":"8200100000","upc":"610934786422","color":"BLACK","retail_price":"72.83","sale_price":"72.83"}}}
