{"sku":"839154","manufacturer_id":"8200110JUL","brand_name":"Dakine","product_name":"DAKINE Heli-Pro 18L Snow Pack - Women's","long_description":"The DAKINE Heli-Pro 18L snow pack does it all! Whether you're chasing powder on the front of the mountain, riding bowls on the backside or just hauling gear around town, this pack can handle it. Snug-fitting design keeps the weight close to your body for balance on uneven terrain and ease on chairlifts. 600-denier polyester fabric is lightweight, durable and water resistant. Straps let you carry your snowboard vertically in a stable, secure manner on the trek to the top. Retractable cable carrying straps hold alpine or backcountry skis; side holster secures your shovel handle or ice axe. Integrated load compression straps steamline your pack and keep bulkiness down. Fleece-lined goggles pocket protects your lenses from getting scratched when not in use. Internal slab pocket with exit port carries a water reservoir (sold separately) for easy hydration on the go. Zippered organizer pocket offers individual sleeves to stash your phone, camera and pens. Non-padded interior sleeve fits most 14 in. laptops for pack use off the slopes. DAKINE Heli-Pro 18L snow pack features a padded hipbelt and a harness contoured to comfortably fit a woman's frame; sternum strap buckle doubles as a rescue whistle.","short_description":"The DAKINE Heli-Pro 18L snow pack does it all! Whether you're chasing powder on the front of the mountain, riding bowls on the backside or just hauling gear around town, this pack can handle it.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s376491.png","image_url":"http://i1.avlws.com/115/l376491.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376491&tt=df","keywords":"day packs","retail_price":"85.00","sale_price":"58.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376491\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376491.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839154&amp;link=&amp;tabs=-Details\"></script>","variants":{"8391540003":{"sku":"8391540003","vendor_sku":"8200110JUL","upc":"610934780734","color":"JULIET","retail_price":"58.83","sale_price":"58.83"}},"categories":["snow","ski-packs-and-bags","ski-packs"]}
