{"sku":"839263","manufacturer_id":"12044/502.1","brand_name":"Scarpa","product_name":"Scarpa Gea RS Randonee Boots - Women's - 2012/2013","long_description":"The downhill-oriented Scarpa Gea RS randonee boots are designed for hard-charging female backcountry skiers. The RS boots are 20% stiffer and only a touch heavier than the original Gea boots. Polyamide shells and Pebax(R) tongues keep the boots light yet stiff for great responsiveness on fast descents. Shell design combines the best of both the overlap and cabrio constructions to allow easy entry/exit, excellent volume control and strong support for downhill performance. Touring-style Intuition Pro Flex RS liners use 100% Ultralon(R) foam for a custom fit; liners offer good range of motion yet provide support with stiff tongues. Tongue-style liners (as opposed to a wrap-style liners) provide easy entry and comfortable flex through the shins when touring. See an REI ski shop professional to have the liners custom molded to your feet to maximize comfort and performance. Boots are compatible with all randonee bindings; tech fittings at the toes accept Dynafit-style bindings. Tech fittings have grooves that make getting into Dynafit-style bindings easy; fitting indicators can be seen from above to help you line the boot toes up with the bindings. 3 magnesium buckles and a Predator RS instep strap on each boot lock your feet in place; instep straps are easy to engage with gloves on. Wide rip-and-stick power straps wrap securely around the outside of the cuffs, distributing pressure and bringing the cuffs as close as possible your lower legs. Rear ski/walk mechanisms free the cuffs for walking comfort; flip the switches to ski mode and you can lock the cuffs at 16deg or 20deg of forward lean. Gea RS boots have a forefoot width of 101mm; women-specific fit includes narrower heels, lower cuffs at the calves and higher insteps than comparable men's boots. Scarpa Gea RS randonee boots feature lugged Vibram soles for good grip while hiking on rock and snow.","short_description":"The downhill-oriented Scarpa Gea RS randonee boots are designed for hard-charging female backcountry skiers. The RS boots are 20% stiffer and only a touch heavier than the original Gea boots.","category":"Skiing","subcategory":"Ski Boots","product_group":"Randonee Ski Boots","thumb_url":"http://i1.avlws.com/115/s452479.png","image_url":"http://i1.avlws.com/115/l452479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=452479&tt=df","retail_price":"699.00","sale_price":"559.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=452479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m452479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839263&amp;link=&amp;tabs=-Details\"></script>","variants":{"8392630001":{"sku":"8392630001","vendor_sku":"12044/502.1","upc":"666898363780","size":"Mondo 23.5","color":"WHITE/BLACK/LIPGLOSS","retail_price":"559.93","sale_price":"559.93"},"8392630002":{"sku":"8392630002","vendor_sku":"12044/502.1","upc":"666898363803","size":"Mondo 24.5","color":"WHITE/BLACK/LIPGLOSS","retail_price":"559.93","sale_price":"559.93"},"8392630004":{"sku":"8392630004","vendor_sku":"12044/502.1","upc":"666898363841","size":"Mondo 26.5","color":"WHITE/BLACK/LIPGLOSS","retail_price":"559.93","sale_price":"559.93"}},"categories":["snow","ski-boots","randonee-ski-boots"]}
