{"sku":"839258","manufacturer_id":"12203/500.2","brand_name":"Scarpa","product_name":" Scarpa TX Pro Telemark Boots - Men's - 2012/2013","long_description":"Rip down the resort or head out on a backcountry tour with the powerful Scarpa TX Pro telemark boots. They're compatible with NTN telemark bindings and Dynafit-style randonee bindings for versatility. 100% Pebax(R) plastic construction provides high stiffness and power without a lot of weight; Pebax plastic maintains a consistent flex in all temperatures. NTN boots do away with the duckbill traditionally found on telemark boots, making walking and scrambling easy; boots are compatible with NTN telemark bindings, sold separately. Boots also feature tech fittings at the toes and heels to allow use with Dynafit-style bindings-that's right, you can ski free- or fixed-heel with the same boots! Custom-thermal-formable Intuition Speed Pro G liners use dual-density foam for great performance, comfort and support. Tongue-style liners (as opposed to a wrap-style liners) provide easy entry and comfortable flex through the shins when touring and making telemark turns. Pull tabs on the tongues and rear top edges of the liners ease entry. Liners can be custom molded to your feet by an REI ski shop professional for the optimal fit. 4 magnesium buckles are strong and light; asymmetric tongues transfer power precisely. Second buckle from the bottom on each boot is designed to secure your foot and heel in place; thicker cable than on previous versions improves durability. Wide rip-and-stick power straps wrap securely around the outside of the cuffs, distributing pressure and bringing the cuffs as close as possible your lower legs. Rear ski/walk mechanisms free the cuffs for walking comfort; flip the switches to ski mode and you can lock the cuffs at 14deg or 20deg of forward lean. Scarpa TX Pro telemark boots feature lugged Vibram soles for good grip while hiking on rock and snow.","short_description":"Rip down the resort or head out on a backcountry tour with the powerful Scarpa TX Pro telemark boots. They're compatible with NTN telemark bindings and Dynafit-style randonee bindings for versatility.","category":"Skiing","subcategory":"Ski Boots","product_group":"Telemark Ski Boots","thumb_url":"http://i1.avlws.com/115/s457043.png","image_url":"http://i1.avlws.com/115/l457043.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457043&tt=df","retail_price":"699.00","sale_price":"699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457043\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457043.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839258&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","telemark-ski-boots"]}
