{"sku":"839262","manufacturer_id":"12041/552.1","brand_name":"Scarpa","product_name":" Scarpa Skadi Randonee Boots - Women's - 2012/2013","long_description":"Fly down backcountry runs and tour back up for more with the women's Scarpa Skadi randonee boots. They are designed for excellent performance on both the dowhill and uphill sections of your tour. Polymer shells and Pebax(R) plastic tongues provide a good balance of stiffness and flexibility for comfort while backcountry skiing. Dual-density V-frame ribs on the cuffs enhance the power of the boots. Skadi boots have a forefoot width of 101mm; women-specific fit includes narrower heels, lower cuffs at the calves and higher insteps than comparable men's boots. Touring-style liners offer good range of motion yet provide support with stiff tongues. Tongue-style liners (as opposed to a wrap-style liners) provide easy entry and comfortable flex through the shins when touring. Cocona(R) lining helps move moisture and reduce odors; Cocona is made with fibers from activated carbon from coconut shells. See an REI ski shop professional to have the liners custom molded to your feet to maximize comfort and performance. Boots are compatible with all randonee bindings; tech fittings at the toes accept Dynafit-style bindings. Tech fittings have grooves that make getting into Dynafit-style bindings easy; fitting indicators can be seen from above to help you line the boot toes up with the bindings. 3 Wiregate buckles and an instep strap on each boot close securely around your feet and legs; clasps hold buckles in place for quick transitions between uphill and downhill. Wide rip-and-stick power straps wrap securely around the outside of the cuffs, distributing pressure and bringing the cuffs as close as possible your lower legs. Rear ski/walk mechanisms free the cuffs for walking comfort; flip the switches to ski mode and you can lock the cuffs at 16deg or 20deg of forward lean. Scarpa Skadi randonee boots feature lugged Vibram soles for good grip while hiking on rock and snow.","short_description":"Fly down backcountry runs and tour back up for more with the women's Scarpa Skadi randonee boots. They are designed for excellent performance on both the dowhill and uphill sections of your tour.","category":"Skiing","subcategory":"Ski Boots","product_group":"Randonee Ski Boots","thumb_url":"http://i1.avlws.com/115/s382715.png","image_url":"http://i1.avlws.com/115/l382715.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382715&tt=df","retail_price":"499.00","sale_price":"399.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382715\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382715.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839262&amp;link=&amp;tabs=-Details\"></script>","variants":{"8392620003":{"sku":"8392620003","vendor_sku":"12041/552.1","upc":"666898258031","size":"Mondo 25.5","color":"ICEFALL TRANSPARENT/SILVE","retail_price":"399.93","sale_price":"399.93"},"8392620004":{"sku":"8392620004","vendor_sku":"12041/552.1","upc":"666898258055","size":"Mondo 26.5","color":"ICEFALL TRANSPARENT/SILVE","retail_price":"399.93","sale_price":"399.93"}},"categories":["snow","ski-boots","randonee-ski-boots"]}
