{"sku":"839393","brand_name":"K2","product_name":"K2 Hurrithane Snowboard Bindings - 2012/2013","long_description":"The K2 Hurrithane snowboard bindings offers park and jib riders the flex and comfort you can only get from urethane highbacks. Padded Tweakback asymmetric highbacks offer smooth side-to-side flex and enhanced heel-side response; tool-free forward lean adjustment. Pro Fusion PC chassis offer a performance flex for advanced riders; they feature tool-free power ramps and multi-position ankle and toe strap mounts. Baseplates feature canted, seamless EVA footbeds with polycarbonate support frames that reduce snow buildup; inward canting improves control and reduces fatigue. Caddi ankle straps feature a contoured 3D shape for free-flexing mobility and durable EVA padding for a cushioned fit; tool-free centering adjustment. Hurrithane bindings feature cored toe straps that save weight and provide a super-snug fit over the toes of your boots; straps offer easy, tool-free adjustment. New MEGA RADchet ratchets feature large aluminum levers for easy operation. These bindings are compatible with Burton The Channel snowboards, disc conversion kit is sold separately.","short_description":"The K2 Hurrithane snowboard bindings offers park and jib riders the flex and comfort you can only get from urethane highbacks.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s461531.png","image_url":"http://i1.avlws.com/115/l461531.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461531&tt=df","retail_price":"179.95","sale_price":"90.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461531\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461531.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839393&amp;link=&amp;tabs=-Details\"></script>","variants":{"8393930002":{"sku":"8393930002","upc":"714636968060","size":"XL","color":"BLUE","retail_price":"90.83","sale_price":"90.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
