{"sku":"839312","manufacturer_id":"12000","brand_name":"Weehoo","product_name":"Weehoo iGo Pro Trailer Bike","long_description":"The Weehoo iGo Pro trailer bike lets kids enjoy the ride and pedal along from a comfortable recumbent position. Lightweight steel frame and adjustable seat sits a child in a recumbent position, placing the child's center of gravity near the ground for a smooth, steady ride. Padded seat freatures a 3-point harness system for safety; hand grips can add sense of security for children or extra leverage for pedaling. Seat easily adjusts forward or backward along frame thanks to a quick-release, secure design, letting you customize the fit for different children. Single-speed drivetrain lets kids pedal along as they please, with a chainring and chainguard providing protection; foot straps help keep feet on pedals. Bring along lunch, extra clothes or toys in the pair of panniers, which sit behind the seat for extra storage. When not needed, the iGo Pro seat is removable, making storage and transportation simple and more compact. Hitch attaches at the seatpost, fitting seat posts with diameters of 25.4, 26.8, 27.2, 30.9 or 31.6mm; cannot be used with carbon fiber seat posts. Recommended rider height on the Weehoo iGo Pro trailer bike is 38 - 52 in., with a maximum weight limit of 65 lbs.","short_description":"The Weehoo iGo Pro trailer bike lets kids enjoy the ride and pedal along from a comfortable recumbent position.","category":"Cycling","subcategory":"Bikes","product_group":"Kids' Bikes","thumb_url":"http://i1.avlws.com/115/s376327.png","image_url":"http://i1.avlws.com/115/l376327.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376327&tt=df","keywords":"trsp123","retail_price":"399.00","sale_price":"399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376327\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376327.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839312&amp;link=&amp;tabs=-Details\"></script>","variants":{"8393120001":{"sku":"8393120001","vendor_sku":"12000","upc":"753182090023","retail_price":"399.00","sale_price":"399.00"}},"categories":["cycling","bikes","kids-bikes"]}
