{"sku":"839464","manufacturer_id":"1231211","brand_name":"Union","product_name":"Union Mini Flite Snowboard Bindings - Kids'","long_description":"The Union Mini Flite kids' bindings are built kid-size and built to last. Freestyle-oriented design provides comfort, support and forgiving flex for stomping the entire mountain. High-quality Union design, materials and construction offer out-of-the-box comfort and a long binding life. Flite bases are super lightweight with a low-profile, freestyle-oriented design; they're made with high-quality DuPont(TM) Zytel(R) ST nylon. Injected, dual-density EVA bushings damp vibrations underfoot, promoting a comfortable ride and smooth, even board flex with no dead spots. Baseplates are designed to be lightweight and strong with the smallest footprint possible; this promotes free, even board flex for sweet response, board control and durability. Extruded aluminum heel cups undergo an anodizing process that further increases their strength by 30%; they'll maintain their shape no matter how much wear and tear they see. Highbacks ride well everywhere on the mountain; a well-rounded freestyle design provides flex where you want it and support and durability where you need it. Quickly adjust forward lean angles to your personal preference. Contoured and padded ankle straps keep feet comfortably locked in; straps adjust without tools. Redesigned toe cups and grippy, multi-position toe straps offer an improved and updated fit for a wider range of boots. Durable, lightweight aluminum buckles. Union Mini Flite bindings are compatible with Burton The Channel snowboards; disc conversion kit is sold separately.","short_description":"The Union Mini Flite kids' bindings are built kid-size and built to last. Freestyle-oriented design provides comfort, support and forgiving flex for stomping the entire mountain.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Kids' Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s267067.png","image_url":"http://i1.avlws.com/115/l267067.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=267067&tt=df","keywords":"jstp7615","retail_price":"109.95","sale_price":"54.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=267067\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m267067.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839464&amp;link=&amp;tabs=-Details\"></script>","variants":{"8394640002":{"sku":"8394640002","vendor_sku":"1231211","upc":"842852102484","size":"Youth","color":"BLACK","retail_price":"54.83","sale_price":"54.83"}},"categories":["snow","snowboard-bindings","kids-snowboard-bindings"]}
