{"sku":"839417","manufacturer_id":"210513","brand_name":"Dalbello","product_name":"Dalbello Mantis 10 Ski Boots - Women's - 2012/2013","long_description":"As you shred down the mountain and lay into turn after turn, the women's Dalbello Mantis 10 ski boots bring confidence-inspiring support to your feet. Dalbello Mantis 10 ski boots perform especially well with both fully cambered and modern rockered skis thanks to an upright cant and cuff angle. Shell features 3 differing densities to enhance performance: rigid outsoles to transfer power, precision mid frame to adapt to feet and soft plastic over instep to ease entry. Women-specific liners precisely fit your feet in 4 key places, enhance warmth and boost cushioning. Cuffs of liners feature a low profile to increase comfort for your calves. Liners are engineered to fit correctly right out of the box, but they can be custom molded as well, a procedure best performed in an REI specialty ski shop. 4 microadjustable aluminum buckles on each boot create a precision fit. 45mm power straps enhance wrap and support of the upper ankles and increase the boots' forward rigidity. Rear spoiler shores up the space behind your calves; spoiler is included with boots in box but not installed. Single canting adjustment fits the cuffs to the angles of your lower legs and levels the soles of the boots above the skis. With a flex index of 85, Dalbello Mantis 10 ski boots offer medium resistance against forward flex, appropriate for most intermediate female skiers. 99mm last provides a close fit and enough comfort to ski all day long.","short_description":"As you shred down the mountain and lay into turn after turn, the women's Dalbello Mantis 10 ski boots bring confidence-inspiring support to your feet.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s461479.png","image_url":"http://i1.avlws.com/115/l461479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461479&tt=df","retail_price":"449.95","sale_price":"269.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839417&amp;link=&amp;tabs=-Details\"></script>","variants":{"8394170001":{"sku":"8394170001","vendor_sku":"210513","upc":"616438207296","size":"Mondo 23.5","color":"SAPPHIRE BLUE/WHITE","retail_price":"269.83","sale_price":"269.83"},"8394170004":{"sku":"8394170004","vendor_sku":"210513","upc":"616438207357","size":"Mondo 26.5","color":"SAPPHIRE BLUE/WHITE","retail_price":"269.83","sale_price":"269.83"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
