{"sku":"839434","brand_name":"Rossignol","product_name":"Rossignol Vita Sensor2 70 Ski Boots - Women's - 2012/2013","long_description":"The Rossignol Vita Sensor2 70 ski boots will take you from tentative turns to confident shredding. Shell of the Vita Sensor2 70 is designed to enhance balance through direct contact with your big toe, little toe and heel. Stiff polycarbonate inserts under big toe, little toe and heel work with the shell to transfer energy to skis. Notches in the plastic along the instep create an active hinge system that makes it easy to get your foot in the boot. Women-specific liners are designed with a lower cuff than men's boots to accommodate women's calf muscles; liners are scallop-shaped in back to ensure a comfortable fit. Rossignol Vita Sensor2 70 liners address the common fit issues of cramped toes, pressure on the insteps and pressure on forefeet. 1-piece toe box and tongue eliminates seams and overlaps in the tongue attachment area, reducing pressure points at top of the toes. Foam padding in the liners resists packing out; smooth contours and an anatomic fit eliminates pressure points in forefeet. Specially designed insteps provide excellent midfoot fit, resulting in heightened responsiveness, increased circulation and greater warmth. Soft padding securely holds ankles and heels in place; liners are outfitted with plush, velvety material. Wool toe boxes help retain heat in your toes. Custom-formable liners can be heated in a specialty ski shop to achieve a personalized fit. 4 buckles feature a diagonal pull design that sets the foot securely into the heel pocket and enhances shell wrap. Buckles are microadjustable for an accurate fit; top 2 buckle catches provide 22mm of adjustability. Power strap serves as a fifth buckle, allowing you to set the firmness around the upper ankle as you prefer for comfort or performance. With a 70 flex index, Rossignol Vita Sensor2 70 ski boots provide light resistance against a forward lean, appropriate for most progressing skiers.","short_description":"The Rossignol Vita Sensor2 70 ski boots will take you from tentative turns to confident shredding.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s461499.png","image_url":"http://i1.avlws.com/115/l461499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461499&tt=df","retail_price":"349.95","sale_price":"209.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839434&amp;link=&amp;tabs=-Details\"></script>","variants":{"8394340001":{"sku":"8394340001","size":"Mondo 23.5","color":"SNOW WHITE","retail_price":"209.93","sale_price":"209.93"},"8394340002":{"sku":"8394340002","size":"Mondo 24.5","color":"SNOW WHITE","retail_price":"209.93","sale_price":"209.93"},"8394340003":{"sku":"8394340003","size":"Mondo 25.5","color":"SNOW WHITE","retail_price":"209.93","sale_price":"209.93"},"8394340004":{"sku":"8394340004","size":"Mondo 26.5","color":"SNOW WHITE","retail_price":"209.93","sale_price":"209.93"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
