{"sku":"839438","manufacturer_id":"61209-0105-24.5","brand_name":"Dynafit","product_name":" Dynafit One U-TF Randonee Boots - Women's - 2012/2013","long_description":"The lightweight women's Dynafit One U-TF randonee boots balance a progressive flex with great walkability so you can ski those steep backcountry lines you've always dreamed about. Polyurethane shells and cuffs offer similar performance to the popular TLT5 Mountain boots, but are a touch wider in the forefoot for a more comfortable fit. Women-specific cuff design is lower and wider than the men's version to better accommodate the shape of women's lower legs. Expanded polyurethane insulation layer is glued to the insides of the shells to help keep your feet warm on frigid winter days. Compact shells with rockered soles provide excellent walkability and nimbleness when you're booting up steep snow slopes or scrambling rocky ridges. Lightweight women-specific liners are premolded on anatomic lasts for use right out of the box; or, have the liners custom molded to your feet by a qualified ski shop employee. Opening the Ultra-Lock magnesium cuff buckles simultaneously changes the boots from ski to walk mode for fast, effortless transitions. Central magnesium buckles are positioned exactly on the shell pivot points to keep your heels in place when you're skinning uphill and skiing back down. Cuff and central buckles are designed with a retention system to prevent unwanted release. Ski/walk mechanisms can be set between 15deg and 18deg of forward lean, as well as loosened for walking. Flexible tongue design doesn't interfere with the cuff rotation for comfort when touring. Power straps help close the boots securely around your legs. Dynafit One U-TF randonee boots have self-guiding notches located at the inserts at the toes of the boots to ease stepping into Dynafit bindings.","short_description":"The lightweight women's Dynafit One U-TF randonee boots balance a progressive flex with great walkability so you can ski those steep backcountry lines you've always dreamed about.","category":"Skiing","subcategory":"Ski Boots","product_group":"Randonee Ski Boots","thumb_url":"http://i1.avlws.com/115/s456463.png","image_url":"http://i1.avlws.com/115/l456463.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456463&tt=df","retail_price":"549.95","sale_price":"439.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456463\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456463.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839438&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
