{"sku":"839424","manufacturer_id":"48369-9252-158","brand_name":"Dynafit","product_name":" Dynafit Baltoro Randonee Skis - Women's - 2012/2013","long_description":"Explore glaciers, couloirs and powder-filled glades with the light and versatile Dynafit Baltoro skis. Ultralight paulownia wood cores combine with rockered tips to keep the skis light and exceptionally smooth on every turn. Biaxial prepreg fiberglass and carbon layers above and below the core provide good torsional stiffness and lateral reinforcement without weighing the skis down. Dual radius sidecut, featuring a tight radius toward the front and a wide radius in the waist, allows both quick turn initiation and large turns at high speeds. Patented titanal Dynafit Ski Insert System eliminates the need to drill your ski for Dynafit bindings (sold separately) and creates excellent ski-to-binding holding strength. Patented SpeedSkinFix attachment system securely attaches Dynafit skins (sold separately) to skis. SpeedSkinFix system does not interfere with the attachment of other brands of skins that feature a tip loop and tail clip. Dynafit Baltoro skis have a sintered graphite coating on the bases that enhances glide and improves wax retention. Base or topsheet color may vary from online photo.","short_description":"Explore glaciers, couloirs and powder-filled glades with the light and versatile Dynafit Baltoro skis.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s381779.png","image_url":"http://i1.avlws.com/115/l381779.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381779&tt=df","retail_price":"599.95","sale_price":"479.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381779\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381779.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839424&amp;link=&amp;tabs=-Details\"></script>","variants":{"8394240004":{"sku":"8394240004","vendor_sku":"48369-9252-158","size":"158 CM","color":"WHITE/ORANGE","retail_price":"479.93","sale_price":"479.93"}}}
