{"sku":"839495","manufacturer_id":"12211/502.2","brand_name":"Scarpa","product_name":" Scarpa T2 Eco Telemark Boots - Women's - 2012/2013","long_description":"Drop a knee down steep terrain with the iconic Scarpa T2 Eco telemark boots. Triple-density shells and comfortable Intuition liners give you the support you need for long backcountry tours. Features Pebax Rnew(R) plastic that is made from castor plant oil rather than petroleum as most plastics are. Pebax Rnew performs exceptionally well across a wide range of temperatures, ensuring consistent flex, strength and stability. Intuition Performance Flex G liners blend high-density and regular-density Ultralon(R) foam for a great mix of performance, comfort and support; women-specific fit. Tongue-style liners (as opposed to a wrap-style liners) provide easy entry; back flex areas improve comfort when touring. Custom thermal-formable liners are lightweight and toasty warm; liners can be custom molded to your feett by an REI ski shop professional. 3 buckles on each boot are microadjustable to just the right snugness; instep buckle is positioned to provide excellent heel hold for touring up and skiing down. Replaceable edge guards protect boots' bellows from sharp ski edges while also dispersing buckle pressure; boots come with an extra set of edge guards. Dynamic Active Power Strap acts as a fourth buckle and provides excellent responsiveness on the slopes. Ski/walk mechanisms lock and release the cuffs for downhill peformance and free-flex touring comfort; forward lean can be set at 16deg and 19deg. Scarpa T2 Eco telemark boots have adjustable canting mechanisms that allows you to customize cuff alignment to your leg shape. Durable Vibram Print lugged soles grip well when hiking; designed specifically for telemark skiing, soles provide a solid interface with 75mm telemark bindings.","short_description":"Drop a knee down steep terrain with the iconic Scarpa T2 Eco telemark boots. Triple-density shells and comfortable Intuition liners give you the support you need for long backcountry tours.","category":"Skiing","subcategory":"Ski Boots","product_group":"Telemark Ski Boots","thumb_url":"http://i1.avlws.com/115/s442615.png","image_url":"http://i1.avlws.com/115/l442615.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442615&tt=df","retail_price":"599.00","sale_price":"599.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442615\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442615.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839495&amp;link=&amp;tabs=-Details\"></script>","variants":{"8394950002":{"sku":"8394950002","vendor_sku":"12211/502.2","upc":"666898364268","size":"Mondo 24.5","color":"OLYMPIC/LIGHT GREY","retail_price":"599.00","sale_price":"599.00"},"8394950003":{"sku":"8394950003","vendor_sku":"12211/502.2","upc":"666898364282","size":"Mondo 25.5","color":"OLYMPIC/LIGHT GREY","retail_price":"599.00","sale_price":"599.00"}},"categories":["snow","ski-boots","telemark-ski-boots"]}
