{"sku":"839411","manufacturer_id":"201551","brand_name":"Dalbello","product_name":"Dalbello KR Two Core Ski Boots - Men's - 2012/2013","long_description":"Responsive and smooth, the Dalbello KR Two Core ski boots offer the precision to romp down the mountain with ease. Completely redesigned boot mold enhances power, precision and comfort by matching 4 critical fit points on your feet. Offering a precise foothold and a progressive forward flex, 3-piece shell optimizes responsiveness for today's relatively short, wide skis. Separate cuff, shell and tongue sections are joined together to create a smooth forward flex with precise side-to-side support. Enhancing side-to-side response and providing a snugger wrap, bi-injected cuffs feature stiff plastic on sides and soft plastic on the strap that wraps around shins. The Dalbello KR Two Core ski boots perform especially well with both fully cambered and modern rockered skis thanks to an upright cant and cuff angle. Medium flex tongues enhance responsiveness, control and sensitivity to skis and snow surface. Liners feature soft comfort foam around the rearfoot areas and tongues, and the toe boxes stretch to enhance comfort and fit. Liners are engineered to fit correctly right out of the box, but they can be custom formed as well, a procedure best performed in an REI specialty ski shop. For further information please contact your REI specialty ski shop. Cable instep buckle on each boot minimizes foot sliding, heel lift and shell distortion while flexing, and a specialized adjustment fine-tunes the cable tension. 3 microadjustable aluminum buckles on each boot create a precision fit; inverted bottom buckles won't come loose from contact with snow. Power straps lock in the cuffs and increase support. Twin canting adjusts the cuffs to fit the angles of your lower legs, levels the soles of the boots above the skis and offers a versatile range of adjustment.","short_description":"Responsive and smooth, the Dalbello KR Two Core ski boots offer the precision to romp down the mountain with ease.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s461475.png","image_url":"http://i1.avlws.com/115/l461475.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461475&tt=df","retail_price":"499.95","sale_price":"349.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461475\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461475.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839411&amp;link=&amp;tabs=-Details\"></script>","variants":{"8394110002":{"sku":"8394110002","vendor_sku":"201551","upc":"616438216137","size":"Mondo 26.5","color":"BLACK/ANTHRACITE","retail_price":"349.83","sale_price":"349.83"},"8394110005":{"sku":"8394110005","vendor_sku":"201551","upc":"616438216199","size":"Mondo 29.5","color":"BLACK/ANTHRACITE","retail_price":"349.83","sale_price":"349.83"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
