{"sku":"839470","brand_name":"Tecnica","product_name":" Tecnica Phoenix Max 12 Ski Boots - Women's - 2012/2013","long_description":"With inflatable chambers that personalize the fit, the Tecnica Phoenix Max 12 women's ski boots enhance your comfort on the mountain. Tecnica Phoenix Max 12 Air Shell ski boots are specifically designed with a narrow heel pocket and a wide forefoot to ensure a comfortable, women-specific fit. As durable as they are innovative, inflatable fit zones provide an instantaneous, personalized fit. Boosting insulation and hold, inflation zones personalize the fit in your heel and ankle. Inflate and deflate buttons are located at the rear of the boot. Soft material in the shape of a V on the upper sides of the collar adapt to a wide range of lower leg shapes, and a flared liner collar increases room for the calf muscle. Custom-moldable, women-specific liners offer superior heel hold and foot envelopment; materials enhance fit, performance and comfort. Velvet faux-fur lining dries quickly and increases comfort and warmth. 3-buckle closure features a versatile range of adjustment, and a specially designed cuff catch features a comfortable position used for walking. Cuff alignment matches the angle of the cuff with the shape of the lower leg, increasing comfort and performance. 2-position flex adjustment device works in conjunction with a modified hinge point and a specialized spine to personalize the rebound flex of the boot. Flex index of 90 responds quickly in a forward lean without the heavy back pressure that leads to early fatigue: it's perfect for progressing intermediate skiers.","short_description":"With inflatable chambers that personalize the fit, the Tecnica Phoenix Max 12 women's ski boots enhance your comfort on the mountain.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382455.png","image_url":"http://i1.avlws.com/115/l382455.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382455&tt=df","retail_price":"399.95","sale_price":"239.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382455\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382455.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839470&amp;link=&amp;tabs=-Details\"></script>","variants":{"8394700001":{"sku":"8394700001","upc":"885315263155","size":"Mondo 23.5","color":"TRANSPARENT AZURE/WHITE","retail_price":"239.83","sale_price":"239.83"},"8394700002":{"sku":"8394700002","upc":"885315263179","size":"Mondo 24.5","color":"TRANSPARENT AZURE/WHITE","retail_price":"239.83","sale_price":"239.83"},"8394700004":{"sku":"8394700004","upc":"885315263216","size":"Mondo 26.5","color":"TRANSPARENT AZURE/WHITE","retail_price":"239.83","sale_price":"239.83"}}}
