{"sku":"839522","brand_name":"Burton","product_name":"Burton Stiletto EST Snowboard Bindings - Women's - 2012/2013","long_description":"The Burton Stiletto EST snowboard bindings provides endless stance adjustability and enhanced board feel and control. Women-specific True Fit(TM) Design creates boots and bindings specifically for the way a woman rides, ensuring complete control, total power and ultimate fun. Ergonomically-canted, cored highbacks eliminate hardware to save weight; forward lean and highback rotation adjust independently of each other for a precise fit. Highbacks rotate side to side to follow the natural contours of your calves, optimizing power and comfort; forward lean adjusts quickly and easily without a tool. Highbacks feature over-the-top padding for extra cushioning that won't bite your calf. Lush ankle straps and premium toe straps lock you into the bindings; precurved and padded, they feature telescoping and multilocation adjustability. Primo capstrap toe straps feature a 3D, curved fit; built-in grip keeps straps in place. Tool-free telescoping straps adjust in seconds. Stilletto bindings feature smooth-gliding buckles that close and release quickly, are easy to grab and provide many seasons of premium ratcheting power. Single-component, lightweight-yet-tough, composite baseplates provide moderate flex and consistent response for a versatile ride on all terrain. Removable ShredBED(TM) 2.0 footbed system protects against impacts while still allowing great board feel; stance indicator window allows easy mounting and adjustment. 2012 Stilleto EST bindings will fit 2011 through 2013 Channel Boards with the included black hardware.","short_description":"The Burton Stiletto EST snowboard bindings provides endless stance adjustability and enhanced board feel and control.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s461535.png","image_url":"http://i1.avlws.com/115/l461535.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461535&tt=df","retail_price":"189.95","sale_price":"93.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461535\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461535.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839522&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
