{"sku":"839640","manufacturer_id":"BD1121360000100","brand_name":"Black Diamond","product_name":" Black Diamond Distance Z-Pole Trekking Poles - Pair","long_description":"The Black Diamond Distance Z-Pole trekking poles have a light and versatile folding design that is ideal for day hikers, trail runners and backpackers. Innovative folding Z-Pole system offers simple, compact and reliable support with a concealed inner cord, single push-button release and speed cone deployment. Inspired by snow probes, speed cones at the end of each pole section ensure strength, stability and superfast deployment; each speed cone guides a pole section into place. A quick pull on the grip and the first pole section snaps and locks the 3 pole sections into place; flexible tube ends protect the Kevlar(R) center cord when folded. Easily replace and solidly secure pole tips with WaveLock(TM) tip connections. Right- and left-hand-specific straps are light, breathable and moisture-wicking; they feature breathable cut-out windows and easy rip-and-stick adjustability. Light, nonslip EVA foam grips feature foam extensions that allow poles to be held low during short side hill traverses. Strong aluminum shafts stand up to everyday use on the trail. Pole baskets feature shaft catchers to secure pole sections when folded. Black Diamond Distance Z-Pole trekking poles come with interchangeable, nonmarking rubber tips, carbide tips and a stow bag. Note: these three-season poles feature fixed baskets.","short_description":"The Black Diamond Distance Z-Pole trekking poles have a light and versatile folding design that is ideal for day hikers, trail runners and backpackers.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Trekking Poles And Hiking Staffs","thumb_url":"http://i1.avlws.com/115/s418807.png","image_url":"http://i1.avlws.com/115/l418807.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418807&tt=df","keywords":"collapsible","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418807\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418807.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839640&amp;link=&amp;tabs=-Details\"></script>","variants":{"8396400002":{"sku":"8396400002","vendor_sku":"BD1121360000110","upc":"793661175261","size":"110 CM","color":"BLUE","retail_price":"99.95","sale_price":"99.95"},"8396400003":{"sku":"8396400003","vendor_sku":"BD1121360000120","upc":"793661175278","size":"120 CM","color":"BLUE","retail_price":"99.95","sale_price":"99.95"},"8396400004":{"sku":"8396400004","vendor_sku":"BD1121360000130","upc":"793661175285","size":"130 CM","color":"BLUE","retail_price":"99.95","sale_price":"99.95"}}}
