{"sku":"839660","manufacturer_id":"BD1121410000ALL","brand_name":"Black Diamond","product_name":" Black Diamond Alpine Carbon Cork Trekking Poles - Pair","long_description":"The Black Diamond Alpine Carbon Cork trekking poles add support, stability and effortless swing to your wilderness forays, with 3 vibration-absorbing carbon fiber sections and natural cork grips. 3 sections of carbon fiber create lightweight poles that absorb vibration and retain strength over a wide temperature range. Double FlickLock Pro adjusters allow easy, slip-proof adjustment and won't accidentally loosen like conventional \"twist\" type adjusters. FlickLock Pro is 20% smaller and 30% easier to open than its predecessor and offers twice the holding force. Natural cork grips with dual-density top knobs fit comfortably in your hands. Adjustable nubuck leather webbing wrist loops support wrists. Foam extensions beneath the top grips allow the hiker to drop the uphill hand lower on the shaft while traversing steep terrain. Poles feature interchangeable carbide tips and low-profile trekking baskets; baskets' small size reduces weight and snagging. The Black Diamond Alpine Carbon Cork trekking poles include powder baskets for use in the snow.","short_description":"The Black Diamond Alpine Carbon Cork trekking poles add support, stability and effortless swing to your wilderness forays, with 3 vibration-absorbing carbon fiber sections and natural cork grips.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Trekking Poles And Hiking Staffs","thumb_url":"http://i1.avlws.com/115/s418823.png","image_url":"http://i1.avlws.com/115/l418823.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418823&tt=df","keywords":"collapsible","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418823\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418823.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839660&amp;link=&amp;tabs=-Details\"></script>","variants":{"8396600001":{"sku":"8396600001","vendor_sku":"BD1121410000ALL","upc":"793661175384","color":"BLACK","retail_price":"159.95","sale_price":"159.95"}}}
