{"sku":"839653","manufacturer_id":"BD1121380000110","brand_name":"Black Diamond","product_name":"Black Diamond Distance FL Z-Pole Trekking Poles - Pair","long_description":"The Black Diamond Distance FL Z-Pole trekking poles combine a folding design with FlickLock Pro adjustability, offering incredibly light weight and support for backpacking and stream crossings. Innovative folding Z-Pole system offers simple, compact and reliable support with a concealed inner cord, single push-button release and speed cone deployment. FlickLock Pro is 20% smaller and 30% easier to open than its predecessor and offers twice the holding force. Inspired by snow probes, speed cones at the end of each pole section ensure strength, stability and super fast deployment; each speed cone guides a pole section into place. A quick pull on the grip, and the first pole section snaps and locks the 3 pole sections into place; flexible tube ends protect the Kevlar(R) center cord when folded. Easily replace and solidly secure pole tips with WaveLock(TM) tip connections. Right- and left-hand-specific straps are light, breathable and moisture-wicking; they feature breathable cutout windows and easy rip-and-stick adjustability. Light, non-slip EVA foam grips feature foam extensions that allow poles to be held low during short side hill traverses. Single FlickLock(R) near the grip of each pole offers 8 in. of adjustable length. Aluminum shafts are superlight and durable. Pole baskets feature shaft catchers to secure pole sections when folded. Black Diamond Distance FL Z-Pole trekking poles come with interchangeable, nonmarking rubber tips, carbide tips and a stow bag. Note: these three-season poles feature fixed baskets.","short_description":"The Black Diamond Distance FL Z-Pole trekking poles combine a folding design with FlickLock Pro adjustability, offering incredibly light weight and support for backpacking and stream crossings.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Trekking Poles And Hiking Staffs","thumb_url":"http://i1.avlws.com/115/s418819.png","image_url":"http://i1.avlws.com/115/l418819.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418819&tt=df","keywords":"collapsible","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418819\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418819.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839653&amp;link=&amp;tabs=-Details\"></script>","variants":{"8396530001":{"sku":"8396530001","vendor_sku":"BD1121380000110","upc":"793661175339","size":"95 CM-110 CM","color":"BLUE/GRAY","retail_price":"129.95","sale_price":"129.95"},"8396530002":{"sku":"8396530002","vendor_sku":"BD1121380000125","upc":"793661175346","size":"105 CM-125 CM","color":"BLUE/GRAY","retail_price":"129.95","sale_price":"129.95"},"8396530003":{"sku":"8396530003","vendor_sku":"BD1121380000140","upc":"793661175353","size":"120 CM-140 CM","color":"BLUE/GRAY","retail_price":"129.95","sale_price":"129.95"}},"categories":["camping-hiking","gadgets","trekking-poles-and-hiking-staffs"]}
