{"sku":"839774","manufacturer_id":"QUAD7-BK","brand_name":"Princeton Tec","product_name":" Princeton Tec Quad Headlamp","long_description":"The Princeton Tec Quad Headlamp brings simplicity and versatility to your adventures. It's a great choice for nighttime trail running and general use around camp. 4 LEDs operate in high, medium, low and flashing modes; suitable for use around a campsite or for signalling from a distance. LEDs output 78 lumens on high and throw a beam up to 50m; illuminate objects up to 30m away on medium and 19m away on low. Single strap fits easily over hats and lets you read in comfort in your sleeping bag without a battery pack pressing against the back of your head. Single switch atop the headlamp is easily located and operated; pivoting headlamp lets you point the beam where you prefer. 3 AAA alkaline batteries (included) provide 31 hrs. of regulated light on low, 10 hrs. on medium and 1 hr. on high. Regulated output maintains consistent light output over the lifetime of the batteries. Features a low-battery indicator. Rugged construction withstands inclement weather and drops onto concrete; headlamp is waterproof to 1m. Princeton Tec Quad can operate on lithium AAA batteries (sold separately) for great cold-weather performance and a reduction in weight.","short_description":"The Princeton Tec Quad Headlamp brings simplicity and versatility to your adventures. It's a great choice for nighttime trail running and general use around camp.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417115.png","image_url":"http://i1.avlws.com/115/l417115.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417115&tt=df","retail_price":"32.95","sale_price":"32.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417115\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417115.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839774&amp;link=&amp;tabs=-Details\"></script>","variants":{"8397740002":{"sku":"8397740002","vendor_sku":"QUAD7-BK","upc":"795626019337","color":"BLACK","retail_price":"32.95","sale_price":"32.95"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
