{"sku":"839943","manufacturer_id":"AE5006460245","brand_name":"Atomic","product_name":" Atomic Live Fit 80 W Ski Boots - Women's - 2012/2013","long_description":"Featuring an innovative, adaptable shell, the Atomic Life Fit 80 W ski boots offer enough performance to ensure a fun day on the mountain. Bi-component shell features specialized flex zones that adapt instantly to the shape of your foot. Located between the first buckle and the toe, these zones feature soft plastic that improves balance, circulation, warmth and sensitivity. Liners feature differing materials on the left and right; firm material helps you feel the terrain on inside of turn and soft material cushions recovery. Women-specific, custom-moldable liners feature very warm faux fur to enhance comfort. Collars feature 4-way stretch materials that instantly provide up to 10mm of space for the lower calf. Still feeling the pinch? Cuff can be lowered by 10mm and circumference increased by 8mm. Custom-moldable liners form to ankles to enhance foot hold in boots. Toe boxes with 4-way stretch reduce hot spots and increase comfort. Foot-wrapping, 2 buckle design makes it simple to get your feet into boots, and a 35mm powerstraps act as a third buckle. Cushioning footbeds offer furnacelike warmth and cloudlike softness. Grip plates use dual-density material to increase traction on slippery terrain. Flex index of 80 offers the comfortable performance preferred by intermediate skiers. The Atomic Live Fit W ski boots feature 102 - 106mm wide footbeds.","short_description":"Featuring an innovative, adaptable shell, the Atomic Life Fit 80 W ski boots offer enough performance to ensure a fun day on the mountain.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s452011.png","image_url":"http://i1.avlws.com/115/l452011.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=452011&tt=df","retail_price":"299.00","sale_price":"199.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=452011\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m452011.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839943&amp;link=&amp;tabs=-Details\"></script>","variants":{"8399430001":{"sku":"8399430001","vendor_sku":"AE5006460235","upc":"884397647914","size":"Mondo 23.5","color":"BLACK TRANSPARENT/GLANZ G","retail_price":"199.83","sale_price":"199.83"}}}
