{"sku":"839949","manufacturer_id":"FC2A004","brand_name":"Look","product_name":" Look Pivot 14 XXL Downhill Ski Bindings","long_description":"The Look Pivot 14 XXL bindings are designed to enhance your performance, increase your safety and create an unparalleled connection with your skis. Why settle for less?. Remember last year when you hit a small bump, your ski randomly popped off, and you went down like a freight train?. To prevent such mishaps, Look has engineered key features into the binding to reduce premature release, the most innovative of which is a rotating heelpiece. Look calls it the Turntable heel, and it rotates with the boot directly under your tibia, creating consistent and reliable release. Pivot also features 40mm of elastic travel at the toe and 25mm at the heel which absorbs shock and allows a lower setting of release values. Look has reduced the space between where the heelpiece and toepiece are mounted on the ski, increasing responsiveness. 3 contact points between the bindings and the heels ensure effective power transfer. 72mm anti-friction device increases leverage and control, especially on wide skis. 117mm brake fits most all-mountain wide and some powder skis.","short_description":"The Look Pivot 14 XXL bindings are designed to enhance your performance, increase your safety and create an unparalleled connection with your skis. Why settle for less?.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Downhill Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381547.png","image_url":"http://i1.avlws.com/115/l381547.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381547&tt=df","retail_price":"299.95","sale_price":"209.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381547\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381547.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839949&amp;link=&amp;tabs=-Details\"></script>","variants":{"8399490001":{"sku":"8399490001","vendor_sku":"FC2A004","color":"KIWI GREEN","retail_price":"209.93","sale_price":"209.93"}}}
