{"sku":"839946","brand_name":"Blizzard","product_name":" Blizzard Bodacious Skis - Men's - 2012/2013","long_description":"Find the deepest, freshest powder and charge in with the fully rockered Blizzard Bodacious skis. Although you can get back to the lifts on groomed runs with ease, the Blizzard Bodacious skis were made for deep powder snow. Wood core is constructed like a sandwich, layers upon layers of CNC-milled strips reinforce each other to create a lightweight, snappy ski with smooth and easy handling. Fully rockered skis are constructed using a specialized technique called Flipcore that maximizes the natural flex of the ski materials. Instead of putting a ski together with standard camber and then pressing it into a rockered shape, Blizzard builds the skis into the finished shape before it is pressed. The standard shape of a cambered wood core is \"flipped\" upside down to naturally match the rockered shape of the finished skis. This results in equal and consistent pressure during construction and a noticeable difference how the skis perform on hard snow. In brief, Flipcore rocker reduces the floppiness and chatter of skis on hard snow at high speeds and enhances the skis performance in soft snow. Dual titanium laminate increases snappiness and power underfoot. Sidewalls offer direct power transmission, resulting in quick side-to-side response. Requires bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"Find the deepest, freshest powder and charge in with the fully rockered Blizzard Bodacious skis.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s381931.png","image_url":"http://i1.avlws.com/115/l381931.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381931&tt=df","retail_price":"799.95","sale_price":"559.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381931\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381931.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=839946&amp;link=&amp;tabs=-Details\"></script>","variants":{"8399460001":{"sku":"8399460001","upc":"885315166999","size":"176 CM","color":"RED","retail_price":"559.83","sale_price":"559.83"},"8399460002":{"sku":"8399460002","upc":"885315167002","size":"186 CM","color":"RED","retail_price":"559.83","sale_price":"559.83"},"8399460003":{"sku":"8399460003","upc":"885315167019","size":"196 CM","color":"RED","retail_price":"559.83","sale_price":"559.83"}}}
