{"sku":"840008","manufacturer_id":"BD620600MTBKALL","brand_name":"Black Diamond","product_name":" Black Diamond ReVolt Headlamp","long_description":"The sophisticated Black Diamond ReVolt headlamp has a bright, powerful beam that lights up the night, and it can operate on alkaline or rechargeable NiMH batteries (both are included). Pop the NiMH batteries in the ReVolt, connect the included micro USB cable and start charging from any USB power source, such as a solar panel, laptop or car power port. ReVolt also accepts non-rechargeable AAA batteries, so if you're on a mountain without a way to recharge, you can throw in your backup alkaline batteries and you're good to go. Headlamp features a TriplePower LED that outputs up to 110 lumens and throws a beam up to 70m when powered by AAA alkaline batteries. TriplePower LED outputs 90 lumens and illuminates objects up to 66m away when powered by AAA NiMH rechargeable batteries. 2 SinglePower white LEDs and 2 SinglePower red LEDs output 25 lumens and throw a beam up to 9m with alkaline batteries and 8m with NiMH batteries. Dimmer switch lets you choose the light output needed for the task at hand, from a blazing 110 lumens down to 4 lumens. Use the red LEDs to preserve night vision while hanging out at camp or making your way down the trail; red light mode activates without having to cycle through white mode. Use the strobe function to flash red or white light to signal for help. 3-level power meter shows how much battery life is remaining. Alkaline batteries provide up to 70 hrs. of use with the TriplePower LED on high and 300 hrs. with the TriplePower LED on low. NiMH batteries provide up to 12 hrs. of use with the TriplePower LED on high and 190 hrs. with the TriplePower LED on low. Recharge the NiMH batteries without removing them from the headlamp; simply plug the included USB cable into the headlamp and a USB power source. Lock mode prevents the Black Diamond ReVolt headlamp from accidentally being turned on while in your backpack.","short_description":"The sophisticated Black Diamond ReVolt headlamp has a bright, powerful beam that lights up the night, and it can operate on alkaline or rechargeable NiMH batteries (both are included).","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417123.png","image_url":"http://i1.avlws.com/115/l417123.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417123&tt=df","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417123\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417123.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=840008&amp;link=&amp;tabs=-Details\"></script>","variants":{"8400080001":{"sku":"8400080001","vendor_sku":"620600","upc":"793661175421","color":"METALLIC CITRON","retail_price":"59.95","sale_price":"59.95"},"8400080002":{"sku":"8400080002","vendor_sku":"620600","upc":"793661175452","color":"ULTRA WHITE","retail_price":"59.95","sale_price":"59.95"},"8400080003":{"sku":"8400080003","vendor_sku":"620600","upc":"793661175445","color":"TITANIUM","retail_price":"59.95","sale_price":"59.95"},"8400080004":{"sku":"8400080004","vendor_sku":"BD620600MTBKALL","upc":"793661175438","color":"MATTE BLACK","retail_price":"59.95","sale_price":"59.95"}}}
