{"sku":"840520","manufacturer_id":"326015","brand_name":"Salomon","product_name":" Salomon Impact 90 Ski Boots - Mens - 2012/2013","long_description":"As you explore the mountain and enjoy the experience, the Salomon Impact 90 ski boots balance comfort with high-speed performance. Thin and precise thickness of the shell creates a light boot that optimizes fit, performance and energy transmission. Comfortable liners feature a layer of custom-moldable foam that personalizes the fit around the shin. Neoprene toe boxes absorb shock and increase insulation, and extra-wide cuff openings make it easy to get your feet in the boots. Loops on tongues make it easy to put the boots on. Microadjustable titanium buckles shave weight off the boots and provide performance-enhancing stiffness. 35mm straps enhance wrap and support along upper ankles and increase the boots' forward rigidity. Single canting sets cuffs to different forward lean angles depending on how aggressively you ski. Salomon Impact 90 ski boots feature a flex index of 90 that provides the medium flex preferred by progressing intermediate skiers. 100mm last envelops the foot with an anatomic fit, so every bit of control pressure is transferred to the ski.","short_description":"As you explore the mountain and enjoy the experience, the Salomon Impact 90 ski boots balance comfort with high-speed performance.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s451491.png","image_url":"http://i1.avlws.com/115/l451491.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451491&tt=df","retail_price":"349.95","sale_price":"209.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451491\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451491.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=840520&amp;link=&amp;tabs=-Details\"></script>","variants":{"8405200001":{"sku":"8405200001","vendor_sku":"326015","upc":"080694137060","size":"Mondo 26.5","color":"BLACK/CRYSTAL TRANSLUCENT","retail_price":"209.83","sale_price":"209.83"}}}
