{"sku":"840522","manufacturer_id":"325981","brand_name":"Salomon","product_name":" Salomon Quest 120 Ski Boots - Men's - 2012/2013","long_description":"Comfortable during the hike and powerful on the descent, the Salomon Quest 120 ski boots help you access the best part of the resort. Specialized ski/hike mechanism frees the upper cuff from the lower part of the boot and offers enough movement to comfortably hike to untouched stashes. When you're ready to ski, the cuffs lock directly into the lower shells to maximize power transmission on the descent. Innovative V-shaped lower shells and magnesium backbones virtually eliminate flex when backbones are engaged. Waterproof fabric along the sides of the tongues helps keep feet dry, even when hiking in deep powder. Customfit Pro liners conform under feet, over insteps and around toes, heels, Achilles and shins for superior foothold. Liners may be custom molded to enhance fit. Moisture-wicking layers of mesh, foam and insulation in liners efficiently transfer chilling sweat away from feet. Liners disperse more moisture than standard liners, helping keep feet dry and warm. Quicklace liner system creates an even pressure distribution around foot, and neoprene toe boxes absorb shock and increases insulation. Cushioning in the tongues reduces shin bang, and closed-cell foam under boot boards softens hard landings. Adjustable spoiler features 3 positions to personalize the fit around your calves and increase forward lean. Single canting sets cuffs to a different forward lean angles depending on how aggressively you ski. Rubber soles offer excellent traction on slippery surfaces. With a flex index of 120, Salomon Quest 120 ski boots provide the responsive power transfer preferred by expert skiers.","short_description":"Comfortable during the hike and powerful on the descent, the Salomon Quest 120 ski boots help you access the best part of the resort.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382467.png","image_url":"http://i1.avlws.com/115/l382467.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382467&tt=df","retail_price":"549.95","sale_price":"439.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382467\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382467.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=840522&amp;link=&amp;tabs=-Details\"></script>","variants":{"8405220001":{"sku":"8405220001","vendor_sku":"325981","upc":"080694056811","size":"Mondo 26.5","color":"CRYSTAL TRANSLUCENT/BLACK","retail_price":"439.93","sale_price":"439.93"},"8405220002":{"sku":"8405220002","vendor_sku":"325981","upc":"080694056835","size":"Mondo 27.5","color":"CRYSTAL TRANSLUCENT/BLACK","retail_price":"439.93","sale_price":"439.93"},"8405220003":{"sku":"8405220003","vendor_sku":"325981","upc":"080694058211","size":"Mondo 28.5","color":"CRYSTAL TRANSLUCENT/BLACK","retail_price":"439.93","sale_price":"439.93"},"8405220004":{"sku":"8405220004","vendor_sku":"325981","upc":"080694079599","size":"Mondo 29.5","color":"CRYSTAL TRANSLUCENT/BLACK","retail_price":"439.93","sale_price":"439.93"}}}
