{"sku":"840583","manufacturer_id":"2610-00630-0067","brand_name":"Mammut","product_name":" Mammut Ride R.A.S Avalanche Airbag Pack","long_description":"The Mammut Ride R.A.S. (Removable Airbag System) Airbag pack features an inflatable airbag designed to keep your head at or near the surface of the snow during an avalanche. Easily stowable, deployment handle is located on the left shoulder strap; airbag inflates in 3 sec. and is positioned so that it won't interfere with your vision or movement. 2-layer, high-density, EVA shoulder straps, hipbelt and back panel provide direct body contact and good ventilation; hipbetl is removable. U-shaped aluminum frame supports the load and helps transfer weight to the hipbelt; frame is adjustable. Panel-loading pack also features full-zip access to main compartment from back of the pack. Snowboard carrier features a fully adjustable stabilization belt so board doesn't impede movement of legs. Ski attachement system holds skis diagonally; skis can also be carried A-frame style. Carry your backcountry tools in the front pocket for quick access; sports external attachment points for ice axe and poles. Stowable helmet carrying system ensures protection for your noggin comes along on every adventure. Sleeve for hydration reservoir (sold separately) and insulated tube cover prevents a frozen hose on long treks. Padded goggles pocket protects your lenses from getting banged-up when not in use; zipped interior compartment with key clip secures small essentials. Mammut Cartridge Refillable 207 Bar Alu sold separately.","short_description":"The Mammut Ride R.A.S. (Removable Airbag System) Airbag pack features an inflatable airbag designed to keep your head at or near the surface of the snow during an avalanche.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Avalanche Safety Gear","thumb_url":"http://i1.avlws.com/115/s407359.png","image_url":"http://i1.avlws.com/115/l407359.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407359&tt=df","retail_price":"699.95","sale_price":"559.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407359\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407359.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=840583&amp;link=&amp;tabs=-Details\"></script>","variants":{"8405830002":{"sku":"8405830002","vendor_sku":"2610-00011-0067","size":"30 LTR","color":"BLACK/SMOKE","retail_price":"559.93","sale_price":"559.93"}}}
