{"sku":"840598","manufacturer_id":"IO7RZWT12","brand_name":"Smith","product_name":" Smith I/O Snow Goggles - Men's","long_description":"Swap lenses to optimize vision with the Smith I/O snow goggles, which feature an easy interchangeable lens system, excellent comfort and great fog protection. With the flip of a switch, the helmet-compatible Smith I/O goggles can change lenses to optimize performance in all conditions. Smith Spherical(TM) series lenses allow a wide field of vision and increased volume that maximizes airflow and reduces fogging. Carbonic-X(TM) lens is individually molded to offer optimum scratch resistance, increased visual acuity and enhanced contrast sensitivity. Lens is tapered from optical center toward the periphery and allows light rays to pass through without refraction. This tapered lens shape provides distortion-free vision for the most accurate interpretation of the terrain that lies ahead. Microporous filter attached to the lens increases fog resistance by allowing air molecules to pass through while blocking water molecules. Patented technology bonds the inner and outer lenses to prevent moisture from entering lenses while letting them breathe; 5x Anti-Fog inner lens offers superb fog protection. 3-layer face foam has a dense base to reduce hot spots, a plush middle layer and a soft fleece top layer to ensure a tight seal, manage moisture and maximize comfort. Extra-wide adjustable strap is backed with silicone grippers and comes with a clip buckle for easy on/off, even over a ski hat or helmet. Black/White Wordpress frame color comes with Ignitor Mirror lens (rose copper tint, 35% visible light transmission (VLT)) and Sensor Mirror lens (light rose tint, 70% VLT). Red Republic frame color comes with Red Sol-X Mirror lens (dark sienna brown tint, 17% VLT) and Red Sensor Mirror lens (light rose tint, 60% VLT). Irie Mission frame color comes with Green Sol-X Mirror lens (dark sienna brown tint, 15% VLT) and Sensor Mirror lens (light rose tint, 70% VLT).","short_description":"Swap lenses to optimize vision with the Smith I/O snow goggles, which feature an easy interchangeable lens system, excellent comfort and great fog protection.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380895.png","image_url":"http://i1.avlws.com/115/l380895.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380895&tt=df","retail_price":"175.00","sale_price":"120.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380895\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380895.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=840598&amp;link=&amp;tabs=-Details\"></script>","variants":{"8405980004":{"sku":"8405980004","vendor_sku":"IO7RZWT12","upc":"715757384487","size":"RED SENSOR MIRROR","color":"WHITE","retail_price":"120.83","sale_price":"120.83"}}}
