{"sku":"840612","manufacturer_id":"VR6IWB12","brand_name":"Smith","product_name":"Smith Virtue Snow Goggles - Women's","long_description":"Smith Virtue women's snow goggles combine a sleek, semi-rimless design with excellent optics for all-out performance on the slopes. Smith Spherical(TM) series lenses allow a wide field of vision and increased volume that maximizes airflow and reduces fogging. Carbonic-X(TM) outer lens is molded to offer optimum scratch resistance, increased visual acuity and enhanced contrast sensitivity. Lens is tapered from optical center toward the periphery and allows light rays to pass through without refraction; this tapered lens shape provides distortion-free vision. Microporous filter attached to the outer lens increases fog resistance by automatically adjusting to elevation changes, allowing air to pass through while blocking moisture. Patented technology bonds the inner and outer lenses to prevent moisture from entering lenses while letting them breathe; 5x Anti-Fog inner lens offers superb fog protection. 3-layer face foam has a dense base to reduce hot spots, a plush middle layer and a soft fleece top layer to ensure a tight seal, manage moisture and maximize comfort. Extra-wide adjustable strap is backed with silicone grippers and comes with a clip buckle for easy on/off, even over a ski hat or helmet. Articulating Outrigger Positioning System puts pressure evenly across the brow and nose to create a complete seal and provide a comfortable, consistent fit, even with a helmet. Light Blue Twist frame comes with Ignitor Mirror lens, which offers a rose-copper tint and mirrored finish; allows 35% visible light transmission (VLT). White Botanical frame comes with Ignitor Mirror lens, which offers a rose-copper tint and mirrored finish; allows 35% VLT. Black frame comes with RC36 lens, which combines rose and copper base tints for excellent all-around use; allows 36% VLT. White frame comes with Red Sensor Mirror lens, which has a light rose tint and red mirrored finish; allows 60% VLT.","short_description":"Smith Virtue women's snow goggles combine a sleek, semi-rimless design with excellent optics for all-out performance on the slopes.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381079.png","image_url":"http://i1.avlws.com/115/l381079.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381079&tt=df","retail_price":"69.83","sale_price":"69.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381079\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381079.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=840612&amp;link=&amp;tabs=-Details\"></script>","variants":{"8406120002":{"sku":"8406120002","vendor_sku":"VR6IWB12","upc":"715757393861","size":"IGNITOR MIRROR","color":"WHITE BOTANICAL","retail_price":"69.83","sale_price":"69.83"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
