{"sku":"840740","manufacturer_id":"325652","brand_name":"Salomon","product_name":" Salomon Guardian WTR 16S Randonee Bindings","long_description":"The Salomon Guardian WTR 16S randonee bindings provide the power, precision and on-snow feel of a high-performance freeride alpine binding with the benefit of being able to tour in the backcountry. Switching from hike to ski mode shouldn't be a hassle, and it isn't with the Guardian binding-simply flick the switch with your ski pole to change modes. Hard-charging skiers who like to land jumps and hit high speeds will appreciate the adjustable DIN that ranges from 7 - 16. Bindings have a low overall stand height of 26mm for great stability while skiing. 80mm width transmits power from you boots to your wide skis for great downhill performance. Bindings include 115mm-wide brakes to fit your wide powder skis; brakes come off with a single turn of a screw driver if you need to remove them. Toe-piece height can be adjusted to fit your boots. Flip the climbing bars up with your ski poles to take some stress off your legs when you're skinning uphill. Salomon Guardian WTR 16S randonee bindings fit boot sizes Mondo 27.5 and smaller; bindings are only compatible with boots with alpine DIN soles and WTR soles.","short_description":"The Salomon Guardian WTR 16S randonee bindings provide the power, precision and on-snow feel of a high-performance freeride alpine binding with the benefit of being able to tour in the backcountry.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Randonee Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381663.png","image_url":"http://i1.avlws.com/115/l381663.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381663&tt=df","retail_price":"449.95","sale_price":"449.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381663\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381663.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=840740&amp;link=&amp;tabs=-Details\"></script>","variants":{"8407400001":{"sku":"8407400001","vendor_sku":"325652","upc":"080694104055","size":"S","retail_price":"449.95","sale_price":"449.95"}}}
