{"sku":"840840","manufacturer_id":"RC1A005","brand_name":"Rossignol","product_name":"Rossignol FKS 140 XXL Downhill Ski Bindings","long_description":"The Rossignol FKS 140 XXL downhill ski bindings are designed to enhance your performance, increase your safety and create an unparalleled connection with your skis. Why settle for less?. Remember last time you hit a small bump, your ski randomly popped off, and you went down like a freight train?. To help prevent such mishaps, Rossingnol has engineered key features into the binding to reduce premature release, the most innovative of which is a rotating heel piece. Turntable heel rotates with the boot directly under your tibia, creating consistent and reliable release. FKS also features 25mm of vertical elastic travel which absorbs shock and allows a lower setting of release values. Rossignol has reduced the space between heelpiece and toepiece mounting points; the result is increased responsiveness and more consistent ski flexing. 3 contact points between the bindings and the heels ensure effective power transfer. Antifriction device increases leverage and control, especially on wide skis. Rossignol FKS 140 XXL bindings come with 115mm brakes that fit most all-mountain wide skis and some powder skis. DIN setting of 5 - 14.","short_description":"The Rossignol FKS 140 XXL downhill ski bindings are designed to enhance your performance, increase your safety and create an unparalleled connection with your skis. Why settle for less?.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Downhill Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381555.png","image_url":"http://i1.avlws.com/115/l381555.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381555&tt=df","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381555\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381555.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=840840&amp;link=&amp;tabs=-Details\"></script>","variants":{"8408400001":{"sku":"8408400001","vendor_sku":"RC1A005","color":"FLUORESCENT ORANGE","retail_price":"299.95","sale_price":"299.95"}},"categories":["snow","ski-bindings","downhill-ski-bindings"]}
