{"sku":"841070","manufacturer_id":"7624M1.JC","brand_name":"Marker","product_name":"Marker Jester 130 Downhill Ski Bindings","long_description":"Designed for park, pipe and big-mountain freeskiers, the Marker Jester B130 downhill ski bindings meet the demands of the most aggressive downhillers around. Featuring updated magnesium parts to increase durability and control in 2012/2013, the Jester bindings enhance control of wide-waisted skis. Burly DIN settings from 6 - 16 lets hard-charging skiers stomp huge landings and hit mach speeds. Level stand height creates a neutral stance with a consistent balance point, ideal for pulling off tricks either forward or backward. Cross-axis toe spring and compact mounting create a short binding that enables fluid spins and twists. Triple Pivot Elite toe absorbs high levels of energy to help prevent prerelease, and an updated horizontal torsion bar reinforcement enhances power and lateral precision. Lightweight Inter-Pivot heel focuses power in the direction of the boot sole and offers superior holding power and energy transfer. Freeride brakes ensure adequate clearance when skiing backward. Heel is designed without pull-out screws to maximize durability. Contact points located directly under the sole holder efficiently transfer power to the ski. Stainless-steel anti-friction device allows essential lateral boot movement despite the condition of dirty or worn soles or negative sliding friction. Anti-friction device adjusts to the height of alpine boots. 130mm brake fits most powder skis. Mounting configuration of Marker Jester B130 downhill ski binding requires a 78mm minimum ski width.","short_description":"Designed for park, pipe and big-mountain freeskiers, the Marker Jester B130 downhill ski bindings meet the demands of the most aggressive downhillers around.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Downhill Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381567.png","image_url":"http://i1.avlws.com/115/l381567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381567&tt=df","retail_price":"359.00","sale_price":"249.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841070&amp;link=&amp;tabs=-Details\"></script>","variants":{"8410700001":{"sku":"8410700001","vendor_sku":"7624M1.JC","upc":"883295101047","size":"130 MM","color":"WHITE/BLACK/TEAL","retail_price":"249.83","sale_price":"249.83"}},"categories":["snow","ski-bindings","downhill-ski-bindings"]}
