{"sku":"841043","manufacturer_id":"20136900051","brand_name":"Tecnica","product_name":" Tecnica Cochise W90 Ski Boots - Women's - 2012/2013","long_description":"The women's Cochise 90W ski boots dig into speedy turns, offer a comfortable fit and offer you the option of hiking and walking with ease. Ski/hike switch frees upper cuff to work with your stride and makes it easy to hike for your turns and walk to the lodge from the parking lot. Steel and aluminum, metal-pin-to-metal plate connection locks the upper cuff to the lower shell when you're ready to ski and allows you to really flex into your skis. Lightweight, mono-injected polymer shell is designed to make it easy going uphill, and it provides the responsive power you need on the way back down. Soft plastic over instep makes it easy to get your feet in the boots. Liners offer superior heel hold, complete foot envelopment and rubberized, shock-absorbent materials in feet. Soft material in the shape of a V on the upper sides of the collar adapt to a wide range of lower leg shapes, and a flared liner collar increases room for the calf muscle. Custom-moldable, women-specific liners offer superior heel hold and foot envelopment; materials enhance fit, performance and comfort. Neoprene toe boxes increase warmth in feet and absorb vibrations. Catches have a whopping 44mm range-22mm forward and 22mm back. Instep catch is hinged, allowing excellent pressure distribution; plus, it pivots away from the shell, letting the shell spread for easy entry. 40mm rip-and-stick power strap provides effective cuff closure and efficient energy transmission as the skier works the boot forward. Cuff alignment matches the angle of the cuff with the shape of the lower leg, increasing comfort and performance. Very sticky arches and soles are designed for hiking in snow. Shock-absorbent heels smooth descents and soften landings. With a flex index of 90, Tecnica Cochise 90W ski boots provide the flex appropriate for intermediate skiers.","short_description":"The women's Cochise 90W ski boots dig into speedy turns, offer a comfortable fit and offer you the option of hiking and walking with ease.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382479.png","image_url":"http://i1.avlws.com/115/l382479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382479&tt=df","retail_price":"399.95","sale_price":"279.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841043&amp;link=&amp;tabs=-Details\"></script>","variants":{"8410430001":{"sku":"8410430001","vendor_sku":"20136900051","upc":"885315239105","size":"Mondo 23.5","color":"SMOKE WHITE","retail_price":"279.83","sale_price":"279.83"},"8410430002":{"sku":"8410430002","vendor_sku":"20136900051","upc":"885315239129","size":"Mondo 24.5","color":"SMOKE WHITE","retail_price":"279.83","sale_price":"279.83"},"8410430003":{"sku":"8410430003","vendor_sku":"20136900051","upc":"885315239143","size":"Mondo 25.5","color":"SMOKE WHITE","retail_price":"279.83","sale_price":"279.83"},"8410430004":{"sku":"8410430004","vendor_sku":"20136900051","upc":"885315614933","size":"Mondo 26.5","color":"SMOKE WHITE","retail_price":"279.83","sale_price":"279.83"}}}
