{"sku":"841066","manufacturer_id":"7625M1.JB","brand_name":"Marker","product_name":" Marker Jester Schizo 110 Downhill Ski Bindings","long_description":"Marker Jester Schizo B110 downhill ski bindings improve freestyle performance by offering an adjustable interface to cater to the type of skiing you choose. Whole binding moves 3cm forward or 3cm back using a simple screw adjustment on the toe piece. Are you spending time in the park or riding switch? Position the binding in the forward position to maximize the skis' responsiveness. Or is the rest of the mountain calling your name with its fresh snowfall? Position the binding in the rear position and enjoy a back-seat ride. Featuring updated magnesium parts to increase durability and control in 2012/2013, the Jester Schizo bindings enhance control of wide-waisted skis. Burly DIN settings from 6-16 lets hard-charging skiers stomp huge landings and hit mach speeds. Cross-axis toe spring and compact mounting create a short binding that enables fluid spins and twists. Triple Pivot Elite toe absorbs high levels of energy to help prevent prerelease. Lightweight Inter-Pivot heel focuses power in the direction of the boot sole and offers superior holding power and energy transfer. Freeride brakes ensure adequate clearance when skiing backward. The Marker Jester Schizo B110 downhill ski bindings feature a heel piece without pull-out screws to maximize durability. Contact points located directly under the sole holder efficiently transfer power to the ski. Stainless-steel anti-friction device allows essential lateral boot movement despite the condition of dirty or worn soles or negative sliding friction. 110mm brake fits all-mountain wide skis and some powder skis.","short_description":"Marker Jester Schizo B110 downhill ski bindings improve freestyle performance by offering an adjustable interface to cater to the type of skiing you choose.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Downhill Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381559.png","image_url":"http://i1.avlws.com/115/l381559.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381559&tt=df","retail_price":"439.00","sale_price":"299.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381559\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381559.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841066&amp;link=&amp;tabs=-Details\"></script>","variants":{"8410660001":{"sku":"8410660001","vendor_sku":"7625M1.JB","upc":"883295101054","size":"110 MM","color":"WHITE/BLACK/PETROL","retail_price":"299.83","sale_price":"299.83"}}}
