{"sku":"841153","manufacturer_id":"S120600101179","brand_name":"K2","product_name":"K2 A.M.P. Bolt Skis with Bindings - Men's - 2012/2013","long_description":"There's fast, and then there's the K2 A.M.P. Bolt skis with bindings. K2 recommends using the K2 A.M.P. Bolt skis with bindings for 80% groomed and 20% ungroomed skiing. Designed with a new mix of technology, the K2 A.M.P. Bolt skis offer incredible stiffness and edge hold on firm snow and the ability to effortlessly initiate turns. Combination of a strong core, shock-absorbent secondary core and X-shaped carbon support creates skis with unshakable hold on hardpack and incredible side-to-side response. Metal laminate construction alternates layers of fiberglass and titanium above and below the fir core to provide vibration damping and powerful responsiveness. Typically a super-beefy ski like the Bolt would be unforgiving and tough to turn, but K2 has combined the aforementioned features with a very slight rise in the tips. Speed Rocker initiates turns easily and offers agile performance, and normal camber underfoot offers responsive power and tenacious edge hold on firm snow. Progressive sidecut has different curve shapes along different parts of the ski-more aggressive in the tip, less aggressive in the tail. Progressive sidecut results in confident, quick turn initiation on hard snow and easy release in crud and powder. Hybridtech sidewalls blend the performance characteristics of sidewalls with the forgiving flex of cap construction in the tip and tail. Hybridtech offers responsiveness and power underfoot and maintains smooth initiation and easy exits from turns. Marker K2/MX 14.0 integrated binding system transfers power directly to the ski for unmatched precision and control during aggressive descents. Lightweight Marker Inter-Pivot heel acts over a wide surface area, transferring power directly to ski's edges for excellent carving performance. Embedded hubs in the core of the ski are 50mm apart, decreasing the distance between the binding and ski edge to enhance performance.","short_description":"There's fast, and then there's the K2 A.M.P. Bolt skis with bindings.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s461379.png","image_url":"http://i1.avlws.com/115/l461379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461379&tt=df","retail_price":"1099.95","sale_price":"659.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841153&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","skis","downhill-skis"]}
