{"sku":"841195","manufacturer_id":"CARBON","brand_name":"Kneebinding","product_name":" KneeBinding Carbon Downhill Ski Bindings","long_description":"Responsive and lightweight, the Kneebinding Carbon downhill ski bindings offer advanced skiers high performance and reduce the chances of serious knee injury. The Kneebinding Carbon downhill ski bindings offer an innovative solution to injury-a heel piece that releases sideways to reduce the chance of serious knee injury. Traditional bindings feature 2 areas of release: sideways toe release in the front of the boot and vertical or forward heel release at the back of the boot. Kneebindings offer an additional dimension of sideways release in the heel, reducing the chances of strains and tears to the anterior cruciate ligament (ACL). Resin and stainless-steel components offer high durability, excellent energy transfer and light weight. Components are blended with carbon fiber to increase stiffness and maximize responsiveness. Mounting system is designed to work with the natural flex of your skis and to reduce unwanted release. Hard, flat boot platforms efficiently transfer pressure from edge to edge, and toe-height adjustment eliminates play. Wide mounting platform enhances leverage on today's wide skis. The Kneebinding Carbon downhill ski bindings feature a 110mm brake that fits most all-mountain wide skis and some powder skis. Features 3 - 12 DIN settings.","short_description":"Responsive and lightweight, the Kneebinding Carbon downhill ski bindings offer advanced skiers high performance and reduce the chances of serious knee injury.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Downhill Ski Bindings","thumb_url":"http://i1.avlws.com/115/s446715.png","image_url":"http://i1.avlws.com/115/l446715.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=446715&tt=df","retail_price":"399.00","sale_price":"399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=446715\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m446715.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841195&amp;link=&amp;tabs=-Details\"></script>","variants":{"8411950001":{"sku":"8411950001","vendor_sku":"CARBON","upc":"736211766816","size":"110 MM","color":"CARBON BLACK","retail_price":"399.00","sale_price":"399.00"}}}
