{"sku":"841858","manufacturer_id":"050193007H6","brand_name":"Nordica","product_name":"Nordica Transfire RSW Ski Boots - Women's - 2012/2013","long_description":"Have a blast carving up the slopes with the women's Nordica Transfire RSW ski boots-available only at REI! The Nordica Transfire RSW boots use a new shell design to enhance side-to-side control, offering precise lateral pressure to put modern skis on edge. Boots flex lightly at first, then as you put greater pressure on tongues during turn, the resistance increases and enhances precision. After flexing, boots return to upright position very quickly, setting you up for the next turn. In addition to flexing progressively, the Transfire RSW boots feature a block in the spine of the boot that ensures the boots do not engage the skis too quickly. Getting your foot in the boot is hassle free thanks to a forgiving 3-piece shell design. As compared to men's liners, women-specific liners feature extra padding in the tongue, more insulation throughout and a contoured top edge designed to fit women's calves. Shaped footbeds with contoured arches and heel cups optimize foot position and provide responsive performance, and this shaping carries over to the liner to increase support. Liners provide a personalized fit around heel, ankle and center of foot when custom molded. Middle buckles clamp down on feet at a 45deg angle to keep heels securely seated and increase comfort in forefeet. Power strap acts as a fourth buckle, allowing you to set the firmness around the upper ankle to favor comfort or performance. Double canting adjusts the cuffs to fit the angles of your lower legs and offers a versatile range of adjustment. 90 flex index provides the power transfer suited to intermediate skiers. 102mm-wide forefoot offers a great mix of comfort and precision.","short_description":"Have a blast carving up the slopes with the women's Nordica Transfire RSW ski boots-available only at REI!","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s448867.png","image_url":"http://i1.avlws.com/115/l448867.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448867&tt=df","retail_price":"399.00","sale_price":"238.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448867\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448867.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841858&amp;link=&amp;tabs=-Details\"></script>","variants":{"8418580004":{"sku":"8418580004","vendor_sku":"050193007H6","upc":"885315475022","size":"Mondo 26.5","color":"BLACK","retail_price":"238.83","sale_price":"238.83"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
