{"sku":"841854","manufacturer_id":"05054400 787","brand_name":"Nordica","product_name":"Nordica Cruise 70 Ski Boots - Men's - 2012/2013","long_description":"Cruise the groomers in the Nordica Cruise 70 ski boots, explore the runs and enjoy your day on the mountain. Dual-density plastic maximizes ease of entry regardless of temperature; even if you have high insteps, getting your foot in the boot is hassle free. Soft shell flaps make it easy to get your foot in the boot; no more standing on 1 foot, hunching over, forcing your instep between 2 unforgiving, pinching plastic flaps. Liners snugly wrap feet in cushioning foam; closed-cell foam against the shells enhances warmth. Liners provide a personalized fit around heel, ankle and center of foot when custom molded. Footbeds optimize foot position to create an effortless skiing stance, and they offer easy support for comfortable wear all day long. Upper buckle features a ladder that changes position to ease closure of the top portion of the boot; ladder changes position without the use of tools. Top of the boot a little tight? Cuffs feature an adjustable hex nut that increases the circumference of the top of the boot by 3 - 5mm and relaxes the angle of the boots. Power strap adjusts cuff for snugness and pressure against the shins. With a flex index of 70, Nordica Cruise 70 ski boots provide light resistance against a forward lean, appropriate for most novice skiers. Extra-wide last accommodates forefoot measurements up to 104mm.","short_description":"Cruise the groomers in the Nordica Cruise 70 ski boots, explore the runs and enjoy your day on the mountain.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382483.png","image_url":"http://i1.avlws.com/115/l382483.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382483&tt=df","retail_price":"249.00","sale_price":"174.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382483\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382483.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841854&amp;link=&amp;tabs=-Details\"></script>","variants":{"8418540001":{"sku":"8418540001","vendor_sku":"05054400 787","upc":"885315252067","size":"Mondo 25.5","color":"BLACK/WHITE","retail_price":"174.83","sale_price":"174.83"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
