{"sku":"841859","manufacturer_id":"05018100 8H2","brand_name":"Nordica","product_name":" Nordica Transfire R1W Ski Boots - Women's - 2012/2013","long_description":"Featuring a very comfortable fit, the women's Nordica Transfire R1W ski boots drive the rockered and cambered shapes of modern skis with precision. The Nordica Transfire R1W uses a new shell design to enhance side-to-side control, offering precise lateral pressure to put modern skis on edge. Boots flex lightly at first, then as you put greater pressure on tongues during turn, the resistance increases and enhances precision. After flexing, boots return to upright position instantly, setting you up for the next turn. In addition to flexing progressively, the Transfire R1W boots feature a block in the spine of the boot that ensures the boots do not engage the skis too quickly. Getting your foot in the boot is hassle free thanks to a forgiving 3-piece shell design. Padding in the tongues and cuffs absorbs shock and damps vibrations, making your ride smooth and easy. As compared to men's liners, women-specific liners feature extra padding in the tongues, more insulation throughout and contoured top edges designed to fit women's calves. Liners snugly wrap the feet in cushioning foam and warm faux-fur lining; closed-cell foam against the shell enhances warmth. Liners provide a personalized fit around heel, ankle and center of foot when custom molded. Middle buckles clamp down on feet at a 45deg angle to keep heels securely seated and increase comfort in forefeet. Power strap acts as a fourth buckle, allowing you to set the firmness around the upper ankle to favor comfort or performance. Double canting adjusts the cuffs to fit the angles of your lower legs and offers a versatile range of adjustment. 100 flex index provides the responsive power transfer preferred by expert skiers. 102mm-wide forefoot offers a great mix of comfort and precision.","short_description":"Featuring a very comfortable fit, the women's Nordica Transfire R1W ski boots drive the rockered and cambered shapes of modern skis with precision.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382487.png","image_url":"http://i1.avlws.com/115/l382487.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382487&tt=df","retail_price":"499.00","sale_price":"298.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382487\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382487.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841859&amp;link=&amp;tabs=-Details\"></script>","variants":{"8418590001":{"sku":"8418590001","vendor_sku":"05018100 8H2","upc":"885315264671","size":"Mondo 23.5","color":"SILVER/WHITE","retail_price":"298.83","sale_price":"298.83"}}}
