{"sku":"841989","manufacturer_id":"7616M1.LA","brand_name":"Marker","product_name":" Marker Duke Large Randonee Bindings - 2012/2013","long_description":"The Marker Duke EPF randonee bindings won't limit the type of terrain you can ski. The tough Dukes are built to handle high-speed sidecountry adventures with cliff jumps and backcountry bumps. Extended Power Frame (EPF) design is 28% wider than the previous version of the Duke to increase power transmission to your fat powder skis. You won't prerelease in these burly bindings-DIN 6 - 16 adjustment lets hard-charging skiers stomp huge landings and hit mach speeds. Switch between downhill and touring mode using the levers located under your boots; lever position eliminates the chance of accidentally switching to touring mode while skiing. When you switch to touring mode, the whole binding interface moves back 4cm for better balance while climbing and doing kick turns. Climbing heel design offers 3 positions-flat, 7deg and 13deg; positions can be easily adjusted using a ski pole. Gliding antifriction devices at the toes of the bindings are height adjustable to accommodate randonee and alpine boots. Low 36mm stand height creates a solid and secure connection to the ski. Included 110mm brakes fit wide skis and effectively stop runaway skis; brakes can be easily removed if desired. Mounting configuration of the Marker Duke EPF randonee bindings requires a 89mm minimum ski width. Large fits boot sole lengths from 305mm - 365mm.","short_description":"The Marker Duke EPF randonee bindings won't limit the type of terrain you can ski. The tough Dukes are built to handle high-speed sidecountry adventures with cliff jumps and backcountry bumps.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Randonee Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381671.png","image_url":"http://i1.avlws.com/115/l381671.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381671&tt=df","retail_price":"449.00","sale_price":"299.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381671\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381671.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841989&amp;link=&amp;tabs=-Details\"></script>","variants":{"8419890001":{"sku":"8419890001","vendor_sku":"7616M1.LA","upc":"883295100972","size":"110 MM","color":"WHITE/BLACK/ORANGE/TEAL","retail_price":"299.83","sale_price":"299.83"}}}
