{"sku":"841922","manufacturer_id":"RR202EF","brand_name":"Rossignol","product_name":"Rossignol Pursuit HP Titanium Skis with Bindings - Men's - 2012/2013","long_description":"The Rossignol Pursuit HP Titanium skis with bindings keep up with speeding turns on hardpack thanks to rock-solid stability and incredible edge grip. The Rossignol Pursuit HP Titanium skis with bindings really excel when you're sticking just to the groomers, and if you find yourself going off-piste, they won't disappoint. Wood core creates a light and lively ski with excellent ski-to-snow feel, and 2 titanium laminates above and below core provide powerful stiffness and lively response. An H-shaped split in the laminates at tip and tail ensures side-to-side response along entire length of skis. This H-shape also smooths out turn initiation and improves edge contact during turns. Rubber material damps vibrations and creates a smooth ride. Subtle rocker in tips offers easy steering in any snow condition, and traditional camber underfoot provides tenacious edge grip. Oversize tip tail dimensions and a large sidecute radius offer strong edging, power and precision. Performance-enhancing Axial^2 140 Ti Pro bindings use lateral arms to apply even edge pressure for energy-efficient power transfer. Dual Action III toe piece has reinforced housing in the high-stress areas, enhancing overall structural integrity. Reinforced housing strengthens the torsion bar interface, facilitating torsional rigidity in the toe piece. Dual Action III toe features multidirectional release. Axial^2 titanium heelpiece improves energy transfer to the ski so more power goes directly from the skier to the ski with less energy loss. High degree of forward pressure dramatically enhances the interface between boot and binding, improving rebound and responsiveness. DIN setting 4 - 14. Base or topsheet color may vary from online photo.","short_description":"The Rossignol Pursuit HP Titanium skis with bindings keep up with speeding turns on hardpack thanks to rock-solid stability and incredible edge grip.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s461391.png","image_url":"http://i1.avlws.com/115/l461391.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461391&tt=df","retail_price":"949.95","sale_price":"569.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461391\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461391.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841922&amp;link=&amp;tabs=-Details\"></script>","variants":{"8419220001":{"sku":"8419220001","vendor_sku":"RR202EF","size":"170 CM","color":"BLACK/WHITE","retail_price":"569.93","sale_price":"569.93"}},"categories":["snow","skis","downhill-skis"]}
