{"sku":"841925","manufacturer_id":"RA2QE03","brand_name":"Rossignol","product_name":" Rossignol Sassy 7 Skis - Women's - 2012/2013","long_description":"The Rossignol Sassy 7 women's skis float through powder, plow through crud and cruise the groomed runs. Won't you take them out for a spin?. Rossignol Sassy 7 skis work well if you're sticking to groomed runs, but they are ideal if you find yourself switching between groomed runs and off-piste terrain. Wood cores create a light and lively skis with excellent ski-to-snow feel and high durability. Fiberglass laminates create a fun, lively feel to the skis and enhance stiffness. Rossignol Sassy 7 skis feature powder-specific rockered tips and tails that provide excellent flotation in soft snow. Standard camber underfoot makes it easy to navigate back to the lifts on groomed runs. Sidecut is centered with a deep radius directly under bindings to create a playful ski that's easy to steer. You'll enjoy powder more thanks to the spoon-shaped tips that float high in the deep stuff without hooking. Directional twin-tip profile excels when going forward and lets you land jumps and ride backward. Requires bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"The Rossignol Sassy 7 women's skis float through powder, plow through crud and cruise the groomed runs. Won't you take them out for a spin?.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s381935.png","image_url":"http://i1.avlws.com/115/l381935.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381935&tt=df","retail_price":"399.95","sale_price":"239.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381935\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381935.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=841925&amp;link=&amp;tabs=-Details\"></script>","variants":{"8419250001":{"sku":"8419250001","vendor_sku":"RA2QE03","size":"150 CM","color":"BLUE","retail_price":"239.93","sale_price":"239.93"},"8419250002":{"sku":"8419250002","vendor_sku":"RA2QE03","size":"160 CM","color":"BLUE","retail_price":"239.93","sale_price":"239.93"}}}
