{"sku":"842312","manufacturer_id":"831631","brand_name":"Leatherman","product_name":" Leatherman OHT Multitool","long_description":"The Leatherman OHT multitool may ensure the success of your next backcountry excursion or extended backpacking trip. Be a little more prepared for the unexpected with its easily accessible tools. Fully operable with 1 hand, spring-action needlenose and regular pliers plus hard and regular wire cutters are easy to use without needing an extra hand. 2 knife blades, 3 regular screwdrivers and 1 phillips screwdriver offer great range for everyday tools that always come in handy. 1 saw blade, 1 strap cutter and an oxygen tank wrench offer more specialized utility for situations requiring more than the standard blades or tools. Can opener, bottle opener and a cleaning rod attachment complete the full set of tools neatly stowed in this compact multitool. All blades and tool lock in place while in use for safety and strength. Stainless-steel body is durable and rugged, perfect for enduring outdoor adventures for years. The Leatherman OHT multitool features visual imprints on the handles that indicate the interior tool. 4.5 in. length stores perfectly in a pack pocket, taking very little space in your pack.","short_description":"The Leatherman OHT multitool may ensure the success of your next backcountry excursion or extended backpacking trip. Be a little more prepared for the unexpected with its easily accessible tools.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Knives And Tools","thumb_url":"http://i1.avlws.com/115/s418531.png","image_url":"http://i1.avlws.com/115/l418531.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418531&tt=df","retail_price":"84.95","sale_price":"84.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418531\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418531.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=842312&amp;link=&amp;tabs=-Details\"></script>","variants":{"8423120001":{"sku":"8423120001","vendor_sku":"831631","upc":"037447021480","color":"BLACK","retail_price":"84.95","sale_price":"84.95"}}}
