{"sku":"842819","manufacturer_id":"276105","brand_name":"Burton","product_name":" Burton Sherlock Snowboard - 2012/2013","long_description":"The Burton Sherlock snowboard solves the mysteries of the deep, untracked pow. Take this board out on a freshie-filled day and enjoy the ride. Sherlock is built for riders who don't hesitate to pick their own lines; it's a shock-absorbent, all natural jib and jump machine that floats like a dream. Flying V(TM) is a premium blend of camber and rocker, and offers the best of both worlds in terms of performance. Rocker overall, and between and outside the feet, enhances catch-free playfulness and float through pow. Subtle camber zones underneath feet focus edge control for crisp snap, added pop and power through the turns. Directional twin shape offers the freestyle feel of a twin board but is slightly tweaked to provide improved float and control through variable terrain and conditions. Surface area at the tip and tail contact points is lengthened to improve edge-hold, and allows the board to plane easier in powder. The Channel system offers unlimited, on-the-fly stance adjustability, enhances board feel and is compatible with EST(TM), Re:Flex(TM) and Disc(R) bindings. The Channel lets you fine-tune your stance width to the millimeter, and then dial in your toe-to-heel centering and rotate your angles in 1 fell swoop. Wood core is light, snappy and responsive; engineered wood grain positioned along the toe and heel edges, perpendicular to the core, improves edge hold and strength. Lightweight Carbon I-Beam(TM) riding up the board's spine adds to board's longitudinal snap. Fiberglass in the topsheet provides versatile flex and response so you can shred everything from big mountain descents to laps in the park. Tapered tip and tail thickness reduces swing weight and improves powder flotation. Meaty 10:45 sidewalls optimize 2 different angles to absorb impact for aggressive riders.","short_description":"The Burton Sherlock snowboard solves the mysteries of the deep, untracked pow. Take this board out on a freshie-filled day and enjoy the ride.","category":"Snowboarding","subcategory":"Snowboards","product_group":"All-Mountain Snowboards","thumb_url":"http://i1.avlws.com/115/s444191.png","image_url":"http://i1.avlws.com/115/l444191.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=444191&tt=df","retail_price":"261.83","sale_price":"261.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=444191\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m444191.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=842819&amp;link=&amp;tabs=-Details\"></script>","variants":{"8428190003":{"sku":"8428190003","vendor_sku":"276105","upc":"886057838717","size":"160 CM","retail_price":"261.83","sale_price":"261.83"}}}
