{"sku":"842918","manufacturer_id":"FL-12000","brand_name":"Backcountry Access","product_name":"Backcountry Access Float 22 Avalanche Airbag Pack","long_description":"The innovative Backcountry Access Float 22 Avalanche Airbag pack features an inflatible airbag with a proven design to help keep you at or near the surface of the snow during an avalanche. Pull the trigger located on the right shoulder strap to deploy the airbag; airbag inflates in 3 sec. and is positioned so that it won't interfere with your vision or movement. Compressed air cylinder (sold separately) inflates the 150 liter airbag; after deployment, cylinder must be refilled by Backcountry Access or an authorized retail location. Visit the Backcountry Access website at www.backcountryaccess.com to find an authorized retail location to fill the cylinder. Airbag is designed to not only help prevent burial, but also protect the head, neck and upper body from trauma. 22 liter (1,342 cu. in.) capacity has enough space for rescue tools, lunch, water, skins and some extra clothes; great for out-of-bounds skiing and short backcountry trips. Dedicated pockets hold your shovel blade, shovel handle and avalanche probe (all sold separately). Includes straps for carrying skis diagonally; an optional snowboard attachment accessory can be purchased separately from Backcountry Access. Zippered pockets on the waistbelt keep energy gels and bars within reach. Backcountry Access recommends wearing the included leg straps to ensure the Float 22 backpack stays securely attached to your body during airbag deployment in an avalanche.","short_description":"The innovative Backcountry Access Float 22 Avalanche Airbag pack features an inflatible airbag with a proven design to help keep you at or near the surface of the snow during an avalanche.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Avalanche Safety Gear","thumb_url":"http://i1.avlws.com/115/s407371.png","image_url":"http://i1.avlws.com/115/l407371.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407371&tt=df","retail_price":"499.95","sale_price":"499.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407371\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407371.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=842918&amp;link=&amp;tabs=-Details\"></script>","variants":{"8429180002":{"sku":"8429180002","vendor_sku":"FL-12000","upc":"857240002239","size":"22 LTR","color":"BLACK","retail_price":"499.95","sale_price":"499.95"}},"categories":["climbing","mountaineering-gear","avalanche-safety-gear"]}
