{"sku":"843059","manufacturer_id":"90042182","brand_name":"Polar","product_name":" Polar RCX3 Heart Rate Monitor - Women's","long_description":"The women's Polar RCX3 heart rate monitor will help you achieve your fitness goals with heart rate info while you train. Included waterproof Polar WearLink(R) Hybrid transmitter sends the heart rate signal to the training watch; comfortable chest strap secures the transmitter. Waterproof WearLink Hybrid heart rate transmitter can be worn while you swim to track your heart rate during workout sessions at the pool or in the ocean. Coded heart rate transmission locks in a code to transmit your heart rate to the watch, thereby reducing interference from other training watches. 5 preset sport zones offer an easy way to select and monitor the intensity of your training; choose between very light, light, moderate, hard and maximum sport zones. Polar OwnCal(R) counts and displays calories burned during a training session; also estimates the fat-burning percentage during a workout. Create interval-guided workouts based on time and heart rate; interval timer is useful when workouts include different segments, such as a run/walk method. Review your workout totals and weekly history on the watch; watch has 99 training files. Watch features include time of day (12/24 hr.) with alarm and snooze, dual time zone, date and weekday indicator, stopwatch, reminders and low-battery indicator. Display text in English, German, French, Spanish, Portuguese, Italian, Dutch, Danish, Finnish, Norwegian and Swedish. The Polar RCX3 heart rate monitor wrist unit is water resistant to 30m (100 ft.). Operates on a single user-replaceable CR2032 battery (included), which provides 8 - 11 mos. of use. Add the Polar G5 GPS sensor (not included) to the The Polar RCX3 heart rate monitor for GPS tracking and speed and distance information.","short_description":"The women's Polar RCX3 heart rate monitor will help you achieve your fitness goals with heart rate info while you train.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427087.png","image_url":"http://i1.avlws.com/115/l427087.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427087&tt=df","keywords":"watch","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427087\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427087.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=843059&amp;link=&amp;tabs=-Details\"></script>","variants":{"8430590001":{"sku":"8430590001","vendor_sku":"90042182","upc":"725882553238","color":"WHITE","retail_price":"199.95","sale_price":"199.95"}}}
