{"sku":"843120","manufacturer_id":"BD1636550000160","brand_name":"Black Diamond","product_name":"Black Diamond Ascension Nylon Split STS 160mm Climbing Skins","long_description":"Designed to fit wide powder-specific skis, the Black Diamond Ascension Nylon Split STS climbing skins feature Dyneema-reinforced ripstop nylon in the middle to keep them lightweight and packable. Split STS skins are 160mm wide and can be trimmed to fit the shape of your fat powder boards that are 120mm or wider underfoot. Dyneema-reinforced ripstop nylon in the middle of the skins keeps them lightweight and packable, and makes them easy to remove from skis. Printed plush material lets you climb steep slopes in search of deep powder; improved material is designed to glide better than previous versions. Tenacious glue effectively sticks to your skis in all temperatures. Adjustable tip attachment fits a wide range of ski tip shapes; tip loop width is sized to fit wide powder skis. Tip design eliminates the traditional fold-over section at the front of the skin, thereby reducing weight and bulk. STS tail attachment fits any ski you have on hand and provides 10cm of length adjustment. Black Diamond Ascension Nylon Split STS climbing skins include detailed instructions, skin trimming tool, Cheat Sheet mesh storage sheets and a nylon storage bag.","short_description":"Designed to fit wide powder-specific skis, the Black Diamond Ascension Nylon Split STS climbing skins feature Dyneema-reinforced ripstop nylon in the middle to keep them lightweight and packable.","category":"Skiing","subcategory":"Climbing Skins","product_group":"Ski Skins","thumb_url":"http://i1.avlws.com/115/s459067.png","image_url":"http://i1.avlws.com/115/l459067.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=459067&tt=df","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=459067\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m459067.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=843120&amp;link=&amp;tabs=-Details\"></script>","variants":{"8431200001":{"sku":"8431200001","vendor_sku":"BD1636550000160","upc":"793661165972","size":"160 MM","retail_price":"199.95","sale_price":"199.95"}},"categories":["snow","climbing-skins","ski-skins"]}
