{"sku":"843129","manufacturer_id":"SMA003","brand_name":"Powertraveller","product_name":"Powertraveller Solarmonkey Adventurer Solar Charger","long_description":"The lightweight Powertraveller Solarmonkey Adventurer solar charger combines an efficient solar charger with an internal battery, perfect for world travel to places where electricity may be scarce. The Adventurer was developed over several years with feedback from real power users in some of the planet's most inhospitable places. Charges 5-volt devices including phones, tablets, music players, portable game players, GPS units, e-readers and more. iPhone(R) 5 can be charged with a USB adapter (not included; available for purchase from Apple). Slim and compact clamshell design opens to reveal 2 polysilicon solar panels that feature up to 17% photovoltaic efficiency with a maximum output of 3 watts (700mA at 5 volts). 2,500mAh internal lithium polymer battery can be fully charged within 12 hrs. under optimal sunlight. Self switching auto-load feature allows the Solarmonkey Adventurer to automatically start charging at optimal levels when you connect your device. Solar energy detection activates a maximum power point tracker that charges your device efficiently in low light. Besides drawing power from the sun, the Adventurer can be charged from a wall socket or DC outlet (AC and DC adapters not included). Save time by charging the internal battery and your device simultaneously; LED indicator glows red while the unit is charging and turns green when it's fully charged. Powertraveller Solarmonkey Adventurer comes with a tough travel case, rip-and-stick attachment strap, Apple device cable, 5 adapter tips and USB cable.","short_description":"The lightweight Powertraveller Solarmonkey Adventurer solar charger combines an efficient solar charger with an internal battery, perfect for world travel to places where electricity may be scarce.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Solar And Portable Power","thumb_url":"http://i1.avlws.com/115/s413127.png","image_url":"http://i1.avlws.com/115/l413127.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413127&tt=df","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413127\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413127.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=843129&amp;link=&amp;tabs=-Details\"></script>","variants":{"8431290001":{"sku":"8431290001","vendor_sku":"SMA003","color":"GRAY","retail_price":"129.95","sale_price":"129.95"}},"categories":["camping-hiking","camp-electronics","solar-and-portable-power"]}
