{"sku":"843162","manufacturer_id":"080115","brand_name":"Kanga","product_name":" Kanga Hurricane 14 RoofPouch Cargo Carrier","long_description":"The Kango Hurricane 14 RoofPouch Cargo Carrier is a tough cartop luggage and gear carrier that's ideal for most vehicles-with or without a roof rack. Welded, heavy-duty tie-down straps provide attachment to your vehicle's factory rack, or aftermarket roof rack such as Yakima or Thule. 4 in-door hooks provide attachment to 4-door vehicles without a roof rack. Removable, lightweight, nylon-covered floorboards distribute weight across the vehicle roof. Height tapers from 19 in. in the back to 10 in. in the front for an aerodynamic wedge shape that helps reduce wind drag. Heavy-duty, abrasion-resistant, 18 oz. vinyl-coated polyester material provides water-resistant protection. Radio frequency welds increase strength and water-resistance, and eliminate needle holes, corners and seams. Sturdy, water-repellent-treated, double-slider YKK zippers provide easy access to your gear. This heavy-duty cargo carrier folds down and stores in the included storage bag for easy stowing in your trunk or garage.","short_description":"The Kango Hurricane 14 RoofPouch Cargo Carrier is a tough cartop luggage and gear carrier that's ideal for most vehicles-with or without a roof rack.","category":"Car Racks","subcategory":"Cargo Boxes, Baskets And Bags","product_group":"Roof Bags","thumb_url":"http://i1.avlws.com/115/s408107.png","image_url":"http://i1.avlws.com/115/l408107.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408107&tt=df","retail_price":"90.00","sale_price":"90.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408107\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408107.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=843162&amp;link=&amp;tabs=-Details\"></script>","variants":{"8431620001":{"sku":"8431620001","vendor_sku":"080115","upc":"780292801157","retail_price":"90.00","sale_price":"90.00"}},"categories":["car-racks","cargo-boxes-baskets-and-bags","roof-bags"]}
