{"sku":"843146","manufacturer_id":"2881","brand_name":"Acr Electronics","product_name":" ACR Electronics ResQLink+ GPS Personal Locator Beacon","long_description":"The buoyant ACR Electronics ResQLink+ GPS personal locator beacon offers all the features of the ResQLink-plus it floats! It's ideal for boaters, anglers and anyone else on or around the water. ResQLink+ 406 relays your position to a global network of Search and Rescue satellites when you're in trouble. 406 MHz satellite signal and 121.5 MHz local homing signal help reduce search times and maximize your chances of survival. 66-channel GPS fixes your location to within 100m; a satellite signal alerts Search and Rescue personnel while the local homing signal guides rescuers to your exact location. Unique registered distress signal tells rescuers where and who you are. Super bright LED strobe light helps rescuers get a visual fix and find you quickly. Buoyant, compact design is carried easily in a pack or pocket and is waterproof down to 16 ft. for up to an hour and 33 ft. for up to 10 min. Fully functional self-test of the circuitry, battery power and 406 MHz transmission gives you peace of mind knowing your beacon will work when you need it. GPS acquisition test mode allows you to test the GPS functionality up to 12 times over the life of the battery. Once activated, the ACR Electronics ResQLink+ GPS personal locator beacon will continue to transmit for up to 30 hrs. in typical conditions.","short_description":"The buoyant ACR Electronics ResQLink+ GPS personal locator beacon offers all the features of the ResQLink-plus it floats! It's ideal for boaters, anglers and anyone else on or around the water.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Plbs And Satellite Messengers","thumb_url":"http://i1.avlws.com/115/s412667.png","image_url":"http://i1.avlws.com/115/l412667.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412667&tt=df","keywords":"plb","retail_price":"289.00","sale_price":"289.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412667\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412667.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=843146&amp;link=&amp;tabs=-Details\"></script>","variants":{"8431460001":{"sku":"8431460001","vendor_sku":"2881","upc":"791659028810","color":"ACRTREUSE","retail_price":"289.00","sale_price":"289.00"}},"categories":["camping-hiking","camp-electronics","plbs-and-satellite-messengers"]}
