{"sku":"843200","brand_name":"Ski Retriever","product_name":"Ski Retriever Complete Kit","long_description":"Do you love the pow, but hate searching when the inevitable runaway ski pops off your boots? The Ski Retriever Complete Kit locates your lost ski using innovative audio and visual homing signals. We've all been there; searching for a lost ski but unable to locate it, getting chilly and wasting time when we could be laying fresh tracks. Ski Retriever Complete Kit includes a small, handheld unit and 2 homing tags that attach to skis via glue and small screws. When the rogue ski buries itself in deep snow, simply turn on the handheld device and follow the signals to its location. Locating the tagged ski is very intuitive, as you move closer to the tag, the LED lights move from red to green and the audio signals increase in frequency and pitch. Radio-frequency technology offers high sensitivity and effective transmission in snowy terrain and weather. The Complete Kit Includes handheld receiver, 2 homing tags, batteries and mounting equipment. Kit offers location coverage for 1 pair of skis. Want to add location coverage to a second pair of skis? Handheld receiver can locate up to 4 skis with the addition of the Ski Retriever Tag Kit (Tag Kit sold separately).","short_description":"Do you love the pow, but hate searching when the inevitable runaway ski pops off your boots? The Ski Retriever Complete Kit locates your lost ski using innovative audio and visual homing signals.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Ski Binding Accessories","thumb_url":"http://i1.avlws.com/115/s381715.png","image_url":"http://i1.avlws.com/115/l381715.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381715&tt=df","retail_price":"159.95","sale_price":"79.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381715\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381715.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=843200&amp;link=&amp;tabs=-Details\"></script>","variants":{"8432000001":{"sku":"8432000001","upc":"899172001294","retail_price":"79.83","sale_price":"79.83"}},"categories":["snow","ski-bindings","ski-binding-accessories"]}
