{"sku":"843787","manufacturer_id":"HBC220D","brand_name":"Uclear","product_name":" UCLEAR Force Dual Snow Helmet Communication System - 2 Control Units","long_description":"Connect 2 users on the mountain with the UCLEAR Force Dual Snow Helmet Communication System. Each unit reduces ambient noise to allow clear, 2-way conversation or music listening with audio devices. Each unit syncs up with Bluetooth(R)-enabled devices and allows wireless control of music, calls using voice commands and intercom communication with other UCLEAR users. Easy-to-use controls allow you to answer/decline calls, toggle through songs, accept 3-way calls and talk to other UCLEAR users via intercom. Based on technology developed for military communications in noisy situations, wind filtering technology and noise reducer allows clear signals at high speeds. High-quality speakers ensure clarity even under noisy conditions; embedded microphones isolate user's voice for crystal-clear communication. Tough weatherproof casing resists snow and dust. Rechargeable lithium-ion battery offers 10 hrs. of talk time, charges in 2 hrs. and functions in temperatures raging from -4degF - 140degF (-20&3176;C - 60deg). Upgraded for the 2012/2013 season, the UCLEAR Force Single works as an intercom with other HBC220 units within 700m (2,296 ft.). In addition to 1-way communication, each UCLEAR HBC220 unit can piggyback on the signal of the other acting as a relay station or repeater. 2 users can communicate within 700m, add a third user and the range increases by 700m, and add a fourth user and the entire group can communicate up to 2100m (1.3 mi.). Includes 2 control units, 2 sets of speakers, temporary and permanent helmet attachments, rip-and-stick speaker attachments, USB charging cables, and car and wall chargers.","short_description":"Connect 2 users on the mountain with the UCLEAR Force Dual Snow Helmet Communication System. Each unit reduces ambient noise to allow clear, 2-way conversation or music listening with audio devices.","category":"Snowboarding","subcategory":"Snowboard Helmets","product_group":"Snowboard Helmet Accessories","thumb_url":"http://i1.avlws.com/115/s408727.png","image_url":"http://i1.avlws.com/115/l408727.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408727&tt=df","keywords":"speakers","retail_price":"479.95","sale_price":"383.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408727\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408727.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=843787&amp;link=&amp;tabs=-Details\"></script>","variants":{"8437870001":{"sku":"8437870001","vendor_sku":"HBC220D","retail_price":"383.93","sale_price":"383.93"}}}
