{"sku":"843750","manufacturer_id":"930201","brand_name":"Burley","product_name":" Burley Piccolo Trailer Bike","long_description":"The Burley Piccolo trailer bike offers the fun of pedaling along with the security of being guided by an adult on their own bike; plus, the Piccolo can be upgraded to be a full-on bicycle later on! Lightweight and sturdy aluminum frame supports a child comfortably; hitch securely mounts to the included rear rack. Hitch system features ball bearing-guided pivots to provide shimmy-free performance along with stable and secure inline handling. Over-axle pivot attachment promotes stability and good tracking; double locking mechanism ensures a secure connection. Rear rack also allows for side panniers to be carried, letting you bring along extra gear or picnic goodies; rack can support up to 65 lbs. Kids can pedal along comfortably and easily, and even shift to meet changing terrain thanks to the 7-speed drivetrain and twist grip shifter. Adjustable handlebar and seatpost make it easy to dial in the \"just right\" fit for your child. Front splash guard helps protect rider from the occasional bits of mud or rain splashing up from the lead bike's rear wheel. Safety flag and rear reflector are included to ehance visibility. Recommended for children 4 - 10 years old; Piccolo has a weight capacity up to 85 lbs. with a recommended 2:1 weight ratio from adult to child. Turn the Piccolo into a complete bicycle with the Burley Plus converter kit (sold separately).","short_description":"The Burley Piccolo trailer bike offers the fun of pedaling along with the security of being guided by an adult on their own bike; plus, the Piccolo can be upgraded to be a full-on bicycle later on!","category":"Cycling","subcategory":"Bikes","product_group":"Kids' Bikes","thumb_url":"http://i1.avlws.com/115/s376331.png","image_url":"http://i1.avlws.com/115/l376331.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376331&tt=df","keywords":"trsp123","retail_price":"359.00","sale_price":"359.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376331\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376331.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=843750&amp;link=&amp;tabs=-Details\"></script>","variants":{"8437500001":{"sku":"8437500001","vendor_sku":"930201","upc":"840840006844","size":"20 IN","color":"GREEN","retail_price":"359.00","sale_price":"359.00"}},"categories":["cycling","bikes","kids-bikes"]}
