{"sku":"844277","manufacturer_id":"PRG550-1A1CR","brand_name":"Casio","product_name":" Casio ProTrek PRG550-1A1CR Multifunction Watch","long_description":"The solar-powered, triple-sensor Casio ProTrek PRG550-1A1CR multifunction watch sports easy-to-use features, including a digital compass, altimeter, barometer and thermometer. No batteries to replace! Efficient, large-capacity solar battery requires very little light to recharge and lasts up to 6 months without recharging. 3-hand analog face features an LCD window, bringing together classic timepiece looks with cutting-edge data display capabilities. Triple sensors measure compass bearing, altitude/atmospheric pressure and temperature. Depending on the function selected, the second hand can point to magnetic north and indicate changes in atmospheric pressure or altitude from a preselected location. LCD window displays numerical sensor information such as compass direction angle value, altitude, atmospheric pressure and temperature. Features include a countdown timer, 1/100 second stopwatch, time in 12- or 24-hr. format, world time with 29 time zones, 5 daily alarms and hourly chime. Full auto LED light activates with a quick flick of the wrist, allowing you to check data and take readings with ease. Tough Solar Power conserves energy, allowing the Casio ProTrek PRG550-1A1CR multifunction watch to power down when not exposed to light for a certain period of time. 100m (330 ft.) water resistance and a stainless-steel case help protect the watch; resin wrist band is comfortable and durable.","short_description":"The solar-powered, triple-sensor Casio ProTrek PRG550-1A1CR multifunction watch sports easy-to-use features, including a digital compass, altimeter, barometer and thermometer.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413403.png","image_url":"http://i1.avlws.com/115/l413403.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413403&tt=df","keywords":"waterproof","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413403\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413403.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=844277&amp;link=&amp;tabs=-Details\"></script>","variants":{"8442770001":{"sku":"8442770001","vendor_sku":"PRG550-1A1CR","upc":"079767962531","color":"BLACK","retail_price":"299.95","sale_price":"299.95"}}}
