{"sku":"844650","manufacturer_id":"14582","brand_name":"Rei","product_name":" REI Crestrail 65 Pack - Women's","long_description":"With an all-new fit, the updated REI Crestrail 65 pack for women sports the latest in design, materials and components. It balances comfort with performance and strength for weekend or multiday trips. Women-specific pack features a slim width and short height along with a redesigned harness that's contoured and sized to comfortably fit a woman's body. ActivMotion(R) hipbelt pivots to follow the natural motion of your hips, helping balance and stabilize the pack when you're hiking on uneven terrain. Hipbelt webbing tightens with a forward pull for easy adjustment; 2 zippered hipbelt pockets provide handy access to snacks. Sculpted FreeFlow back panel has multiple peaks and valleys to reduce contact areas and allow sweat vapor to escape; soft foam conforms to your back for a stable fit. Tubular aluminum perimeter frame saves weight compared to HDPE/stay framesheets; it moves weight to your hips and stabilizes the pack, helping prevent side-to-side sway. Top-loading main compartment also features 2 zippered access points to the main bag, plus separate zippered access to the sleeping bag compartment. Large zippered front pocket, stretch stash pocket and lightweight lash points store and organize often-used gear; floating top lid expands capacity to hold large loads. Side, bottle-locking pockets secure bottles or other items, helping prevent them from falling out when bushwhacking or taking your pack off. Strategically placed Speed Hook ice axe attachments avoid interference with pockets and access zippers. Top and side compression straps pull the load closer to your back, minimize bulk and create external attachment points for gear. Cordura(R) nylon fabric resists abrasion and tears; Durable Water Resistant finish and water-resistant zippers help keep your contents dry.","short_description":"With an all-new fit, the updated REI Crestrail 65 pack for women sports the latest in design, materials and components. It balances comfort with performance and strength for weekend or multiday trips.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410559.png","image_url":"http://i1.avlws.com/115/l410559.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410559&tt=df","keywords":"multiday","retail_price":"239.00","sale_price":"239.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410559\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410559.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=844650&amp;link=&amp;tabs=-Details\"></script>","variants":{"8446500002":{"sku":"8446500002","vendor_sku":"14582","upc":"484465000025","size":"S","color":"DARK GRAPE","retail_price":"239.00","sale_price":"239.00"},"8446500003":{"sku":"8446500003","vendor_sku":"14582","upc":"484465000032","size":"M","color":"DARK GRAPE","retail_price":"239.00","sale_price":"239.00"}}}
