{"sku":"844631","manufacturer_id":"14583","brand_name":"Rei","product_name":"REI Flash 22 Pack","long_description":"The REI Flash 22 pack takes sweet simplicity and comfort to a new level. It combines a minimalist design with a lightly padded harness and removable back panel pad for your day-hiking enjoyment. Shoulder straps are lined with mesh and lightly padded for breathable comfort; removable hipbelt and sternum strap make the pack customizable for different uses. Mesh back panel offers soft and breathable comfort without excessive weight; removable back panel pad doubles as a simple sit pad. Interior zippered pocket secures keys and other small items. Hydration-compatible design has an hose exit port and an internal sleeve to hold a hydration reservoir, sold separately. Store small items within easy reach in the zippered lid pocket. Large mesh side pockets hold items for quick access. Front of pack features twin daisy chains running vertically and a tool loop at the bottom for attaching items on the front of the pack. 140-denier ripstop nylon stands up to regular use on day hikes without adding weight. REI Flash 22 pack has a 100-decibel safety whistle built into the sternum strap so you'll always have this essential item with you.","short_description":"The REI Flash 22 pack takes sweet simplicity and comfort to a new level. It combines a minimalist design with a lightly padded harness and removable back panel pad for your day-hiking enjoyment.","category":"Camping & Hiking","subcategory":"Daypacks, Hydration Packs And Waistpacks","product_group":"Daypacks","thumb_url":"http://i1.avlws.com/115/s285463.png","image_url":"http://i1.avlws.com/115/l285463.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=285463&tt=df","keywords":"pack,back,daypack,day,rucksack","retail_price":"49.50","sale_price":"34.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=285463\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m285463.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=844631&amp;link=&amp;tabs=-Details\"></script>","variants":{"8446310001":{"sku":"8446310001","vendor_sku":"14583","upc":"484463100017","color":"TITANIUM/LIME SPRITZ","retail_price":"34.93","sale_price":"34.93"},"8446310002":{"sku":"8446310002","vendor_sku":"14583","upc":"484463100024","color":"PARROT/LIME SPRITZ","retail_price":"34.93","sale_price":"34.93"}}}
