{"sku":"844652","manufacturer_id":"14580","brand_name":"Rei","product_name":"REI XT 85 Pack","long_description":"The updated REI XT 85 pack delivers comfort, performance and user-friendly features in a size and design that accommodate anything from a 10-day wilderness expedition to a weekend jaunt. Precurved shoulder straps and hipbelt comfortably match your anatomy from day one; hipbelt webbing system adjusts with a forward pull in an ergonomic motion. Sculpted back panel has multiple peaks and valleys to reduce contact areas and allow sweat vapor to escape; soft foam conforms to your back for a stable fit. Silky-smooth Dri-Lex(R) fabric lines all body contact areas for chafe-free comfort. Hybrid frame blends external-frame comfort and load transfer with internal-frame stability; X-Brace crossed stays stabilize the hipbelt against unwanted sag. Sleeve in the main compartment accommodates most hydration systems; ports allow for routing the bite valve over either shoulder (reservoir sold separately). Front pocket arrangement provides 2 zippered pockets on top of a stretch-woven stash pocket, allowing access to your gear without interference from the other pockets. Floating lid can be removed and stowed; secure key pocket is inside lid; double top collar allows you to vary the pack's capacity. Dual side-zip access allows easy retrieval of items buried deep in the pack; bottom sleeping bag compartment features a smooth curved zipper. Quick-release straps on the bottom of the pack body provide an easy attachment point for sleep pad or tent. Lash points on the hipbelt make it easy to keep camera and GPS pouches within easy reach; attachment points on the pack body feature TipGrips to keep trekking poles in place. Hipbelt pocket provides handy storage for items needed on the hike; drawcorded water bottle pockets hold bottles vertically for easy access or horizontally for extra security. Sew-free construction at lash points provides a lighter-weight alternative to sewn constructions without sacrificing strength.","short_description":"The updated REI XT 85 pack delivers comfort, performance and user-friendly features in a size and design that accommodate anything from a 10-day wilderness expedition to a weekend jaunt.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410567.png","image_url":"http://i1.avlws.com/115/l410567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410567&tt=df","keywords":"multiday","retail_price":"289.00","sale_price":"289.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=844652&amp;link=&amp;tabs=-Details\"></script>","variants":{"8446520001":{"sku":"8446520001","vendor_sku":"14580","upc":"484465200012","size":"M","color":"SLATE","retail_price":"289.00","sale_price":"289.00"},"8446520002":{"sku":"8446520002","vendor_sku":"14580","upc":"484465200029","size":"L","color":"SLATE","retail_price":"289.00","sale_price":"289.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
