{"sku":"844634","manufacturer_id":"NFRX1WXGY","brand_name":"Eton","product_name":" Eton FRX1 Radio","long_description":"The Eton FRX 1 radio comes in a compact and portable design, keeping you informed and prepared for emergencies and travel, whether you have a power source or not! Convenient power options include full-time power via hand crank and rechargeable NiMH battery pack. Included mini USB cord lets you charge up the FRX1 from a computer. Internal rechargeable NiMH battery pack stores power generated from dynamo hand crank or a computer's USB port. Handy flashlight features 3 bright white LEDs for a dependable source of light when the power is out; glow-in-the dark indicator makes it easy to locate the radio in the dark. 3.5mm earphone jack allows easy private listening with headphones (headphones not included). The Eton FRX 1 radio features an FM/AM radio receiver that can also tune in all 7 NOAA weather channels. Telescoping antenna for FM reception; internal ferrite antenna for AM reception. Analog tuning knobs on side offer smooth dialing to zero in on finicky signals; full-range monophonic front speaker serves up clear sound.","short_description":"The Eton FRX 1 radio comes in a compact and portable design, keeping you informed and prepared for emergencies and travel, whether you have a power source or not!","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412771.png","image_url":"http://i1.avlws.com/115/l412771.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412771&tt=df","retail_price":"30.00","sale_price":"30.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412771\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412771.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=844634&amp;link=&amp;tabs=-Details\"></script>","variants":{"8446340003":{"sku":"8446340003","vendor_sku":"NFRX1WXGY","upc":"750254806063","color":"SILVER","retail_price":"30.00","sale_price":"30.00"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
