{"sku":"844617","manufacturer_id":"14602","brand_name":"Rei","product_name":" REI Tech Beast 100L Duffel","long_description":"The REI Tech Beast 100L duffel delivers unmatched access, durability and storage capacity for frequent travelers whose trips are centered around multisport activites. Classic cargo duffel silhouette has a large main packing compartment and 2 zip-close end pockets; exterior zip pocket on center front holds quick-access items. Carry the Tech Beast 100L duffle over your shoulder or backpack style; backpack shoulder straps easily store away with single zipper closure when not in use. Adjustable-length shoulder strap with sliding shoulder pad provides comfort and secure single-shoulder carry. Ergonomic shape has padded back side and conforms to the body while carrying for a more comfortable journey. Top and side grab handles for ease of hauling. All exterior pocket zippers can be secured with standard travel locks, sold separately. Interior mesh zip pocket adds organization. REI Tech Beast 100L duffel is made from rugged, water-repellent materials; light-colored lining lets you find items easily. This large-capacity Beast also works great for occasional airline travel for more remote adventures.","short_description":"The REI Tech Beast 100L duffel delivers unmatched access, durability and storage capacity for frequent travelers whose trips are centered around multisport activites.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Travel Duffels","thumb_url":"http://i1.avlws.com/115/s433583.png","image_url":"http://i1.avlws.com/115/l433583.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433583&tt=df","retail_price":"119.00","sale_price":"119.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433583\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433583.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=844617&amp;link=&amp;tabs=-Details\"></script>","variants":{"8446170001":{"sku":"8446170001","vendor_sku":"14602","upc":"484461700011","size":"100 LTR","color":"BLACK/COAL","retail_price":"119.00","sale_price":"119.00"}},"categories":["travel","luggage","travel-duffels"]}
