{"sku":"845265","manufacturer_id":"2510-02211-0520","brand_name":"Mammut","product_name":" Mammut Trion Light 40 Pack","long_description":"Perfect for mountaineering, the Mammut Trion Light 40 pack is a clean, lean top-loader with a waterproof lid. Strip it down to an ultralight weight and still enjoy impressive comfort and performance. Removable hipbelt, shoulder straps and back panel feature 2-layer, high-density EVA padding and laminated stretch fabric covers for breathable comfort. Shaped shoulder straps and hipbelt follow the contours of your body. Suspension allows full freedom of movement for your upper body with a torsionally flexible, anatomically-shaped frame that transfers the load to your hips. Hydration-compatible design features a reservoir sleeve and tube exit port for on-the-go hydration (reservoir sold separately). Removable top lid with taped seams sports internal and external pockets for organizing small essentials. Reinforced ski carrier, daisy chain gear carrier and 2 removable ice tool attachment points let you lash tools and gear to the outside of the pack. Mammut Trion Light 40 pack features compression straps that can be tensioned at the sides or front.","short_description":"Perfect for mountaineering, the Mammut Trion Light 40 pack is a clean, lean top-loader with a waterproof lid. Strip it down to an ultralight weight and still enjoy impressive comfort and performance.","category":"Climbing","subcategory":"Climbing Essentials","product_group":"Climbing Packs","thumb_url":"http://i1.avlws.com/115/s407003.png","image_url":"http://i1.avlws.com/115/l407003.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407003&tt=df","retail_price":"189.95","sale_price":"189.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407003\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407003.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845265&amp;link=&amp;tabs=-Details\"></script>","variants":{"8452650001":{"sku":"8452650001","vendor_sku":"2510-02211-0520","color":"CEMENT/GRAPHITE","retail_price":"189.95","sale_price":"189.95"}},"categories":["climbing","climbing-essentials","climbing-packs"]}
