{"sku":"845269","manufacturer_id":"S8500","brand_name":"Bic Sport","product_name":"BIC Sport ACE-TEC Wing Stand Up Paddleboard - 12' 6\"","long_description":"Hit the water on the Bic Sport ACE-TEC Wing 12 ft. 6 in. stand up paddleboard and enjoy the smooth, easy glide. Aimed at riders looking for excellent flatwater performance, the Bic Sport ACE-TEC Wing 12 ft. 6 in. stand up paddleboard supports paddlers from 170 - 308 lbs. 12 ft. 6 in. length makes it easy to glide along the shore during fitness paddles, flatwater or ocean touring and recreational racing. Flat hull under standing area increases stability and slightly V-shaped tail section reduces drag. High-volume bow and sharp V shape cuts easily through chop and smooths out the ride. EPS foam core wrapped with an epoxy resin/fiberglass cloth is encased in a styrene polymer outer shell; construction offers lightweight durability. Multiaxial fiberglass cloth distributes weight in multiple directions in the board, offering excellent stiffness and low weight. Padded deck supplies reliable wax-free traction when paddling in the standing or kneeling position, and it increases comfort on long paddles. Recessed standing area on the deck makes it easy to stay on your feet. 9 in. single fin promotes straight tracking in the water. FCS SUP Touring fin features injection-molded construction and a specialized structure on the inside face of the fin that reduces drag and enhances performance. 9 deck clips offer multiple spots to attach day-tripping accessories. Integrated carry handle on deck makes toting the 34 lb. the Bic Sport ACE-TEC Wing 12 ft. 6 in. stand up paddleboard quick and easy. Please note that the color of the deck pad on the tail of the board may be gray and not colored.","short_description":"Hit the water on the Bic Sport ACE-TEC Wing 12 ft. 6 in. stand up paddleboard and enjoy the smooth, easy glide.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430771.png","image_url":"http://i1.avlws.com/115/l430771.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430771&tt=df","retail_price":"1299.95","sale_price":"1299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430771\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430771.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845269&amp;link=&amp;tabs=-Details\"></script>","variants":{"8452690001":{"sku":"8452690001","vendor_sku":"S8500","upc":"883667004327","color":"WHITE/RED","retail_price":"1299.95","sale_price":"1299.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
