{"sku":"845205","manufacturer_id":"13-50100-63","brand_name":"Mountainsmith","product_name":" Mountainsmith Apex 80 Pack","long_description":"Feel the miles float by with the Mountainsmith Apex 80 pack. This expedition workhorse is loaded with high-performance features, organization and carrying comfort for your backcountry adventure. Innovative hipbelt, lumbar pad and dual-density shoulder straps enhance the body's ability to bear weight on the hips and lumbar and offer a comfortable ride on the shoulders. Open spinal column runs the length of the upper torso, allowing perspiration and heat to escape; elevated foam pods with air channels on either side wick moisture. Spacious main compartment is crowned by a detachable top lid that converts into a lumbar pack or shoulder sling; webbing underneath the top lid secures rope or accessories. Hydration-compatible design features a drink tube exit port for on-the-go hydration (reservoir sold separately); dedicated sleeping bag compartment makes it easy to catch Zs. The Mountainsmith Apex 80 pack features front and side accessory pockets, dual water bottle pockets, tool/trekking pole mounts and quick-release compression straps.","short_description":"Feel the miles float by with the Mountainsmith Apex 80 pack. This expedition workhorse is loaded with high-performance features, organization and carrying comfort for your backcountry adventure.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s445551.png","image_url":"http://i1.avlws.com/115/l445551.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445551&tt=df","keywords":"multiday","retail_price":"209.95","sale_price":"209.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445551\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445551.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845205&amp;link=&amp;tabs=-Details\"></script>","variants":{"8452050001":{"sku":"8452050001","vendor_sku":"13-50100-63","upc":"757894321802","color":"MIDNIGHT BLUE","retail_price":"209.95","sale_price":"209.95"}}}
