{"sku":"845306","manufacturer_id":"14452","brand_name":"Rei","product_name":"REI InCamp 4 Tent","long_description":"The REI InCamp 4 Tent is a weatherproof refuge that packs small and lets you customize your campground coverage when you add an InCamp shelter and other accessories. The large door is designed to dock under the edge of an InCamp Shelter 100 (sold separately). Double-lobed door can be opened on either side or zipped fully open; door can also stow inside a stuff pocket. Front vestibule provides covered storage; vestibule door can also be staked out as an awning (poles sold separately). Windproof wall fabric blocks blowing sand, while mesh windows and a roof vent provide fresh air. Efficient rectangular floor plan makes it easy to arrange sleeping bags and gear. Clips, pole sleeves and a stable aluminum frame make setup simple. Multiple pockets and hang loops help organize the interior. The InCamp 4 Tent comes with a convenient duffel-style storage sack, stakes, guylines and tighteners, as well as a pole-repair tube, a pole bag and a stake bag. The REI InCamp 4 Tent Footprint is sold separately.","short_description":"The REI InCamp 4 Tent is a weatherproof refuge that packs small and lets you customize your campground coverage when you add an InCamp shelter and other accessories.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424407.png","image_url":"http://i1.avlws.com/115/l424407.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424407&tt=df","retail_price":"259.00","sale_price":"259.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424407\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424407.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845306&amp;link=&amp;tabs=-Details\"></script>","variants":{"8453060001":{"sku":"8453060001","vendor_sku":"14452","upc":"484530600013","color":"MESA ORANGE/BUCKWHEAT","retail_price":"259.00","sale_price":"259.00"}}}
