{"sku":"845306","manufacturer_id":"14452","brand_name":"Rei","product_name":"REI InCamp 4 Tent","long_description":"The REI InCamp 4 is a \"just-right\" camping tent that offers friends and families a weatherproof refuge. Pair it with the InCamp Shelter for an extended living space where the whole gang can hang out. REI InCamp 4 tent is built for weatherproof integration with the REI InCamp Shelter (sold separately) to extend your living space. Freestanding, compact footprint features a tall entry for easy, wide-open access. Pole clips and sleeves provide a quick and stable setup; all-aluminum, pre-bent frame is strong and durable. Rectangular floor plan makes it easy to arrange sleeping bags and gear, and allows efficient use of space. Huge single door with roof stuff pocket opens fully or to either side for easy access and ventilation. Compact vestibule provides dry-entry awning for weather protection. Perimeter of windproof, breathable fabric keeps dust and sand from blowing in from under the fly. Fully adjustable from inside tent, the high-level vent reduces condensation, drawing cool air under the fly from the lower perimeter and exhausting the warm, moist air. Fly is seam-sealed, 75-denier polyester for high strength and low stretch, ensuring a taut pitch. Floor is 210-denier polyester oxford for durable abrasion resistance. Multiple interior storage options provided by 4 mesh side pockets and hang loops located throughout. Includes zippered, duffel-style stuff sack, stakes, guylines and tighteners, pole repair tube, and pole and stake bags. Add 2 REI Adjustable Tarp Poles (sold separately) to create a 6 ft. awning over the InCamp tent's door.","short_description":"The REI InCamp 4 is a \"just-right\" camping tent that offers friends and families a weatherproof refuge. Pair it with the InCamp Shelter for an extended living space where the whole gang can hang out.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Family & Car Camping Tents","thumb_url":"http://i1.avlws.com/115/s294335.png","image_url":"http://i1.avlws.com/115/l294335.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=294335&tt=df","keywords":"cottent","retail_price":"259.00","sale_price":"259.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=294335\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m294335.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845306&amp;link=&amp;tabs=-Details\"></script>","variants":{"8453060001":{"sku":"8453060001","vendor_sku":"14452","upc":"484530600013","color":"MESA ORANGE/BUCKWHEAT","retail_price":"259.00","sale_price":"259.00"}}}
