{"sku":"845316","manufacturer_id":"14467","brand_name":"Rei","product_name":"REI Flash Sleeping Bag - Women's","long_description":"Using an innovation combination of goose down and synthetic insulation, the REI Flash women's sleeping bag uses the best of both worlds to bring you a lightweight bag that balances warmth and weight. Down insulation is put on top of bag where it contributes the most warmth and loft; synthetic insulation on bottom of bag for a stable, moisture-resistant insulation layer. 800-fill-power goose down is efficiently distributed for maximum warmth and compressibility. Exclusive REI Down Fill Calculator optimizes the amount of down per baffle for the most warmth with the least amount of down. Soft PrimaLoft(R) Sport synthetic insulation feels like goose down but continues to work even if wet; dries quickly, too. In-the-round pattern wraps vertical baffles around perimeter of sleeping bag, from head to foot, creating a 3-dimensional bag that wraps you in warmth. Performance fit saves weight by reducing girth at shoulders, hips and lower legs while increasing thermal efficiency. Women-specific bags are cut to match a woman's shape, and provide extra insulation and warmth in the hood and feet areas. Baffle spacing allows the down to remain fully lofted and keeps it from shifting, preventing cold spots. Waterproof, breathable shell fabric is used on hood, side panels and footbox to increase moisture resistance in areas that often come in contact with tent side walls. Shell fabric is treated with a Durable Water Repellent finish to repel moisture and stains. Ultralight, mini-ripstop polyester lining has a soft hand feel and is comfortable against your skin. Multichambered contour hood, insulated full-face muffler, and full-length zipper draft tube with ground-level seams all work to keep heat in and cold out. Trapezoidal footbox mirrors sleeping position for room to move and thermal efficiency. Differentiated drawcords (1 round, 1 flat) let you adjust hood and neck easily in the dark.","short_description":"Using an innovation combination of goose down and synthetic insulation, the REI Flash women's sleeping bag uses the best of both worlds to bring you a lightweight bag that balances warmth and weight.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s284503.png","image_url":"http://i1.avlws.com/115/l284503.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=284503&tt=df","keywords":"bag,cold,insulated,winter,sleep","retail_price":"279.00","sale_price":"154.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=284503\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m284503.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845316&amp;link=&amp;tabs=-Details\"></script>","variants":{"8453160002":{"sku":"8453160002","vendor_sku":"14467","upc":"484531600029","size":"Long Right","color":"CITRINE","retail_price":"154.83","sale_price":"154.83"}}}
