{"sku":"845310","manufacturer_id":"BD1121340000110","brand_name":"Black Diamond","product_name":" Black Diamond Ultra Mountain FL Z-Pole Women's Trekking Poles - Pair","long_description":"Never break your stride with the packable and quick-deploying Black Diamond Ultra Mountain FL Z-Pole trekking poles. Sized for women, they offer extra stability when backpacking or cruising powder. Folding Z-Pole system features 3 sections of light, strong aluminum shafts, an inner Kevlar(R) cord and single push-button release. When you're ready to go, innovative \"speed cones\" help guide each pole section into place, ensuring stability and super-fast deployment. To deploy, simply give a quick pull on the grip and the 3 pole sections snap into place; cinch down the FlickLock Pro clasp on the top pole section to lock in the tension. FlickLock Pro clasp is 20% smaller and 30% easier to open than its predecessor, and offers twice the holding force. Shafts collapse easily to fit into your pack; flexible tube ends protect the inner Kevlar(R) cord when folded. Lightweight EVA foam grips feature breathable, moisture-wicking straps and non-slip foam mini grips that extend down the poles for secure choke-ups. The Black Diamond Women's Ultra Mountain FL trekking poles feature flexible carbide tips and come with rubber tip covers, trekking baskets and powder baskets.","short_description":"Never break your stride with the packable and quick-deploying Black Diamond Ultra Mountain FL Z-Pole trekking poles. Sized for women, they offer extra stability when backpacking or cruising powder.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Trekking Poles And Hiking Staffs","thumb_url":"http://i1.avlws.com/115/s418835.png","image_url":"http://i1.avlws.com/115/l418835.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418835&tt=df","keywords":"collapsible","retail_price":"139.95","sale_price":"139.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418835\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418835.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845310&amp;link=&amp;tabs=-Details\"></script>","variants":{"8453100001":{"sku":"8453100001","vendor_sku":"BD1121340000110","upc":"793661175193","size":"95 CM-110 CM","color":"AMETHYST","retail_price":"139.95","sale_price":"139.95"}},"categories":["camping-hiking","gadgets","trekking-poles-and-hiking-staffs"]}
