{"sku":"845315","manufacturer_id":"14466","brand_name":"Rei","product_name":"REI Flash Sleeping Bag","long_description":"Our lightest backpacking bag, the REI Flash is an innovative hybrid of warm, packable goose down on top, resilient synthetic fill underneath and waterproof fabric in key areas for great versatility. 800-fill goose down on top of bag provides maximum warmth and compressibility; bag is rated to 32degF. Soft PrimaLoft(R) Sport synthetic insulation on the bottom of the bag provides a stable layer that continues to warm even if wet and dries quickly. Waterproof, breathable shell fabric on hood, side panels and footbox increases moisture resistance in areas that often come in contact with tent side walls. Ripstop nylon shell fabric on the rest of the bag is treated with a Durable Water Repellent finish to repel moisture and stains. Ultralight, mini-ripstop polyester lining is soft and comfortable against your skin. Baffles wrap around perimeter of sleeping bag to maximize warmth from head to foot; baffles keep the down from shifting, preventing cold spots. Performance fit saves weight by reducing girth at shoulders, hips and lower legs; trapezoidal footbox accommodates a natural sleeping position. Multichambered contoured hood, insulated full-face muffler, full-length zipper draft tube and ground-level seams all work to keep heat in and cold out. Differentiated drawcords (1 round, 1 flat) let you adjust hood and neck easily in the dark. Zipper is backed by wide, antisnag binding tape; the REI Flash sleeping bag can be zipped to any other REI backpacking bag (women's bags zip on the right, men's on the left). European Norm (EN) rating for men is 32degF and 41degF for women; EN is an independent third-party temperature rating, allowing accurate comparisons across brands. Includes stuff sack and storage bag.","short_description":"Our lightest backpacking bag, the REI Flash is an innovative hybrid of warm, packable goose down on top, resilient synthetic fill underneath and waterproof fabric in key areas for great versatility.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s284499.png","image_url":"http://i1.avlws.com/115/l284499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=284499&tt=df","keywords":"insulated,cold,bag,sleeping,sleep","retail_price":"269.00","sale_price":"199.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=284499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m284499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845315&amp;link=&amp;tabs=-Details\"></script>","variants":{"8453150002":{"sku":"8453150002","vendor_sku":"14466","upc":"484531500022","size":"Long Left","color":"CACTUS","retail_price":"199.93","sale_price":"199.93"}}}
