{"sku":"845485","brand_name":"The North Face","product_name":"The North Face Hightail 3S Sleeping Bag","long_description":"Follow your adventurous spirit to beautiful mountain summits and know you'll sleep comfortably at night when you get there in the warm and lightweight Hightail 3S sleeping bag from The North Face. Lightweight, premium 850-fill-power goose down is highly compressible and offers a superior warmth-to-weight ratio; regular-length bag weighs only 2 lbs. With a lower-limit European Norm (EN) rating of 15degF, the Hightail 3S is a versatile bag for lightweight adventures into the mountains. Synthetic insulation pads are sewn in high-pressure areas on the bottom of the sleeping bag to create a compression-resistant buffer between you and the hard ground. Pertex(R) Endurance(TM) fabric is used on the head, collar and footbox to keep moisture from seeping in. Trapezoidal side baffles are constructed to trap insulation and prevent it from shifting to eliminate cold spots. Footbox allows natural foot movement while also eliminating excess lateral space so you stay warm and comfortable all night long. Fitted hood with drawcords lets you seal in warmth; when it's cold enough to cinch down the hood, the down-insulated draft collar snugs comfortably and holds in warmth. Insulated draft tube backs the zipper to prevent warm air from escaping; anti-snag tape keeps the zipper from catching on the draft tube. Full-length, 2-way zipper lets you make adjustments for ventilation. No more fumbling with the zipper in the middle of the night thanks to the glow-in-the-dark zipper pull. The North Face Hightail 3S sleeping bag comes with a stuff sack and storage bag. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Follow your adventurous spirit to beautiful mountain summits and know you'll sleep comfortably at night when you get there in the warm and lightweight Hightail 3S sleeping bag from The North Face.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s306747.png","image_url":"http://i1.avlws.com/115/l306747.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=306747&tt=df","keywords":"cold,sleep,sleeping,winter,insulated","retail_price":"429.00","sale_price":"429.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=306747\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m306747.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845485&amp;link=&amp;tabs=-Details\"></script>","variants":{"8454850004":{"sku":"8454850004","vendor_sku":"A2UWTC0","upc":"766182003672","size":"Long Right","color":"METALLIC SILVER/ATHENS BL","retail_price":"429.00","sale_price":"429.00"}}}
