{"sku":"845421","manufacturer_id":"153 356 527","brand_name":"Native Eyewear","product_name":" Native Eyewear Andes Reflex Polarized Sunglasses","long_description":"Eyewear protection for year-round use with added glare protection, the Native Andes Reflex polarized sunglasses feature interchangeable lenses to protect you eyes from the elements anytime of the day. Each frame includes 1 set of polarized lens and 1 set of SportFlex(TM) lenses, for a total of 2 sets of lenses. Interchangeable lens system lets you switch lenses to accommodate a variety of light conditions and activities. N3(TM) polarized lenses block 40% of infrared light (decreasing eye fatigue), offer UV protection and blue light filtering to minimize haze and enhance clarity. Lenses are built to withstand a high-velocity impact. Moss/Asphalt frames feature polarized Bronze (brown tint) Reflex lenses that work well in extremely bright sunlight; Reflex- lenses provide increased glare reduction. Asphalt/Iron frames feature polarized Blue (gray tint) Reflex lenses that work well in extremely bright sunlight; Reflex lenses provide increased glare reduction. Frames endure extreme highs and lows in temperature. Frames are extremely lightweight, yet flexible and durable enough to withstand high velocity collisions. Self-adjusting Cushinol(TM) nosepads and ear stems create a nonslip grip that keeps sunglasses in place, ensuring a soft feel and personalized fit. Temple ends hug behind your ears to keep sunglasses in place. Cam-action spring hinges quickly lock temples into position. Additional SportFlex orange-yellow lenses have a mirror coating suitable for a range of low lighting-cloudy, overcast, dusk and dawn. Native Andes interchangeable polarized sunglasses include a protective case and a soft pouch that doubles as a cleaning cloth. Frames best fit medium profiles.","short_description":"Eyewear protection for year-round use with added glare protection, the Native Andes Reflex polarized sunglasses feature interchangeable lenses to protect you eyes from the elements anytime of the day.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423031.png","image_url":"http://i1.avlws.com/115/l423031.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423031&tt=df","keywords":"Cycling","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423031\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423031.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845421&amp;link=&amp;tabs=-Details\"></script>","variants":{"8454210001":{"sku":"8454210001","vendor_sku":"153 356 527","upc":"764824010569","size":"BRONZE REFLEX","color":"MOSS/ASPHALT","retail_price":"149.00","sale_price":"149.00"},"8454210002":{"sku":"8454210002","vendor_sku":"153 302 526","upc":"764824010552","size":"BLUE REFLEX","color":"ASPHALT/IRON","retail_price":"149.00","sale_price":"149.00"}}}
