{"sku":"845489","manufacturer_id":"A2UGD2E","brand_name":"The North Face","product_name":" The North Face Mica FL 1 Tent","long_description":"The North Face Mica FL 1 tent is an ultralight, 1-person tent with generous headroom. It also has an easy-access side door with a dry entry and nice size vestibule to store your gear. No-see-um mesh canopy facilitates warm-weather comfort and breathability; asymmetric floor adds extra width at one end for head and shoulder room. Crossing ridge pole maximizes interior volume and provides a dry entrance. Hubbed poleset and color-coded webbing make setup quick and easy. Lightweight and strong DAC Featherlite(R) NSL poles with press-fit connectors use an anodization process that lessens environmental impact. Twist-clips make pitching and disassembly easy and fast, and save weight. High-low ventilation design harnesses convection and cross flow to help expel moisture vapor and prevent interior condensation. Superlight silicone- and polyurethane-coated, high-tenacity nylon rainfly material is rugged and weatherproof; fully taped bathtub floor prevents leaks through seams. Adjustable vestibule stakeout ensures a taut pitch and maximizes space. Convenient side pockets stow headlamps and fragile items; also features abundant gear loops. Reflective guyline loops, guylines and glow-in-the-dark zipper pulls make life easier at night. As a convenient option, poles and rainfly can be set up with the footprint (sold separately) to create a lightweight shelter. The North Face Mica 1 tent comes with stuff sacks, DAC tent stakes and guyline/tighteners.","short_description":"The North Face Mica FL 1 tent is an ultralight, 1-person tent with generous headroom. It also has an easy-access side door with a dry entry and nice size vestibule to store your gear.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423875.png","image_url":"http://i1.avlws.com/115/l423875.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423875&tt=df","retail_price":"319.00","sale_price":"319.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423875\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423875.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845489&amp;link=&amp;tabs=-Details\"></script>","variants":{"8454890001":{"sku":"8454890001","vendor_sku":"A2UGD2E","upc":"637439202530","color":"WINTER STONE IVORY/WIEMAR","retail_price":"319.00","sale_price":"319.00"}}}
