{"sku":"845482","manufacturer_id":"12237","brand_name":"Rei","product_name":"REI Half Dome 4 Tent","long_description":"Lightweight, weather worthy and strong for 3-season use, the REI Half Dome 4 backpacking tent offers generous headroom, storage and easy access for up to 4 people. 2 side doors and 2 vestibules offer easy access and personalized storage for each occupant; 4 vents ensure the tent stays well ventilated. Rectangular floor plan optimizes usable space and allows comfortable sleeping shoulder-to-shoulder or head-to-toe. Color-coded poles and pole clips ensure an easy setup. Advanced frame design combines DAC(R) Pressfit poles with dual-hub architecture to provide areawide headroom with nearly vertical side and end walls. Exclusive Tension Truss architecture leverages bound seams to provide low-weight structural stability and to increase interior volume. 4 adjustable, high-level ceiling vents mitigate condensation by drawing cool air under the fly and exhausting warm, moist air. Waterproof floor with sealed seams has bathtub curves that stay taut for easy door zipper operation and maximize volume at end walls. Multiple storage options include corner pockets, roof pockets and hang loops; additional stuff pockets hold doors out of the way and do double duty as storage. Shape and position of tent door zippers allow for smooth, 1-handed operation; vestibule zipper can be opened more or less to fine-tune the weather protection and ventilation. Durable polyester rainfly holds a consistently taut pitch and resists UV degradation. No-wick welded construction ensures that moisture won't sneak through susceptible areas, such as guyout points, pole wraps and zippers. Includes guylines with tighteners, stakes and pole repair tube; tapered, easy-to-stuff compression stuff sack, pole bags and stake bags keep everything organized. Save weight and create a minimalist shelter by using just the rainfly, footprint (sold separately), poles and stakes.","short_description":"Lightweight, weather worthy and strong for 3-season use, the REI Half Dome 4 backpacking tent offers generous headroom, storage and easy access for up to 4 people.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s284279.png","image_url":"http://i1.avlws.com/115/l284279.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=284279&tt=df","keywords":"backpacktent,tent","retail_price":"289.00","sale_price":"289.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=284279\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m284279.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845482&amp;link=&amp;tabs=-Details\"></script>","variants":{"8454820002":{"sku":"8454820002","vendor_sku":"12237","upc":"484548200021","color":"ORANGE SKY/REDROCK","retail_price":"289.00","sale_price":"289.00"}}}
