{"sku":"845493","manufacturer_id":"A2ULD3T","brand_name":"The North Face","product_name":"The North Face Kings Canyon 2 Tent","long_description":"The North Face Kings Canyon 2 is a roomy, freestanding backpacking tent big enough for base camp, but rugged enough for backcounty exploration. 2 doors with 2 vestibules offer private entries and personal gear storage. Double hubbed poleset, crossing ridge pole and combination-diameter pole sizes maximize interior volume and provide a dry entrance. Color-coded webbing and poles make setup quick and easy. Lightweight and strong DAC Featherlite(R) NSL poles with press-fit connectors use an anodization process that lessens environmental impact. Twist-clips make pitching and disassembly easy and fast, and save weight. High-low ventilation design harnesses convection and cross flow to help expel moisture vapor and prevent interior condensation. Lightweight silicone- and polyurethane-coated high-tenacity nylon rainfly material is rugged and weatherproof; fully taped bathtub floor prevents leaks through seams. Convenient overhead pockets stow headlamps and fragile items; also features abundant gear loops. Reflective guyline loops, guylines and glow-in-the-dark zipper pulls make life easier at night. As a convenient option, poles and rainfly can be set up with the footprint (sold separately) to create a lightweight shelter. The North Face Kings Canyon 2 tent comes with stuff sacks, DAC tent stakes and guyline/tighteners.","short_description":"The North Face Kings Canyon 2 is a roomy, freestanding backpacking tent big enough for base camp, but rugged enough for backcounty exploration.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s293419.png","image_url":"http://i1.avlws.com/115/l293419.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=293419&tt=df","keywords":"backpacktent,tent","retail_price":"329.00","sale_price":"239.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=293419\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m293419.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845493&amp;link=&amp;tabs=-Details\"></script>","variants":{"8454930001":{"sku":"8454930001","vendor_sku":"A2ULD3T","upc":"766182534947","color":"FOSSIL IVORY/BOMBER BLUE","retail_price":"239.93","sale_price":"239.93"}}}
