{"sku":"845511","manufacturer_id":"13087","brand_name":"Rei","product_name":"REI Siesta Double Sleeping Bag","long_description":"The REI Siesta double sleeping bag brings the creature comforts of home to the campsite, yurt or cabin. This roomy bag provides warmth and comfort for 2 happy campers. Generous barrel shape provides ample interior volume, making it ideal for those who prefer a roomy fit. Hollow-core insulation delivers a balance of compressibility, warmth and durability; bag continues to insulate when wet and dries quickly. Ripstop nylon shell is abrasion- and tear-resistant for years of use. Shell fabric is treated with a Durable Water Repellent finish to repel moisture and stains. Main body features a smooth polyester taffeta lining that breathes for comfort and feels great against skin. Brushed polyester knit lining panels near the head and face offer the softness of your favorite T-shirt with the moisture-wicking properties of a high-tech fabric. Layered offset quilt construction eliminates cold spots. For sharing the load, bag zips apart to become 2 bags; bags can be used separately or connected to another Siesta sleeping bag/sheet (sold separately) for customized comfort. Full side and bottom zipper access; bags can be completely unzipped and opened up for use as comforters. Zippers are backed by wide, antisnag binding tape. REI Siesta +35degF sleeping bag includes a cotton storage bag.","short_description":"The REI Siesta double sleeping bag brings the creature comforts of home to the campsite, yurt or cabin. This roomy bag provides warmth and comfort for 2 happy campers.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s282127.png","image_url":"http://i1.avlws.com/115/l282127.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=282127&tt=df","keywords":"winter,insulated,sleeping,sleep,cold","retail_price":"169.00","sale_price":"114.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=282127\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m282127.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845511&amp;link=&amp;tabs=-Details\"></script>","variants":{"8455110001":{"sku":"8455110001","vendor_sku":"13087","upc":"478906300850","size":"Long","color":"DEEP SEA","retail_price":"114.93","sale_price":"114.93"}}}
