{"sku":"845671","manufacturer_id":"16-09-04","brand_name":"Switch","product_name":"Switch Zealot Interchangeable Polarized Sunglasses","long_description":"Whether you need to pump up the color or reduce the glare, the Switch Zealot polarized sunglasses offer a speedy magnetic lens interchange system to swap out lenses as light conditions change. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Switch interchangeable system uses high-energy embedded magnets, so lenses jump into place when brought near the frames. Magnets are engineered to stay in place when subjected to the intense jarring of skiing, snowboarding, running or mountain biking. Superior grade nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Frames include 2 sets of lenses-1 set of polarized lenses for bright light and 1 set of non-polarized, rose-tinted lenses for low light. Frames come with gray polarized lenses, which provide true color definition on bright, sunny days. Lightweight and virtually shatterproof, polycarbonate lenses are 20 times more impact resistant than glass and one-third the weight. TriGuard(TM) thin-film lens coating is easy to clean, withstands rough handling and causes water to bead up and run off. Magnetic LensPod(TM) keeps your lenses protected in an easy-to-carry, contoured case. Switch Zealot polarized sunglasses also come with a microfiber cleaning pouch. Best fits medium to large profiles.","short_description":"Whether you need to pump up the color or reduce the glare, the Switch Zealot polarized sunglasses offer a speedy magnetic lens interchange system to swap out lenses as light conditions change.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423035.png","image_url":"http://i1.avlws.com/115/l423035.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423035&tt=df","keywords":"Cycling","retail_price":"189.00","sale_price":"189.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423035\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423035.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845671&amp;link=&amp;tabs=-Details\"></script>","variants":{"8456710001":{"sku":"8456710001","vendor_sku":"16-17-01","upc":"813046012018","size":"GREY POLARIZED","color":"OLIVE/BLACK","retail_price":"189.00","sale_price":"189.00"},"8456710002":{"sku":"8456710002","vendor_sku":"16-09-04","upc":"484567100029","size":"GREY POLAR/BLUE MIRROR","color":"SHINY BLACK","retail_price":"189.00","sale_price":"189.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
