{"sku":"845777","manufacturer_id":"APOCJK3","brand_name":"The North Face","product_name":"The North Face Prophet 40 Pack","long_description":"The top-loading North Face Prophet 40 pack travels light and fast with a sleek design and uncompromising quality for climbers and mountaineers who reach for the summits. Breathable, molded back panel uses perforated foam to eliminate excess weight and circulate air through channels; back panel can be removed and used as a bivy pad. Anatomic shoulder straps use perforated foam to eliminate excess weight and circulate air through channels. Formed hipbelt features molded gear loops which let you easily attach climbing tools and gear. Simple, supportive tubular stay offers stability and light weight. Internal pocket holds hydration reservoir (sold separately) for hands-free drinking on the trail. Top lid of North Face Prophet 40 pack features a generous zippered stash pocket. Bombastic(TM) fabric is traditionally used for car airbags; welded reinforcements and double fabric on base of pack enhance abrasion resistance and durability. Side compression straps with hypalon reinforcement wings secure both large and small loads for increased stability. Haul an assortment of climbing gear with the expandable wand pockets, dual haul loops, adjustable tool loops and elastic ice axe attachment.","short_description":"The top-loading North Face Prophet 40 pack travels light and fast with a sleek design and uncompromising quality for climbers and mountaineers who reach for the summits.","category":"Camping & Hiking","subcategory":"Specialized Packs","product_group":"Climbing Packs","thumb_url":"http://i1.avlws.com/115/s306543.png","image_url":"http://i1.avlws.com/115/l306543.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=306543&tt=df","keywords":"pack,climbing,climb,scrambling,backpack","retail_price":"179.00","sale_price":"179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=306543\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m306543.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845777&amp;link=&amp;tabs=-Details\"></script>","variants":{"8457770001":{"sku":"8457770001","vendor_sku":"APOCC8T","upc":"732075054045","size":"S/M","color":"SUMMIT GOLD/ASPHALT GREY","retail_price":"133.93","sale_price":"133.93"},"8457770002":{"sku":"8457770002","vendor_sku":"APOCC8T","upc":"732075054052","size":"M/L","color":"SUMMIT GOLD/ASPHALT GREY","retail_price":"133.93","sale_price":"133.93"}}}
