{"sku":"845867","manufacturer_id":"27630-9260","brand_name":"Marmot","product_name":" Marmot Astral 3P Tent","long_description":"The Marmot Astral 3P tent is a great option for long backpacking or biking trips where space and weight are main concerns. It offers the protection and reliability needed for wilderness journeys. Marmot Astral 3P boasts vertical sidewalls for a spacious interior; vertical wall design also prevents water from dripping into the tent when the rainfly is open. 2 doors and 2 vestibules provide easy access and personal storage for 3 campers. Mesh canopy walls circulate air and offer exceptional views during warm, clear nights. DAC Featherlite(R) NSL hubbed polesets are super lightweight yet strong, and are annodized without the use of harmful acids; rear brow pole extends headroom. Color-coded poles and clips simplify and speed tent setup. Catenary-cut floor provides a tight pitch; taped seams are lifted off the ground to ensure waterproof protection. Lightweight, durable ripstop nylon rainfly has silicone and polyurethane coatings for waterproof protection and UV resistance. Inside pockets store and organize small gear inside the Marmot Astral 3P tent. As a convenient option, poles and rainfly can be set up with the footprint (sold separately) to create a lightweight shelter.","short_description":"The Marmot Astral 3P tent is a great option for long backpacking or biking trips where space and weight are main concerns. It offers the protection and reliability needed for wilderness journeys.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423903.png","image_url":"http://i1.avlws.com/115/l423903.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423903&tt=df","retail_price":"459.00","sale_price":"339.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423903\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423903.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845867&amp;link=&amp;tabs=-Details\"></script>","variants":{"8458670001":{"sku":"8458670001","vendor_sku":"27630-9260","upc":"785562391819","color":"VINTAGE ORANGE","retail_price":"339.93","sale_price":"339.93"}},"categories":["camping-hiking","tents","backpacking-tents"]}
