{"sku":"845870","manufacturer_id":"27050-9260","brand_name":"Marmot","product_name":" Marmot Eclipse 3P Tent","long_description":"The Marmot Eclipse 3P tent is simple and sleek with a narrow design and bullet-nose front entry. It is low profile even for 3 people while offering ample leg and head room. Unique pole design offers a spacious interior at the front of the tent and ample leg room at the rear. Mesh canopy walls circulate air and offer exceptional views during warm, clear nights. Color-coded poles and clips simplify and speed tent setup. DAC Featherlite(R) NSL hubbed polesets are super lightweight yet strong, and are anodized without the use of harmful acids. Catenary-cut floor provides a tight pitch; taped seams are lifted off the ground to ensure waterproof protection. Lightweight, durable ripstop nylon rainfly has silicone and polyurethane coatings for waterproof protection and UV resistance. Inside pockets store and organize small gear inside the Marmot Eclipse 3P tent. Light-reflective guyout points help you find your tent at night. As a convenient option, poles and rainfly can be set up with the footprint (sold separately) to create a lightweight shelter.","short_description":"The Marmot Eclipse 3P tent is simple and sleek with a narrow design and bullet-nose front entry. It is low profile even for 3 people while offering ample leg and head room.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423907.png","image_url":"http://i1.avlws.com/115/l423907.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423907&tt=df","retail_price":"439.00","sale_price":"319.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423907\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423907.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845870&amp;link=&amp;tabs=-Details\"></script>","variants":{"8458700001":{"sku":"8458700001","vendor_sku":"27050-9260","upc":"785562391352","color":"VINTAGE ORANGE","retail_price":"319.93","sale_price":"319.93"}}}
