{"sku":"845984","manufacturer_id":"21660-4082","brand_name":"Marmot","product_name":" Marmot Cloudbreak 30 Sleeping Bag","long_description":"The Marmot Cloudbreak 30 synthetic-fill sleeping bag features innovative construction to keep you warm from top to bottom and it's nearly the same weight and packability as a down bag! Thermal R synthetic insulation's excellent loft keeps you warm with minimal weight; innovative wave construction, with overlapping shingles of insulation, prevents cold spots. Body-mapping of insulation directs warmth to key areas and maximizes thermal efficiency. Non-bulky Thermal R maximizes warmth while reducing the adverse effects of perspiration, condensation and humidity inside the sleeping bag. With a European Norm (EN) lower limit rating of 32degF, the Cloudbreak 32 is a versatile bag for mild-weather 3-season adventures. Anatomic 3D hood envelops your head in warmth; Face Muff allows hood to be cinched snug without digging into face. Trapezoidal footbox allows insulation to loft fully around your feet for optimum warmth and comfort. Full-length zipper with a snagless draft tube prevents fabric from snagging in the zipper coils. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make hood and collar adjustments easy. Marmot Cloudbreak 30 Sleeping Bag comes with a lightweight stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The Marmot Cloudbreak 30 synthetic-fill sleeping bag features innovative construction to keep you warm from top to bottom and it's nearly the same weight and packability as a down bag!","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421307.png","image_url":"http://i1.avlws.com/115/l421307.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421307&tt=df","keywords":"compact","retail_price":"179.00","sale_price":"179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421307\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421307.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845984&amp;link=&amp;tabs=-Details\"></script>","variants":{"8459840001":{"sku":"8459840001","vendor_sku":"21650-4082","upc":"785562390126","size":"Regular Left","color":"ENVY/GREENER PASTURES","retail_price":"169.00","sale_price":"169.00"},"8459840002":{"sku":"8459840002","vendor_sku":"21660-4082","upc":"785562390133","size":"Long Left","color":"ENVY/GREENER PASTURES","retail_price":"179.00","sale_price":"179.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
