{"sku":"845997","manufacturer_id":"21730-2717","brand_name":"Marmot","product_name":" Marmot Sunset 20 Sleeping Bag - Women's","long_description":"Stop the chill, the women's Marmot Sunset 20 synthetic-fill sleeping bag offers innovative construction to keep you warm from top to bottom, with nearly the same weight and packability as a down bag! Designed to fit a woman's body, bag offers increased room at hips, decreased room at shoulders and extra insulation in critical heat-loss areas. Thermal R synthetic insulation's excellent loft keeps you warm with minimal weight; innovative wave construction, with overlapping shingles of insulation, prevents cold spots. Non-bulky Thermal R insulation maximizes warmth while reducing the adverse effects of perspiration, condensation and humidity inside the sleeping bag. Body-mapping of insulation directs warmth to key areas and maximizes thermal efficiency. With a European Norm (EN) comfort rating of 23degF, the Sunset 20 is a versatile bag for 3-season adventures. Anatomic 3D hood envelops your head in warmth; Face Muff allows hood to be cinched snug without digging into face. Trapezoidal footbox allows insulation to loft fully around your feet for optimum warmth and comfort. Full-length zipper with a snagless draft tube prevents fabric from snagging in the zipper coils. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make hood and collar adjustments easy. Marmot Sunset 20 comes with a lightweight stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Stop the chill, the women's Marmot Sunset 20 synthetic-fill sleeping bag offers innovative construction to keep you warm from top to bottom, with nearly the same weight and packability as a down bag!","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421315.png","image_url":"http://i1.avlws.com/115/l421315.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421315&tt=df","keywords":"compact","retail_price":"209.00","sale_price":"209.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421315\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421315.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=845997&amp;link=&amp;tabs=-Details\"></script>","variants":{"8459970001":{"sku":"8459970001","vendor_sku":"21640-2717","upc":"785562659278","size":"Regular Right","color":"ELECTRIC BLUE/DAHLIA PURP","retail_price":"199.00","sale_price":"199.00"},"8459970002":{"sku":"8459970002","vendor_sku":"21730-2717","upc":"785562659216","size":"Long Right","color":"ELECTRIC BLUE/DAHLIA PURP","retail_price":"209.00","sale_price":"209.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
