{"sku":"846002","manufacturer_id":"21760-9263","brand_name":"Marmot","product_name":"Marmot Rockaway 0 Sleeping Bag","long_description":"The roomy Marmot Rockaway 0 sleeping bag offers a little extra width at the shoulders, waist and feet so you can stretch out on your cold-weather camping trips. With a European Norm (EN) lower-limit rating of -3degF, you can rest assured this sleeping bag will keep you comfortable on chilly winter nights. Insulation is a unique blend of 3-denier spiral hollow fibers and 1-denier polyester fibers that provide great loft, warmth and compressibility. Overlapping shingle insulation construction throughout prevents cold spots. Polyester shell and lining fabrics are treated with a Durable Water Repellent finish to repel moisture and stains. Hood envelops your head in warmth; drawcords cinch face muff snug without digging into your skin. Zipper guard along the draft tube keeps fabric from snagging in the coils; 2-way zippers. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make top opening adjustments easy. Trapezoid footbox is wide in toe area and narrow at the heels for comfort that does not compromise warmth. The Marmot Rockaway 0 sleeping bag includes a compression stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The roomy Marmot Rockaway 0 sleeping bag offers a little extra width at the shoulders, waist and feet so you can stretch out on your cold-weather camping trips.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421323.png","image_url":"http://i1.avlws.com/115/l421323.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421323&tt=df","keywords":"compact","retail_price":"169.00","sale_price":"169.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421323\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421323.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846002&amp;link=&amp;tabs=-Details\"></script>","variants":{"8460020001":{"sku":"8460020001","vendor_sku":"21750-9263","upc":"785562390201","size":"Regular Left","color":"BURNT ORANGE/RUST","retail_price":"159.00","sale_price":"159.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
