{"sku":"846038","manufacturer_id":"OO9171-03","brand_name":"Oakley","product_name":"Oakley Racing Jacket Interchangeable Sunglasses","long_description":"Slip on the Oakley Racing Jacket interchangeable sunglasses for life in the sunny fast lane. Each frame includes 2 sets of lenses: 1 set for the bright lights, 1 set for after hours. Designed for easy lens swapping, SWITCHLOCK(TM) lens removal system relieves distortion-causing frame pressure by allowing the bottom part of the frame to pivot open. Quick-release removal system minimizes lens handling, so dirty fingers needn't touch lenses; cam lock frame closure securely holds lenses in place. Lightweight, flexible nylon frames resist damaging stresses. Optically correct, shatterproof and scratch-resistant polycarbonate lenses are made for lasting use. Unique 3-point Oakley fit includes optical alignment for sharp accurate vision, impact absorption for improved safety and geometry that extends the peripheral view. Removable retaining strap. White frames with Fire Iridium(R) lenses are best for medium to bright light; includes additional set of amber lenses for flat to low light. Black frames with VR28 Blue Iridium lenses, which are best for medium-bright light in hazy skies, stopping asphalt and water glare; set of light gray lenses included. Reflective Iridium coating enhances optical clarity and contrast, and reduces glare in varying light. Nose pads and stem sleeves are made from hydrophilic rubber that increases in tackiness as you perspire, holding eyewear in place as you move. To preserve the superior optical quality, sunglasses come with a specially woven, electrostatic bag for cleaning and storage.","short_description":"Slip on the Oakley Racing Jacket interchangeable sunglasses for life in the sunny fast lane. Each frame includes 2 sets of lenses: 1 set for the bright lights, 1 set for after hours.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423075.png","image_url":"http://i1.avlws.com/115/l423075.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423075&tt=df","keywords":"Cycling","retail_price":"220.00","sale_price":"220.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423075\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423075.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846038&amp;link=&amp;tabs=-Details\"></script>","variants":{"8460380001":{"sku":"8460380001","vendor_sku":"OO9171-03","upc":"700285568508","size":"FIRE IRIDIUM","color":"MATTE WHITE","retail_price":"220.00","sale_price":"220.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
