{"sku":"846040","manufacturer_id":"OO4060-06","brand_name":"Oakley","product_name":" Oakley Crosshair Polarized Sunglasses","long_description":"Constantly evolving, Oakley puts a new spin on the classic aviator style with the Crosshair polarized sunglasses that protect against the sun's harmful rays. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Shatterproof and scratch-resistant polycarbonate lenses enhance durability. Ultralight metal alloy frames are engineered to provide comfort and to accommodate a variety of head sizes. Oakley optics maximize vision while retaining clarity, refraction and prism at all angles. Unique Oakley 3-point fit includes optical alignment for sharp, accurate vision, impact absorption for improved protection, and geometry designed to enhance peripheral view. Molded ear- and nose-pieces increase adhesion as you sweat, holding eyewear in place during strenuous activity. To preserve the superior optical quality of Oakley Crosshair sunglasses use the specially woven, electrostatic bag included for storage and cleaning. Frames feature black Iridium(R) gray-tinted lenses to provides neutral contrast-best for extremely bright light. Reflective Iridium coating enhances optical clarity and contrast and reduces glare in varying light.","short_description":"Constantly evolving, Oakley puts a new spin on the classic aviator style with the Crosshair polarized sunglasses that protect against the sun's harmful rays.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423079.png","image_url":"http://i1.avlws.com/115/l423079.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423079&tt=df","keywords":"Cycling","retail_price":"200.00","sale_price":"200.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423079\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423079.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846040&amp;link=&amp;tabs=-Details\"></script>","variants":{"8460400001":{"sku":"8460400001","vendor_sku":"OO4060-06","upc":"700285545110","size":"BLACK IRIDIUM POLARIZED","color":"LEAD","retail_price":"200.00","sale_price":"200.00"}}}
