{"sku":"846256","manufacturer_id":"13089","brand_name":"Rei","product_name":"REI Siesta 25 Sleeping Bag","long_description":"Camping or glamping, the REI Siesta +25degF sleeping bag lets you add cold-weather camping to your list whether you cozy up in the cabin, yurt or tent. Barrel shape provides generous interior volume, making it ideal for those who prefer a roomy fit. Hollow-core insulation delivers a balance of compressibility, warmth and durability; bag continues to insulate when wet and dries quickly. Ripstop nylon shell is abrasion- and tear-resistant for years of use. Shell fabric is treated with a Durable Water Repellent finish to repel moisture and stains. Main body features a smooth polyester taffeta lining that breathes for comfort and feels great against skin. Brushed polyester knit lining panels near the head and face offer the softness of your favorite T-shirt with the moisture-wicking properties of a high-tech fabric. Layered offset quilt construction eliminates cold spots. Bag can be used by itself or connected to another REI Siesta sleeping bag via the Comfort Connection Zip to form a double bag. Full side and bottom zipper access; bag can be completely unzipped and opened up for use as a comforter. Zipper is backed by wide, antisnag binding tape. REI Siesta +25degF sleeping bag includes a cotton storage bag.","short_description":"Camping or glamping, the REI Siesta +25degF sleeping bag lets you add cold-weather camping to your list whether you cozy up in the cabin, yurt or tent.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s282131.png","image_url":"http://i1.avlws.com/115/l282131.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=282131&tt=df","keywords":"sleeping,sleep,winter,cold,bag","retail_price":"99.50","sale_price":"49.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=282131\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m282131.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846256&amp;link=&amp;tabs=-Details\"></script>","variants":{"8462560001":{"sku":"8462560001","vendor_sku":"13089","upc":"484625600010","size":"Long","color":"DEEP RED","retail_price":"49.83","sale_price":"49.83"}}}
