{"sku":"846241","manufacturer_id":"12073","brand_name":"Arc'teryx","product_name":"Arc'teryx Accelero Jacket - Men's","long_description":"The Arc'teryx Accelero is a lightweight running jacked evolved to the next level. This lightweight, weather-resistant jacket is designed to be worn over a thin layer for cool-weather runs. The first thing you'll notice about Arc'teryx Accelero when you get it in your hands is the fabric. Arc'teryx calls it Dry Web, and it's incredibly smooth to the touch; it's designed to move with the body and keep you comfortable thanks to its breathability. On the outside, there's a long-lasting Durable Water Repellent finish that makes training in drizzle possible. As you zip the jacket up, you'll feel the expertly designed fit conform to your body. Accelero has articulated elbows, seams that touch in areas that don't chafe and gusseted underarms that promote freedom of motion. Every little thing on this jacket is well thought out, right down to the zippered hip pocket that stays out of the way of fast motion. A reflective logo and reflective prints on sleeves and back boost visibility. Stretch-woven cuffs with thumbholes keep sleeves in place as you move, and the stretch-woven hem ensures the bottom of your jacket stays put. Slim, athletic fit, 8.4 oz.","short_description":"The Arc'teryx Accelero is a lightweight running jacked evolved to the next level.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Running Jackets","thumb_url":"http://i1.avlws.com/115/s402283.png","image_url":"http://i1.avlws.com/115/l402283.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=402283&tt=df","retail_price":"149.00","sale_price":"103.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=402283\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m402283.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846241&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["mens","mens-jackets","mens-running-jackets"]}
