{"sku":"846334","manufacturer_id":"CAMPSTOVE","brand_name":"Biolite","product_name":" BioLite Wood Burning CampStove","long_description":"The BioLite Wood Burning CampStove(TM) combines the benefits of a backpacking stove and an off-grid power charger so you can cook a meal while charging your gadgets at a backcountry campsite. There's no need to buy or carry heavy fuel canisters with this stove-simply collect twigs during your journey and burn them when you get to camp. Using patent-pending thermoelectric technology, the stove converts heat to electricity that charges an internal battery and powers a fan to increase the efficiency of the fire. Extra electricity can be used to charge small electronics like cell phones, headlamps and rechargeable batteries via the USB port; devices and charging cables sold separately. For an Apple iPhone(R) 4S, 20 min. of charging with a strong fire gives you about 60 min. of talk time; charging times vary by device as well as by the strength of the fire. During a full burn, the CampStove can boil 1 liter of water in as little as 4 min. 30 sec.; place your pot or pan on the built-in pot support. Like a campfire, you can sit around the CampStove and watch the flames dance while you roast marshmallows and spend time with friends. Twigs from hardwood trees, like oak, maple and hickory, will burn hottest and cleanest; choose wood that's dry, and avoid burning leaves, as they can be smoky. CampStove can also burn wood pellets (available at many home and garden stores) if you're camping in a spot where you're not allowed to collect twigs or trees aren't present. BioLite CampStove weighs about 2 lbs.and is about the same size as a 1-liter Nalgene water bottle; power module stows inside the fuel chamber when the stove is not in use. Anodized-aluminum legs create a stable platform for cooking; legs fold in for compact storage when you're done making dinner. CampStove's starter battery helps kick-start the fire before the stove begins generating its own power so it's best to charge the battery for 2 - 4 hrs.","short_description":"The BioLite Wood Burning CampStove(TM) combines the benefits of a backpacking stove and an off-grid power charger so you can cook a meal while charging your gadgets at a backcountry campsite.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416591.png","image_url":"http://i1.avlws.com/115/l416591.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416591&tt=df","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416591\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416591.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846334&amp;link=&amp;tabs=-Details\"></script>","variants":{"8463340001":{"sku":"8463340001","vendor_sku":"CAMPSTOVE","upc":"853290004001","retail_price":"129.95","sale_price":"129.95"}},"categories":["camping-hiking","camp-kitchen","stoves"]}
