{"sku":"846368","manufacturer_id":"J41737","brand_name":"Merrell","product_name":"Merrell Chameleon 5 Mid Ventilator Waterproof Hiking Boots - Men's","long_description":"The lightweight Merrell Chameleon 5 Mid Ventilator waterproof hiking boots offer the support, protection and traction you need to handle rugged trails. Durable pig suede leather uppers with abrasion-resistant nylon mesh panels offer flexibility and ventilation. Waterproof linings boast a high level of breathability while retaining complete protection against moisture. Nylon mesh linings wick away excess moisture and dry quickly for comfort; AEGIS Microbe Shield(R) antimicrobial treatment helps keep odors at bay. Removable 2mm EVA insoles add cushioning to compression-molded EVA midsoles for a soft, cradled feel. External heel stability arm increases support, making these boots ideal for use with a medium pack. Nylon shanks offer torsional stability and protection underfoot, increasing confidence on varied terrain and reducing rock bruising. Vibram(R) outsoles on the Merrell Chameleon 5 Mid Ventilator waterproof hiking boots feature TC5+ rubber for durable traction on the trails.","short_description":"The lightweight Merrell Chameleon 5 Mid Ventilator waterproof hiking boots offer the support, protection and traction you need to handle rugged trails.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385151.png","image_url":"http://i1.avlws.com/115/l385151.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385151&tt=df","retail_price":"160.00","sale_price":"160.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385151\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385151.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846368&amp;link=&amp;tabs=-Details\"></script>","variants":{"8463680001":{"sku":"8463680001","vendor_sku":"J41737","upc":"098681849421","size":"8","color":"BLACK SLATE","retail_price":"160.00","sale_price":"160.00"}},"categories":["footwear","mens-footwear","mens-boots"]}
