{"sku":"846405","manufacturer_id":"024418-281-1-O/","brand_name":"Osprey","product_name":" Osprey Mira 18 Hydration Pack - Women's - 100 fl. oz.","long_description":"The lightweight Osprey Mira 18 hydration pack combines a women-specific fit and great carrying comfort with the latest in easy hydration. Design conforms the reservoir to the back's shape even when full, resulting in a precise, stable and comfortable fit. Reservoir features a rigid spine/handle that stabilizes the water load and makes it easy to slide the reservoir into the pack. Large mouth makes filling and cleaning the reservoir a snap. BPA- and PVC-free reservoir does not retain tastes or odors and features an antimicrobial formula to help prevent bacteria and mold. Metallocene polyethylene film offers improved strength and resiliency, even when used with hot liquids. 180-degree pivoting on/off valve rotates in either direction for quick and easy flow control; magnetic sternum-strap buckle secures the bite valve when not in use. AirSpeed(TM) suspension incorporates a lightweight alloy frame and cross struts with a tensioned mesh back panel for support and flexibility. Breathable mesh and perforated, molded waffle-foam at contact points on contoured shoulder straps and hipbelt enhance breathability and comfort. Panel-loading main compartment is spacious enough for a long day's worth of food, clothing and gear. Zippered top organizational pocket with key clip holds small items; zippered top pocket with soft lining helps keep sunglasses or other fragile items from getting scratched. Large and small stretch-woven front shove-it pockets offer quick external storage and access; integrated patch holds a blinker light (sold separately). Zippered side pockets carry small items within easy reach. The Osprey Mira 18 hydration pack features an integrated raincover that can be deployed quickly to keep contents dry.","short_description":"The lightweight Osprey Mira 18 hydration pack combines a women-specific fit and great carrying comfort with the latest in easy hydration.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411131.png","image_url":"http://i1.avlws.com/115/l411131.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411131&tt=df","retail_price":"139.95","sale_price":"139.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411131\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411131.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846405&amp;link=&amp;tabs=-Details\"></script>","variants":{"8464050001":{"sku":"8464050001","vendor_sku":"024418-281-1-O/","upc":"877257019440","color":"ESPRESSO BROWN","retail_price":"139.95","sale_price":"139.95"},"8464050002":{"sku":"8464050002","vendor_sku":"024418-745-1-O/","upc":"877257017286","color":"SERENE GREEN","retail_price":"139.95","sale_price":"139.95"}},"categories":["camping-hiking","backpacks","day-packs"]}
