{"sku":"846424","manufacturer_id":"023846-363-2-WS","brand_name":"Osprey","product_name":"Osprey Kyte 46 Pack - Women's","long_description":"The versatile Kyte 46 pack sports a light, clean and functional design with women-specific fit and comfort. Its size and features make it an ideal do-it-all pack for a long day or a long weekend. Women-specific hipbelt and shoulder straps are anatomically contoured for comfort and precise, supportive fit. Mesh-lined back panel provides superior breathability and comfortable pack-to-body contact; peripheral frame effectively transfers pack weight to the hipbelt. Top-loading main compartment features a drop-down divider that allows you to combine the sleeping bag compartment with the main compartment for a single, cavernous space. Zippered sleeping bag compartment at the bottom of the pack body is easy to load and unload. Fixed top lid features gear loops, 2 zippered compartments and an under-the-lid mesh pocket. External hydration sleeve in the back panel simplifies refilling and helps protect pack contents from spills (hydration reservoir sold separately). Large stretch-mesh front pocket, dual vertical zippered side pockets and zippered hipbelt pockets make it easy to organize and access extra gear. Integrated raincover comes in handy when the weather gets wet. The Osprey Kyte 46 pack features side compression straps, removable sleeping pad straps, trekking pole attachment and 2 ice-axe loops and handle wraps.","short_description":"The versatile Kyte 46 pack sports a light, clean and functional design with women-specific fit and comfort. Its size and features make it an ideal do-it-all pack for a long day or a long weekend.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410607.png","image_url":"http://i1.avlws.com/115/l410607.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410607&tt=df","keywords":"multiday","retail_price":"179.95","sale_price":"179.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410607\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410607.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846424&amp;link=&amp;tabs=-Details\"></script>","variants":{"8464240003":{"sku":"8464240003","vendor_sku":"023846-363-1-WX","upc":"877257017194","size":"XS/S","color":"ROSE RED","retail_price":"179.95","sale_price":"179.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
