{"sku":"846467","manufacturer_id":"SW7W-900","brand_name":"Sockwell","product_name":" Sockwell by Goodhew Chevron Compression Socks - Women's","long_description":"Whether you're about to spend hours on a plane or trying to speed muscle recovery, the Sockwell Chevron Compression socks help increase blood flow, decrease swelling and deliver support. Gradient compression is greatest at the ankles and gradually decreases toward the tops of the socks; blood pushes upward toward your heart, maximizing circulation. Moderate (15 - 20 mmHg) compression is recommended for all-day and everyday wear, prolonged sitting or standing, travel, exercise and recovery and minor to moderate swelling. Fiber blend balances the durability and thermoregulation properties of wool with naturally antimicrobial and luxurious bamboo. Spandex used throughout the entire sock ensures a snug fit all day long and helps prevent slipping in the shoe. Turn welt tops help keep the socks up and give a clean, finished appearance to the tops of the socks. Seam-free toe closures minimize friction and reduce irritation. Y-heel construction contours the heels of the socks to your feet. Spandex bands knitted into the arch areas of the Sockwell Chevron Compression socks provide support to the arches and reduce sock slippage on the foot. *Discount will be applied when you check out. Offer not valid for sale-price items ending in $._3 or $._9.","short_description":"Whether you're about to spend hours on a plane or trying to speed muscle recovery, the Sockwell Chevron Compression socks help increase blood flow, decrease swelling and deliver support.","category":"Footwear","subcategory":"Socks","product_group":"Running And Athletic Socks","thumb_url":"http://i1.avlws.com/115/s374395.png","image_url":"http://i1.avlws.com/115/l374395.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374395&tt=df","retail_price":"24.95","sale_price":"24.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374395\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374395.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846467&amp;link=&amp;tabs=-Details\"></script>","variants":{"8464670002":{"sku":"8464670002","vendor_sku":"SW7W-900","upc":"484646700027","size":"M/L","color":"BLACK","retail_price":"24.95","sale_price":"24.95"},"8464670005":{"sku":"8464670005","vendor_sku":"SW7W-900","upc":"845028018541","size":"S/M","color":"BLACK","retail_price":"24.95","sale_price":"24.95"}},"categories":["footwear","socks","running-and-athletic-socks"]}
