{"sku":"846443","manufacturer_id":"023075-230-2-WS","brand_name":"Osprey","product_name":"Osprey Ariel 75 Pack - Women's","long_description":"A favorite for women, the Osprey Ariel 75 pack just got even better with an updated design and a stiff, well-padded hipbelt. Be amazed by its light weight, support, comfort and customizable fit. Custom-moldable, anatomically contoured hipbelt features gender-specific angles and padding; it balances firmness and cushioning for optimal support and comfort. Osprey certified custom molding is available in most REI stores-check your local store for a custom hipbelt molding oven. Shoulder straps are designed with thoughtful angles and varying degrees of padding thickness to create an anatomic fit for a woman's neck, shoulders and chest. Back panel is lined with flat spacer mesh for a smooth and breathable contact surface. Peripheral frame effectively transfers weight to the hipbelt; single 6061-T6 aluminum center stay helps maintain back panel shape. Top-loading main compartment can also be accessed through a curved side zipper on the front of the pack body; wide-mouth sleeping bag compartment is easy to load and unload. Top lid converts to lumbar pack with a built-in belt. External hydration sleeve in the back panel simplifies refilling and helps protect pack contents from spills (hydration reservoir sold separately). Large stretch-mesh front pocket makes it easy to quickly stash and access extra gear. Zippered hipbelt pockets and dual-access stretch-mesh side pockets provide secure storage and organization. The Osprey Ariel 75 pack features dual side compression straps, removable sleeping pad straps, trekking pole attachment and 2 ice-axe loops and handle wraps.","short_description":"A favorite for women, the Osprey Ariel 75 pack just got even better with an updated design and a stiff, well-padded hipbelt. Be amazed by its light weight, support, comfort and customizable fit.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410639.png","image_url":"http://i1.avlws.com/115/l410639.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410639&tt=df","keywords":"multiday","retail_price":"309.95","sale_price":"309.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410639\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410639.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846443&amp;link=&amp;tabs=-Details\"></script>","variants":{"8464430001":{"sku":"8464430001","vendor_sku":"023075-639-1-WX","upc":"877257019358","size":"XS","color":"DEEP SEA BLUE","retail_price":"309.95","sale_price":"309.95"},"8464430002":{"sku":"8464430002","vendor_sku":"023075-639-2-WS","upc":"877257019365","size":"S","color":"DEEP SEA BLUE","retail_price":"309.95","sale_price":"309.95"},"8464430004":{"sku":"8464430004","vendor_sku":"023075-322-1-WX","upc":"877257017095","size":"XS","color":"VERMILLION RED","retail_price":"309.95","sale_price":"309.95"},"8464430007":{"sku":"8464430007","vendor_sku":"023075-230-1-WX","upc":"877257017064","size":"XS","color":"SUMMER WHEAT BROWN","retail_price":"309.95","sale_price":"309.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
