{"sku":"846441","manufacturer_id":"023055-639-1-WX","brand_name":"Osprey","product_name":"Osprey Ariel 55 Pack - Women's","long_description":"Slip the Osprey Ariel 55 pack onto your back and rejoice in a heat-moldable hipbelt and a women-specific fit, brought together in a superb, lightweight design for your days in the wilderness. Removable hipbelt can be custom molded for a perfect anatomical fit; it offers superior load support, stiffness and padding with dual-density foam for enhanced comfort. Osprey-certified custom molding available in most stores-check your local REI store for availability. Women's dual-density foam harness with spacer mesh promotes airflow and wicks away moisture during warm weather and intense activity. Suspension features a peripheral frame, a smooth, spacer-mesh back panel, single stay and an internal framesheet. Running down the sidewalls, the peripheral frame anchors to the load-lifter straps and hipbelt, transferring the load to your hips and resisting sag. HDPE framesheet and a center aluminum stay protect your back from bulky or pointy items and support heavy loads. Top lid can be removed and converted into a lumbar pack; hipbelt can be removed from the pack and attached to the lumbar pack for comfortable carrying. J-zipper panel access on the front of the pack body makes stowing and accessing your gear a breeze, even when it's buried deep in the pack. Externally accessible bottom compartment with a wide mouth and divider accommodates all types of sleeping bags. Zippered hipbelt pockets and stretch-woven side pockets keep essentials accessible; stretch-woven front pocket with welded vent accepts Osprey AddOns(TM) (sold separately). Compression system with 3 horizontal straps and 1 internal strap lets you securely compress the contents whether full or nearly empty, and without sag or load distortion. Trekking pole attachment, side gear straps, ice axe tool loops, cord loop attachment slots and removable sleeping pad straps accommodate a variety of alpine gear.","short_description":"Slip the Osprey Ariel 55 pack onto your back and rejoice in a heat-moldable hipbelt and a women-specific fit, brought together in a superb, lightweight design for your days in the wilderness.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410631.png","image_url":"http://i1.avlws.com/115/l410631.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410631&tt=df","keywords":"multiday","retail_price":"259.95","sale_price":"259.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410631\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410631.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846441&amp;link=&amp;tabs=-Details\"></script>","variants":{"8464410001":{"sku":"8464410001","vendor_sku":"023055-639-1-WX","upc":"877257019280","size":"XS","color":"DEEP SEA BLUE","retail_price":"259.95","sale_price":"259.95"},"8464410002":{"sku":"8464410002","vendor_sku":"023055-639-2-WS","upc":"877257019297","size":"S","color":"DEEP SEA BLUE","retail_price":"259.95","sale_price":"259.95"},"8464410005":{"sku":"8464410005","vendor_sku":"023055-322-2-WS","upc":"877257016890","size":"S","color":"VERMILLION RED","retail_price":"259.95","sale_price":"259.95"},"8464410006":{"sku":"8464410006","vendor_sku":"023055-322-3-WM","upc":"877257016906","size":"M","color":"VERMILLION RED","retail_price":"259.95","sale_price":"259.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
