{"sku":"846408","manufacturer_id":"026065-403-1-O/","brand_name":"Osprey","product_name":"Osprey Viva 65 Pack - Women's","long_description":"The light, simple and affordable Osprey Viva 65 pack offers all the essential backpack features without extraneous bells and whistles, along with a women-specific fit for long-range backcountry trips. Shoulder straps and hipbelt feature thoughtfully designed angles and varying padding thickness to accommodate a woman's shoulders, chest and hips. Torso length adjusts easily and precisely over a 5 in. range to provide an exact fit; extra pads on the dual-density hipbelt extend up to 3 in. on each side. Lumbar pad and back panel are covered in spacer mesh for enhanced cushioning and ventilation. Peripheral-hoop alloy frame provides a light and flexible structure that effectively transfers load weight to the hipbelt. Women-specific pack body provides freedom of movement with a narrower and deeper design than a men's pack; lower load position helps ensure an optimum center of gravity. Top-loading design features a floating lid that extends to handle bulky gear and overloads; externally accessible lower compartment accommodates a sleeping bag. External hydration sleeve in the back panel simplifies refilling and helps protect pack contents from spills (hydration reservoir sold separately). Trekking pole attachment lets you stow and remove poles on the go; poles tuck between your arm and pack with a side loop and an adjustable shockcord on the left shoulder strap. Zippered lid pocket, 1 front and 2 side stretch-woven pockets and zippered hipbelt pockets make it easy to organize and access often-used gear. 2 ice axe loops let you lash tools or extra gear on the outside of the pack. Side compression straps let you cinch down loads for jostle-free carrying; sleeping pad straps on the pack's base adjust easily to hold a variety of shapes and sizes of pads. The Osprey Viva 65 pack body is made of 210-denier double ripstop nylon; pack base is made of 600-denier polyester.","short_description":"The light, simple and affordable Osprey Viva 65 pack offers all the essential backpack features without extraneous bells and whistles, along with a women-specific fit for long-range backcountry trips.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410583.png","image_url":"http://i1.avlws.com/115/l410583.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410583&tt=df","keywords":"multiday","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410583\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410583.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846408&amp;link=&amp;tabs=-Details\"></script>","variants":{"8464080001":{"sku":"8464080001","vendor_sku":"026065-776-1-O/","upc":"877257017460","color":"EMERALD GREEN","retail_price":"199.95","sale_price":"199.95"},"8464080002":{"sku":"8464080002","vendor_sku":"026065-403-1-O/","upc":"877257017453","color":"PLUM PURPLE","retail_price":"199.95","sale_price":"199.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
