{"sku":"846439","manufacturer_id":"010475-607-2-LG","brand_name":"Osprey","product_name":" Osprey Xenith 75 Pack","long_description":"Load up the Osprey Xenith 75 pack for your next multi-day backpacking trip and enjoy its supportive and highly customizable fit, beefed-up frame and deluxe suspension. Custom-moldable, anatomically contoured BioForm4 CM(TM) hipbelt and shoulder s balance firmness and cushioning for optimal support and comfort. Osprey certified custom molding is available in most REI stores-check your local store for availability. Back panel is lined with reversed spacer mesh for a smooth and breathable contact surface. Peripheral frame effectively transfers weight to the hipbelt; single 6061-T6 aluminum center stay helps maintain back panel shape. Top-loading main compartment can also be accessed through curved side zippers on each side of the pack body; wide-mouth sleeping bag compartment is easy to load and unload. Dual-compartment top pocket converts to lumbar pack with built-in belt. External hydration sleeve in the back panel simplifies refilling and helps protect pack contents from spills (hydration reservoir sold separately). Roomy front pockets with coated zippers help keep often-used items handy; stretch-mesh front pocket makes it easy to quickly stash and access extra gear. Zippered hipbelt pockets and dual-access stretch-mesh side pockets provide secure storage and organization. The Osprey Xenith 75 pack features dual side compression straps, removable sleeping pad straps, trekking pole attachment and 2 ice-axe loops and handle wraps.","short_description":"Load up the Osprey Xenith 75 pack for your next multi-day backpacking trip and enjoy its supportive and highly customizable fit, beefed-up frame and deluxe suspension.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410623.png","image_url":"http://i1.avlws.com/115/l410623.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410623&tt=df","keywords":"multiday","retail_price":"329.95","sale_price":"329.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410623\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410623.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846439&amp;link=&amp;tabs=-Details\"></script>","variants":{"8464390001":{"sku":"8464390001","vendor_sku":"010475-544-1-MD","upc":"877257015220","size":"M","color":"GRAPHITE GRAY","retail_price":"329.95","sale_price":"329.95"},"8464390003":{"sku":"8464390003","vendor_sku":"010475-544-3-XL","upc":"877257015244","size":"XL","color":"GRAPHITE GRAY","retail_price":"329.95","sale_price":"329.95"},"8464390006":{"sku":"8464390006","vendor_sku":"010475-607-3-XL","upc":"877257015275","size":"XL","color":"MEDITERRANEAN BLUE","retail_price":"329.95","sale_price":"329.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
