{"sku":"846476","manufacturer_id":"02130","brand_name":"Sigma Sport","product_name":" SIGMA SPORT BC 12.12 Bike Computer - Wireless","long_description":"The Sigma Sport BC 12. 12 Wireless Bike Computer gives you all the information you need to track your training without being confusing or distracting, so you can optimize your time on the bike. Automatic start/stop lets you forget about the clock and focus on your ride. Trip distance and trip time are displayed; total distance and total time are recorded and stored but not shown while riding. Display readings include current temperature, current speed, average speed, maximum speed and a comparison of current and average speeds. Distinct trip function allows you to manually start and stop the computer. Distinct time function allows you to manually start and stop the timer; clock display also available. Each mile is converted into the amount of fuel saved over a trip and records total fuel saved so you can see the immediate impact of your choice to ride. 7 available languages. Includes storage chip as a backup function so you don't ever lose data during battery changes. Low-battery indicator helps you replace the battery before it runs out in the middle of a ride. Features watertight casing and tool-free installation. Sigma Sport BC 12.12 Wireless Bike Computer includes 1 CR2032 battery.","short_description":"The Sigma Sport BC 12. 12 Wireless Bike Computer gives you all the information you need to track your training without being confusing or distracting, so you can optimize your time on the bike.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375199.png","image_url":"http://i1.avlws.com/115/l375199.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375199&tt=df","retail_price":"75.00","sale_price":"75.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375199\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375199.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846476&amp;link=&amp;tabs=-Details\"></script>","variants":{"8464760001":{"sku":"8464760001","vendor_sku":"02130","upc":"750220021308","retail_price":"75.00","sale_price":"75.00"}},"categories":["cycling","bike-accessories","bike-computers"]}
