{"sku":"846545","manufacturer_id":"TJRSL113","brand_name":"Big Agnes","product_name":"Big Agnes Jack Rabbit SL1 Tent","long_description":"Spacious and lightweight, the Big Agnes Jack Rabbit SL1 tent is a well-built 3-season backpacking tent designed for 1. Roominess around the head and shoulders provides comfortable living. Single door with a nice-size vestibule provides protected access and space to store gear. Hubbed pole design and pole clips ensure a quick and easy setup; crossover pole creates spaciousness up high. DAC Pressfit(R) poles feature a securely fixed, pressed-in ferrule, ensuring the poles will remain strong and reliable. Fly and floor are made of durable ripstop nylon with a waterproof polyurethane coating; tent body is made from lightweight nylon and polyester mesh. Vestibule door zipper features protective stormflaps; 1 vent enhances air circulation. All seams taped with waterproof, solvent-free polyurethane tape (no PVC or VOCs). Reflective guyline and stakeouts increase nighttime visibility. Mesh pockets and gear loft loops help organize small gear. Jack Rabbit SL1 includes stuff sacks, stakes and guyline. As a convenient option, poles and rainfly can be set up with the footprint (sold separately) to create a lightweight shelter.","short_description":"Spacious and lightweight, the Big Agnes Jack Rabbit SL1 tent is a well-built 3-season backpacking tent designed for 1. Roominess around the head and shoulders provides comfortable living.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423911.png","image_url":"http://i1.avlws.com/115/l423911.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423911&tt=df","retail_price":"279.95","sale_price":"279.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423911\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423911.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846545&amp;link=&amp;tabs=-Details\"></script>","variants":{"8465450002":{"sku":"8465450002","vendor_sku":"TJRSL113","upc":"873840010085","color":"SILVER/PLUM","retail_price":"279.95","sale_price":"279.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
