{"sku":"846547","manufacturer_id":"TLS113","brand_name":"Big Agnes","product_name":" Big Agnes Lone Spring 1 Tent","long_description":"The Big Agnes Lone Spring 1 tent is designed with weekend warriors, cash-strapped college kids budget travelers in mind. This durable tent doesn't sacrifice quality or versatility. Lone Spring 1 tent can march off to a weekend with the local scout troop, get used and abused on the weekends and offers a durable refuge for years to come. Single side door and 1 vestibule offer easy access to tent, a protected entrance and generous storage area. Hub/pole system is super lightweight and tent body attaches quickly and easily to the pole frame with plastic clips; fabric loops along the ridge pole increase weight savings. Innovative pole design provides exceptional headroom without excess weight. DAC Pressfit(R) poles feature a securely fixed, pressed-in ferrule, ensuring the poles will remain strong and reliable. Canopy is made from mesh up top for ventilation and views outside, and ripstop fabric for durability and weather protection. Fly and floor are made from polyurethane-coated ripstop polyester for durability. All seams on tent body and fly are sealed with waterproof, solvent-free polyurethane seam tape; vestibule stormflap protects zipper from the elements. Reflective guyline and webbing on tent corners increase nighttime visibility. Big Agnes Lone Spring 1 includes stuff sacks and 8 superlight aluminum stakes; interior pockets and gear loft loops. As a convenient option, poles and rainfly can be set up with the footprint (sold separately) to create a lightweight shelter.","short_description":"The Big Agnes Lone Spring 1 tent is designed with weekend warriors, cash-strapped college kids budget travelers in mind. This durable tent doesn't sacrifice quality or versatility.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423915.png","image_url":"http://i1.avlws.com/115/l423915.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423915&tt=df","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423915\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423915.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846547&amp;link=&amp;tabs=-Details\"></script>","variants":{"8465470001":{"sku":"8465470001","vendor_sku":"TLS113","upc":"873840010221","color":"GRAY/RED","retail_price":"199.95","sale_price":"199.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
