{"sku":"846614","manufacturer_id":"TFHSL213","brand_name":"Big Agnes","product_name":" Big Agnes Fishhook UL2 Tent","long_description":"The Big Agnes Fishhook UL2 is a 3-season, freestanding superlight backpacking tent made without zippers. This not only saves weight but also gives you a totally jingle-free night's sleep! 1 large side door and 1 vestibule: tent door secures closed using small hooks and loops, and crossover vestibule doors stake out for secure closure. Door is quick and simple to open and close with no zipper tangle. Fly and floor are silicone treated ripstop nylon with a waterproof polyurethane coating providing lightweight, yet durable performance. Tent body is nylon and polyester mesh for protection, ventilation and visibility. Light yet strong, DAC Featherlite(R) NSL pole system with press fit connectors and lightweight hubs offer durable, long-lasting performance. Plastic clips attach tent body to pole frame. Reflective guyline and webbing at tent corners enhance nighttime visibility. Features 2 interior mesh pockets and gear loft loops (gear loft not included). Big Agnes Fishhook UL2 tent includes stuff sacks and 9 superlight aluminum J-stakes. For a lightweight setup during nice weather leave tent body behind; use the rainfly and footprint (sold separately) with the poles and stakes.","short_description":"The Big Agnes Fishhook UL2 is a 3-season, freestanding superlight backpacking tent made without zippers. This not only saves weight but also gives you a totally jingle-free night's sleep!","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423927.png","image_url":"http://i1.avlws.com/115/l423927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423927&tt=df","retail_price":"399.95","sale_price":"399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846614&amp;link=&amp;tabs=-Details\"></script>","variants":{"8466140001":{"sku":"8466140001","vendor_sku":"TFHSL213","upc":"873840010047","color":"GRAY/MOSS","retail_price":"399.95","sale_price":"399.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
