{"sku":"846639","manufacturer_id":"TTSS613","brand_name":"Big Agnes","product_name":"Big Agnes Tensleep Station 6 Tent","long_description":"The Big Agnes Tensleep Station 6 is a 3-season deluxe car camping/base camp tent that sleeps 6. With an extra-large versatile front vestibule and a smaller back one, it's a perfect place to call home. 2 large doors and 2 vestibules: extra-large front vestibule has 2 windows with 2 closure options; mesh only for ventilation or zip up the polyester layer for complete closure. Front door vestibule door can also be staked out as a shade with your trekking poles, sold separately. Fly walls can be rolled up to expose mesh walls for increased ventilation and visibility. Color-coded webbing and buckles create an intuitive setup; sleeves and plastic clips attach tent body to the pole frame quickly and easily. Fly is made from durable ripstop polyester and floor of rugged polyester taffeta; both are treated with a durable waterproof polyurethane coating. Fly vent minimizes condensation. Tent body is ripstop polyester and polyester mesh; mesh door, walls and ceiling offer excellent cross-ventilation. Lightweight aluminum pole system with press fit connectors; securely fixed, pressed-in ferrules ensure the poles will remain strong and reliable. All seams are taped with waterproof, solvent-free polyurethane tape (no PVC or VOCs); waterproof door keeps tent dry. Stay organized with 8 interior mesh pockets, 4 vestibule pockets and gear loft loops (gear loft not included). Big Agnes Tensleep 6 tent comes with a briefcase-style carry bag with shoulder straps and organizational pockets; includes 17 lightweight aluminum hook stakes. Footprint (sold separately) extends the life of your tent by protecting it from abrasive wear and tear.","short_description":"The Big Agnes Tensleep Station 6 is a 3-season deluxe car camping/base camp tent that sleeps 6. With an extra-large versatile front vestibule and a smaller back one, it's a perfect place to call home.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s452751.png","image_url":"http://i1.avlws.com/115/l452751.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=452751&tt=df","retail_price":"469.95","sale_price":"469.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=452751\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m452751.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846639&amp;link=&amp;tabs=-Details\"></script>","variants":{"8466390001":{"sku":"8466390001","vendor_sku":"TTSS613","upc":"873840010399","color":"YELLOW/MOSS","retail_price":"469.95","sale_price":"469.95"}},"categories":["camping-hiking","tents","camping-tents"]}
