{"sku":"846633","manufacturer_id":"TWT413","brand_name":"Big Agnes","product_name":" Big Agnes Wyoming Trail 4 Tent","long_description":"The Big Agnes Wyoming Trail 4 tent offers 2 private sleeping areas separated by a large, comfortable vestibule in the middle! Share your hang-out space but not your sleeping area. Single door for each sleeping area leads to 1 oversize shared vestibule; 2 vestibule doors provide convenient entry and exit. Storm flaps on vestibule doors keep water from dripping inside the vestibule; both vestibule doors may be staked out as a shade using trekking poles, sold separately. Color-coded pole ends, webbing and buckles create an intuitive setup; plastic clips attach tent body to the pole frame quickly and easily. Fly is made from durable ripstop polyester and is treated with a waterproof polyurethane coating. Fly vents minimize condensation. Tent body is ripstop polyester and polyester mesh; mesh door, walls and ceiling offer excellent cross-ventilation. DAC Pressfit(R) poles feature a securely fixed, pressed-in ferrule, ensuring the poles will remain strong and reliable. DAC Green Anodizing(TM) reduces the need for the hazardous chemicals phosphoric and nitric acid by eliminating the chemical polishing stage; wastewater is also recycled. All seams are taped with waterproof, solvent-free polyurethane tape (no PVC or VOCs); waterproof door keeps tent dry. Stay organized with 8 interior mesh pockets and gear loft loops (gear loft not included). Oversize stake-out loops ease setup. Reflective guyline and reflective webbing on tent corners aid nighttime visibility. Big Agnes Wyoming Trail 4 comes with stuff sacks and 16 lightweight aluminum hook stakes. Footprint (sold separately) extends the life of your tent by protecting it from abrasive wear and tear.","short_description":"The Big Agnes Wyoming Trail 4 tent offers 2 private sleeping areas separated by a large, comfortable vestibule in the middle! Share your hang-out space but not your sleeping area.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424419.png","image_url":"http://i1.avlws.com/115/l424419.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424419&tt=df","retail_price":"549.95","sale_price":"549.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424419\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424419.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846633&amp;link=&amp;tabs=-Details\"></script>","variants":{"8466330001":{"sku":"8466330001","vendor_sku":"TWT413","upc":"873840010283","color":"MOSS/CREAM","retail_price":"549.95","sale_price":"549.95"}}}
