{"sku":"846738","manufacturer_id":"OT8519-742","brand_name":"Mountain Hardwear","product_name":"Mountain Hardwear Mountain Speed Sleeping Bag","long_description":"The Mountain Hardwear Mountain Speed sleeping bag has lightweight fabrics and water-repellent down insulation-a great choice for alpinist and backpackers spending nights in damp, cool climes. Q.Shield(TM) advance water repellency technology protects individual down fibers from moisture so they retain loft and insulation properties; Q.Shield won't wear off. Insulated with lightweight and compressible Q.Shield 850-fill-power goose down, blended and lab-certified in the United States. Performance mummy cut features a snug overall fit that positions the down insulation close to the body, maximizing warmth and minimizing weight without restrictiveness. Nylon shell is lightweight and tear resistant; fabric is treated with a Durable Water Repellent finish to repel moisture. Tight 5-in. baffle spacing keeps down from shifting and prevents cold spots. Insulated draft tube extends to bottom of bag to eliminate cold spots. Multi-baffled, tailored hood lies close along the sides of neck and face for easy warmth. Ergonomic collar drapes comfortably over neck and shoulders, sealing out drafts; no need to cinch it unless it's close to bag's temperature limits. When it's cold enough to cinch down hood, face gasket makes hood closure more comfortable and effective. Comfort footbox is shaped to allow feet to rest naturally; shape preserves loft and allows insulation to drape close to feet for more warmth. Half-length zipper enhances weight savings; snag guards keep fabric from catching in zipper. Mountain Hardwear Mountain Speed sleeping bag comes with a stuff sack and a storage bag.","short_description":"The Mountain Hardwear Mountain Speed sleeping bag has lightweight fabrics and water-repellent down insulation-a great choice for alpinist and backpackers spending nights in damp, cool climes.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421339.png","image_url":"http://i1.avlws.com/115/l421339.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421339&tt=df","keywords":"compact","retail_price":"530.00","sale_price":"530.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421339\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421339.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846738&amp;link=&amp;tabs=-Details\"></script>","variants":{"8467380001":{"sku":"8467380001","vendor_sku":"1522321742","upc":"786559903251","size":"Regular Left","color":"STATE ORANGE","retail_price":"480.00","sale_price":"480.00"},"8467380002":{"sku":"8467380002","vendor_sku":"OT8519-742","upc":"786559903237","size":"Long Left","color":"STATE ORANGE","retail_price":"530.00","sale_price":"530.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
