{"sku":"846756","manufacturer_id":"OT8500-858","brand_name":"Mountain Hardwear","product_name":"Mountain Hardwear Lamina 0 Sleeping Bag","long_description":"The Mountain Hardwear Lamina +0degF sleeping bag uses insulation designed to provide high loft, durability, softness and compressibility appropriate for damp, freezing conditions. Lightweight synthetic insulation has excellent loft retention, and is durable, soft and compressible. Welding stabilizes the fill without sewing through the bag, eliminating moisture penetration points and maximizing loft. Insulation is laid in a wave shape, enhancing loft and increasing thermal efficiency; offset welds increase stability and loft. Slightly wide cut gives you extra room to move inside the bag; Comfort mummy cut efficiently maximizes warmth without constriction. Tough, 40-denier micro ripstop nylon shell provides durabilty; 40-denier polyester taffeta lining breathes for comfort and feels great against skin. Durable Water Repellent finish on shell causes water to bead up and roll off. Insulated draft tube extends to bottom of bag to eliminate cold spots. Face gasket and ergonomic draft collar seal out cold air. Full-length, 2-way zipper with locking slider is backed by wide, antisnag binding tape. Insulated zipper gusset seals in warmth at base of zipper. Comfort footbox is shaped to allow feet to rest naturally; shape preserves loft and allows insulation to drape close to feet for extra warmth. Mountain Hardwear Lamina +0degF sleeping bag comes with a stuff sack and a storage bag.","short_description":"The Mountain Hardwear Lamina +0degF sleeping bag uses insulation designed to provide high loft, durability, softness and compressibility appropriate for damp, freezing conditions.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s442327.png","image_url":"http://i1.avlws.com/115/l442327.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442327&tt=df","keywords":"compact","retail_price":"240.00","sale_price":"240.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442327\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442327.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846756&amp;link=&amp;tabs=-Details\"></script>","variants":{"8467560002":{"sku":"8467560002","vendor_sku":"OT8500-858","upc":"786559902476","size":"Long Left","color":"RUSSET ORANGE","retail_price":"240.00","sale_price":"240.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
