{"sku":"846706","manufacturer_id":"BLRLL13","brand_name":"Big Agnes","product_name":"Big Agnes Lost Ranger Sleeping Bag","long_description":"The Big Agnes Lost Ranger sleeping bag features water-repellent down insulation so you can rest easy even at the first sound of raindrops on your tent. DownTek(TM) 650-fill-power down repels water by employing nanotechnology and a proprietary process that applies a micro-thin polymer to the down. DownTek down repels water and maintains loft and insulation value, even when exposed to moisture. Proprietary application process creates a water repellent, antimicrobial and antibacterial down insulation that actually floats on water. Insotect Flow(TM) Construction features internal Flow Gates(TM), which are vertical chambers with internal mesh gates that keep insulation from shifting up and down. Underside insulation has been eliminated and replaced with a sleeve for a 20 in. wide Big Agnes rectangular pad or any 20 in. wide pad, sold separately. Continuous draft wedge insulates the connection between the bag and pad to prevent cold air from entering. Ripstop nylon shell with a Durable Water Repellent surface treatment sheds water; soft, breathable nylon taffeta lining cocoons you in comfort. Built-in pillow sleeve allows you to stuff a jacket or a backcountry pillow inside, and keeps it in place all night long. Contoured, down-filled collar at the top of the bag seals around the neck to prevent warm air from escaping and cold air from entering. 2-way, full-length, locking zipper with big, easy-to-grab zipper pull. Fabric stiffeners on both sides of the zipper prevent the zipper from snagging. Draft tube located behind the zipper prevents warm air from escaping and cold air from entering. Interior fabric loops stabilize a sleeping bag liner, sold separately. Big Agnes Lost Ranger 15degF sleeping bag includes a stuff sack and large storage bag.","short_description":"The Big Agnes Lost Ranger sleeping bag features water-repellent down insulation so you can rest easy even at the first sound of raindrops on your tent.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421335.png","image_url":"http://i1.avlws.com/115/l421335.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421335&tt=df","keywords":"compact","retail_price":"289.95","sale_price":"289.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421335\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421335.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846706&amp;link=&amp;tabs=-Details\"></script>","variants":{"8467060001":{"sku":"8467060001","vendor_sku":"BLRRL13","upc":"873840009133","size":"Regular Left","color":"BLACK/BLUE","retail_price":"259.95","sale_price":"259.95"},"8467060002":{"sku":"8467060002","vendor_sku":"BLRLL13","upc":"873840009157","size":"Long Left","color":"BLACK/BLUE","retail_price":"289.95","sale_price":"289.95"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
