{"sku":"846802","manufacturer_id":"E9LE54B","brand_name":"Bob","product_name":" BOB B-Safe Infant Car Seat by BRITAX","long_description":"The BOB B-Safe Infant car seat by Britax color-coordinates with your BOB single child stroller and offers click-in convenience to go from car to stroller hassle-free. The BOB B-Safe Infant car seat can be used with the BOB Motion Stroller; it can be used with other BOB single strollers with the use of the Britax adapter (sold separately). Seat's foam lining absorbs and distributes bumps, jostles and more, ensuring a comfortable ride and enhancing safety; removable pillow, shoulder pads and belly pad add comfort. Built to accommodate growing children, the seat offers 4 harness heights and 2 different buckle positions to provide a secure, comfortable fit. Harness system is easily adjusted for hassle-free loosening and securing; built-in lock-offs ensure the lap and shoulder belts secure with little effort. Adjustable base has 5 positions to let you set the ideal seat angle and positioning. Lightweight and travel-friendly design makes it easy to transport the seat between vehicle, stroller and elsewhere; certified for aircraft travel. Canopy can be adjusted between multiple positions, helping block the elements and shade passengers. Carry handle is ergonomically designed to follow the contours of the forearm to allow for more comfortable carrying. Premium Lower LATCH Connectors help facilitate a quick and simple installation and feature push-button convenience for easy release. Seat-to-Base design self-guides car seat into proper locked position. Please note: the BOB B-Safe Infant car seat by Britax has a 4 - 30 lbs. weight capacity and accommodates children with a standing height of 32 in. or less.","short_description":"The BOB B-Safe Infant car seat by Britax color-coordinates with your BOB single child stroller and offers click-in convenience to go from car to stroller hassle-free.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s427499.png","image_url":"http://i1.avlws.com/115/l427499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427499&tt=df","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846802&amp;link=&amp;tabs=-Details\"></script>","variants":{"8468020001":{"sku":"8468020001","vendor_sku":"E9LE54B","upc":"652182072018","color":"NAVY","retail_price":"199.00","sale_price":"199.00"},"8468020002":{"sku":"8468020002","vendor_sku":"E9LE54A","upc":"652182072001","color":"BLACK","retail_price":"199.00","sale_price":"199.00"},"8468020003":{"sku":"8468020003","vendor_sku":"E9LE54C","upc":"652182072025","color":"ORANGE","retail_price":"199.00","sale_price":"199.00"}},"categories":["fitness","running","strollers"]}
