{"sku":"846931","manufacturer_id":"1488441314","brand_name":"Mountain Hardwear","product_name":" Mountain Hardwear Hoop Dreams 4 Shelter","long_description":"The Mountain Hardwear Hoop Dreams 4 is a lightweight teepee-type backpacking shelter. It does double duty as a sun shelter for the beach or park, and also at open-air festivals and events. Traditional round shape deflects wind; modern structure and reinforced stretch-free seams keep it light and stable; comfortably seats 4 campers. This design is a great alternative to cramped tents; the lightweight architecture creates a large, symmetrical open space with a minimum of materials. 1 Trussring(TM), 1 lightweight center pole and durable polyester fabric separates and protects campers and their gear from the elements. Patented Trussring support system (ring pole) greatly increases internal volume at head level, adds structural strength and provides a place to string a clothesline. Ring insertion aid ensures a hassle-free setup; it prevents the DAC ring pole from pulling out of the insertion point while the tent is being set up and staked out. Light yet strong, DAC Featherlite(R) NSL poles are anodized without the use of harmful acids. Single door opens wide for stargazing or closes tight for weather protection. 6 guyout points allow the Hoop Dreams shelter to be securely staked out. Hang loop allows shelter to be pitched without a center pole; shelter can also be pitched with a single trekking pole, sold separately. Mountain Hardwear Hoop Dreams 4 comes with stuff sack, DAC ring pole, DAC center support pole and 9 aluminum stakes. Buggy environment? Not a problem; add the Mountain Hardwear Nothing But Net 4 (sold separately) to create a bug-free, covered shelter.","short_description":"The Mountain Hardwear Hoop Dreams 4 is a lightweight teepee-type backpacking shelter. It does double duty as a sun shelter for the beach or park, and also at open-air festivals and events.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Shelters","thumb_url":"http://i1.avlws.com/115/s424623.png","image_url":"http://i1.avlws.com/115/l424623.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424623&tt=df","keywords":"canopy,beach","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424623\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424623.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846931&amp;link=&amp;tabs=-Details\"></script>","variants":{"8469310001":{"sku":"8469310001","vendor_sku":"1488441314","upc":"786559872519","color":"GREEN MOUNTAIN","retail_price":"250.00","sale_price":"250.00"}},"categories":["camping-hiking","tents","shelters"]}
