{"sku":"846934","manufacturer_id":"1495211304","brand_name":"Mountain Hardwear","product_name":"Mountain Hardwear Skyledge 2 DP Tent","long_description":"Mountain Hardwear Skyledge 2 DP tent is for serious backcountry users. It's impressively lightweight, strong and durable-and fly-first pitching lets you set up the tent in the rain and stay dry. DryPitch(TM) lets you set up the fly first and then set the canopy up beneath it and out of the rain; you stay dry, your gear stays dry and your tent's canopy stays dry. Skyledge 2 DP footprint is included. 2 doors with double-slider zippers and mesh panels combine with 2 generously sized vestibules for personalized entry/exit and gear storage. Dry-entry vestibules prevent water from dripping inside tent when vestibule is open; welded vestibule flap construction is lightweight and helps keep the inside dry. Light yet strong, DAC Featherlite(R) NSL poles are anodized without the use of harmful acids. Mountain Hardwear Watertight Construction: thoughtful design, taping and welding technology combine to make this tent watertight off the shelf-no seam sealing required. Superlight ripstop nylon rainfly has outer silicone coating for additional strength, water repellency and reduced stretch in wet conditions. Off-ground perimeter floor features double-needle, folded seams that absorb stress and prevent the floor fabric from stretching or weakening. SVX clear fly window lets in light and offers a view to the outside. Mesh pockets help keep tent organized; hang loops allow you to add your own gear loft. Reflective guyout loops, starter points and zipper pulls enhance nighttime setup and visibility. As a convenient option, poles and rainfly can be set up with just the footprint to create a lightweight shelter. Mountain Hardwear Skyledge 2 DP comes with stuff sacks, aluminum stakes/guyline, footprint and owner's manual.","short_description":"Mountain Hardwear Skyledge 2 DP tent is for serious backcountry users. It's impressively lightweight, strong and durable-and fly-first pitching lets you set up the tent in the rain and stay dry.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s445659.png","image_url":"http://i1.avlws.com/115/l445659.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445659&tt=df","retail_price":"450.00","sale_price":"450.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445659\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445659.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=846934&amp;link=&amp;tabs=-Details\"></script>","variants":{"8469340001":{"sku":"8469340001","vendor_sku":"1495211304","upc":"786559896003","color":"SMOKEY SAGE","retail_price":"450.00","sale_price":"450.00"}},"categories":["camping-hiking","tents","backpacking-tents"]}
