{"sku":"847046","manufacturer_id":"035538-785-2-MD","brand_name":"Osprey","product_name":"Osprey Mutant 38 Pack","long_description":"The Osprey Mutant 38 pack is a simple, strong and light solution for short alpine adventures or multiday mountain trips. It's the direct result of testing and feedback from around the vertical world. Thermoformed, contoured back panel provides ventilation and moisture resistance for carrying comfort and snow-shedding capability. Reverse Wrap ErgoPull hipbelt is easy to adjust with a forward-pull motion; hipbelt can be tucked out of the way when you're wearing a climbing harness. Lightweight, removable HDPE framesheet helps stabilize the pack when loaded and folds out into a handy bivy pad when removed fiom the pack. Floating lid with spindrift collar and internal/external pockets allows you to increase pack capacity to 48 liters; lid is removable to shed unwanted pounds. Internal sleeve and drink tube exit port accommodate a reservoir (sold separately) for hydration on the go. Dual tool loops provide lash points for ice axes or other tools; Gorilla Grip patch on the pack fabric resists wear and punctures from sharp tools. Hypalon(R) racking loops on the hipbelt create a durable and unobtrusive gear racking/organization system for climbing equipment. Grab handle and 2 reinforced loops at the top of pack create a 3-point haul system for big wall endeavors. Z-compression straps cinch down loads for jostle-free carrying and secure skis, poles or sleeping pads. The Osprey Mutant 38 pack is made of 420-denier Armourlite and 900-denier Armourguard fabric for light weight and durability.","short_description":"The Osprey Mutant 38 pack is a simple, strong and light solution for short alpine adventures or multiday mountain trips. It's the direct result of testing and feedback from around the vertical world.","category":"Climbing","subcategory":"Climbing Essentials","product_group":"Climbing Packs","thumb_url":"http://i1.avlws.com/115/s407011.png","image_url":"http://i1.avlws.com/115/l407011.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407011&tt=df","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407011\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407011.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847046&amp;link=&amp;tabs=-Details\"></script>","variants":{"8470460001":{"sku":"8470460001","vendor_sku":"035538-785-1-SM","upc":"877257002947","size":"S","color":"EVERGREEN","retail_price":"159.95","sale_price":"159.95"},"8470460002":{"sku":"8470460002","vendor_sku":"035538-785-2-MD","upc":"877257003043","size":"M","color":"EVERGREEN","retail_price":"159.95","sale_price":"159.95"},"8470460003":{"sku":"8470460003","vendor_sku":"035538-785-3-LG","upc":"877257004224","size":"L","color":"EVERGREEN","retail_price":"159.95","sale_price":"159.95"}},"categories":["climbing","climbing-essentials","climbing-packs"]}
