{"sku":"847001","manufacturer_id":"30301116","brand_name":"Exped","product_name":" Exped Scout Hammock Combi","long_description":"The Exped Scout Hammock Combi merges vesatility and comfort so you can have the satisfaction of swinging, daydreaming and sleeping outdoors. 3-season design lets you use it in nearly any weather. Scout Hammock Combi includes a large-size hammock with a sleeping mat sleeve and mosquito net, and a cover tarp to shelter you from the elements. Double-fabric floor holds sleeping mat in place, adds protection from stinging insects and increases the durability and stability of the Scout hammock. Sturdy zipper runs the length of the Scout hammock to simplify entry and exit. Roomy mosquito netting has wide dimensions and volume; large volume improves interior climate and reduces heat retention. Includes 3 fabric sleeves (to hold sticks or trekking pole segments) and 3 bungee cords that allow you to adjust the volume to your needs and keep the net away from your body. Dark netting color helps visibility inside and offers privacy from the outside. 2 interior stash pockets hold small personal items. Comes with suspension kit with slit cords for easy, quick and secure setup around trees; attachment straps won't harm tree bark. Tarp is made from heavy-duty coated nylon taffeta and is seamless for waterproof protection. Numerous guyline loops on the tarp provide easy setup over the hammock; ridgeline loops attach directly to the slits of the hammock cords for easy alignment. All necessary guylines are included; they come packed in their own sewn-on stuff sacks so you don't have to worry about sorting them out or untangling every time. Exped Scout Hammock can be flipped upside down if you simply want to use it as a hammock without the netting. Sleeves at both ends of the hammock allow you to vary the setup; slide in sticks or trekking poles to make the hammock flat and wide; includes 4 slitted ropes for this setup. Sleeping mat sold separately; fits up to a 77.5 x 26 in. mat.","short_description":"The Exped Scout Hammock Combi merges vesatility and comfort so you can have the satisfaction of swinging, daydreaming and sleeping outdoors. 3-season design lets you use it in nearly any weather.","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Hammocks","thumb_url":"http://i1.avlws.com/115/s414095.png","image_url":"http://i1.avlws.com/115/l414095.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414095&tt=df","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414095\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414095.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847001&amp;link=&amp;tabs=-Details\"></script>","variants":{"8470010001":{"sku":"8470010001","vendor_sku":"30301116","color":"GREEN","retail_price":"199.00","sale_price":"199.00"}},"categories":["camping-hiking","camp-furniture","hammocks"]}
