{"sku":"847010","manufacturer_id":"30600220","brand_name":"Exped","product_name":" Exped Gemini III Tent","long_description":"The Gemini III tent from Exped is unpretentious from the outside, but a true space wonder from the inside. This sturdy tent, with its high volume area, provides a comfortable, roomy option for 3. High-volume comfort in a compact design: creative pole geometry creates steep walls on all sides to provide ample space for sitting, sleeping and dressing. Wide, high doors enhance comfort; vestibules are large enough to hold packs, shoes and a even a dog. Poles are fed into the continuous pole sleeves from the top of the tent and then easily secured with the Arc Connectors; this allows poles to be inserted while standing up. Light yet strong, DAC Featherlite(R) NSL poles are anodized without the use of harmful acids. Fine mosquito mesh keeps the tiniest bugs out and enhances ventilation on hot summer nights; nylon panels on sides and roof keep wind and condensation out. Rainfly vents ensure air circulation to prevent condensation. Guylines attach directly to the pole structure and increase stability in high winds; guylines are easy to access through the rainfly vents. When fully guyed out, the Exped Gemini III tent rivals the strength of many 4-season structures. Gear loops and pockets keep personal items organized. Includes partitioned stuff sack, stakes and guyline/tighteners. Gemini III tent fits 3 medium-size or 2 large-wide Exped sleeping mats (sold separately) for a perfect night's sleep. As a convenient option, poles and rainfly can be set up with the footprint (sold separately) to create a lightweight shelter.","short_description":"The Gemini III tent from Exped is unpretentious from the outside, but a true space wonder from the inside. This sturdy tent, with its high volume area, provides a comfortable, roomy option for 3.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423955.png","image_url":"http://i1.avlws.com/115/l423955.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423955&tt=df","retail_price":"499.00","sale_price":"499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423955\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423955.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847010&amp;link=&amp;tabs=-Details\"></script>","variants":{"8470100001":{"sku":"8470100001","vendor_sku":"30600220","color":"GREEN","retail_price":"499.00","sale_price":"499.00"}},"categories":["camping-hiking","tents","backpacking-tents"]}
