{"sku":"847078","manufacturer_id":"00.6818.005.012","brand_name":"Rockshox","product_name":"RockShox Reverb 125mm Height-Adjustable Seatpost - 30.9 x 380mm / 30.9 x 420mm","long_description":"Great for riding changing terrain, the RockShox Reverb height-adjustable seatpost offers fast bar-top control of your saddle height to ensure you've got that \"just right\" saddle height the whole ride. The air-sprung, hydraulically actuated seatpost features custom seals for consistent performance; bar-top remote enables easy and precise saddle height adjustment. Saddle height can be set anywhere within the 125mm range of adjustment for a truly customized ride. In addition to the fast, responsive action of the hydraulic system, the return rate of the saddle can be adjusted at the bar for even greater tunability. Enduro collar acts as an optional travel limiter if you don't want to use the full range of saddle drop. 2-bolt head clamp accepts standard saddle rails and allows easy angle and fore/aft adjustment; zero offset ensures strength. Triple-keyed telescoping design deters twist and play. Comes with 1,300mm of pre-bled tubing and bleed kit. Please note: choose between either 380 or 420mm seatpost lengths: \"L\" designates a left-side bar-top remote; \"R\" designates right-side remote, both are MatchMakerX compatible.","short_description":"Great for riding changing terrain, the RockShox Reverb height-adjustable seatpost offers fast bar-top control of your saddle height to ensure you've got that \"just right\" saddle height the whole ride.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Saddles And Seatposts","thumb_url":"http://i1.avlws.com/115/s388943.png","image_url":"http://i1.avlws.com/115/l388943.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=388943&tt=df","retail_price":"384.00","sale_price":"384.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=388943\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m388943.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847078&amp;link=&amp;tabs=-Details\"></script>","variants":{"8470780001":{"sku":"8470780001","vendor_sku":"00.6818.005.012","upc":"710845700842","size":"380 MM X R","retail_price":"384.00","sale_price":"384.00"}},"categories":["cycling","bike-components","bike-saddles-and-seatposts"]}
