{"sku":"847018","manufacturer_id":"2200506998","brand_name":"Lowa","product_name":" Lowa Cevedale Pro GTX Mountaineering Boots - Women's","long_description":"Ligthweight, flexible and supportive, yet tough enough for technical ascents, the Lowa Cevedale Pro GTX mountaineering boots will help you climb high while keeping your feet dry. Seam-sealed Gore-Tex(R) liners with wicking polyester linings deliver complete protection and allow moisture vapor to escape. Split leather, synthetic microfiber and Cordura(R) nylon uppers are lightweight and flexible; rubber randing helps protect uppers. Boot design allows ankles and uppers to flex naturally while maintaining a stable platform underfoot; tongue stud improves lacing pressure distribution. Durable, shock-absorbent polyurethane midsoles feature thermopastic urethane inserts for additional support. Rigid, full-length nylon shanks control flex and add the stability needed during use on rough terrain and with crampons. Vibram(R) Dolent outsoles on the Lowa Cevedale Pro GTX mountaineering boots offer excellent grip, stability and durability for alpine adventures.","short_description":"Ligthweight, flexible and supportive, yet tough enough for technical ascents, the Lowa Cevedale Pro GTX mountaineering boots will help you climb high while keeping your feet dry.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Boots","thumb_url":"http://i1.avlws.com/115/s386751.png","image_url":"http://i1.avlws.com/115/l386751.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=386751&tt=df","retail_price":"380.00","sale_price":"380.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=386751\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m386751.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847018&amp;link=&amp;tabs=-Details\"></script>","variants":{"8470180004":{"sku":"8470180004","vendor_sku":"2200506998","upc":"840054215865","size":"8.5","color":"TURQUOISE/BLACK","retail_price":"380.00","sale_price":"380.00"}}}
