{"sku":"847073","manufacturer_id":"00.7518.010.001","brand_name":"Sram","product_name":" SRAM X0 Type-2 10-Speed Rear Derailleur","long_description":"Light, fast and precise, the SRAM X0 Type-2 10-speed rear derailleur makes snappy, near-silent work of shifting gears when you're in the zone flying up, down and along your favorite trails. Self-lubricating Roller Bearing Clutch(TM) provides 1-way damping to eliminate derailleur bounce and chain slap without sacrificing shifting precision. Exact Actuation means precise, even gear changes throughout the shifting range-when you move a shifter, the derailleur moves the same amount for 1:1 action. Cage Lock simplifies wheel changes and chain installations by allowing the derailleur to be locked in an extended position that puts slack in the chain. Direct routing design minimizes cable friction for light-effort shifting performance. Constructed out of forged aluminum with carbon fiber outer cage for light, stiff and sturdy performance; sealed cartridge bearing pulleys offer low-drag, long-lasting spinning. Capable of handling up to a 36-tooth cassette cog. The SRAM X0 Type-2 10-speed rear derailleur is compatible with all SRAM 10-speed shifters; available as either a medium or long cage length.","short_description":"Light, fast and precise, the SRAM X0 Type-2 10-speed rear derailleur makes snappy, near-silent work of shifting gears when you're in the zone flying up, down and along your favorite trails.","category":"Cycling","subcategory":"Bike Components","product_group":"Drivetrain Components","thumb_url":"http://i1.avlws.com/115/s390223.png","image_url":"http://i1.avlws.com/115/l390223.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390223&tt=df","retail_price":"264.00","sale_price":"264.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390223\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390223.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847073&amp;link=&amp;tabs=-Details\"></script>","variants":{"8470730002":{"sku":"8470730002","vendor_sku":"00.7518.010.000","upc":"710845700422","size":"Long","retail_price":"264.00","sale_price":"264.00"}}}
