{"sku":"847019","manufacturer_id":"2206456747","brand_name":"Lowa","product_name":" Lowa Mauria GTX Flex Hiking Boots - Women's","long_description":"The Lowa Mauria GTX hiking boots are designed on a women-specific last and offer cream-of-the-crop comfort on your treks into the wilderness. Nubuck leather uppers are durable and flexible, offering long-lasting protection and comfort; rubber toe and heel caps protect uppers from abrasion. GORE-TEX(R) waterproof liners let feet breathe while protecting them from the elements, keeping them dry and comfortable. Moisture-wicking polyester linings offer excellent climate control within boots by moving sweat away from feet, helping to reduce the chances of blisters developing. Perforations inside cuff linings let heat and moisture out so your feet can enjoy a cool, dry and blister-free environment. C4 system uses an asymmetric padded tongue, soft edging, recessed ankle cut and curved insert for tailored comfort across instep. Tongue stud X-Lacing system establishes even pressure distribution over the insteps. Flex Fit construction facilitates natural ankle flex without compromising stability, resulting in a more comfortable stride. Polyurethane midsoles offer outstanding cushioning for all-day wear; midsoles allow for normal pronation but reduce excess cushioning to enhance stability. Lowa Mauria GTX hiking boots feature nylon shanks for enhanced torsional rigidity to protect and support feet. Vibram(R) Apptrail rubber outsoles feature aggressive lugs, self-cleaning tread and a pronounced edge at front of heel for excellent downhill traction.","short_description":"The Lowa Mauria GTX hiking boots are designed on a women-specific last and offer cream-of-the-crop comfort on your treks into the wilderness.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Boots","thumb_url":"http://i1.avlws.com/115/s386755.png","image_url":"http://i1.avlws.com/115/l386755.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=386755&tt=df","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=386755\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m386755.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847019&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","womens-footwear","womens-boots"]}
