{"sku":"847188","manufacturer_id":"00014564","brand_name":"Rei","product_name":"REI Camp X Chair - Low","long_description":"The REI Camp X Low chair features exclusive X-Web technology for supreme comfort that you can take to the campground, summer concert and backyard barbecue. X-Web technology uses X-shape webbing to tension the seat and back panel, and distribute your weight for excellent sitting comfort. Mono-mesh and polyester seating surface stands up to regular use and exposure to weather; mesh fabric drains water and dries quickly. Frame is constructed of heavy-duty, thick-walled steel tubing for enduring strength; powder coating keeps the frame looking nice for years of use. With a back height of 26.75 in. and a seat height of just 7 in., chair is great for use at outdoor concerts; chair restrictions vary, so check with the concert venue. Versatile integrated cup holder on the right armrest accommodates a wide variety of container shapes and sizes, from mugs to plastic bottles to long-neck glass bottles. Drop-down pocket on the left armrest holds your cell phone and other small valuables; cinch the pocket closed with the string and cordlock to keep items from falling out. Chair has a weight capacity of 250 lbs. The REI Camp X Low chair packs up into the included stuff sack for easy storage and transport.","short_description":"The REI Camp X Low chair features exclusive X-Web technology for supreme comfort that you can take to the campground, summer concert and backyard barbecue.","category":"Camping & Hiking","subcategory":"Camping Chairs","product_group":"Camp Chairs","thumb_url":"http://i1.avlws.com/115/s281095.png","image_url":"http://i1.avlws.com/115/l281095.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=281095&tt=df","keywords":"folding,seat,beach,trail,lounger","retail_price":"44.50","sale_price":"29.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=281095\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m281095.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847188&amp;link=&amp;tabs=-Details\"></script>","variants":{"8471880001":{"sku":"8471880001","vendor_sku":"00014564","upc":"484718800013","color":"PINEDALE","retail_price":"29.93","sale_price":"29.93"}}}
