{"sku":"847141","manufacturer_id":"015514-345-1-O/","brand_name":"Osprey","product_name":"Osprey Raptor 14 Hydration Pack - 100 fl. oz.","long_description":"With plenty of gear-carrying capacity, the Osprey Raptor 14 hydration pack is designed for 3+ hour long rides and includes a 100 fl. oz. reservoir to ensure you're well hydrated. Hydration system features a 100 fl. oz. reservoir that conforms to back's shape even when full, resulting in a precise, stable and comfortable fit. Rigid spine stabilizes the reservoir and doubles as a handle, making it easy to slide it into its dedicated compartment; large mouth makes filling and cleaning easy. Hydration reservoir pocket has zippered access that extends onto shoulder strap, letting you remove, refill and replace reservoir and drink tube quickly and with minimal fuss. Back panel uses molded foam to create a lightweight, supportive and ventilated contact area across your back. Breathable mesh and perforated, molded foam on contoured shoulder straps and full-sized hipbelt offer great breathability and load-carrying comfort. Sternum strap has a magnetic attachment for keeping bite valve accessible. Large zippered main pocket has dividers to make it easy to organize your gear, food and other essentials; front zip pocket has mesh pockets for more organizational options. Stretch mesh front and side pockets work great for stashing extra gear or water bottles. Top zippered pocket has internal key pocket and is lined with a soft, easy-to-clean fabric that helps keep sunglasses from getting scratched. Shove-it pocket can be cinched down to secure bulky items like a jacket. Quickly attach a helmet to the Raptor 14 with the LidLock(TM) helmet clip; bungee on the exterior of the pack allows easy adjustment of the LidLock feature. Top and bottom compression straps help stabilize pack and contents. Removable, roll-up tool pouch stores in its own zippered compartment at bottom of pack, giving you quick and convenient access to your tools for mid-ride adjustments or fixes.","short_description":"With plenty of gear-carrying capacity, the Osprey Raptor 14 hydration pack is designed for 3+ hour long rides and includes a 100 fl. oz. reservoir to ensure you're well hydrated.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411739.png","image_url":"http://i1.avlws.com/115/l411739.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411739&tt=df","keywords":"day packs","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411739\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411739.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847141&amp;link=&amp;tabs=-Details\"></script>","variants":{"8471410001":{"sku":"8471410001","vendor_sku":"015514-345-1-O/","upc":"877257016241","size":"One Size","color":"MADCAP RED","retail_price":"129.95","sale_price":"129.95"},"8471410002":{"sku":"8471410002","vendor_sku":"015514-550-1-O/","upc":"877257016258","size":"One Size","color":"BLACK","retail_price":"129.95","sale_price":"129.95"},"8471410003":{"sku":"8471410003","vendor_sku":"015514-799-1-O/","upc":"877257019174","size":"One Size","color":"SCREAMIN GREEN","retail_price":"129.95","sale_price":"129.95"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
