{"sku":"847139","manufacturer_id":"015506-345-1-O/","brand_name":"Osprey","product_name":" Osprey Raptor 6 Hydration Pack - 100 fl. oz. - Men's","long_description":"With a compact design, the Osprey Raptor 6 hydration pack is well-suited to quick and fun rides up to 2 hours long and boasts a 100 fl. oz. reservoir to quench your thirst. Hydration system features a 100 fl. oz. reservoir that conforms to back's shape even when full, resulting in a precise, stable and comfortable fit. Rigid spine stabilizes the reservoir and doubles as a handle, making it easy to slide it into its dedicated compartment; large mouth makes filling and cleaning easy. Hydration reservoir pocket has zippered access that extends onto shoulder strap, letting you remove, refill and replace reservoir and drink tube quickly and with minimal fuss. Back panel uses molded foam to create a lightweight, supportive and ventilated contact area across your back. Breathable mesh and perforated, molded foam on contoured shoulder straps and full-sized hipbelt offer great breathability and load-carrying comfort. Sternum strap has a magnetic attachment for keeping the bite valve accessible. Large zippered main pocket has dividers to make it easy to organize your gear, food and other essentials. Removable, roll-up tool pouch stores in its own zippered compartment at bottom of pack, giving you quick and convenient access to your tools for mid-ride adjustments or fixes. Top zippered pocket has internal key pocket and is lined with a soft, easy-to-clean fabric that helps keep sunglasses from getting scratched. Stretch mesh front pocket work great for stashing extra gear or a water bottle. Quickly attach a helmet to the Raptor 6 with the LidLock(TM) helmet clip; bungee on the exterior of the pack allows easy adjustment of the LidLock feature. Zip pockets on hipbelt stow small tools or energy foods. Reflective trim increases visibility in low light.","short_description":"With a compact design, the Osprey Raptor 6 hydration pack is well-suited to quick and fun rides up to 2 hours long and boasts a 100 fl. oz. reservoir to quench your thirst.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411731.png","image_url":"http://i1.avlws.com/115/l411731.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411731&tt=df","keywords":"day packs","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411731\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411731.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847139&amp;link=&amp;tabs=-Details\"></script>","variants":{"8471390001":{"sku":"8471390001","vendor_sku":"015506-345-1-O/","upc":"877257016180","size":"One Size","color":"MADCAP RED","retail_price":"109.95","sale_price":"109.95"},"8471390002":{"sku":"8471390002","vendor_sku":"015506-550-1-O/","upc":"877257016197","size":"One Size","color":"BLACK","retail_price":"109.95","sale_price":"109.95"},"8471390003":{"sku":"8471390003","vendor_sku":"015506-799-1-O/","upc":"877257019150","size":"One Size","color":"SCREAMIN GREEN","retail_price":"109.95","sale_price":"109.95"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
