{"sku":"847179","manufacturer_id":"026609-509-1-O/","brand_name":"Osprey","product_name":"Osprey Verve 9 Hydration Pack - 100 fl. oz. - Women's","long_description":"If you're going to be out riding between 1.5 and 3 hours, or just want some extra gear capacity, the women's Osprey Verve 9 hydration pack stows your essentials and 3 liters of liquid. Hydration system features a 3 liter (100 fl. oz.) reservoir that conforms to back's shape even when full, resulting in a precise, stable and comfortable fit. Rigid spine/handle stabilizes the reservoir, making it easy to slide it into its dedicated compartment; large mouth makes filling/cleaning easy. Hydration reservoir pocket has zippered access that extends onto shoulder strap, letting you remove, refill and replace reservoir and drink tube quickly and with minimal fuss. Women-specific shorter torso design incorporates padded mesh back panel and mesh shoulder straps for great next-to-body comfort. Magnetic attachment on sternum strap keeps the hydration bite valve easily accessible. Large zippered main pocket with tool organization sleeves and a mesh pocket is ideal for carrying pumps, bike tools and tubes. Front zippered pocket has additional mesh pockets for more organizational options; key clip secures keys. Stretch mesh side pockets work great for stashing extra gear or water bottles for quick, easy access. Quick-access top zippered pocket is lined with a soft, easy-to-clean heat-embossed fabric that helps keep sunglasses or other fragile items from getting scratched. Quickly attach a helmet to the Verve 9 with the LidLock(TM) helmet clip; bungee on the exterior of the pack allows easy adjustment of the LidLock feature. Shove-it pocket can be cinched down to secure bulky items like a jacket. Compression straps help stabilize pack and contents; removable webbing waistbelt helps stabilize pack. Reflective trim increases visibility in low light.","short_description":"If you're going to be out riding between 1.5 and 3 hours, or just want some extra gear capacity, the women's Osprey Verve 9 hydration pack stows your essentials and 3 liters of liquid.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411755.png","image_url":"http://i1.avlws.com/115/l411755.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411755&tt=df","keywords":"day packs","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411755\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411755.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847179&amp;link=&amp;tabs=-Details\"></script>","variants":{"8471790001":{"sku":"8471790001","vendor_sku":"026609-460-1-O/","upc":"877257017491","size":"One Size","color":"PASSION PURPLE","retail_price":"99.95","sale_price":"99.95"},"8471790002":{"sku":"8471790002","vendor_sku":"026609-509-1-O/","upc":"877257017507","size":"One Size","color":"PLATINUM GREY","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
