{"sku":"847144","manufacturer_id":"016613-603-1-O/","brand_name":"Osprey","product_name":"Osprey Viper 13 Hydration Pack - 100 fl. oz.","long_description":"Built for 3+ hours of riding and offering plenty of organization options, the Osprey Viper 13 hydration pack totes your gear plus 3 liters of water for your extended rides. Hydration system features a 100 fl. oz. reservoir that conforms to back's shape even when full, resulting in a precise, stable and comfortable fit. Rigid spine/handle stabilizes the reservoir, making it easy to slide it into its dedicated compartment; large mouth makes filling/cleaning easy. Hydration reservoir pocket has zippered access that extends onto shoulder strap, letting you remove, refill and replace reservoir and drink tube quickly and with minimal fuss. Low-profile padded mesh back panel and mesh shoulder straps offer next-to-body comfort; sternum strap has a magnetic attachment for keeping bite valve accessible. Large zippered main pocket with tool organization sleeves and a mesh pocket is ideal for carrying pumps, bike tools and tubes. Front zippered pocket has additional mesh pockets for more organizational options; key clip secures keys. Stretch mesh front and side pockets work great for stashing extra gear or water bottles for quick, easy access. Quick-access top zippered pocket is lined with a soft, easy-to-clean heat-embossed fabric that helps keep sunglasses or other fragile items from getting scratched. Quickly attach a helmet to the Viper 13 with the LidLock(TM) helmet clip; bungee on the exterior of the pack allows easy adjustment of the LidLock feature. Shove-it pocket can be cinched down to secure bulky items like a jacket. Top and bottom side compression straps help stabilize pack and contents; removable webbing waistbelt helps stabilize pack. Reflective trim increases visibility in low light. Osprey Viper 13 hydration pack sports a BPA- and PVC-free reservoir that does not retain tastes or odors and features an antimicrobial treatment that deters bacterial growth.","short_description":"Built for 3+ hours of riding and offering plenty of organization options, the Osprey Viper 13 hydration pack totes your gear plus 3 liters of water for your extended rides.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411743.png","image_url":"http://i1.avlws.com/115/l411743.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411743&tt=df","keywords":"day packs","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411743\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411743.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847144&amp;link=&amp;tabs=-Details\"></script>","variants":{"8471440001":{"sku":"8471440001","vendor_sku":"016613-378-1-O/","upc":"877257016395","size":"One Size","color":"FLASHPOINT RED","retail_price":"109.95","sale_price":"109.95"},"8471440002":{"sku":"8471440002","vendor_sku":"016613-599-1-O/","upc":"877257016401","size":"One Size","color":"GUNPOWDER GREY","retail_price":"109.95","sale_price":"109.95"},"8471440003":{"sku":"8471440003","vendor_sku":"016613-603-1-O/","upc":"877257016418","size":"One Size","color":"WILD BLUE","retail_price":"109.95","sale_price":"109.95"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
