{"sku":"847245","manufacturer_id":"811","brand_name":"Ally","product_name":"Ally 16.5 DR Folding Canoe","long_description":"Pack it up and travel to wherever the call of exploration takes you. The Ally 16.5 DR foldable canoe offers substantial benefits as an alternative to hard-shell canoes. Slightly shorter than its 17 ft. sibling, the Ally 16.5 DR foldable canoe offers high maneuverability should you take on moving water. Long, slightly rockered keel enhances maneuverability in waves, and 37.5 in. width makes for a very stable ride. Perfect for 2 paddlers, this foldable canoe has enough gear-holding capacity for multiday expeditions. The Ally 16.5 DR foldable canoe assembles without special tools or skills; when collapsed, it can be stored in a 42 x 24 x 18 in. space (storage sack not included). PVC-skin won't crack if you scrape an unexpected rock, and foam bottom mat is soft on knees and provides an additional source of protection. 6082 T6 aluminum frame is strong, lightweight and corrosion-resistant. Plastic, molded seat can be adjusted for sitting or kneeling positions and for adjusting the canoe's trim. 44 lb. weight means you'll have an easy time portaging, and the flexible feel to the boat means you'll glide easily over chop and waves. Package includes canoe (skin, seats, foam mat, chines, keel, ribs, gunwales, bow and stern), a mallet for assembly and a repair kit. Approximate setup time is 30 min. with 2 people; 1 hr. with a single person.","short_description":"Pack it up and travel to wherever the call of exploration takes you. The Ally 16.5 DR foldable canoe offers substantial benefits as an alternative to hard-shell canoes.","category":"Paddling","subcategory":"Canoeing","product_group":"Canoes","thumb_url":"http://i1.avlws.com/115/s430359.png","image_url":"http://i1.avlws.com/115/l430359.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430359&tt=df","retail_price":"2050.00","sale_price":"2050.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430359\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430359.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847245&amp;link=&amp;tabs=-Details\"></script>","variants":{"8472450001":{"sku":"8472450001","vendor_sku":"811","size":"16 FT 6 IN","color":"GREEN","retail_price":"2050.00","sale_price":"2050.00"}},"categories":["paddling","canoeing","canoes"]}
