{"sku":"847241","manufacturer_id":"2041005","brand_name":"Giro","product_name":"Giro Espada Road Bike Shoes - Women's","long_description":"The Giro Espada women's road bike shoes deliver road-ready performance thanks to a stiff carbon fiber platform and a luxurious, women-specific fit for long-lasting comfort. Lightweight synthetic leather and nylon mesh uppers give a glovelike fit with excellent breathability. Molded EVA footbeds include a fit kit with 3 different-size arch supports, allowing you to choose the amount of support needed. AEGIS Microbe Shield(R) antimicrobial treatment helps deter odors. Carbon fiber outsoles offer more rigidity than a nylon sole, providing a direct connection with the pedal and solid power transfer. Strong and secure ratcheting buckle allows precise on-the-fly adjustability; buckle is replaceable. 2 rip-and-stick closure straps provide a solid, secure fit over insteps and are offset to maximize comfort and minimize pressure points. Giro Espada road bike shoes are compatible with 3-bolt cleats; please note that cleats are not included (cleats typically come with pedals).","short_description":"The Giro Espada women's road bike shoes deliver road-ready performance thanks to a stiff carbon fiber platform and a luxurious, women-specific fit for long-lasting comfort.","category":"Cycling","subcategory":"Cycling Shoes","product_group":"Road Cycling Shoes","thumb_url":"http://i1.avlws.com/115/s457655.png","image_url":"http://i1.avlws.com/115/l457655.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457655&tt=df","retail_price":"225.00","sale_price":"225.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457655\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457655.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847241&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","cycling-shoes","road-cycling-shoes"]}
