{"sku":"847228","manufacturer_id":"GM59888","brand_name":"Gregory","product_name":"Gregory Cairn 48 Pack - Women's","long_description":"The lightweight Gregory Cairn 48 pack for women represents a backpacking breakthrough with precise Gregory fit, innovative organization and efficient gear access for a joyous weekend in the wild. Pack suspension offers legendary Gregory comfort and strong, light support with a patented hipbelt alignment system, streamlined back panel and wire wishbone frame. Harness offers stable comfort for the long haul and is shaped specifically for female anatomy. Shoulder straps feature a layer of monofilament mesh, perforated EVA foam and 2 layers of air-mesh on the top and bottom, all bonded together for breathability and comfort. Hipbelt auto-adjusts to fit your unique body shape the moment you put on the pack; ventilated air channels and breathable spacer mesh on the back panel permit cooling airflow. Light and sturdy wire wishbone frame provides effective load transfer to your lumbar; integrated cross-stay helps maintain proper pack shape and prevents barreling. Innovative packing system features 3 sections that separate your trail gear from camp items, and keeps frequently grabbed essentials at your fingertips. Each section allows easy access to your gear when you need it and distributes the weight properly for intuitive packing and comfortable carry. Highly water-resistant top pocket features a waterproof zipper and sealed seams; top-loading design features a quick-draw closure and a stash pocket under the lid. External hydration sleeve makes it easy to access and fill your reservoir; it attaches directly to internal frame (reservoir sold separately). Organize gear within easy reach with a side security pocket, large front dump pocket, dual oversize side pockets and hipbelt pockets. 2-stage compression straps on the lower pack body and over the main top opening help stabilize and compress your load. Integrated raincover helps keep contents dry when the weather takes a wet turn.","short_description":"The lightweight Gregory Cairn 48 pack for women represents a backpacking breakthrough with precise Gregory fit, innovative organization and efficient gear access for a joyous weekend in the wild.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410663.png","image_url":"http://i1.avlws.com/115/l410663.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410663&tt=df","keywords":"multiday","retail_price":"259.00","sale_price":"259.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410663\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410663.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847228&amp;link=&amp;tabs=-Details\"></script>","variants":{"8472280004":{"sku":"8472280004","vendor_sku":"GM59887","upc":"844930070241","size":"XS","color":"TEAL GREEN","retail_price":"259.00","sale_price":"259.00"},"8472280005":{"sku":"8472280005","vendor_sku":"GM59888","upc":"844930070258","size":"S","color":"TEAL GREEN","retail_price":"259.00","sale_price":"259.00"},"8472280006":{"sku":"8472280006","vendor_sku":"GM59889","upc":"844930070265","size":"M","color":"TEAL GREEN","retail_price":"259.00","sale_price":"259.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
