{"sku":"847290","manufacturer_id":"11620","brand_name":"Arc'teryx","product_name":"Arc'teryx Altra 48 Pack - Women's","long_description":"The women's Arc'teryx Altra 48 pack excels on light-and-fast weekends or gear-heavy, one-day adventures. This workhorse combines an advanced, breathable harness with a sturdy frame and light weight. Highly breathable suspension system features a women-specific shape and fit and creates a direct link between spine, suspension and bag. Suspension is bonded directly to the pack body for comfort and stability; features twin removable aluminum stays and an HDPE framesheet for reliable load support. Anatomically shaped shoulder straps feature a core layer of perforated, air-permeable foam lined with breathable mesh for next-to-the-skin comfort. Shoulder straps adjust both vertically and horizontally for a personalized fit. Thermoformed, triple-density hipbelt promotes airflow and evaporative cooling. Removable and expandable top lid comes with 2 zippered compartments and a map pocket. Extendable collar with drawcord adds capacity to the main compartment for handling large loads. Top-loading pack design also features a full-length, inverted-U zipper, allowing quick access to the main compartment through the front panel. Features a hydration-reservoir sleeve with port and hose clip for the drinking tube (reservoir sold separately). Front kangaroo pocket is perfect for stashing gear you may need in a hurry. 2 stretch-mesh side pockets with elastic drawcords secure your water bottles or energy snacks. Compression straps and padded compression wings let you cinch down your load for jostle-free carrying; micro daisy chains add more storage options. Silicone- and polyurethane-coated pack body is made of 100-denier Invista HD Mini Ripstop(TM) nylon and 210-denier Ripstorm(TM) nylon. Pack base is made of burly, 420-denier Invista HD plain weave nylon. Arc'teryx Altra 48 pack features a padded bottom, Hypalon(TM) trim and reinforced high-wear areas to bolster durability.","short_description":"The women's Arc'teryx Altra 48 pack excels on light-and-fast weekends or gear-heavy, one-day adventures. This workhorse combines an advanced, breathable harness with a sturdy frame and light weight.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410683.png","image_url":"http://i1.avlws.com/115/l410683.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410683&tt=df","keywords":"multiday","retail_price":"289.00","sale_price":"289.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410683\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410683.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847290&amp;link=&amp;tabs=-Details\"></script>","variants":{"8472900007":{"sku":"8472900007","vendor_sku":"11620","upc":"806955703023","size":"Short","color":"AMETHYST","retail_price":"289.00","sale_price":"289.00"},"8472900008":{"sku":"8472900008","vendor_sku":"11620","upc":"806955703016","size":"Regular","color":"AMETHYST","retail_price":"289.00","sale_price":"289.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
