{"sku":"847296","manufacturer_id":"11621","brand_name":"Arc'teryx","product_name":" Arc'teryx Altra 50 Pack","long_description":"The Arc'teryx Altra 50 pack is sized for light-and-fast weekends or gear-heavy, one-day adventures. This workhorse pack combines an advanced, breathable harness with a sturdy frame and light weight. Highly breathable suspension system creates a direct link between spine, suspension and bag. Suspension is bonded directly to the pack body for comfort and stability; features twin removable aluminum stays and an HDPE framesheet for reliable load support. Anatomically shaped shoulder straps feature a core layer of perforated, air-permeable foam lined with breathable mesh for next-to-the-skin comfort. Thermoformed, triple-density hipbelt promotes airflow and evaporative cooling. Removable and expandable top lid comes with 2 zippered compartments and a map pocket. Floating top lid and extendable collar with drawcord adds capacity to the main compartment for handling large loads. Dual side zippers allow quick access to the main compartment through the front panel. Features a hydration-reservoir sleeve with port and hose clip for the drinking tube (reservoir sold separately). Front kangaroo pocket is perfect for stashing gear you may need in a hurry; 2 zippered pockets and a map pocket in the top lid organize small items. 2 stretch-mesh side pockets with elastic drawcords secure water bottles or energy snacks. Compression straps and padded compression wings let you cinch down your load for jostle-free carrying; micro daisy chains for more storage options. Silicone- and polyurethane-coated pack body is made of 100-denier Invista HD Mini Ripstop(TM) nylon and 210-denier Ripstorm(TM) nylon. Pack base is made of burly, 420-denier Invista HD plain weave nylon. Arc'teryx Altra 50 pack features a padded bottom, Hypalon(TM) trim and reinforced high-wear areas to bolster durability.","short_description":"The Arc'teryx Altra 50 pack is sized for light-and-fast weekends or gear-heavy, one-day adventures. This workhorse pack combines an advanced, breathable harness with a sturdy frame and light weight.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410687.png","image_url":"http://i1.avlws.com/115/l410687.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410687&tt=df","keywords":"multiday","retail_price":"289.00","sale_price":"289.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410687\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410687.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847296&amp;link=&amp;tabs=-Details\"></script>","variants":{"8472960001":{"sku":"8472960001","vendor_sku":"11621","upc":"806955628180","size":"Regular","color":"STONE PINE","retail_price":"289.00","sale_price":"289.00"},"8472960002":{"sku":"8472960002","vendor_sku":"11621","upc":"806955628203","size":"Tall","color":"STONE PINE","retail_price":"289.00","sale_price":"289.00"},"8472960003":{"sku":"8472960003","vendor_sku":"11621","upc":"806955628159","size":"Regular","color":"CARBON COPY","retail_price":"289.00","sale_price":"289.00"},"8472960004":{"sku":"8472960004","vendor_sku":"11621","upc":"806955628173","size":"Tall","color":"CARBON COPY","retail_price":"289.00","sale_price":"289.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
