{"sku":"847276","manufacturer_id":"041210-354-1-S/","brand_name":"Osprey","product_name":" Osprey Syncro 10 Hydration Pack - 100 fl. oz.","long_description":"Carry your riding essentials in well-ventilated comfort with the Osprey Syncro 10 hydration pack, which boasts a 100 fl. oz. reservoir and easy gear organization for multiple-hour riding adventures. Ventilated and supportive AirSpeed(TM) suspension incorporates a wire frame with suspended mesh, ridged foam and side vents for excellent breathability. Contoured shoulder straps feature breathable mesh and perforated foam to enhance breathability and comfort; wide webbing hipbelt can be removed. Zippered main pocket offers access to the hydration reservoir as well as storage space for your riding gear, clothes, lunch and more; compression straps help secure the load. Large front zip pocket features tool organization sleeves and mesh pockets, making it a breeze to store and get to pumps, bike tools and tubes; includes a key clip. Quick-access top zippered pocket is lined with a soft, easy-to-clean, heat-embossed fabric that helps keep sunglasses or other fragile items from getting scratched. Stretch-mesh pockets on each side of hipbelt keep small essentials within easy reach. Securing a helmet is super-easy and fast, thanks to the LidLock(TM) helmet clip; a bungee on the exterior of the pack allows easy adjustment of the LidLock feature. Hydration system features a 100 fl. oz. reservoir that conforms to back's shape even when full, resulting in a precise, stable and comfortable fit. Rigid spine/handle stabilizes the reservoir, making it easy to slide into its dedicated compartment; large mouth makes filling/cleaning easy. BPA- and PVC-free reservoir does not retain tastes or odors and features an antimicrobial treatment that deters bacterial growth. 180deg pivoting on/off valve rotates in either direction for quick and easy flow control; magnetic sternum-strap buckle secures the bite valve when not in use.","short_description":"Carry your riding essentials in well-ventilated comfort with the Osprey Syncro 10 hydration pack, which boasts a 100 fl. oz. reservoir and easy gear organization for multiple-hour riding adventures.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411763.png","image_url":"http://i1.avlws.com/115/l411763.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411763&tt=df","keywords":"day packs","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411763\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411763.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847276&amp;link=&amp;tabs=-Details\"></script>","variants":{"8472760001":{"sku":"8472760001","vendor_sku":"041210-354-1-S/","upc":"877257017538","size":"S/M","color":"PYRO RED","retail_price":"109.95","sale_price":"109.95"},"8472760002":{"sku":"8472760002","vendor_sku":"041210-354-2-M/","upc":"877257017545","size":"M/L","color":"PYRO RED","retail_price":"109.95","sale_price":"109.95"},"8472760003":{"sku":"8472760003","vendor_sku":"041210-525-1-S/","upc":"877257017552","size":"S/M","color":"PITCH BLACK","retail_price":"109.95","sale_price":"109.95"},"8472760004":{"sku":"8472760004","vendor_sku":"041210-525-2-M/","upc":"877257017569","size":"M/L","color":"PITCH BLACK","retail_price":"109.95","sale_price":"109.95"}}}
