{"sku":"847389","manufacturer_id":"97331354","brand_name":"Wilderness Systems","product_name":" Wilderness Systems Aspire 100 Kayak with Skeg - 2012/2013","long_description":"Love to paddle lakes, but looking to enjoy the experience of some faster-moving rivers? The Wilderness Systems Aspire 100 helps expand your paddling repertoire beyond flatwater. High density polyethylene hull withstands years of use and offers high durability. Slightly smaller than its 10 ft. 6 in. counterpart, the 10 ft. Wilderness Systems Aspire 100 is designed for small kayakers. The Aspire 100 features a hybrid design between a purely recreational kayak and 1 designed for moving water. As with all Wilderness Systems kayaks, you'll love the confidence-inspiring stability of the Aspire 100. Shallow arch hull is easy to turn, reminiscent of Tarpon and tandem Pamlico series, and it enhances maneuverability in class II rivers and even gentle surf. Upswept, full bow easily rides up and over waves. Front console fits in multiple sizes of bottles, cans, liter-sized wide-mouth bottles and smaller bottles. Gear trays on either side of the water-bottle holder offers storage for small cameras, cell phones, sunscreen or sunglasses; drain holes help keep things dry. Adjustable, spring-loaded skeg deploys with a cord on right side of cockpit and enhances tracking in flatwater. Phase 3 Air Pro seat offers excellent comfort and intuitive adjustments. Mesh stretched over contoured foam forms a perforated pad; large holes enhance airflow, and small holes enhance support for sit bones and lower back. Scalloped, contoured seat pan cradles and cushions legs, and backrest conforms to size of paddler and flexes a bit with every paddle stroke. Icons show what each adjustment strap does, and all control points are forward of the paddler and centrally located to reduce strain. Leg lifter uses handle to shore up space below your legs; back strap lowers seat back, and the angle of back rest is adjustable as well. Small gear bag under seat features a gear clip and enough capacity for a water bottle or extra food.","short_description":"Love to paddle lakes, but looking to enjoy the experience of some faster-moving rivers? The Wilderness Systems Aspire 100 helps expand your paddling repertoire beyond flatwater.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s430567.png","image_url":"http://i1.avlws.com/115/l430567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430567&tt=df","retail_price":"739.00","sale_price":"739.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847389&amp;link=&amp;tabs=-Details\"></script>","variants":{"8473890003":{"sku":"8473890003","vendor_sku":"97331361","upc":"729282751812","color":"LIME","retail_price":"739.00","sale_price":"739.00"}},"categories":["paddling","kayaks","recreational-kayaks"]}
