{"sku":"847391","manufacturer_id":"97225340","brand_name":"Wilderness Systems","product_name":"Wilderness Systems Tsunami 125 Kayak","long_description":"With the stability and agility of a recreational kayak and the space and efficiency of a light touring kayak, the Wilderness Systems Tsunami 125 kayak is sized for day and overnight trips. Slightly larger than its 12 ft. cousin, the Wilderness Systems Tsunami 125 kayak is a great choice for large paddlers thanks to its spacious cockpit. Hull is crafted in high-density polyethylene for amazing durability and easy care. Solid initial and secondary stability enhances confidence when learning, and speed and handling delight more experienced paddlers. Cockpit is easy to get into no matter who is paddling. Phase 3 Air Pro Tour seat offers excellent comfort and intuitive adjustments. Mesh stretched over contoured foam forms a perforated pad; large holes enhance airflow, and small holes enhance support for sit bones and lower back. Scalloped, contoured seat pan cradles and cushions legs, and backrest conforms to size of paddler and flexes a bit with every paddle stroke. Icons shows what each adjustment strap does, and all control points are forward of the paddler and centrally located to reduce strain. Leg lifter uses handle to shore up space below your legs; back strap lowers seat back, and the angle of back rest is adjustable as well. Small gear bag under seat features a gear clip and enough capacity for a water bottle or extra food. Rear bungee cords lock seat back forward during transport. Slidelock footrail system is easily adjustable, comfortable and rugged; footbraces adjust via extension rod that places positioning at your fingertips. The Tsunami 125 kayak is equipped with 2 generous hatches plus plenty of deck rigging, letting you easily stow a weekend's worth of food and gear. Bulkheads in bow and stern along with rubber hatch covers keep gear secure and dry and assist with flotation. Domed hatch covers offer a rugged watertight seal and an easy-to-remove tab and contours.","short_description":"With the stability and agility of a recreational kayak and the space and efficiency of a light touring kayak, the Wilderness Systems Tsunami 125 kayak is sized for day and overnight trips.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s458087.png","image_url":"http://i1.avlws.com/115/l458087.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458087&tt=df","retail_price":"1019.00","sale_price":"1019.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458087\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458087.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847391&amp;link=&amp;tabs=-Details\"></script>","variants":{"8473910001":{"sku":"8473910001","vendor_sku":"97225340","upc":"729282746641","color":"RED","retail_price":"1019.00","sale_price":"1019.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
