{"sku":"847394","manufacturer_id":"97207354","brand_name":"Wilderness Systems","product_name":"Wilderness Systems Tempest 170 Kayak with Skeg - 2012/2013","long_description":"Smooth, sleek and ready for touring, the Wilderness Systems Tempest 170 kayak with skeg blends speed with impeccable manners and excellent maneuverability in all conditions. High-density polyethylene construction offers performance, rugged durability and affordability. With hull lines similar to many British kayaks, the Tempest adds even more chine area for amazing secondary stability and enhanced turning ability. Combination of solid initial stability and strong tracking even in high winds makes this kayak an excellent choice for rough-water expedition paddling. Excellent secondary stability lets skilled paddlers confidently put the boat on edge and hold it there. Paddle comfortably all day thanks to the the Phase 3 Air Pro XP seat, which offers excellent comfort and intuitive adjustment. Mesh stretched over 3-dimensional foam forms a perforated pad; large holesenhance airflow, and small holes enhance support for sit bones and lower back. Scalloped, contoured seat pan cradles and cushions legs, and backrest conforms to size of paddler and flexes a bit with every paddle stroke. Series of icons shows what each adjustment strap does, and all control points are forward of the paddler and centrally located to reduce strain. Leg lifter uses handle to shore up space below your legs; back strap lowers seat back, and the angle of back rest is adjustable as well. Small gear bag under seat features a gear clip and enough capacity for a water bottle or extra food. Rear bungee cords lock seat back forward during transport. SlideLock footrail system is comfortable, rugged and easy to adjust; foot braces adjust via extension rod that places positioning at your fingertips. Cockpit-controlled drop-down skeg improves tracking and resists weathercocking. The Tempest 170 is equipped with 3 hatches plus plenty of deck rigging, letting you easily stow up to a week's worth of food and gear.","short_description":"Smooth, sleek and ready for touring, the Wilderness Systems Tempest 170 kayak with skeg blends speed with impeccable manners and excellent maneuverability in all conditions.","category":"Paddling","subcategory":"Kayaks","product_group":"Sea Kayaks","thumb_url":"http://i1.avlws.com/115/s430607.png","image_url":"http://i1.avlws.com/115/l430607.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430607&tt=df","retail_price":"1629.00","sale_price":"1629.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430607\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430607.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847394&amp;link=&amp;tabs=-Details\"></script>","variants":{"8473940002":{"sku":"8473940002","vendor_sku":"97207354","upc":"729282746894","color":"MANGO","retail_price":"1629.00","sale_price":"1629.00"}},"categories":["paddling","kayaks","sea-kayaks"]}
