{"sku":"847396","manufacturer_id":"97521340","brand_name":"Wilderness Systems","product_name":"Wilderness Systems Tarpon 120 Sit-On-Top Kayak - 2012/2013","long_description":"Ready to get out on the water? The Wilderness Systems Tarpon 120 sit-on-top kayak offers easy transport, solid performance on the water and plenty of room for gear. Smooth-paddling design lends itself to serious paddling fun; kayak tracks very well, offers surprising speed and turns easily. Hull is crafted in high-density polyethylene to provide rugged durability and easy care. Multichine hull responds to leans and delivers terrific secondary stability; self-bailing hull ensures flotation in rough water. 12 ft. length and moderate weight allow kayak to be transported by the solo paddler. Updated for 2012, the Phase 3 Air Pro sit-on-top seat offers excellent comfort and intuitive adjustments. Mesh stretched over 3-dimensional foam forms a perforated pad; large holes enhance airflow and small holes enhance support for sit bones and lower back. Scalloped, contoured seat pan cradles and cushions legs, and backrest conforms to size of paddler and flexes a bit with every paddle stroke. Series of icons shows what each adjustment strap does, and all control points are forward of the paddler and centrally located to reduce strain. Leg lifter uses handle to shore up space below your legs; back strap lowers seat back, and the angle of back rest is adjustable as well. Small gear bag under seat features a gear clip and enough capacity for a water bottle or extra food. Rear bungee cords lock seat back forward during transport. Increased tank well size with bungee cords keeps tackle box and dry bags secure. New dual Slide-Trax rail system at front of seating area and tank well attach compatible accessories (not included) without tools or complicated adjustments. Keepers footbraces adjust to maximize comfort, personalizing your paddling experience and ensuring optimal paddling position. 8 in. center hatch and 19 in. bow hatch offer dry storage for small items like clothing and lunch.","short_description":"Ready to get out on the water? The Wilderness Systems Tarpon 120 sit-on-top kayak offers easy transport, solid performance on the water and plenty of room for gear.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s430651.png","image_url":"http://i1.avlws.com/115/l430651.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430651&tt=df","retail_price":"919.00","sale_price":"919.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430651\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430651.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847396&amp;link=&amp;tabs=-Details\"></script>","variants":{"8473960001":{"sku":"8473960001","vendor_sku":"97521340","upc":"729282744333","color":"RED","retail_price":"919.00","sale_price":"919.00"},"8473960002":{"sku":"8473960002","vendor_sku":"97521309","upc":"729282744388","color":"SAND","retail_price":"919.00","sale_price":"919.00"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
