{"sku":"847403","manufacturer_id":"CSB10530RE","brand_name":"Nemo","product_name":"NEMO Siren Sleeping Quilt","long_description":"Designed for your minimalist adventures into the mountains, the NEMO Siren sleeping quilt weighs just a hair over 1 lb. to keep you warm at night without weighing you down on the hike in. Lofty 850-fill-power goose down provides excellent insulation and compresses down small when you're packing the bag away. Buttery-soft, featherweight nylon ripstop fabric has a Durable Water Repellent coating to help keep moisture from seeping in to the down. Use the optional lacing system to close the back of the Siren to retain warmth on especially chilly nights; snap at the collar keeps you tucked in. Stretch stitching helps maintain bag shape and down loft while also allowing the bag to subtly move with you throughout the night. Blanket Fold(TM) insulated flap of fabric can be wrapped around your neck to block drafts and add warmth. When the Siren is paired with a regular or short NEMO Zor(TM) sleeping pad (sold separately), your total sleep system weighs in at 2 lbs. or less. Insert your sleeping pad inside the Siren, or lay on top of it; Siren accommodates a variety of pad widths. NEMO Siren 30 down sleeping quilt comes with a roll-top compression stuff sack and a storage bag.","short_description":"Designed for your minimalist adventures into the mountains, the NEMO Siren sleeping quilt weighs just a hair over 1 lb. to keep you warm at night without weighing you down on the hike in.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421379.png","image_url":"http://i1.avlws.com/115/l421379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421379&tt=df","keywords":"compact","retail_price":"349.95","sale_price":"349.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847403&amp;link=&amp;tabs=-Details\"></script>","variants":{"8474030001":{"sku":"8474030001","vendor_sku":"CSB10530RE","upc":"814041012591","size":"Regular","color":"ALUMINUM/LIGHTNING","retail_price":"349.95","sale_price":"349.95"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
