{"sku":"847405","manufacturer_id":"CSB12540RER","brand_name":"Nemo","product_name":" NEMO Harmony 40 Sleeping Bag - Women's","long_description":"Nobody actually sleeps like a mummy, so why try to fit in a mummy-shaped bag? The NEMO Harmony 40 sleeping bag features the Spoon(TM) Shape to free your legs and accommodate all sleeping positions. The new NEMO Spoon Shape is wide in the shoulders, tapers to the hips and then gently flares back out to allow room for the natural bend and shift of knees. PrimaLoft(R) Synergy synthetic microfiber insulation works a lot like down: it minimizes bulkiness, packs down well and stays warm even when wet. Synergy insulation is constructed of fine and ultrafine denier fibers for exellent warmth, softness and loft; fibers form tiny air pockets to trap body heat. Underside of sleeping bag features 10% less insulation than the topside to cut down on weight (insulation underneath is often flattened, so less doesn't hinder performance). Features women-specific geometry and extra insulation in the footbox for excellent comfort. Footbox has a waterproof/breathable coating on the backside of the fabric that combines with a Durable Water Repellent finish on the exterior to protect from tent condensation. A nifty little feature in the hood is the tuckable Blanket Fold(TM), an insulated flap of fabric that can be wrapped around your neck to block drafts and add warmth. Includes a pillow pocket to hold your pillow (sold separately) and a zippered watch pocket so you'll hear your alarm go off in the morning. NEMO Harmony 40 sleeping bag comes with a roll-top compression stuff sack and a storage bag.","short_description":"Nobody actually sleeps like a mummy, so why try to fit in a mummy-shaped bag? The NEMO Harmony 40 sleeping bag features the Spoon(TM) Shape to free your legs and accommodate all sleeping positions.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421387.png","image_url":"http://i1.avlws.com/115/l421387.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421387&tt=df","keywords":"compact","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421387\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421387.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847405&amp;link=&amp;tabs=-Details\"></script>","variants":{"8474050002":{"sku":"8474050002","vendor_sku":"CSB12540RER","upc":"814041012034","size":"Regular Right","color":"ALUMINUM/MARIGOLD","retail_price":"199.95","sale_price":"199.95"}}}
