{"sku":"847401","manufacturer_id":"CSB11030LOL","brand_name":"Nemo","product_name":"NEMO Nocturne 30 Sleeping Bag","long_description":"Breaking the mold of sleeping bag shapes, the NEMO Nocturne 30 sleeping bag brings up the notion that maybe mummies didn't sleep all that comfortably. NEMO finds a middle ground for the living. The new NEMO Spoon Shape is wide in the shoulders, tapers to hips and then gently flares back out to allow room for the natural bend and shift of knees. DownTek(TM) 700-fill-power duck down repels water by employing nano technology and a proprietary process to apply a micro-thin polymer to the down. DownTek down repels water and maintains loft and insulation value, even in the wettest conditions. Proprietary application process creates a water repellent, antimicrobial and antibacterial down insulation that actually floats on water. A nifty little feature in the hood is the tuckable Blanket Fold(TM), an insulated flap of fabric that can be wrapped around neck to block drafts and add a layer of warmth. Baffle construction curves to the shape of your body; construction keeps down from shifting around, so cold spots are prevented. Waterproof/breathable coating on backside of fabric combined with a Durable Water Repelent on the exterior protects from tent wall condensation. NEMO Nocturne 30 down sleeping bag comes with a compression stuff sack and storage bag.","short_description":"Breaking the mold of sleeping bag shapes, the NEMO Nocturne 30 sleeping bag brings up the notion that maybe mummies didn't sleep all that comfortably. NEMO finds a middle ground for the living.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421371.png","image_url":"http://i1.avlws.com/115/l421371.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421371&tt=df","keywords":"compact","retail_price":"369.95","sale_price":"369.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421371\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421371.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847401&amp;link=&amp;tabs=-Details\"></script>","variants":{"8474010003":{"sku":"8474010003","vendor_sku":"CSB11030REL","upc":"814041012089","size":"Regular Left","color":"ALUMINUM/CLOVER","retail_price":"349.95","sale_price":"349.95"},"8474010004":{"sku":"8474010004","vendor_sku":"CSB11030LOL","upc":"814041012102","size":"Long Left","color":"ALUMINUM/CLOVER","retail_price":"369.95","sale_price":"369.95"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
