{"sku":"847561","manufacturer_id":"2841","brand_name":"Rei","product_name":"REI Halo 40 Sleeping Bag - Women's Regular - Special Buy","long_description":"The REI Halo +40 women's warm-weather sleeping bag offers the perfect of balance low weight, high-quality materials and top performance-great for all your backpacking and car-camping trips. Designed specifically to fit the contours of a woman's body around the hips and shoulders. Partially recycled ripstop polyester shell and lining feels soft against skin. Premium 750-fill-power goose down is extremely warm, lightweight and compressible. Contoured hood, face muffler, trapezoidal foot box, full-length antisnag zipper, and full-length draft tube work together to keep body heat in and cold air out. External chest pocket keeps essentials such as headlamp, watch and glasses right at hand and easy to find in the dark. Differentiated drawcords (1 round, 1 flat) let you adjust hood and neck easily in the dark. Pad loops provide attachment points to keep your sleeping bag and pad together, so you don't roll off onto the cold ground (straps not included). European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags. Comes with stuff sack and large cotton storage bag. Special Buy.","short_description":"The REI Halo +40 women's warm-weather sleeping bag offers the perfect of balance low weight, high-quality materials and top performance-great for all your backpacking and car-camping trips.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Warm Weather Sleeping Bags (+35F And Above)","thumb_url":"http://i1.avlws.com/115/s323123.png","image_url":"http://i1.avlws.com/115/l323123.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=323123&tt=df","keywords":"familycamping,camping,bag,car,sleeping","retail_price":"209.00","sale_price":"155.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=323123\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m323123.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847561&amp;link=&amp;tabs=-Details\"></script>","variants":{"8475610001":{"sku":"8475610001","vendor_sku":"2841","upc":"484756100014","size":"Regular","color":"NETTLE/PEWTER","retail_price":"155.73","sale_price":"155.73"}}}
