{"sku":"847549","manufacturer_id":"ULT-RP-EF","brand_name":"Steripen","product_name":"SteriPEN Ultra Water Purifier","long_description":"When you're traveling or backpacking, put your trust in the rechargeable SteriPEN Ultra water purifier to be your source for potable water. Ultra features an internal battery that's recharged from any USB power source; connect the included USB cable and start charging from a solar panel, laptop or car power port. Low-power indicator lets you know when battery needs recharging; you'll get about 40 treatments per charge. Ultraviolet (UV-C) light rays safely sterilize clear water by destroying 99.99% of protozoa (including Giardia and Cryptosporidia), bacteria and even viruses. SteriPEN protects you from risks that cause botulism, cholera, dysentery and typhoid, just to name a few. To purify your water, just press a button and gently agitate the water with a quick stir. Purifies 16 fl. oz. of water (cold or warm) in less than a minute; to treat 32 fl. oz., simply treat the water twice. Ultra is designed to fit perfectly into store-bought bottles of water; just insert the Ultra into the bottle, flip the bottle upside down and start treating the water. Small size fits most containers-use it in cups, mugs, water bottles and canteens. SteriPEN turns itself off once ultraviolet treatment is complete; can be used up to 8,000 times! Watertight seals keep water away from the electronics; rubberized inset grips for secure handling in wet conditions. Long used by municipal water districts and bottling companies, low-level UV-C light treats water safely, and unit's light will not damage eyes or skin. Use only on clear water, as cloudy, sediment-laden water hinders effectiveness; FitsAll prefilter (sold separately) clears particulates and debris from water. Includes SteriPEN Ultra water purifier, USB cable, carrying case and instruction manuals.","short_description":"When you're traveling or backpacking, put your trust in the rechargeable SteriPEN Ultra water purifier to be your source for potable water.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426387.png","image_url":"http://i1.avlws.com/115/l426387.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426387&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426387\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426387.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847549&amp;link=&amp;tabs=-Details\"></script>","variants":{"8475490001":{"sku":"8475490001","vendor_sku":"ULT-RP-EF","upc":"899321000970","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
