{"sku":"847528","manufacturer_id":"00601513RR","brand_name":"Sierra Designs","product_name":"Sierra Designs Eleanor 19 Sleeping Bag - Women's","long_description":"The women's Eleanor 19degF sleeping bag features the new Sierra Designs DriDown(TM) finish for down insulation. It resists water and dries fast! Regular down takes on water and is very difficult to dry; DriDown proprietary process treats each individual duck down plume with a hydrophobic finish. With the duck down now resistant to water, the insulation maintains its loft and stays dry 7 times longer than untreated down. It also performs better in high humidity than regular down and, in case it accidentally gets wet, it will dry out faster, too. Women-specific bags are cut to match a woman's shape, and provide extra insulation and warmth in the hood and feet areas. Lightweight yet durable 30-denier micro-ripstop polyester shell and comfortable, moisture-wicking polyester lining warm up fast. Baffle construction keeps down from migrating, eliminating cold spots. Full-length 2-way, double sliding zipper allows easy venting; locking slider is backed by wide, antisnag binding tape. Snag-free zipper tracks prevent the dreaded stuck zipper by creating a barrier between the lining and the zipper track. Fully insulated draft tube backing the zipper keeps body heat in and cold air out. Ergonomic, nonrestrictive hood cradles your head in warmth; hood features differentiated drawcords that make fit adjustments easy, even in the dark. Roomy, ergonomically shaped footbox enhances comfort and warmth of feet. Sierra Designs Eleanor 19degF comes with stuff sack and storage bag. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The women's Eleanor 19degF sleeping bag features the new Sierra Designs DriDown(TM) finish for down insulation. It resists water and dries fast!","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421423.png","image_url":"http://i1.avlws.com/115/l421423.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421423&tt=df","keywords":"compact","retail_price":"339.95","sale_price":"339.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421423\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421423.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847528&amp;link=&amp;tabs=-Details\"></script>","variants":{"8475280001":{"sku":"8475280001","vendor_sku":"00601513RR","upc":"054003729246","size":"Regular Right","color":"CARIBBEAN","retail_price":"339.95","sale_price":"339.95"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
