{"sku":"847640","manufacturer_id":"1008479","brand_name":"Keen","product_name":" Keen Arroyo II Sandals - Women's","long_description":"The Keen Arroyo II sandals pair sandal ventilation with trail-shoe support and protection, making them a great choice for multisport adventures. Waterproof nubuck leather uppers form a flexible, durable, quick-drying, protective and supportive shell for your feet. Patented rubber toe protects feet from scuffs, bumps and uneven terrain. One-pull elastic drawcord laces secure uppers around instep; heel and tongue loops aid entry and exit. Tightening the laces draws in a webbing strap running through a heel counter in order to minimize heal slippage. Nylon mesh linings enhance comfort and control moisture. Removable dual-density EVA footbeds provide ample cushioning and arch support. EVA midsoles offer rich shock-absorption and padding; ESS nylon stability shanks offer torsional stability. Keen Arroyo II sandals feature nonmarking carbon rubber outsoles with deep lugs for exceptional durability and superb traction on loose dirt, scree or rock.","short_description":"The Keen Arroyo II sandals pair sandal ventilation with trail-shoe support and protection, making them a great choice for multisport adventures.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s387431.png","image_url":"http://i1.avlws.com/115/l387431.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=387431&tt=df","keywords":"trail","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=387431\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m387431.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847640&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","womens-footwear","womens-shoes"]}
