{"sku":"847636","manufacturer_id":"40814512","brand_name":"Kelty","product_name":"Kelty Frontier 4 Tent","long_description":"If you're a family of 4 looking for a tent that you can really hang out in, the Kelty Frontier 4 is for you. Take a close look, this canvas home away from home is not your father's old canvas tent. Easy to setup, freestanding design provides over 7 ft. of peak height. Expansive supported vestibule can be kept open to create a screened-in porch or closed up so that you can still utilize this space in the event the weather turns. Continuous pole sleeves across combined with quick-to-use pole clips ensure an easy setup and a secure, stable pitch. Single-wall poly/cotton canvas fabric breathes well when it's dry and seals out moisture when it rains; taped floor seams add waterproofness and durability. Interior storage pockets help keep your space tidy. Noiseless zipper pulls on the tent and vestibule won't rattle you awake. Vestibule features large front door and a smaller side door; tent has 1 large divided door that separates into 2 smaller entries if desired. Fly vents and closeable mesh vestibule panels enhance air circulation and ventilation. Guyout points stabilize the Kelty Frontier 4 tent and assist with air circulation.","short_description":"If you're a family of 4 looking for a tent that you can really hang out in, the Kelty Frontier 4 is for you. Take a close look, this canvas home away from home is not your father's old canvas tent.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424423.png","image_url":"http://i1.avlws.com/115/l424423.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424423&tt=df","retail_price":"1099.95","sale_price":"1099.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424423\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424423.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847636&amp;link=&amp;tabs=-Details\"></script>","variants":{"8476360001":{"sku":"8476360001","vendor_sku":"40814512","upc":"727880028763","color":"PUTTY","retail_price":"1099.95","sale_price":"1099.95"}},"categories":["camping-hiking","tents","camping-tents"]}
