{"sku":"847648","manufacturer_id":"N5414813LR","brand_name":"Kelty","product_name":"Kelty Cosmic Down 41 Sleeping Bag","long_description":"Snuggle up in the Kelty Cosmic Down 41 Sleeping Bag in conditions ranging from a cool spring morning to a brisk fall night. The Cosmic Down 41 provides exceptional warmth at a great price. Soft, high-loft 550-fill-power duck down insulation provides exceptional warmth and light weight. Baffle construction with differential cut eliminates cold spots; inner layer is cut smaller than the outer layer to create consistent thickness of insulation. Polyester taffeta creates a smooth yet durable shell; polyester taffeta lining breathes for comfort and feels great against skin. Formfitting hood has drawcords of differing widths at head and neck for easy identification and adjustment in the dark. Ground-level side seam helps prevent cold air from seeping through the 2-way, locking zipper. Internal loops provide attachment for a liner (sold separately) to increase the warmth of the bag. Pad loops provide attachment points to keep your sleeping bag and pad together, so you needn't worry about rolling onto the cold, hard ground (straps sold separately). Hang loops allow easy drying and storage. Kelty Cosmic Down 41degF sleeping bag comes with a stuff sack.","short_description":"Snuggle up in the Kelty Cosmic Down 41 Sleeping Bag in conditions ranging from a cool spring morning to a brisk fall night. The Cosmic Down 41 provides exceptional warmth at a great price.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421443.png","image_url":"http://i1.avlws.com/115/l421443.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421443&tt=df","keywords":"compact","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421443\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421443.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847648&amp;link=&amp;tabs=-Details\"></script>","variants":{"8476480002":{"sku":"8476480002","vendor_sku":"N5414813LR","upc":"727880038793","size":"Long Right","color":"GOLDEN YELLOW","retail_price":"149.95","sale_price":"149.95"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
