{"sku":"847651","manufacturer_id":"N5420713LR","brand_name":"Kelty","product_name":" Kelty Ignite Down 16 Sleeping Bag","long_description":"Keep the cold weather at bay and your engine warm with the Kelty Ignite DriDown(TM) 16degF sleeping bag that stays warm and dry with revolutionary down insulation. Regular down takes on water and is very difficult to dry; the DriDown proprietary process treats each individual duck down plume with a hydrophobic finish. With the down now resistant to water, the insulation maintains its loft and stays dry 7 times longer than untreated down. It also performs better in high humidity than regular down, and in case it accidentally gets wet, it will dry out faster, too. Baffle construction with differential cut eliminates cold spots; inner layer is cut smaller than the outer layer to create consistent thickness of insulation. Tough, 30-denier ripstop nylon shell provides durabilty; polyester lining breathes for comfort and feels great against skin. Top baffle draft collar drapes comfortably over neck and shoulders, sealing out drafts. Formfitting hood has drawcords of differing widths at head and neck for easy identification and adjustment in the dark. Ground-level side seam keeps draft tube in place, further helping to prevent cold air from seeping through the 2-way, locking zipper. Internal loops provide attachment for a liner (sold separately) to increase the warmth of the bag. Pad loops provide attachment points to keep your sleeping bag and pad together, so you needn't worry about rolling onto the cold, hard ground (straps sold separately). Hang loops allow easy drying and storage. Kelty Ignite DriDown 16degF sleeping bag comes with a stuff sack.","short_description":"Keep the cold weather at bay and your engine warm with the Kelty Ignite DriDown(TM) 16degF sleeping bag that stays warm and dry with revolutionary down insulation.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421451.png","image_url":"http://i1.avlws.com/115/l421451.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421451&tt=df","keywords":"compact","retail_price":"239.95","sale_price":"239.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421451\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421451.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847651&amp;link=&amp;tabs=-Details\"></script>","variants":{"8476510002":{"sku":"8476510002","vendor_sku":"N5420713LR","upc":"727880037567","size":"Long Right","color":"CHILI PEPPER","retail_price":"239.95","sale_price":"239.95"}}}
