{"sku":"847658","manufacturer_id":"40819213","brand_name":"Kelty","product_name":" Kelty Carport ESB Shelter","long_description":"Park the car and set up camp in minutes with the Kelty Carport ESB. Attach this unique shelter to the roof rack of your mid- to large-size SUV or truck for instant protection from sun and rain. Color-coded clip construction makes setup intuitive and easy; canopy attaches to roof rack with rip-and-stick loops. Closeable mesh panels provide a choice between visibility and venting or more privacy. Side panel rolls back and secures to create a door. Livibility features includes internal storage pockets and noiseless zipper pulls. Guyline storage pockets keep cord organized and out of the way. Taped seams provide provide complete weather protection. Package includes Carport ESB canopy, 1 main hubbed pole system, 2 leg poles, 1 fiberglass pole, guycords and tent stakes. Please note: Carport ESB works with vehicles with a factory or aftermarket roof rack and with back doors that open either up (hatchback) or up/down (tailgate). Please note: if using the Kelty Carport ESB shelter in a parking lot, you will need sandbags, not included.","short_description":"Park the car and set up camp in minutes with the Kelty Carport ESB. Attach this unique shelter to the roof rack of your mid- to large-size SUV or truck for instant protection from sun and rain.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Truck Tents","thumb_url":"http://i1.avlws.com/115/s425283.png","image_url":"http://i1.avlws.com/115/l425283.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=425283&tt=df","retail_price":"274.95","sale_price":"274.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=425283\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m425283.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847658&amp;link=&amp;tabs=-Details\"></script>","variants":{"8476580001":{"sku":"8476580001","vendor_sku":"40819213","upc":"727880038397","color":"COOL GREY/PUTTY","retail_price":"274.95","sale_price":"274.95"}}}
