{"sku":"847860","manufacturer_id":"62041","brand_name":"Camelbak","product_name":" CamelBak H.A.W.G. NV Hydration Pack - 100 fl. oz.","long_description":"The spacious CamelBak H.A.W.G. NV hydration pack has got your back with plenty of hydration and storage to keep you rolling from dawn until dusk and into the night. Lightweight NV(TM) back panel features articulating pods that hold the load away from your back for dependable ventilation. Padded shoulder straps provide a comfortable fit over the long haul; D-Fit(TM) shoulder straps slide to automatically adjust to wide or narrow shoulders for sweet comfort. Sternum strap can be repositioned up or down on your chest for a customized fit; fixed hipbelt offers added stability. 100 fl. oz. Antidote(TM) reservoir is equipped with the Quick Link(TM) connection system for hassle-free removal of the drinking tube. Bite valve is ergonomically positioned for easy drinking; handy HydroLock(TM) securely shuts off water flow. Dual bike-tool organizer pockets and hipbelt pockets keep essentials within reach. Media pocket with weather-resistant zipper is conveniently located at the top of the pack. External quick-stash pocket keeps your jacket handy and cinches down to keep contents tight; helmet hook secures your helmet when you're not wearing it. Full-zip panel access makes it easy to load a full reservoir into the pack. Reflective accents enhance your visibility in the dark. The CamelBak H.A.W.G. NV hydration pack features a durable, integrated raincover that helps protect the pack from moisture.","short_description":"The spacious CamelBak H.A.W.G. NV hydration pack has got your back with plenty of hydration and storage to keep you rolling from dawn until dusk and into the night.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411771.png","image_url":"http://i1.avlws.com/115/l411771.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411771&tt=df","keywords":"day packs","retail_price":"150.00","sale_price":"150.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411771\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411771.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847860&amp;link=&amp;tabs=-Details\"></script>","variants":{"8478600001":{"sku":"8478600001","vendor_sku":"62041","upc":"886798620411","color":"VOLCANO","retail_price":"150.00","sale_price":"150.00"},"8478600002":{"sku":"8478600002","vendor_sku":"62040","upc":"886798620404","color":"PIRATE BLACK","retail_price":"150.00","sale_price":"150.00"}}}
