{"sku":"847870","manufacturer_id":"62246","brand_name":"Camelbak","product_name":" CamelBak Spark 10 LR Hydration Pack - 70 fl. oz. - Women's","long_description":"The ultralight women's CamelBak Spark 10 LR hydration pack cuts a low profile and offers 70 fl. oz. of hydration capacity along with room for gear on your mountain biking adventures. Women-specific design includes soft contact points, a narrow, curved shoulder harness and a slider sternum strap. 4-point adjustable harness offers a custom, secure fit. Lightweight back panel incorporates a vertical ventilation chimney, allowing your back to breathe. LR designation stands for \"Lumbar Reservoir\", placing the reservoir low and close to your body for enhanced stability. 70 fl. oz. Antidote(TM) reservoir is equipped with the Quick Link(TM) connection system for hassle-free removal of the drinking tube. Big Bite(TM) valve is ergonomically positioned for easy drinking. It's easy to access the reservoir via the zippered flap at bottom front of the pack; simply lift the flap to unzip it, open the reservoir mouth and fill. The Spark 10 LR is constructed out of ultralight materials throughout; Durable Water Repellent finish helps fend off light rain. 450 cu. in. gear capacity lets you bring along the essentials such as a multitool, CO2 pump and cartridges, spare tube, extra layer, energy foods, cell phone, wallet and keys. Main compartment features a mesh organizer panel and key clip; front outer stash pocket holds a jacket or other bulky items. Zippered hipbelt pockets offer quick-access storage for small items such as energy bars or gels. The CamelBak Spark 10 LR hydration pack has reflective detailing, increasing your visibility in low light.","short_description":"The ultralight women's CamelBak Spark 10 LR hydration pack cuts a low profile and offers 70 fl. oz. of hydration capacity along with room for gear on your mountain biking adventures.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411803.png","image_url":"http://i1.avlws.com/115/l411803.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411803&tt=df","keywords":"day packs","retail_price":"110.00","sale_price":"110.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411803\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411803.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847870&amp;link=&amp;tabs=-Details\"></script>","variants":{"8478700003":{"sku":"8478700003","vendor_sku":"62246","upc":"886798622460","color":"BLUE JEWEL/CHARTREUSE","retail_price":"110.00","sale_price":"110.00"},"8478700004":{"sku":"8478700004","vendor_sku":"62282","upc":"886798622828","color":"IMPERIAL PURPLE/GRAPHITE","retail_price":"110.00","sale_price":"110.00"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
