{"sku":"847832","manufacturer_id":"97335332","brand_name":"Wilderness Systems","product_name":" Wilderness Systems Pamlico 135T Tandem Kayak - 2012/2013","long_description":"The Wilderness Systems Pamlico 135T tandem kayak's short length and large cockpit offer you and a friend superb maneuverability and easy entry and exit. Can't you picture it on your next adventure?. The Wilderness Systems Pamlico 135T is a great recreational kayak for exploring ponds and flatwater lakes, slow-moving rivers and gentle waves in open bays. Rock-solid stability makes it perfect for fishing, photography and family paddling, but its efficient design excels at weekend touring, too. Tough polyethylene construction offers high performance and rugged durability. Updated for 2012, the Phase 3 Air Pro tandem seats offer excellent comfort and intuitive adjustments. Mesh stretched over 3-dimensional foam forms a perforated pad; large holes enhance airflow and small holes enhance support for sit bones and lower back. Scalloped, contoured seat pan cradles and cushions legs, and backrest conforms to size of paddler and flexes a bit with every paddle stroke. Series of icons shows what each adjustment strap does, and all control points are forward of the paddler and centrally located to reduce strain. Leg lifter uses handle to shore up space below your legs; back strap lowers seat back, and the angle of back rest is adjustable as well. Front seat easily converts to solo position using an intuitive slide-rail system; foot pegs adjust to provide maneuverability in solo position. When front seat is in solo position, rear seat can be used to stow gear or a small, 4-legged buddy. Roomy cockpit offers comfort and a boat that's easy to get in and out, even for large kayakers. Slide-rail system is comfortable, rugged and easy to adjust; footbraces adjust with an easily-accessible extension rod. 8 in. stern hatch with rubber hatch cover offers easy access to hull storage, and stern bulkhead keeps contents separate from cockpit space.","short_description":"The Wilderness Systems Pamlico 135T tandem kayak's short length and large cockpit offer you and a friend superb maneuverability and easy entry and exit. Can't you picture it on your next adventure?.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s430579.png","image_url":"http://i1.avlws.com/115/l430579.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430579&tt=df","retail_price":"919.00","sale_price":"919.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430579\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430579.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847832&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
