{"sku":"847868","manufacturer_id":"62090","brand_name":"Camelbak","product_name":" CamelBak L.U.X.E. NV Hydration Pack - 100 fl. oz. - Women's","long_description":"The women's CamelBak L.U.X.E. NV hydration pack boasts a fully ventilated back panel for excellent comfort, plus generous capacity and a 100 fl. oz. reservoir for all-day mountain biking sessions. Lightweight NV(TM) back panel features articulating pods that hold the load away from your back for dependable ventilation. Women-specific design includes soft contact points, a narrow, curved shoulder harness and a slider sternum strap. 100 fl. oz. Antidote(TM) reservoir sits in its own rear-entry compartment and is equipped with the Quick Link(TM) connection system for easy removal of the drinking tube. Quick Link system also lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director or flow meter (accessories sold separately). Big Bite(TM) valve is ergonomically positioned for easy drinking; valve securely shuts off water flow with an easy, quick turn. Main compartment, hipbelt pockets, front zippered pocket with internal organization and lined media pocket store and organize gear; expandable scoop pocket holds extra gear. Helmet attachment points make it easy to secure your helmet during transport. Side compression straps let you cinch down loads for jostle-free carrying. Removable rain cover helps keep your gear dry in wet weather. The CamelBak L.U.X.E. NV hydration pack has reflective details that increase your visibility in low light.","short_description":"The women's CamelBak L.U.X.E. NV hydration pack boasts a fully ventilated back panel for excellent comfort, plus generous capacity and a 100 fl. oz. reservoir for all-day mountain biking sessions.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411795.png","image_url":"http://i1.avlws.com/115/l411795.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411795&tt=df","keywords":"day packs","retail_price":"135.00","sale_price":"135.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411795\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411795.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847868&amp;link=&amp;tabs=-Details\"></script>","variants":{"8478680001":{"sku":"8478680001","vendor_sku":"62090","upc":"886798620909","color":"PEACOAT DIVA BLUE","retail_price":"135.00","sale_price":"135.00"},"8478680002":{"sku":"8478680002","vendor_sku":"62208","upc":"886798622088","color":"CLEMENTINE/LIGHT PURPLE","retail_price":"135.00","sale_price":"135.00"}}}
