{"sku":"847869","manufacturer_id":"62059","brand_name":"Camelbak","product_name":" CamelBak Magic Hydration Pack - 70 fl. oz. - Women's","long_description":"The women's CamelBak Magic hydration pack sports a gender-specific design for excellent comfort, plus gear storage and a 70 fl. oz. reservoir for quick mountain biking sessions. Women-specific design includes soft contact points, a narrow mesh shoulder harness and a slider sternum strap; hipbelt is removable. Lightweight XV(TM) back panel offers excellent cross-ventilation to help keep your back cool. 70 fl. oz. Antidote(TM) reservoir has its own, front-entry compartment for easy external filling. Quick Link(TM) system lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director or flow meter (accessories sold separately). Big Bite(TM) valve is ergonomically positioned for easy drinking; valve securely shuts off water flow with an easy, quick turn. Main compartment and front zippered pocket with internal organization store essentials; expandable overflow pocket holds extra gear. Helmet attachment points make it easy to secure your helmet during transport. Side compression straps let you cinch down loads for jostle-free carrying. CamelBak Magic hydration pack has reflective detailing that increases your visibility in low light.","short_description":"The women's CamelBak Magic hydration pack sports a gender-specific design for excellent comfort, plus gear storage and a 70 fl. oz. reservoir for quick mountain biking sessions.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411799.png","image_url":"http://i1.avlws.com/115/l411799.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411799&tt=df","keywords":"day packs","retail_price":"88.00","sale_price":"88.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411799\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411799.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847869&amp;link=&amp;tabs=-Details\"></script>","variants":{"8478690002":{"sku":"8478690002","vendor_sku":"62059","upc":"886798620596","color":"PEACOAT/CAPRI","retail_price":"88.00","sale_price":"88.00"},"8478690004":{"sku":"8478690004","vendor_sku":"62211","upc":"886798622118","color":"CLEMENTINE/LIGHT PURPLE","retail_price":"88.00","sale_price":"88.00"},"8478690005":{"sku":"8478690005","vendor_sku":"62212","upc":"886798622125","color":"LIGHT PURPLE/BLUEBIRD","retail_price":"88.00","sale_price":"88.00"}}}
