{"sku":"847833","manufacturer_id":"93354342","brand_name":"Perception","product_name":"Perception Expression 11.5 Kayak with Skeg","long_description":"Whether you take it for a fun flatwater jaunt or a longer tour, the Perception Expression 11.5 kayak will have you tackling greater distances with more confidence. Designed for those ready to expand their skills, the Expression 11.5 effectively bridges the gap between a fun, maneuverable day-tripping kayak and a predictable touring model. 11 ft. 7 in. model is lighter, more maneuverable, and easier to handle than its 15 ft. counterpart, and it's much easier to load on top of your car. Rigid polyethylene hull withstands years of use without the need for maintenance. Very stable, touring-style hull offers excellent versatility; great for those seeking a boat for everything from light ocean swells to local lakes. Peaked deck and upswept bow sheds water quickly and enhances speed, and progressive rocker enhances handling. Added room in the cockpit and thighbraces enhance confidence in beginning paddlers. Zone DLX seat features a foam-encased pocket that cradles the lower back. Seat back adjusts forward and backward and up and down; leg lifters offer additional support if needed. Backrest may be raised by pulling strap in front of seat forward or by pushing the button on front of seat to lower. Leg lifters raise seat pan to increase support and take pressure of the ankles. Padded foam thighbraces may be repositioned to personalize cockpit for performance or comfort. Slidelock footbraces are easy to adjust from inside the boat; simply raise the black plastic rod to unlock and slide footbrace into desired position. Fully bulkheaded stern hatch provides dry cargo storage. Cockpit-deployable skeg enhances tracking in rough water and windy conditions; sliding skeg controls are located on left side of cockpit. Deck rigging on bow and stern lets you stash items you'll want readily available such as a bilge pump, extra paddle and map with weatherproof case, all not included.","short_description":"Whether you take it for a fun flatwater jaunt or a longer tour, the Perception Expression 11.5 kayak will have you tackling greater distances with more confidence.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s454203.png","image_url":"http://i1.avlws.com/115/l454203.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454203&tt=df","retail_price":"829.00","sale_price":"829.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454203\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454203.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847833&amp;link=&amp;tabs=-Details\"></script>","variants":{"8478330001":{"sku":"8478330001","vendor_sku":"93354342","upc":"729282000000","color":"RED/YELLOW","retail_price":"829.00","sale_price":"829.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
