{"sku":"847803","manufacturer_id":"Z022340210","brand_name":"Zoot","product_name":"Zoot Ultra Tri Bag","long_description":"Before packing your things for your next triathlon, take a look at the Zoot Ultra Tri bag. It's designed with the specific needs of serious triathletes in mind, and it can be carried on the plane. Lightweight, durable bag helps keep all your gear securely stowed and organized so you're ready to go on race day. Interior has divided mesh storage pockets, letting you easily find your race clothes, sunglasses, swim cap and energy food. Molded front compartment protects your cycling helmet. Stash your dirty laundry or wetsuit in the sealed removable pocket. Fleece-lined top pocket protects your sunglasses or digital music player; a side zippered pocket keeps other valuables secure and has a clip for your keys. Stash a water bottle in the stretchy side pocket. Printed triathlon checklist on the inside helps your remember what to bring. Padded waistbelt and shoulder straps support the weight of hefty loads. Zoot Ultra Tri bag has side compression straps to help secure both large and small loads.","short_description":"Before packing your things for your next triathlon, take a look at the Zoot Ultra Tri bag. It's designed with the specific needs of serious triathletes in mind, and it can be carried on the plane.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411175.png","image_url":"http://i1.avlws.com/115/l411175.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411175&tt=df","retail_price":"125.00","sale_price":"125.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411175\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411175.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847803&amp;link=&amp;tabs=-Details\"></script>","variants":{"8478030001":{"sku":"8478030001","vendor_sku":"Z022340210","upc":"714636910854","color":"BLACK/ZOOT YELLOW","retail_price":"125.00","sale_price":"125.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
