{"sku":"847814","manufacturer_id":"174 24 255-10","brand_name":"Rei","product_name":"REI Traverse Shocklight Trekking Poles - Pair","long_description":"The quiet REI Traverse Shocklight trekking poles provide stability and support so you hear the sounds of nature and not the clicks of your poles. Shock-absorbing poles reduce fatigue while improving stability; lockout mechanism creates a rigid pole when needed for more efficient climbing. Shocklight shock absorbers weigh less than common spring-loaded mechanisms and won't rattle within the shaft as you walk. Internal twist-lock mechanisms apply a wide area of pressure against pole walls to lock in length adjustment. With the Stop Lock system, poles won't come apart; system makes the pole sections into 1 unit for security and stability. Twist-locking pole sections let you tailor the length to fit your terrain: make them shorter for the way up, longer for the way down. Strong 7075-T6 aluminum, 3-section telescoping poles extend to a maximum length of 55.1 in. and compact to 27.5 in. for easy storage and transport. Soft EVA foam hand grips have an ergonomic, contoured shape that is easy to hold; adjustable padded neoprene wrist straps add support. Fitted with trekking discs and extra-durable tungsten carbide tips; included tip protectors are strictly for travel/packing protection, not intended for hiking.","short_description":"The quiet REI Traverse Shocklight trekking poles provide stability and support so you hear the sounds of nature and not the clicks of your poles.","category":"Camping & Hiking","subcategory":"Hiking Staffs And Trekking Poles","product_group":"Trekking Poles","thumb_url":"http://i1.avlws.com/115/s279587.png","image_url":"http://i1.avlws.com/115/l279587.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=279587&tt=df","keywords":"hiking,walking,climbing,Trekking,adjustable","retail_price":"89.50","sale_price":"89.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=279587\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m279587.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847814&amp;link=&amp;tabs=-Details\"></script>","variants":{"8478140001":{"sku":"8478140001","vendor_sku":"174 24 255-10","upc":"484781400011","color":"MINERAL WATER","retail_price":"89.50","sale_price":"89.50"}}}
