{"sku":"847963","manufacturer_id":"12825","brand_name":"Rei","product_name":"REI Tara City Bag - Women's - 2013 Special Buy","long_description":"With its smorgasbord of pockets and organizational features, the REI Tara City bag manages your essentials for commutes, travel or everyday adventures. Made from 100% recycled PET; each bag keeps twelve 16-oz. plastic bottles out of landfills and is tough enough to withstand the rigors of daily use. Front flap opens to reveal organizer panel with slip pockets for a phone/PDA, pen and other small essentials; flap secures with magnetic closures. Main organizer pocket unzips to reveal 9 card slots, 2 zip pockets and 1 slip pocket; gussets allow easy access and security. Separate zippered pocket is accessible from top as well and lets you stash bulky items or drop in whatever you may need without fuss. With the bonus of added security, the back panel features a discreet zippered pocket, which easily fits a passport or ID. Carry the Tara as you please, thanks to a detachable, adjustable shoulder strap. Special buy.","short_description":"With its smorgasbord of pockets and organizational features, the REI Tara City bag manages your essentials for commutes, travel or everyday adventures.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Day Bags","thumb_url":"http://i1.avlws.com/115/s298995.png","image_url":"http://i1.avlws.com/115/l298995.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=298995&tt=df","keywords":"luggage,bag,crossbody,day,shoulder","retail_price":"39.50","sale_price":"26.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=298995\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m298995.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847963&amp;link=&amp;tabs=-Details\"></script>","variants":{"8479630001":{"sku":"8479630001","vendor_sku":"12825","upc":"484796300016","color":"SADDLE/BONSAI GREEN","retail_price":"26.73","sale_price":"26.73"}}}
