{"sku":"847964","manufacturer_id":"12823","brand_name":"Rei","product_name":"REI Nikole Day Bag - Women's - 2013 Special Buy","long_description":"The REI Nikole day bag boasts a convertible design that goes from a mini backpack to a sling pack, so you're ready for any occasion. Main body of bag is made from 100% recycled PET; each bag keeps 28 16-oz. plastic bottles out of landfills! Post-consumer recycled PET polyester is tough enough to endure the daily grind. Shoulder strap design allows use as a single sling or 2-strap backpack-simply unclip a strap and tuck it away to convert to a sling style. Zippered panel opening on main compartment opens wide to access items such as magazines, books and files; interior padded pocket holds e-book reader or small netbook. Front pocket features a panel organizer to stow your daily essentials such as wallet, MP3 player, change, keys and pens. Zippered front pocket includes a key fob and small pockets for must-have items. Back panel features a zippered vertical pocket; inside is a smaller pocket for your passport. Zip-away side pocket is sized for a water bottle; side slip pocket can keep a small umbrella within reach. Air mesh padding on back panel and shoulder straps controls moisture by wicking perspiration away from your body for cool carrying comfort. Special buy.","short_description":"The REI Nikole day bag boasts a convertible design that goes from a mini backpack to a sling pack, so you're ready for any occasion.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s299051.png","image_url":"http://i1.avlws.com/115/l299051.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=299051&tt=df","keywords":"traveling,travel,luggage,pack,backpack","retail_price":"59.50","sale_price":"39.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=299051\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m299051.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847964&amp;link=&amp;tabs=-Details\"></script>","variants":{"8479640001":{"sku":"8479640001","vendor_sku":"12823","upc":"484796400013","color":"SADDLE/BONSAI GREEN","retail_price":"39.73","sale_price":"39.73"}}}
