{"sku":"847950","manufacturer_id":"1123ZEN4","brand_name":"Zoic","product_name":" Zoic Ether Plaid Bike Shorts - Men's","long_description":"Don't be fooled by their plaid good looks, the Zoic Ether plaid bike shorts are built to withstand abuse so you can stay focused on cleaning the line ahead. Packed with features, the Zoic Ether plaid shorts are ideal for riding everything from all mountain trails to cross-country outings to urban commutes. Rugged, quick-drying polyester outer shorts endure heavy use and resist abrasion. Removable polyester/spandex stretch-mesh liner shorts wick moisture away and sport a built-in chamois pad. Liner shorts feature a tagless waistline; leg grippers keep liner shorts in place as you move. Men-specific wicking chamois is anatomically molded for comfort in the saddle. Integrated knit mesh panels encourage cooling airflow between outer and inner shorts. Zoic Ether plaid bike shorts feature front hand pockets, 2 leg zip pockets and a hidden back zip pocket. Zippered media player pocket at back thigh features a headphone port and cord-routing loop-perfect for tunes on the go. Attached with an elastic strap inside pocket, included sunglasses wipe is always ready to keep your vision clear. Side rip-and-stick adjuster tabs personalize the fit; waistband secures with snap closure and zippered fly.","short_description":"Don't be fooled by their plaid good looks, the Zoic Ether plaid bike shorts are built to withstand abuse so you can stay focused on cleaning the line ahead.","category":"Cycling","subcategory":"Cycling Clothing","product_group":"Bike Shorts","thumb_url":"http://i1.avlws.com/115/s390739.png","image_url":"http://i1.avlws.com/115/l390739.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390739&tt=df","retail_price":"90.00","sale_price":"90.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390739\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390739.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847950&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","cycling-clothing","bike-shorts"]}
