{"sku":"847958","manufacturer_id":"12824","brand_name":"Rei","product_name":"REI Natalie Shoulder Bag - Women's - 2013 Special Buy","long_description":"The REI Natalie shoulder bag blends outdoor performance with urban style and utility. This bag is perfect for everyday use. Bag is sized to fit up to 11 in. tablets and carries daily commute and urban travel essentials with ample organization. Made from 100% recycled PET; each bag keeps thirty-four 16-oz. plastic bottles out of landfills and is tough enough to withstand the rigors of urban use. Main compartment holds letter-size docs and file folders; messenger bag styling has zippered opening to main compartment, covered with flap and secured with hidden magnets. Organizer panel under front flap with pen slots, lined phone/PDA pocket, slip pocket and zippered mesh pocket; key clip keeps keys within easy reach. Side bottle pocket is great for slim water bottles or a travel umbrella and zips away when not in use for a sleeker look. Exterior zippered pocket on back offers quick access to small items; adjustable shoulder strap with sliding shoulder pad offers comfort and secure carrying. Special buy.","short_description":"The REI Natalie shoulder bag blends outdoor performance with urban style and utility. This bag is perfect for everyday use.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Tote Bags","thumb_url":"http://i1.avlws.com/115/s298927.png","image_url":"http://i1.avlws.com/115/l298927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=298927&tt=df","keywords":"tote,beach tote,grocery bag,day,shoulder","retail_price":"54.50","sale_price":"37.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=298927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m298927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847958&amp;link=&amp;tabs=-Details\"></script>","variants":{"8479580001":{"sku":"8479580001","vendor_sku":"12824","upc":"484795800012","color":"STEEL","retail_price":"37.73","sale_price":"37.73"}}}
