{"sku":"847934","manufacturer_id":"FB103BY","brand_name":"Fitbit","product_name":" Fitbit One Activity Tracker","long_description":"The Fitbit One(TM) activity tracker never rests, even when you do. It tracks steps, distance, calories burned and stairs climbed, and come nightfall, it monitors sleep and wakes you in the morning. Fitbit One tracker uses a 3D motion sensor to monitor your activity while walking, running, participating in daily activities and sleeping. Tracker counts how many steps you've taken during the day, assesses how many miles you've traveled and calculates how many calories you've burned. Altimeter encourages you to walk up hills and take the stairs by tracking the number of stairs you've climbed throughout the day. Switch to Sleep mode before you go to bed to track how many times you wake and how long you've slept; a sleep quality score is assigned to help you apply what you learn. Includes a silent wake alarm that gently vibrates to wake you at your desired time without disturbing your partner. Wear the tracker clipped to your pants, shirt, undergarments or to the included wristband; wear it clipped to the wristband at night to track your sleep. Sync the Fitbit One with your PC or Mac; free online dashboard gives you a snapshot of your daily and cumulative progress with graphs, tools and charts. Fitbit One can also sync over Bluetooth with certain mobile devices, including iPhones(R) and iPads(R). Fitbit free mobile app for your Apple iPhone(R) 4S, iPhone 5, iPod touch and 3rd generation iPad keeps track of your stats and celebrates how much you do each day. Receive badges and alerts on your smartphone for daily, weekly and lifetime achievements to help keep you motivated; receive a weekly email of your stats. Connect with friends on Fitbit.com to compare stats, share progress, set challenges and cheer each other on. Use the online tool to log your meals, water intake, workouts and weight.","short_description":"The Fitbit One(TM) activity tracker never rests, even when you do. It tracks steps, distance, calories burned and stairs climbed, and come nightfall, it monitors sleep and wakes you in the morning.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427111.png","image_url":"http://i1.avlws.com/115/l427111.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427111&tt=df","keywords":"odometer,walking","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427111\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427111.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=847934&amp;link=&amp;tabs=-Details\"></script>","variants":{"8479340001":{"sku":"8479340001","vendor_sku":"FB103BK","upc":"898628002267","color":"BLACK","retail_price":"99.95","sale_price":"99.95"},"8479340002":{"sku":"8479340002","vendor_sku":"FB103BY","upc":"898628002274","color":"BURGUNDY","retail_price":"99.95","sale_price":"99.95"}}}
