{"sku":"848007","manufacturer_id":"40X061-1","brand_name":"Rei","product_name":" REI Taj 3 Tent - 2012 Special Buy","long_description":"Heading out on a backpacking trip with 2 friends? Choose the REI Taj 3 tent for your next backcountry adventure. Doors are easy to enter and exit, and vestibules offer space for gear storage. Combi-pole design offers extra interior space for better livability while inside tent. 3-pole clip design is sturdy; no-see-um mesh doors, window and ceiling panels provide excellent ventilation and visibility. Inside floor seams are engineered to create a clean, taut pitch and maximize floor space; factory seam-taping ensures a waterproof seal. Polyester rainfly stays taut even when wet and features 2 built-in vestibules, an upper vent and a clear film window for viewing outside conditions. Leak-proof rainfly construction ensures that water won't sneak through susceptible areas such as guyout points and zippers. Organize your gear with the attic (included) and 3 interior pockets. Useful details include reflective zipper pulls and guylines, ladder-loc tie-downs on rainfly and pole wraps that secure rainfly to tent. Footprint (not included) extends the life of your tent by protecting it from abrasive wear and tear. Save weight by creating a minimalist shelter using rainfly, footprint (not included) and poles only. Comes with guylines and tighteners, stakes, pole repair tube, pole and stake bags and tapered, easy-to-stuff compression stuff sack. Special buy.","short_description":"Heading out on a backpacking trip with 2 friends? Choose the REI Taj 3 tent for your next backcountry adventure.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423971.png","image_url":"http://i1.avlws.com/115/l423971.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423971&tt=df","retail_price":"310.00","sale_price":"239.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423971\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423971.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848007&amp;link=&amp;tabs=-Details\"></script>","variants":{"8480070001":{"sku":"8480070001","vendor_sku":"40X061-1","upc":"484800700016","color":"GOLDEN APRICOT/PLATINUM","retail_price":"239.73","sale_price":"239.73"}},"categories":["camping-hiking","tents","backpacking-tents"]}
