{"sku":"848005","manufacturer_id":"13544","brand_name":"Rei","product_name":"REI Stoke 29 Pack - 2013 Special Buy","long_description":"Featuring great ventilation and a body-hugging profile, the REI Stoke 29 pack is ideal for all-day wilderness adventures. Sculpted foam panel reduces sweaty contact areas with multiple peaks and valleys that release vapor; foam structure allows pack to conform to your back for a stable fit. Adjustable, padded and wrapped with breathable mesh, the perforated foam shoulder straps enhance air circulation. Stabilizer wings connect the shoulder straps to the bottom of the pack to stabilize the load and reduce unwanted bouncing. Hipbelt webbing system cinches with a natural forward pulling motion for quick, precise adjustments. Top-loading main compartment carries the essentials you need for a day on the trail; top lid features a small pocket for often-used gear. Hydration sleeve in the main compartment holds a reservoir (not included) for hands-free drinking on the trail; hydration tube can be routed through either shoulder strap. Front mesh pocket is perfect for quickly stashing a jacket or other items; pocket adjusts to help stabilize and compress the pack's load. Hipbelt zip pockets store those small essentials you want at your finger tips, such as energy gel packs, lip balm and sunscreen. The REI Stoke 29 pack features Quick Clip tool loops that hold an ice axe or trekking poles. Special buy.","short_description":"Featuring great ventilation and a body-hugging profile, the REI Stoke 29 pack is ideal for all-day wilderness adventures.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s306435.png","image_url":"http://i1.avlws.com/115/l306435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=306435&tt=df","keywords":"carry-on,bookbag,sack,bookpack,carryon","retail_price":"99.50","sale_price":"69.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=306435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m306435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848005&amp;link=&amp;tabs=-Details\"></script>","variants":{"8480050001":{"sku":"8480050001","vendor_sku":"13544","upc":"484800500012","size":"M","color":"CASTLEROCK/GREY MIST","retail_price":"69.73","sale_price":"69.73"},"8480050002":{"sku":"8480050002","vendor_sku":"13544","upc":"484800500029","size":"L","color":"CASTLEROCK/GREY MIST","retail_price":"69.73","sale_price":"69.73"}}}
