{"sku":"848099","manufacturer_id":"90103","brand_name":"Gsi Outdoors","product_name":" GSI Outdoors Gourmet Kitchen Set 11","long_description":"Take your cooking skills to the campsite with the 11-piece GSI Gourmet Kitchen set. It has the utensils you need to prepare a delicious meal for a group of hungry campers. Kit includes a spoon, spatula, collapsible whisk, spicer, 2 condiment containers, cutting board, scrubber, scraper, camp towel and ballistic nylon case. Spoon and spatula feature handles that pivot from stored to working position quickly and easily; utensils feature reinforced handles that won't flop around. Spoon includes gradations to make measuring for recipes a snap; spatula features tapered edges and a serrated cutting edge to make frying, flipping and serving simple. Waterproof spice holder features 4 compartments and is easy to refill; clear copolyester resin body is lightweight and strong. Slice and dice in the backcountry with the ultralight cutting board. Use the included scraper to get your nonstick pots and pants clean; flexible rubber end helps serve up the last bits of food; hard plastic end scrapes stubborn food. Pack along your favorite condiments in the 2 squeeze bottles. Scrubby pad and camp towel make cleaning up quick and easy. All components of the 11-piece GSI Gourmet Kitchen set fit in the lightweight tote so you can stay organized.","short_description":"Take your cooking skills to the campsite with the 11-piece GSI Gourmet Kitchen set. It has the utensils you need to prepare a delicious meal for a group of hungry campers.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414875.png","image_url":"http://i1.avlws.com/115/l414875.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414875&tt=df","retail_price":"39.95","sale_price":"39.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414875\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414875.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848099&amp;link=&amp;tabs=-Details\"></script>","variants":{"8480990001":{"sku":"8480990001","vendor_sku":"90103","upc":"090497901034","retail_price":"39.95","sale_price":"39.95"}},"categories":["camping-hiking","camp-kitchen","cookware-and-dinnerware"]}
