{"sku":"848187","manufacturer_id":"407-4-2143","brand_name":"Timbuk2","product_name":" Timbuk2 Power Commute Messenger Bag - Medium","long_description":"The Timbuk2 Power Commute Messenger bag has a TSA-compliant laptop sleeve and a Joey(R) Energy charging unit for on-the-go electronics charging! Charge your iPad(R), smartphone, camera or other device that charges via USB cable while it's in the bag. The Joey charge unit fits in a dedicated pocket on the inside with weatherproof ports to thread the charger cable to the iPad pocket or phone pocket. TSA-compliant quilted, tricot-lined laptop compartment fits up to a 15 in. MacBook Pro, zips open and lays flat through security. TSA-compatible Joey charge unit can be left in your bag at security checkpoints as well. Separate dedicated pockets hold your iPad, power bricks and cords. Front flap has rip-and-stick/buckle closure; flap opens to reveal organizer panel with key tether, and multiple sleeve and zippered pockets for all your on-the-go necessities. Mulitple internal organizer pockets for pens, phones, gadgets and other personal items. Removable shoulder strap and carry handle allow you to carry as a messenger bag or a briefcase. External pocket stows a water bottle or compact umbrella. Back panel sleeve slides over a luggage handle for convenient transportation. Rear bike light attachment loop, bike light sold separately. Power Commute messenger bag also includes a weatherproof port to thread the charger cable to the outside of the bag for charging a strap-on accessory, sold separately. Joey Energy charge unit is designed with rugged electronics and a slim, yet tough, water-resistant case; Joey power supply includes a 13-watt (Wh) lithium polymer battery. Recharge from wall outlets or USB with your phone's charge cable or the included Joey cable. Charges most cell and smartphones, iPhones, Bluetooth devices, eReaders, iPods and MP3 players; partially charges most iPad and tablet computers. Draw multiple partial charges over several days; provides 1.5 to 2 full charges for most mobile phones.","short_description":"The Timbuk2 Power Commute Messenger bag has a TSA-compliant laptop sleeve and a Joey(R) Energy charging unit for on-the-go electronics charging!","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Messenger Bags","thumb_url":"http://i1.avlws.com/115/s432371.png","image_url":"http://i1.avlws.com/115/l432371.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432371&tt=df","keywords":"courier","retail_price":"199.00","sale_price":"138.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432371\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432371.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848187&amp;link=&amp;tabs=-Details\"></script>","variants":{"8481870001":{"sku":"8481870001","vendor_sku":"407-4-2143","upc":"631364511507","size":"M","color":"BLACK","retail_price":"138.93","sale_price":"138.93"}}}
