{"sku":"848186","manufacturer_id":"268-2-2226","brand_name":"Timbuk2","product_name":" Timbuk2 Command Messenger Bag - Small","long_description":"With a well-thought-out, eye-catching urban design, the small Timbuk2 Command Messenger bag is perfect for everyday use, and stellar when it comes to airline travel. TSA-compliant, tricot-lined laptop compartment fits a 13 in. laptop; no need to take your laptop out of the pack, simply zip it open and lay it flat through security. External laptop compartment is easy to access while carrying the Command Messenger by the shoulder strap; superior crater-foam cushions and ventilates the laptop. Features a separate padded pocket within the laptop compartment to hold an iPad. Luggage pass-through allows you to strap the bag over your wheeled luggage handle for convenient on-the-move carrying, or it can be used as another stash pocket. Main pocket includes a divider and multiple organizational pocket options. Pockets underneath front flap include 3 zip pockets, a drop-in pocket and side-entry zip pocket; front flap secures with optional rip-and-stick closures. Anodized aluminum hardware secures front flap, lends a sophisticated look, and quiets entry and exit when the rip-and-stick closure isn't engaged. Exterior pocket with stretch gusset holds a water bottle. Adjustable cam buckle enables you adjust and strap on the Timbuk2 Command Messenger with ease; coordinating strap pad ensures comfort. Made from stylish and durable oxford nylon fabric with a waterproof thermoplastic urethane (TPU) liner; includes a top carry handle. Reflective tabs on front flap improve nighttime profile.","short_description":"With a well-thought-out, eye-catching urban design, the small Timbuk2 Command Messenger bag is perfect for everyday use, and stellar when it comes to airline travel.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Messenger Bags","thumb_url":"http://i1.avlws.com/115/s432367.png","image_url":"http://i1.avlws.com/115/l432367.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432367&tt=df","keywords":"courier","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432367\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432367.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848186&amp;link=&amp;tabs=-Details\"></script>","variants":{"8481860001":{"sku":"8481860001","vendor_sku":"268-2-7019","upc":"631364511521","size":"S","color":"PEAT GREEN","retail_price":"62.83","sale_price":"62.83"},"8481860002":{"sku":"8481860002","vendor_sku":"268-2-2226","upc":"631364518445","size":"S","color":"CARBON TWILL","retail_price":"129.00","sale_price":"129.00"}}}
