{"sku":"848208","manufacturer_id":"EC-20428010","brand_name":"Eagle Creek","product_name":" Eagle Creek Tarmac Wheeled Luggage - 22\"","long_description":"The Eagle Creek Tarmac 22 wheeled luggage offers plenty of space for long weekend adventures, built-in durability and convenient travel features. Expandable capacity offers extra space for the trip home; please note that when expanded, the luggage no longer qualifies as carry-on size. Tarmac 22 is made from rugged Bi-Tech(TM) fabrics for extreme abrasion and weather resistance. Includes rugged wheels with sturdy wheel housing, a skid plate, bumper protection and a travel-tested handle system. Large padded exterior zip pocket fits most 15 in. laptops; includes a padded sleeve that fits most tablets. Quick-grab lockable top pocket contains a coat keeper for attaching your jacket, a key fob with bottle opener and an attached piggyback clip to securely attach another bag. Main pocket features a zippered cargo net that supplies compression when used inside; or attach it to the outside of the bag for use as a utility net. Large interior zip mesh pocket. #10 lockable zippers secure main compartment and have finger-friendly zipper pulls; luggage locks are sold separately. 2 exterior compression straps help stabilize and secure luggage contents. Reflective accents improve dusk and nighttime visibility. Integrates with Eagle Creek Pack-It(R) Systems, sold separately. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"The Eagle Creek Tarmac 22 wheeled luggage offers plenty of space for long weekend adventures, built-in durability and convenient travel features.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433839.png","image_url":"http://i1.avlws.com/115/l433839.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433839&tt=df","retail_price":"290.00","sale_price":"290.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433839\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433839.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848208&amp;link=&amp;tabs=-Details\"></script>","variants":{"8482080001":{"sku":"8482080001","vendor_sku":"EC-20428010","upc":"766182139562","color":"BLACK","retail_price":"290.00","sale_price":"290.00"},"8482080002":{"sku":"8482080002","vendor_sku":"EC-20428114","upc":"484820800024","color":"GREEN","retail_price":"290.00","sale_price":"290.00"}}}
