{"sku":"848273","manufacturer_id":"052LL","brand_name":"Sea To Summit","product_name":" Sea to Summit Talus TsII Sleeping Bag","long_description":"Are you climbing a glaciated peak this summer or thinking about trying winter camping? The Sea to Summit Talus TsII sleeping bag is a great choice if you're looking for 1 bag that can do it all. High loft, premium 750-fill-power European duck down offers superb warmth with minimal weight; Ultra-Dry Down(TM) water-repellent treatment protects down from moisture. Ultra-Dry Down is a water-repellent polymer treatment applied to the 750-fill down; Ultra-Dry Down retains 60% more loft and absorbs 30% less moisture than untreated down. With a European Norm (EN) lower-limit rating of 14degF, the TsII bag will help keep you warm in all seasons, including mild winters. Shell fabric is constructed of 2D NanoShell(TM) technology, a ripstop nylon fabric treated with a Durable Water Repellent and a non-woven silicone encapsulated fabric. Innovative shell technology provides excellent protection against external moisture while allowing internal moisture from perspiration to pass through the thin coating. If condensation should form under the 2D NanoShell(TM) shell fabric, the Ultra-Dry Down treatment will minimize its effects on the down. Lining is a breathable, durable 20-denier polyester fabric with a soft touch. Relaxed mummy shape is cut with a large hood, broad shoulders and large chest for a more comfortable sleeping bag while maintaining thermal efficiency. Upper side of bag features a differential cut (inner layer is cut smaller than the outer layer to create consistent thickness of insulation) to help prevent cold spots. Reverse differential cut on lower side; inner layer is cut larger than the outer layer to allow down to loft up, filling spaces around body so warmth wraps around you. Oversize draft tube backing the zipper keeps the warmth in and the cold out; zipper is backed by stiff, antisnag tape for smooth operation. Full-length side zipper allows bag to be joined to other Sea to Summit sleeping bags.","short_description":"Are you climbing a glaciated peak this summer or thinking about trying winter camping? The Sea to Summit Talus TsII sleeping bag is a great choice if you're looking for 1 bag that can do it all.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421463.png","image_url":"http://i1.avlws.com/115/l421463.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421463&tt=df","keywords":"compact","retail_price":"449.00","sale_price":"449.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421463\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421463.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848273&amp;link=&amp;tabs=-Details\"></script>","variants":{"8482730001":{"sku":"8482730001","vendor_sku":"052RL","size":"Regular Left","color":"BLUE","retail_price":"429.00","sale_price":"429.00"},"8482730002":{"sku":"8482730002","vendor_sku":"052LL","upc":"484827300022","size":"Long Left","color":"BLUE","retail_price":"449.00","sale_price":"449.00"}}}
