{"sku":"848326","manufacturer_id":"35219 75200","brand_name":"Deuter","product_name":"Deuter Transit 65 Travel Backpack","long_description":"The Deuter Transit 65 backpack is the ultimate partner for trips abroad with its stylish design and timeless colors. Its trademark is the suitcase/backpack carrying options that make traveling easy. Concealable backpack system zips away for airline transport or duffel/shoulder carrying. Removable shoulder strap turns the pack into a practical shoulder bag; easily stash it out of the way when not in use. Clamshell main compartment reveals entire contents; internal zip compartment and compression straps help keep the contents organized and safely in place. Side compression straps reduce pack volume and improve load stability; attach extra gear here as well. Zippered bottom compartment keeps dirty clothes or wet shoes separate. Padded grab handles offer convenient and easy transport via the top or side. Variquick shoulder harness and back system lets you adjust torso length from 15.5 - 22 in. Contoured and padded air-mesh shoulder straps, breathable foam back panel and sternum strap provide carrying comfort. Load-bearing aluminum frame and anatomically formed hipbelt make carrying heavy loads comfortable. The Deuter Transit 65 backpack has a removable daypack which is perfect for day excursions; front zip stash pocket holds small valuables and accessories.","short_description":"The Deuter Transit 65 backpack is the ultimate partner for trips abroad with its stylish design and timeless colors. Its trademark is the suitcase/backpack carrying options that make traveling easy.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s463895.png","image_url":"http://i1.avlws.com/115/l463895.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463895&tt=df","retail_price":"189.00","sale_price":"189.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463895\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463895.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848326&amp;link=&amp;tabs=-Details\"></script>","variants":{"8483260001":{"sku":"8483260001","vendor_sku":"35219 75200","color":"BLACK/ANTHRACITE","retail_price":"189.00","sale_price":"189.00"}},"categories":["travel","luggage","travel-packs"]}
