{"sku":"848358","manufacturer_id":"MIS1849/0247","brand_name":"Millet","product_name":" Millet Axpel 42 Pack","long_description":"With its technical alpine profile, ergonomic harness and well-built, durable functionality, the Millet Axpel 42 pack is a perfect companion for venturing into the mountains and backcountry. Long and slender design offers low-profile, body hugging performance that excels when you're off-trail mountaineering and scrambling. Innovative swiveling hipbelt helps maintain pack stability while allowing your hips unrestricted side-to-side movement; ergonomic shoulder straps offer all-day comfort. Dual zippered main compartment features easy access at the pack base. Zippered lid pocket and rope holder allow organization and easy access to gear. Storm collar helps seal in the main compartment from blowing rain or snow. Hydration-compatible design features a reservoir pocket and drink tube exit port for on-the-go hydration (reservoir sold separately). Side stretch pockets and hipbelt pocket keep small items at your fingertips. Side compression straps secure both large and small loads for increased stability; built-in raincover helps protect your pack and its contents from wet weather. Durable 210-denier honeycomb nylon and 420-denier velocity nylon stand up to rugged alpine use. The Millet Axpel 42 pack features ice-axe loops that let you lash gear to the outside of the pack body; compression straps double as ski holders.","short_description":"With its technical alpine profile, ergonomic harness and well-built, durable functionality, the Millet Axpel 42 pack is a perfect companion for venturing into the mountains and backcountry.","category":"Climbing","subcategory":"Climbing Essentials","product_group":"Climbing Packs","thumb_url":"http://i1.avlws.com/115/s407015.png","image_url":"http://i1.avlws.com/115/l407015.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407015&tt=df","retail_price":"199.95","sale_price":"136.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407015\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407015.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848358&amp;link=&amp;tabs=-Details\"></script>","variants":{"8483580001":{"sku":"8483580001","vendor_sku":"MIS1849/0247","color":"BLACK/NOIR","retail_price":"136.93","sale_price":"136.93"}},"categories":["climbing","climbing-essentials","climbing-packs"]}
