{"sku":"848380","manufacturer_id":"22611813","brand_name":"Kelty","product_name":" Kelty Coyote 75 Pack - Women's","long_description":"A full-featured load hauler, the Kelty Coyote 75 pack for women delivers an easily adjustable suspension, great fit and a durable design at an attractive price. Women-specific fit features shoulder straps placed close together and shaped through the bust, plus hipbelt padding that aligns with a woman's hip bones. S-shaped shoulder straps contour to your body for a comfortable fit and to help eliminate chafing or rubbing. HDPE-reinforced hipbelt helps evens out pressure against your hips, providing comfortable load support. Sternum strap, load-lifter straps and belt stabilizers help balance the load; pulleylike Scherer Cinch(TM) doubles hipbelt tightening force. Rip-and-stick adjustment allows the shoulder straps to easily slide up and down on the pack's frame to fit torsos of various lengths. Ventilated and padded back panel offers breathability and comfort. Lightbeam(TM) II stays attach to the hipbelt for direct load transfer; center anti-barreling stay keeps the back panel flat even when the pack is overloaded. HDPE framesheet adds load support, stability and shock absorption. Top-loading design features front zippered access, making it easy to reach all corners of the pack. Main compartment features a sleeve for a hydration reservoir and drinking tube ports on lid (reservoir sold separately). Removable, floating top lid converts to a lumbar pack for forays away from base camp. 2 spacious zippered side pockets, 2 mesh water bottle pockets and a large zippered front pocket with organizer keep all of your often-used essentials handy. Daisy chain and ice-axe loop let you lash trekking poles or tools to the outside of the pack. Side compression straps help secure and stabilize the load. The Kelty Coyote 75 pack is made of durable 420-denier polyester reinforced with 420-denier polyester oxford.","short_description":"A full-featured load hauler, the Kelty Coyote 75 pack for women delivers an easily adjustable suspension, great fit and a durable design at an attractive price.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410699.png","image_url":"http://i1.avlws.com/115/l410699.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410699&tt=df","keywords":"multiday","retail_price":"209.95","sale_price":"209.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410699\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410699.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848380&amp;link=&amp;tabs=-Details\"></script>","variants":{"8483800001":{"sku":"8483800001","vendor_sku":"22611813","upc":"727880038618","color":"BLACKBERRY","retail_price":"209.95","sale_price":"209.95"}}}
