{"sku":"848376","manufacturer_id":"60300100","brand_name":"Pacsafe","product_name":" Pacsafe Venturesafe 25L GII Travel Daypack","long_description":"Great for airplane travel, voyages abroad and day trips, the Pacsafe Venturesafe 25L GII travel daypack is lightweight, durable and secure. Zippered main compartment has an internal padded sleeve that protects a 15 in. laptop. Exterior zippers fasten to concealed clips, making it hard for pickpockets to unzip and snatch your valuables. RFID-reader-blocking pocket prevents access to your personal data stored on micro chips in your passport and credit cards; includes 2 slot pockets, key ring and a pen holder. Features eXomesh(R) slashguards: lightweight stainless-steel wire mesh is built discreetly into vulnerable areas to prevent thieves from slashing through the fabric. Flexible, lightweight stainless-steel wire is integrated into the adjustable backpack straps to prevent bag slashers from slicing through and running off with your gear. Sternum and waist straps balance and secure your load; side compression straps secure contents for easier carrying. Molded foam back support adds carrying comfort. Turn-and-lock security hooks allow you to secure the bag around a chair or other fixture to prevent pack snatching when dining or relaxing. Padded sleeve in main pocket alternately carries a 3 liter hydration reservoir (not included); centrally located tube port lets you route it to either side of your body. Pacsafe Venturesafe 25LGII travel daypack includes 2 side, stretch water bottle/umbrella pockets.","short_description":"Great for airplane travel, voyages abroad and day trips, the Pacsafe Venturesafe 25L GII travel daypack is lightweight, durable and secure.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s433139.png","image_url":"http://i1.avlws.com/115/l433139.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433139&tt=df","keywords":"backpack","retail_price":"135.00","sale_price":"135.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433139\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433139.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848376&amp;link=&amp;tabs=-Details\"></script>","variants":{"8483760002":{"sku":"8483760002","vendor_sku":"60300100","upc":"688334008437","color":"BLACK","retail_price":"135.00","sale_price":"135.00"},"8483760003":{"sku":"8483760003","vendor_sku":"60300606","upc":"688334010591","color":"NAVY BLUE","retail_price":"135.00","sale_price":"135.00"}},"categories":["travel","day-bags-and-packs","travel-daypacks"]}
