{"sku":"848414","manufacturer_id":"00151313","brand_name":"Sierra Designs","product_name":"Sierra Designs Flash 3 Tent","long_description":"The Sierra Designs Flash 3 tent sets up in a matter of seconds with new ExoFusion technology. This setup combines an external pitch with an integrated fly to speed setup and increase interior space. ExoFusion shelters utilize an external frame combined with hybrid single and double wall panels; since there's no separate fly to fuss with, the setup is easy and quick. Integration of the rainfly means the tent is protected during setup; the inner body of the tent won't get soaked since there's no separate rainfly to attach. Well-ventilated comfort: the exterior skeleton/hybrid wall construction allows effective vent placement and airflow planning that isn't possible with traditional construction. Less material saves weight: exterior skeleton/hybrid wall construction also allows double walls where necessary and single walls otherwise. D-shape doors on the Sierra Designs Flash 3 tent provide roomy access; 2 vestibules provide separate storage areas. Light yet strong, DAC Featherlite(R) NSL poles are anodized without the use of harmful acids. Hub/pole design reduces the possibility of pitching errors and aids in the speed of the pitch. Jake's Feet(TM) corner anchor system locks poles in place during setup and aids in tensioning out the floor. Taped rainfly seams and a seam-sealed floor offer weatherproof protection. Reflective door trim and guyouts aid nighttime visibility of tent. Mesh windows have closeable flaps to prevent weather from creeping in. Includes stuff sacks, guylines, tent stakes, user guide and setup instructions.","short_description":"The Sierra Designs Flash 3 tent sets up in a matter of seconds with new ExoFusion technology. This setup combines an external pitch with an integrated fly to speed setup and increase interior space.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423979.png","image_url":"http://i1.avlws.com/115/l423979.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423979&tt=df","retail_price":"389.95","sale_price":"289.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423979\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423979.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848414&amp;link=&amp;tabs=-Details\"></script>","variants":{"8484140001":{"sku":"8484140001","vendor_sku":"00151313","upc":"054003729055","color":"BLUE/GRAY","retail_price":"289.93","sale_price":"289.93"}},"categories":["camping-hiking","tents","backpacking-tents"]}
