{"sku":"848478","manufacturer_id":"00014562","brand_name":"Rei","product_name":"REI Camp Kitchen","long_description":"With dedicated spots for all your cooking supplies, the REI Camp Kitchen keeps you organized so you can spend less time searching for a spatula and more time hiking, biking and relaxing with friends. Place your 2-burner camp stove (sold separately) on the side table; side table can be attached to either side of the main table. Tabletop surfaces are finished with a durable laminate to withstand regular use in the outdoors. Aluminum frame creates a sturdy, weather-resistant structure without the cumbersome weight of heavier materials. 2 heavy-duty, chrome-plated wire shelves provide ample storage space for pots, pans, utensils and food. Vertical pole attaches to the main table and includes a movable hook so you can hang a lantern (sold separately) at whatever height you want. Fabric gear-loft hangs underneath the side table to keep small items close by. Powder-coated wire frame designed to hold a garbage bag (not included) attaches to either side of the main table. REI Camp Kitchen conveniently stows in the included carry bag for easy transport to and from the campsite.","short_description":"With dedicated spots for all your cooking supplies, the REI Camp Kitchen keeps you organized so you can spend less time searching for a spatula and more time hiking, biking and relaxing with friends.","category":"Camping & Hiking","subcategory":"Camp Tables","product_group":"Tables","thumb_url":"http://i1.avlws.com/115/s286703.png","image_url":"http://i1.avlws.com/115/l286703.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=286703&tt=df","keywords":"table,bbq,portable,barbeque,picnic","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=286703\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m286703.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848478&amp;link=&amp;tabs=-Details\"></script>","variants":{"8484780001":{"sku":"8484780001","vendor_sku":"00014562","upc":"484847800014","retail_price":"149.00","sale_price":"149.00"}}}
