{"sku":"848410","manufacturer_id":"00150312","brand_name":"Sierra Designs","product_name":" Sierra Designs Mojo 3 Tent","long_description":"The Sierra Designs Mojo 3 tent blends ample headroom, abundant mesh, ultra lightweight materials and an integrated rainfly for outstanding comfort on the trail and a quick, easy setup. Less material saves weight: An exterior frame combined with hybrid panels allows double walls where necessary and single walls otherwise. Integration of the rainfly means the tent is protected during setup; the inner body of the tent won't get soaked since there's no separate rainfly to attach. The exoskeletong/hybrid wall construction allows for venting and airflow planning not possible with traditional construction. D-shaped door provides easy access without the need to crawl over your tentmates; a roomy vestibule stores gear without being oversized. Light yet strong, DAC Featherlite(R) NSL poles are anodized without the use of harmful acids. Taped rainfly seams and a PVC-free, seam-sealed floor offer weatherproof protection. Reflective door trim and guyouts aid nighttime visibility of the Sierra Designs Mojo 3 tent. Mesh windows have closeable flaps to prevent weather from creeping in. Internal pockets keeps small gear organized. Includes stuff sacks, guylines, tent stakes, user guide and setup instructions.","short_description":"The Sierra Designs Mojo 3 tent blends ample headroom, abundant mesh, ultra lightweight materials and an integrated rainfly for outstanding comfort on the trail and a quick, easy setup.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423975.png","image_url":"http://i1.avlws.com/115/l423975.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423975&tt=df","retail_price":"499.95","sale_price":"369.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423975\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423975.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848410&amp;link=&amp;tabs=-Details\"></script>","variants":{"8484100001":{"sku":"8484100001","vendor_sku":"00150312","upc":"054003705011","color":"BLUE/GRAY","retail_price":"369.93","sale_price":"369.93"}},"categories":["camping-hiking","tents","backpacking-tents"]}
