{"sku":"848640","manufacturer_id":"A0MHE1Y","brand_name":"The North Face","product_name":"The North Face Defroster Hoodie Fleece Jacket - Men's","long_description":"The North Face Defroster Hoodie for men upgrades the classic fleece jacket to a whole new level with materials that dry quickly, pack small and fit snugly for optimal insulation. Pontetorto hard-face fleece creates a durable outer face with an interior that insulates and wicks moisture; a touch of stretch ensures comfort and complete mobility. Strategically located FlashDry(TM) panels allow moisture-prone areas to dry quickly so you stay comfortable as long as possible. Hood fits close to the head to ensure helmet compatibility and comfort; extended collar and chin guard provide extra warmth and coverage during bad weather. 2 zippered hand pockets sit high on the torso to accommodate a harness or pack. Raglan style sleeve with off-the-shoulder seaming minimizes chafing and irritation when wearing a pack. The North Face Defroster Hoodie is part of The North Face Summit Series(TM), apparel designed and tested for use in harsh environments.","short_description":"The North Face Defroster Hoodie for men upgrades the classic fleece jacket to a whole new level with materials that dry quickly, pack small and fit snugly for optimal insulation.","category":"Men's","subcategory":"Men's Jackets","product_group":"Men's Fleece Jackets","thumb_url":"http://i1.avlws.com/115/s295635.png","image_url":"http://i1.avlws.com/115/l295635.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=295635&tt=df","keywords":"top,winter,warm,hiking,fleece","retail_price":"190.00","sale_price":"190.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=295635\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m295635.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848640&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
