{"sku":"848634","manufacturer_id":"A0KDA0M","brand_name":"The North Face","product_name":"The North Face Alpine Project Hybrid Hoodie Jacket - Men's","long_description":"The North Face Alpine Project Hybrid hoodie for men combines elements of a hard shell, soft shell and cozy hoodie into a jacket you'll want to wear in any weather. Gore Windstopper(R) material completely blocks wind and sheds water for total weather resistance without being stiff or restrictive. Breathable stretch nylon panels on sides and upper back promote increased comfort for a wide range of conditions or when working hard. Close-fitting hood fits easily under helmets and adjusts using hidden cord locks; laminated brim sheds water and holds its shape. 2 zippered front pockets sit high on the torso for harness and pack compatibility. The North Face Alpine Project Hybrid hoodie features a hidden hem cinch cord to seal in warmth. The North Face Summit Series(TM) apparel is designed and tested for use in harsh environments.","short_description":"The North Face Alpine Project Hybrid hoodie for men combines elements of a hard shell, soft shell and cozy hoodie into a jacket you'll want to wear in any weather.","category":"Men's","subcategory":"Men's Jackets","product_group":"Men's Wind Shells","thumb_url":"http://i1.avlws.com/115/s295659.png","image_url":"http://i1.avlws.com/115/l295659.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=295659&tt=df","keywords":"shell,wind shell,windbreaker","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=295659\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m295659.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848634&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
