{"sku":"848732","manufacturer_id":"04-0071A-GRN5M","brand_name":"Boreas","product_name":" Boreas Lagunitas 25 Pack","long_description":"The Boreas Lagunitas 25 pack boasts an innovative variable suspension that morphs from close-fitting stability to off-the-back, trampoline-like ventilation-perfect for biking or hiking. With a simple push at the top and the pull of a strap, effortlessly switch from a highly ventilated, trampoline suspension to a more conventional and stable fit. Adjusting the gap between the pack and your back is like adjusting a thermostat-bigger gap, more cooling airflow; smaller gap, more warmth and stability. Supportive, ventilated shoulder straps and back panel distribute pressure evenly with resilient foam that maintains its volume, even under a heavy load. Aluminum and steel hoop frame effectively transfers load weight to your hips; lightweight webbing hipbelt is removable. Top-loading main compartment features a lid with a completely waterproof top pocket for wallets, phones and other items that react to water like the Wicked Witch of the West. Organize often-used items with dual zippered side pockets and a tuck-away daisy chain; hydration sleeve and port enable on-the-go hydration (reservoir sold separately). Lightweight, 210-denier ripstop pack fabric is impregnated with silicone for water-resistant durability that thwarts the tendency to wear out or rub off over time. The Boreas Lagunitas 25 pack incorporates stretch panels that allow the pack body to expand and curve, depending on the load and suspension setting.","short_description":"The Boreas Lagunitas 25 pack boasts an innovative variable suspension that morphs from close-fitting stability to off-the-back, trampoline-like ventilation-perfect for biking or hiking.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411207.png","image_url":"http://i1.avlws.com/115/l411207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411207&tt=df","retail_price":"140.00","sale_price":"140.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848732&amp;link=&amp;tabs=-Details\"></script>","variants":{"8487320003":{"sku":"8487320003","vendor_sku":"03-0071A-BLU5M","upc":"854049003931","color":"MARINA BLUE","retail_price":"140.00","sale_price":"140.00"},"8487320004":{"sku":"8487320004","vendor_sku":"04-0071A-GRN5M","upc":"852326004602","color":"TRUCKEE GREEN","retail_price":"140.00","sale_price":"140.00"},"8487320005":{"sku":"8487320005","vendor_sku":"04-0071-ECL5M","upc":"852326004596","color":"ECLIPSE","retail_price":"140.00","sale_price":"140.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
