{"sku":"848728","manufacturer_id":"01-0032A-BLK5M","brand_name":"Boreas","product_name":"Boreas Muir Woods 30 Pack","long_description":"The beautifully crafted Boreas Muir Woods 30 pack hauls your gear with a comfortable, practical and durable design so you can focus on your outdoor passion instead of a sore back. This well-engineered and uncomplicated daypack offers versatility and capacity for a very full day of adventure without compromising form for function. With a suspension that rivals the comfort of bigger multiday packs, the Muir Woods 30 is a little big man that is always up for a gear-intensive hike or long day of cragging. Supportive hipbelt and shoulder straps distribute pressure evenly with resilient foam that maintains its volume, even under a heavy load. Back panel features a Z-foam surface that pumps air as you hike to help keep your back cool; aluminum hoop frame effectively transfers load weight to your hips. Panel-loading main compartment opens wide and lies completely flat, making it easy to stow and access your gear. Tuck-away daisy chains and a minimal number of zippers, buckles and straps create a clean and streamlined profile. Light, 210-denier ripstop nylon is impregnated with silicone for water-resistant durability; 410-denier nylon base is just plain tough. The Boreas Muir Woods 30 pack features a hydration sleeve and port (reservoir sold separately), expandable exterior stretch pocket and zippered top and hipbelt pockets.","short_description":"The beautifully crafted Boreas Muir Woods 30 pack hauls your gear with a comfortable, practical and durable design so you can focus on your outdoor passion instead of a sore back.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411199.png","image_url":"http://i1.avlws.com/115/l411199.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411199&tt=df","retail_price":"140.00","sale_price":"140.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411199\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411199.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848728&amp;link=&amp;tabs=-Details\"></script>","variants":{"8487280001":{"sku":"8487280001","vendor_sku":"01-0032A-BLK5M","upc":"854049003450","color":"FARALLON BLACK","retail_price":"140.00","sale_price":"140.00"},"8487280003":{"sku":"8487280003","vendor_sku":"03-0032A-BLU5M","upc":"854049003887","color":"MARINA BLUE","retail_price":"140.00","sale_price":"140.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
