{"sku":"848730","manufacturer_id":"03-0081A-BLU5M","brand_name":"Boreas","product_name":" Boreas Bolinas 31 Pack","long_description":"The brainy Boreas Bolinas 31 pack is truly one of a kind. It converts effortlessly from a ventilated, bike-friendly roll-top to a stable, back-hugging workhorse for day hikes and scrambles. With a simple push at the top and the pull of a strap, the innovative variable suspension transforms from close-fitting stability to off-the-back, trampoline-like ventilation. Adjusting the gap between the pack and your back is like adjusting a thermostat-bigger gap, more cooling airflow; smaller gap, more warmth and stability. Supportive, ventilated shoulder straps and back panel distribute pressure evenly with resilient foam that maintains its volume, even under a heavy load. Aluminum and steel hoop frame effectively transfers load weight to your hips; lightweight webbing hipbelt is removable. Water-resistant, roll-top main compartment features a completely waterproof pocket for wallets, phones and other items that run screaming from water. Organize often-used items with dual zippered side pockets and a tuck-away daisy chain; hydration sleeve and port enable on-the-go hydration (reservoir sold separately). Lightweight, 210-denier ripstop pack fabric is impregnated with silicone for water-resistant durability that thwarts the tendency to wear out or rub off over time. The Boreas Bolinas 31 pack incorporates stretch panels that allow the pack body to expand and curve, depending on the load and suspension setting.","short_description":"The brainy Boreas Bolinas 31 pack is truly one of a kind. It converts effortlessly from a ventilated, bike-friendly roll-top to a stable, back-hugging workhorse for day hikes and scrambles.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411203.png","image_url":"http://i1.avlws.com/115/l411203.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411203&tt=df","retail_price":"150.00","sale_price":"150.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411203\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411203.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848730&amp;link=&amp;tabs=-Details\"></script>","variants":{"8487300002":{"sku":"8487300002","vendor_sku":"03-0081A-BLU5M","upc":"854049003955","color":"MARINA BLUE","retail_price":"150.00","sale_price":"150.00"},"8487300004":{"sku":"8487300004","vendor_sku":"04-0081A-GRN5M","upc":"852326004626","color":"TRUCKEE GREEN","retail_price":"150.00","sale_price":"150.00"},"8487300005":{"sku":"8487300005","vendor_sku":"04-0081A-ECL5M","upc":"852326004619","color":"ECLIPSE","retail_price":"150.00","sale_price":"150.00"}}}
