{"sku":"848879","manufacturer_id":"13768","brand_name":"Rei","product_name":"REI Serrana Sleeping Bag - Women's","long_description":"Grab the REI Serrana women's down sleeping bag for all of your 3-season adventures. It's designed for the backpacker who prioritizes comfort over weight and wants a balance of performance and price. Women-specific bags are cut to match a woman's shape, and provide extra insulation and warmth in the hood and feet areas. Relaxed fit from the shoulders to the hips increases comfort by providing ample space to move around. 650-fill-power duck down is warm, lightweight and compressible. Exclusive REI Down Fill Calculator optimizes the amount of down per baffle for the most warmth with the least amount of down. 60% of insulation is put on top of bag where it contributes the most warmth and loft. Baffle spacing allows the down to remain fully lofted and keeps it from shifting, preventing cold spots. Ripstop polyester shell resists water and abrasion; smooth polyester taffeta lining is comfortable against your skin. Shell fabric is treated with a Durable Water Repellent finish to repel moisture and stains. Contoured hood, insulated full-face muffler, puffy interior yoke, roomy footbox and full-length zipper draft tube with ground-level seams all work to keep heat in and cold out. The REI Serrana down sleeping bag has an external chest pocket that keeps small essentials-headlamp, watch, glasses-right at hand and easy to find in the dark. Differentiated drawcords (1 round, 1 flat) let you adjust hood and neck easily in the dark. Full-length of zipper is backed by wide, antisnag binding tape. Any REI backpacking bag can be zipped to any other REI backpacking bag because of the consistent 63 in., No. 5, YKK zipper; women's bags zip on the right, men's on the left. Pad loops provide attachment points to keep your sleeping bag and pad together to avoid rolling off onto the cold ground (straps and sleeping pad sold separately). Includes stuff sack and storage bag.","short_description":"Grab the REI Serrana women's down sleeping bag for all of your 3-season adventures. It's designed for the backpacker who prioritizes comfort over weight and wants a balance of performance and price.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s305035.png","image_url":"http://i1.avlws.com/115/l305035.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=305035&tt=df","keywords":"cold,sleep,winter,bag,sleeping","retail_price":"239.00","sale_price":"178.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=305035\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m305035.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=848879&amp;link=&amp;tabs=-Details\"></script>","variants":{"8488790001":{"sku":"8488790001","vendor_sku":"13768","upc":"484887900019","size":"Regular Right","color":"LARKSPUR/DEWBERRY","retail_price":"169.93","sale_price":"169.93"},"8488790002":{"sku":"8488790002","vendor_sku":"13768","upc":"484887900026","size":"Long Right","color":"LARKSPUR/DEWBERRY","retail_price":"178.93","sale_price":"178.93"}}}
