{"sku":"849053","manufacturer_id":"T-2000","brand_name":"Kinetic","product_name":"Kinetic inRide Watt Meter","long_description":"Kinetic InRide watt meter offers power-based training in a convenient and budget-friendly design that pairs with your Kinetic bike trainer. Using the Bluetooth Smart(TM) communication protocol, the inRide sensor transmits data to your compatible Apple device. inRide sensor pod measures speed and cadence at the tire and translates that to wattage with a simple equation; auto coast-down calibration accurately sets wattage. Data measurements include power, heart rate, cadence, speed and distance; power metrics include TSS, nPower, iFactor, mean maximal power and time in power zones. Heart rate zones show current, average, and max heart rate and total time spent in each training zone; calorie burn tracks energy expenditure. Free inRide app is available in the Apple App Store and is compatible with iPhone 4S, iPhone 5, iPad 3, iPad Mini and new iPod Touch. App features 5 different data screens so that you can easily access and your wattage or heart rate on the fly. Installation is easy: affix sensor pod to back of resistance unit, insert plug and magnet into roller, install Kinetic inRide app on your device, configure rider data and ride. Includes sensor pod, heart rate monitor chest strap, batteries, trainer roller magnet and inRide App (free at Apple App Store). Please note: Kinetic inRide power meter is only compatible with Kinetic fluid resistance trainers and is compatible with all current and previous models.","short_description":"Kinetic InRide watt meter offers power-based training in a convenient and budget-friendly design that pairs with your Kinetic bike trainer.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trainers","thumb_url":"http://i1.avlws.com/115/s379567.png","image_url":"http://i1.avlws.com/115/l379567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379567&tt=df","retail_price":"229.00","sale_price":"229.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849053&amp;link=&amp;tabs=-Details\"></script>","variants":{"8490530001":{"sku":"8490530001","vendor_sku":"T-2000","upc":"851061001037","retail_price":"229.00","sale_price":"229.00"}},"categories":["cycling","bike-accessories","bike-trainers"]}
