{"sku":"849000","manufacturer_id":"3213371300","brand_name":"Deuter","product_name":" Deuter Race EXP Air Bike Hydration Pack - 100 fl. oz.","long_description":"The light and airy Deuter Race EXP Air Bike Hydration Pack carries 3 liters of water and features a flexible, highly breathable suspension to keep you comfortable as you ride. Includes BPA-free Streamer 3 liter (100 fl. oz). hydration reservoir with drink tube for on-the-go hydration. Lightweight Aircomfort FlexLite suspension features a flexible, supportive design with sprung mesh to allow air to freely circulate between you and the pack body. Adjustable shoulder straps, chest strap and waistbelt let you dial in a comfortable personal fit. Attached mesh waistbelt stabilizers help keep the pack secure when riding over uneven surfaces. Zippered main compartment features an expandable section to accommodate bulkier gear. Main compartment also has a special pocket for wet clothing or gear as well as an internal mesh pocket to help organize your stuff. Front zip pocket has an organizer panel for easy access to small essentials; mesh side pockets work great for securing water bottles or other on-the-go necessities. Reflective detailing increases your visibility in low light. Reflective loop lets you easily attach a safety light (sold separately) to keep you visible. Raincover can deploy at a moment's notice to help keep your gear dry; when not in use, it stows away in bottom zippered pocket. Mesh helmet holder deploys easily from the front of the Deuter Race EXP Air bike hydration pack.","short_description":"The light and airy Deuter Race EXP Air Bike Hydration Pack carries 3 liters of water and features a flexible, highly breathable suspension to keep you comfortable as you ride.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411819.png","image_url":"http://i1.avlws.com/115/l411819.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411819&tt=df","keywords":"day packs","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411819\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411819.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849000&amp;link=&amp;tabs=-Details\"></script>","variants":{"8490000001":{"sku":"8490000001","vendor_sku":"3213371300","color":"BLACK/WHITE","retail_price":"129.00","sale_price":"129.00"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
