{"sku":"849032","manufacturer_id":"A4UNB1D","brand_name":"The North Face","product_name":"The North Face Hyper-Track Guide Trail-Running Shoes - Women's","long_description":"Made for endurance runners, the women's Hyper-Track trail-running shoes from The North Face have a neutral design that fuels fast stride turnover on trails and roads alike. Lightweight polyester mesh uppers are highly breathable and resist abrasion; thermoplastic urethane overlays provide support and protection. Polyester mesh linings wick moisture away from your feet and dry quickly. Hyper-Track trail-running shoes have tongue scree collars to help keep pesky trail debris out of the shoes. Removable multidensity foam footbeds offer cushioning and stability. Cushioning, dual-density EVA midsoles provide shock absorption and lightweight, neutral support. Thermoplastic urethane heel cradles offer stability and protection against stone bruising. Sticky rubber outsoles provide excellent traction and abrasion resistance for off-road pursuits.","short_description":"Made for endurance runners, the women's Hyper-Track trail-running shoes from The North Face have a neutral design that fuels fast stride turnover on trails and roads alike.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s387459.png","image_url":"http://i1.avlws.com/115/l387459.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=387459&tt=df","retail_price":"120.00","sale_price":"83.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=387459\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m387459.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849032&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","womens-footwear","womens-shoes"]}
