{"sku":"849099","manufacturer_id":"TOW1023060","brand_name":"National Geographic","product_name":"National Geographic Ultimate Outdoor Map Kit","long_description":"The National Geographic Ultimate Outdoor map kit is your print, mobile and online solution for outdoor mapping! It makes planning your next adventure with maps easy and fun. Kit offers a 1-year pro subscription to AllTrails, with a 20% savings compared to buying the subscription separately. Mobile and online access to current maps for the entire United States includes seamless USGS TOPO!, National Geographic Trails Illustrated, satellite, terrain and street maps. Kit includes an award-winning, fully integrated mobile app for iOS and Android with GPS tracking, photo geotagging, and trail finder. Online route planning tools with distance and elevation profiling seamlessly integrate with the mobile app. GPX file compatibility enables route sharing with handheld GPS receivers. Enjoy online trail and place finder with trail ratings, reviews and event calendars. Kit features unlimited printing of letter, legal and tabloid size maps. The National Geographic Ultimate Outdoor map kit requires no software to install and comes with 2 sample sheets of Adventure Paper (more paper sold separately).","short_description":"The National Geographic Ultimate Outdoor map kit is your print, mobile and online solution for outdoor mapping! It makes planning your next adventure with maps easy and fun.","category":"Books And Maps","subcategory":"Maps","product_group":"Map Accessories","thumb_url":"http://i1.avlws.com/115/s409855.png","image_url":"http://i1.avlws.com/115/l409855.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=409855&tt=df","retail_price":"39.95","sale_price":"39.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=409855\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m409855.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849099&amp;link=&amp;tabs=-Details\"></script>","variants":{"8490990001":{"sku":"8490990001","vendor_sku":"TOW1023060","retail_price":"39.95","sale_price":"39.95"}},"categories":["books","maps","map-accessories"]}
