{"sku":"849186","manufacturer_id":"E52 B","brand_name":"Petzl","product_name":" Petzl Ultra Rush Accu 4 Belt Headlamp","long_description":"Designed for demanding, fast-paced activities such as trail running, skiing and mountain biking, the Petzl Ultra Rush Accu 4 Belt headlamp has 6 powerful LEDs that throw a stunning beam up to 140m. Belt Accu 4 version of the Ultra includes a 5,200 mAh rechargeable lithium ion battery as opposed to the 2,600 mAh battery that's included with the standard Ultra. 51 in. long cable allows the battery pack to be carried in a pocket, keeping the weight on the head to only 8.1 oz.; battery pack weighs 9.3 oz. Ultra Rush has 4 brightness settings with a light output of up to 700 lumens to meet the needs of nighttime explorers. Headlamp throws a bright beam up to 140m on high and 37m on low. Light selection dial is easily adjusted while on the move; switch the dial to the lock setting when transporting the headlamp to avoid accidentally turning it on. Rechargeable lithium ion battery pack provides 4 hrs. of use on high and 73 hrs. of use on low. Light automatically switches to power reserve mode when the batteries get low, buying you an additional 1 hr. of use with an output of 35 lumens. Energy gauge located on the battery pack indicates in bar-graph form how much battery power remains. Included battery charger fully recharges the battery pack in only 5 hrs.; charger includes European and American outlet adapters. Lithium ion batteries continue to work well at cold temperatures. Rugged body keeps the light operating in the worst weather; IP67 rating indicates protection against submersion down to 1m for 30 min. and complete protection against dust. Headlamp is constructed with excellent resistance to falls, impacts and crushing. Stretchy side and top straps adjust to securely fit on your head or climbing helmet; front and back stabilizing plates help hold the light steady.","short_description":"Designed for demanding, fast-paced activities such as trail running, skiing and mountain biking, the Petzl Ultra Rush Accu 4 Belt headlamp has 6 powerful LEDs that throw a stunning beam up to 140m.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417135.png","image_url":"http://i1.avlws.com/115/l417135.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417135&tt=df","retail_price":"500.00","sale_price":"500.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417135\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417135.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849186&amp;link=&amp;tabs=-Details\"></script>","variants":{"8491860001":{"sku":"8491860001","vendor_sku":"E52 B","color":"WHITE","retail_price":"500.00","sale_price":"500.00"}}}
