{"sku":"849137","manufacturer_id":"EC-20390125","brand_name":"Eagle Creek","product_name":" Eagle Creek Load Warrior Wheeled Duffel - 25\"","long_description":"The Eagle Creek Load Warrior 25 wheeled duffel has an expandable main compartment that adds 15% more packing space. If you plan on coming home with more than you left with, it's worth a look! Large main compartment features compression straps and a zip mesh organizer pocket. Laundry Chute(TM) pocket, with exterior access, keeps wet or dirty gear separate from the clean. Stowable Equipment Keeper(TM) exterior elastic lash strap lets you hold gear and clothing on the luggage via the Porter Key(TM) bottle opener attachment. Oversize super-tread wheels with protective housing guards roll easily over urban obstacles. Handle extends smoothly and offers a comfortable grip; cleanly zips away when not deployed. Piggyback clip attaches an additional bag (not included), allowing both to be wheeled as 1. Multiple grab handles; center harness handle doubles as lash points. Exterior compression strap helps stabilize and secure contents. Built-in durability: rugged corner guards, reinforced hypalon material blocking, bumper protection and reinforced bar tacks. Lockable, self-repairing zippers have finger-friendly zipper pulls; luggage locks sold separately. Contrast accents throughout Load Warrior 25 allow easy identification on the luggage belt. ID tag slips neatly away. Reflective accents for dusk and nighttime visibility. Integrates with Eagle Creek Pack-It(R) Systems, sold separately.","short_description":"The Eagle Creek Load Warrior 25 wheeled duffel has an expandable main compartment that adds 15% more packing space. If you plan on coming home with more than you left with, it's worth a look!","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433855.png","image_url":"http://i1.avlws.com/115/l433855.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433855&tt=df","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433855\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433855.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849137&amp;link=&amp;tabs=-Details\"></script>","variants":{"8491370002":{"sku":"8491370002","vendor_sku":"EC-20390125","upc":"032546749433","color":"SLATE BLUE","retail_price":"250.00","sale_price":"250.00"}},"categories":["travel","luggage","wheeled-luggage"]}
