{"sku":"849388","manufacturer_id":"32577810","brand_name":"Mavic","product_name":"Mavic Ksyrium Equipe S Front Wheel","long_description":"Mavic Ksyrium Equipe S front bike wheel delivers a fine balance between weight savings and strength and durability for an excellent, all-around wheel that won't break your budget. Semi-aerodynamic 24mm deep rim is strengthened where the spokes exert the greatest stress to deliver lasting performance. Rim features a milled braking surface to improve friction; rim joint is welded and milled to eliminate shuddering during braking and provide great wheel balance. Hub uses double-sealed cartridge bearings to deliver excellent longevity and smooth spinning. 20 straight-pull, bladed steel spokes are laced radially for a balance between strength and weight savings. Yksion Comp 700x23c clincher tire is included; tire has supple 120 tpi casing and is backed with a puncture-resistant nylon breaker. Please note: tube uses a Presta valve; maximum recommended pressure of 140 psi (10 bar). Mavic Kysrium Equipe S front wheel comes with a quick-release skewer and rim tape; 100mm front axle spacing. Mavic recommended maximum combined weight of the cyclist, bike and equipment is 220 lbs. (100kg).","short_description":"Mavic Ksyrium Equipe S front bike wheel delivers a fine balance between weight savings and strength and durability for an excellent, all-around wheel that won't break your budget.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Tires, Tubes And Wheels","thumb_url":"http://i1.avlws.com/115/s389563.png","image_url":"http://i1.avlws.com/115/l389563.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=389563&tt=df","retail_price":"258.50","sale_price":"258.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=389563\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m389563.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849388&amp;link=&amp;tabs=-Details\"></script>","variants":{"8493880001":{"sku":"8493880001","vendor_sku":"32577810","upc":"080694817436","size":"700C","retail_price":"258.50","sale_price":"258.50"}},"categories":["cycling","bike-components","bike-tires-tubes-and-wheels"]}
