{"sku":"849386","manufacturer_id":"32791114","brand_name":"Mavic","product_name":" Mavic Crossmax ST 29er Disc Wheelset","long_description":"Mavic Crossmax ST 29er Disc mountain bike wheelset offers tough, sturdy performance to meet the demands of your favorite trails. Proprietary lighweight aluminum rims have a drilling method that doesn't penetrate the tube-facing wall, enhancing wheel strength and rigidity. This drilling method also alllows UST tubeless compatibility, offering all the benefits of tubeless with the option of using a traditional tube/tire setup. Inter Spoke Milling along rim reduces material between spokes, lowering weight and the amount of effort needed to spin the wheels up for superb climbing and acceleration. Rim joints are welded and milled to maximize strength, rigidity and wheel balance while also offering a smooth finish. Rear hub uses Instant Transfer System 4 freewheel design to supply fast engagement via 4 pawls, ensuring your energy is transferred to the wheel quickly and efficiently. Double-sealed cartridge bearings deliver excellent longevity and smooth spinning; microadjustability lets you fine-tune bearing loads to optimize your ride. Front wheel uses 24 round, straight-pull Zicral alloy spokes laced in a 2-cross pattern; rear uses 20 spokes in a radial lacing on drive-side and 2-cross on non-drive-side. Front hub works with 15mm thru-axles (for use with 9mm quick-release, adapter must be purchased separately); rear hub works with either 9mm or 12mm axles (adapters included). Compatible with standard 6-bolt disc brake rotors; 100mm front and 135mm rear axle spacing. The Mavic Crossmax ST 29er Disc wheelset comes with rear quick-release skewer (no front skewer), removable UST valves, adjustment tool and front wheel computer magnet. Mavic recommended maximum combined weight of the cyclist, bike and equipment is 220 lbs. (100kg); recommended tire width is 1.5 - 2.3 in.","short_description":"Mavic Crossmax ST 29er Disc mountain bike wheelset offers tough, sturdy performance to meet the demands of your favorite trails.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Tires, Tubes And Wheels","thumb_url":"http://i1.avlws.com/115/s389555.png","image_url":"http://i1.avlws.com/115/l389555.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=389555&tt=df","retail_price":"824.95","sale_price":"824.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=389555\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m389555.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849386&amp;link=&amp;tabs=-Details\"></script>","variants":{"8493860001":{"sku":"8493860001","vendor_sku":"32791114","upc":"080694938636","size":"29 IN","retail_price":"824.95","sale_price":"824.95"}},"categories":["cycling","bike-components","bike-tires-tubes-and-wheels"]}
