{"sku":"849445","manufacturer_id":"58-5212008","brand_name":"Aquaglide","product_name":"Aquaglide Multisport 270 Inflatable Sailboat/Windsurfing Board","long_description":"Offering unparalleled versatility, the inflatable Aquaglide Multisport(TM) 270 works as a sailboat, windsurfing board or even a sit-on-top kayak. Tough PVC construction and comfortable polyester covering stand up to on-the-water use; included foot pump offers convenient inflation. Use the included mast and sail to convert the Multisport 270 into a stable sailboat that's perfect for learning how to sail with up to 2 users. Very stable and lightweight, the Multisport 270 requires little wind to sail and can handle winds up to 20 mph. Keel is less than 12 in. deep and allows you to sail in very shallow waterways. Mast can be configured to be used as a windsurfing sail with 1 user. Put a paddle in your hand, and the Multisport 270 can be used as a very stable sit-on-top kayak. Lastly, the Multisport 270 also works great as a towable inflatable for 2 passengers. Wheeled storage bag houses all components and is sized to fit in the trunk of a car. Includes roller travel bag, tiller handle, sailing harness, main sheet/uphaul strap, rudder, keel (2 pieces), mast base, foot pump, sail and sail bag, mast, boom and hull. Aquaglide strongly cautions against dragging the Multisport across dry ground-always lift and carry your inflatable. Aquaglide estimates the setup time to approximately 10 min. with no special tools required.","short_description":"Offering unparalleled versatility, the inflatable Aquaglide Multisport(TM) 270 works as a sailboat, windsurfing board or even a sit-on-top kayak.","category":"Paddling","subcategory":"Rafts And Tubes","product_group":"Inflatable Rafts","thumb_url":"http://i1.avlws.com/115/s460547.png","image_url":"http://i1.avlws.com/115/l460547.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460547&tt=df","keywords":"jgq459n","retail_price":"799.95","sale_price":"799.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460547\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460547.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849445&amp;link=&amp;tabs=-Details\"></script>","variants":{"8494450001":{"sku":"8494450001","vendor_sku":"58-5212008","upc":"790628032254","retail_price":"799.95","sale_price":"799.95"}},"categories":["paddling","rafts-and-tubes","inflatable-rafts"]}
