{"sku":"849519","manufacturer_id":"PJUTSCOR0","brand_name":"Kokatat","product_name":"Kokatat TROPOS Light Storm Cag Pullover","long_description":"Despite the sunny forecast, rain starts to fall and you need extra protection of the TROPOS Light Storm Cag pullover from Kokatat. When the rain starts, you don't have to take off your PFD! The Kokatat Storm Cag pullover is roomy on the inside so it will fit over bulky paddling clothing. It's dry on the inside thanks to waterproof and breathable TROPOS polyurethane-coated nylon. Adjustable shockcord fits over kayak coaming to enhance protection in the cockpit; adjustable hood with internal foam bill dials in the fit with 2 points of adjustment. Rip-and-stick cuff closures help keep sleeves in place; pile-lined kangaroo pocket shelters hands from the cold. Left-sleeve pocket with self-draining mesh keeps track of small items and cargo pocket with zip closure stores accessories. You can reach inside pullover behind the cargo pocket if you need to get to your PFD or other layers. Reflective tape enhances visibility and safety. Take it along just for emergencies; the Kokatat TROPOS Light Storm Cag pullover stuffs into hood and packs down small.","short_description":"Despite the sunny forecast, rain starts to fall and you need extra protection of the TROPOS Light Storm Cag pullover from Kokatat.","category":"Paddling","subcategory":"Paddling Clothing","product_group":"Paddling Jackets","thumb_url":"http://i1.avlws.com/115/s431599.png","image_url":"http://i1.avlws.com/115/l431599.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431599&tt=df","retail_price":"209.00","sale_price":"209.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431599\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431599.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849519&amp;link=&amp;tabs=-Details\"></script>","variants":{"8495190002":{"sku":"8495190002","vendor_sku":"PJUTSCOR0","upc":"606891041223","size":"One Size","color":"PUMPKIN","retail_price":"209.00","sale_price":"209.00"}},"categories":["paddling","paddling-clothing","paddling-jackets"]}
