{"sku":"849591","manufacturer_id":"M36","brand_name":"Hennessy Hammock","product_name":"Hennessy Hammock Explorer Deluxe Asym Zip","long_description":"The Explorer Deluxe Asym Zip from Hennessy Hammock has an easy side entrance with a double-slider zipper closure. It's designed for anyone under 300 lbs. and up to 7 ft. tall. Explorer Deluxe Asym Zip hammock has a comfortable asymmetric shape and large, protective rainfly; it sets up in about 3 minutes. This general-purpose hammock is an excellent and economical choice for those who like to travel light. Asymmetric hammock bed offers a comfortable night's sleep; asymmetric rainfly improves coverage. Strong #10 zipper features double sliders for easy adjustments to the hammock and mesh; entry is from the side on this Hennessy model. Patented integral ridgeline maintains the same comfortable shape every time to keep your back straight and level when resting on the diagonal. No-see-um mesh provides excellent insect protection and ventilation, and will deflect wind to provide a calm space inside. Waterproof polyester ripstop rainfly may be tilted to any angle, rolled up above, removed or used separately; large rainfly offers ample protection. Nifty gear pocket slides on the ridgeline and stores out of sight behind your head. Suspension system includes two 10 ft. long, 1500 lb. test low-stretch polyester core ropes with polyester cover. Complementary polyester webbing straps are attached to the end of the suspending ropes to protect the tender bark of trees and provide greater span for the ropes. Explorer Deluxe Asym Zip hammock folds into an open-air lounger/chair or can be used on the ground as a tent when paired with your hiking poles. Setup instructions printed on ripstop polyester stuff sack.","short_description":"The Explorer Deluxe Asym Zip from Hennessy Hammock has an easy side entrance with a double-slider zipper closure. It's designed for anyone under 300 lbs. and up to 7 ft. tall.","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Hammocks","thumb_url":"http://i1.avlws.com/115/s414103.png","image_url":"http://i1.avlws.com/115/l414103.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414103&tt=df","retail_price":"229.95","sale_price":"229.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414103\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414103.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849591&amp;link=&amp;tabs=-Details\"></script>","variants":{"8495910001":{"sku":"8495910001","vendor_sku":"M36","upc":"832667334248","color":"BARK","retail_price":"229.95","sale_price":"229.95"}},"categories":["camping-hiking","camp-furniture","hammocks"]}
