{"sku":"849589","manufacturer_id":"40811513","brand_name":"Kelty","product_name":" Kelty Mach 4 Tent","long_description":"Comfort and versatility is the name of the game with the 4-person, 3-season Kelty Mach 4 tent. Highlights include inflatable air poles, an integrated rainfly, a large vestibule and a sleep room. Inflatable air poles, with easy-access points, allow tent to be inflated and deflated in about a minute; includes a high-volume, dual-action floor pump. Inflatable air poles resist bending, breaking and kinking, and keep the Mach 4 standing tall and ready to go in even in stormy weather. Integrated, fully vented rainfly further simplifies setup. Versatile with abundant comfort; remove the fully enclosed sleeping-room insert to create 1 large area for storing gear or escaping the weather. Large enclosed vestibule is over 50 sq. ft. and sleep room another 50 sq. ft.; when sleep room is removed, you have a cavernous 100 sq. ft. area. Large mesh windows in vestibule make it a screened-in hangout; fabric panels zip close for weather protection and privacy. Double-zipper end door opens wide for easy access and awning functionality (awning poles not included). Fully stake out tent and guyout points, including side vents, to stabilize tent and maximize ventilation; guylines live in their own storage pockets for quick access. UV-resistant polyester rainfly will not stretch when wet, ensuring a consistently taut pitch. Seam-taped rainfly and floor ensure watertight protection. Noiseless zipper pulls and internal storage pockets enhance your comfort while you're in the Kelty Mach 4 tent.","short_description":"Comfort and versatility is the name of the game with the 4-person, 3-season Kelty Mach 4 tent. Highlights include inflatable air poles, an integrated rainfly, a large vestibule and a sleep room.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424431.png","image_url":"http://i1.avlws.com/115/l424431.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424431&tt=df","retail_price":"399.95","sale_price":"399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424431\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424431.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849589&amp;link=&amp;tabs=-Details\"></script>","variants":{"8495890001":{"sku":"8495890001","vendor_sku":"40811513","upc":"727880039615","color":"COOL GREY/PUTTY/APPLE GRE","retail_price":"399.95","sale_price":"399.95"}}}
