{"sku":"849590","manufacturer_id":"40811613","brand_name":"Kelty","product_name":" Kelty Mach 6 Tent","long_description":"Comfort and versatility is the name of the game with the 6-person, 3-season Kelty Mach 6 tent. Highlights include Inflatable air poles, an integrated rainfly, a large vestibule and 2 sleep rooms. Inflatable air poles, with easy-access points, allow tent to be inflated and deflated in about a minute; includes a high-volume, dual-action floor pump. Inflatable air poles resist bending, breaking and kinking, and keep the Mach 6 standing tall and ready to go in even in stormy weather. Integrated, fully vented rainfly further simplifies setup. Dine and relax in the large central vestibule; mesh window and door panel zips closed for weather protection and privacy. Double-zipper door opens wide for easy access. Versatile with abundant comfort; 1 or both of the fully enclosed sleep-room inserts can be removed to create 1 cavernous area to store gear or hang out in bad weather. Each sleep room offers 49 sq. ft. of floor space; centrally located vestibule offers 38 sq. ft. of storage and a peak height of 6 ft. 4 in. for abundant head room. Fully stake out tent and guyout points, including side vents, to stabilize tent and maximize ventilation; guylines live in their own storage pockets for quick access. UV-resistant polyester rainfly will not stretch when wet, ensuring a consistently taut pitch. Seam-taped rainfly and floor ensure watertight protection. Noiseless zipper pulls and internal storage pockets enhance your comfort while in the Kelty Mach 6 tent.","short_description":"Comfort and versatility is the name of the game with the 6-person, 3-season Kelty Mach 6 tent. Highlights include Inflatable air poles, an integrated rainfly, a large vestibule and 2 sleep rooms.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424435.png","image_url":"http://i1.avlws.com/115/l424435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424435&tt=df","retail_price":"499.95","sale_price":"499.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849590&amp;link=&amp;tabs=-Details\"></script>","variants":{"8495900001":{"sku":"8495900001","vendor_sku":"40811613","upc":"727880039622","color":"COOL GREY/PUTTY/APPLE GRE","retail_price":"499.95","sale_price":"499.95"}}}
