{"sku":"849632","manufacturer_id":"MTI806E","brand_name":"Mti","product_name":"MTI Voyager PFD","long_description":"The MTI Voyager PFD is a premium highback jacket designed to make the on-the-water experience more fun for older paddlers, retirees and grandparents. Designed to be easy on hands, especially those with arthritis, the MTI Voyager fastens securely with a single front zipper instead of a series of buckles. Extra-long zipper pulls in bright colors offer better-than-average leverage to open vest and pockets. Easily accessible eyeglasses pocket is large enough to fit clip-on sunglasses covers. Fleece-lined pockets warm up chilly hands. Tethered safety whistle is easy to grab in the event you need it. Keep essential important information with you on the sewn-in ID patch that offers room for a name, address and phone number. Padded, adjustable shoulders offer a comfortable fit. Large pockets store lots of gear and feature internal organizers. Rear mesh panel promotes cooling airflow. Reflective highlights increase visibility in dim light. The Voyager PFD from MTI offers high durability thanks to its very tough 500-denier nylon construction.","short_description":"The MTI Voyager PFD is a premium highback jacket designed to make the on-the-water experience more fun for older paddlers, retirees and grandparents.","category":"Paddling","subcategory":"Pfds","product_group":"Men's Pfds","thumb_url":"http://i1.avlws.com/115/s431963.png","image_url":"http://i1.avlws.com/115/l431963.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431963&tt=df","keywords":"kayaking","retail_price":"125.00","sale_price":"125.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431963\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431963.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849632&amp;link=&amp;tabs=-Details\"></script>","variants":{"8496320001":{"sku":"8496320001","vendor_sku":"MTI806E","upc":"762894032511","size":"XS/S","color":"KHAKI/RED","retail_price":"125.00","sale_price":"125.00"}},"categories":["paddling","pfds","mens-pfds"]}
