{"sku":"849693","manufacturer_id":"2000012033","brand_name":"Coleman","product_name":" Coleman Triton Series 2-Burner Stove","long_description":"The high-performance Coleman Triton Series 2-Burner camp stove features a slim, portable design and powerful burners for great cooking performance at the campground. Burners output 11,000 BTUs each to get your cooking done in short order. Large cooking area accommodates one 12-in. frying pan and one 10-in. frying pan at the same time (frying pans sold separately). PerfectFlow control system delivers stable heat output by producing a steady flow of fuel, even in high altitude, low fuel or cold weather. Burner output control knobs supply variable control over cooking temperature-from simmer to full boil for perfect outdoor cooking. 2 folding WindBlock(TM) shields are oriented vertically to block burner and grill from winds, improving efficiency and reducing cooking time. Top lid also serves as a wind block. Heavy-duty, nickel-chrome grate removes easily for cleaning. Coleman Triton Series 2-Burner camp stove requires a 16 oz. propane fuel cylinder, not included. Stove can be operated on a bulk propane tank by using a Type-1 adapter with hose, sold separately. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"The high-performance Coleman Triton Series 2-Burner camp stove features a slim, portable design and powerful burners for great cooking performance at the campground.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s442867.png","image_url":"http://i1.avlws.com/115/l442867.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442867&tt=df","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442867\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442867.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849693&amp;link=&amp;tabs=-Details\"></script>","variants":{"8496930001":{"sku":"8496930001","vendor_sku":"2000012033","upc":"076501234220","color":"BLACK","retail_price":"69.95","sale_price":"69.95"}}}
