{"sku":"849608","manufacturer_id":"97-2849-F08","brand_name":"Rei","product_name":"REI Sub Kilo 20 Sleeping Bag - Long - Special Buy","long_description":"Featuring reliable warmth for 3-season backpacking trips, the REI Sub Kilo +20 long sleeping bag accommodates your \"reach-the-top-shelf\" height so you stay covered and cozy while sleeping outside. Extra length accommodates sleepers up to 6 ft. 6 in. tall. Sleeping bag features premium 750-fill-power goose down insulation, a downproof polyester ripstop shell and soft polyester taffeta lining. Vertical Baffle construction allows the goose down to remain fully lofted and keeps it from shifting and migrating, preventing cold spots. Contoured hood, roomy footbox, full-length locking zipper, full-length draft tube and muffler all keep body heat in and cold air out. Internal pocket keeps all your essentials-headlamp, watch, glasses-right at hand and easy to find in the dark. Differentiated drawcords (one round, one flat) let you adjust hood and neck easily in the dark. Pad loops provide attachment points to keep your sleeping bag and pad together to avoid rolling off onto the cold ground (straps not included). Efficient, slim cut keeps the weight down. Right-hand zip design lets you zip the REI Sub Kilo +20 Long sleeping bag to compatible left-hand bags to create a double bed. Comes with stuff sack and large cotton storage bag. Special buy.","short_description":"Featuring reliable warmth for 3-season backpacking trips, the REI Sub Kilo +20 long sleeping bag accommodates your \"reach-the-top-shelf\" height so you stay covered and cozy while sleeping outside.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"3-Season Sleeping Bags (+15F To +32F)","thumb_url":"http://i1.avlws.com/115/s319443.png","image_url":"http://i1.avlws.com/115/l319443.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=319443&tt=df","keywords":"3-season,sleeping,sleeping bag,bag,sleepingbag","retail_price":"299.00","sale_price":"208.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=319443\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m319443.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849608&amp;link=&amp;tabs=-Details\"></script>","variants":{"8496080001":{"sku":"8496080001","vendor_sku":"97-2849-F08","upc":"484960800014","size":"Long","color":"ORANGE","retail_price":"208.73","sale_price":"208.73"}}}
