{"sku":"849694","manufacturer_id":"2000012034","brand_name":"Coleman","product_name":"Coleman Triton InstaStart 2-Burner Stove","long_description":"The high-performance Coleman Triton InstaStart(TM) 2-Burner propane camp stove features matchless lighting and powerful burners in a slim, portable design. Burners output 11,000 BTUs each to get your cooking done in short order. Large cooking area accommodates one 12-in. frying pan and one 10-in. frying pan at the same time (frying pans sold separately). Easy-to-use InstaStart ignition sparks the stove to life quickly and takes the worry out of remembering matches. PerfectFlow control system delivers stable heat output by producing a steady flow of fuel even in high altitudes, cold weather or when fuel is low. Burner output control knobs supply variable control of cooking temperature-from simmer to full boil for perfect outdoor cooking. 2 folding WindBlock(TM) shields can be oriented vertically to block burner and grill from winds, improving efficiency and reducing cooking time. The shields can be oriented horizontally for convenient side shelves to hold condiments and cooking utensils; top lid also serves as a wind block. Heavy-duty, nickel-chrome grate removes easily for cleaning. Coleman Triton InstaStart 2-Burner camp stove requires a 16 oz. propane fuel cylinder, not included. Stove can be operated on a bulk propane tank by using a Type-1 adapter with hose, sold separately. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"The high-performance Coleman Triton InstaStart(TM) 2-Burner propane camp stove features matchless lighting and powerful burners in a slim, portable design.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416607.png","image_url":"http://i1.avlws.com/115/l416607.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416607&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416607\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416607.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849694&amp;link=&amp;tabs=-Details\"></script>","variants":{"8496940001":{"sku":"8496940001","vendor_sku":"2000012034","upc":"076501234237","color":"BLACK","retail_price":"89.95","sale_price":"89.95"}},"categories":["camping-hiking","camp-kitchen","stoves"]}
