{"sku":"849635","manufacturer_id":"06898","brand_name":"Msr","product_name":"MSR Reactor 1.0L Stove System","long_description":"High winds and freezing temperatures are enough to hamper the performance of many canister stoves. Not the MSR Reactor 1.0L. It excels on lightweight adventures in rugged alpine terrain. Reactor 1.0L stove system includes a 1-liter pot, making it ideal for light and fast adventures by 1 or 2 people. Windproof stove cranks out heat in short order and keeps constant pressure for optimal fuel regulation and consumption. Burner features 2 modes of heat transfer, convective and radiant, to generate maximum heat output and boil 1 liter of water in about 3 min. 30 sec. Internal regulation of fuel pressure creates a consistent flame in all temperatures and excellent performance throughout the life of the fuel canister. One 133g (4 oz.) fuel canister (not included) allows you to boil about 10 liters of water, meaning you need to carry less fuel and spend less money. Integrated heat exchanger fused to the 1-liter pot completely encloses the radiant burner, blocking even the most extreme winds. Whisper-quiet operation won't disturb your dinnertime discussions. Fuel canister (not included) and stove stow inside pot for compact storage; Reactor Solo system nests optimally with a small-diameter MSR 133g (4 oz.) IsoPro fuel canister. BPA-free lid features an integrated strainer to eliminate the hassle of draining water from noodles or steamed vegetables. Integrated pot handle locks in place over the lid for secure transport. MSR Reactor 1.0L system includes the stove, 1-liter pot with strainer lid and a PackTowl(TM) to protect the pot from scratches during transport. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"High winds and freezing temperatures are enough to hamper the performance of many canister stoves. Not the MSR Reactor 1.0L. It excels on lightweight adventures in rugged alpine terrain.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416599.png","image_url":"http://i1.avlws.com/115/l416599.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416599&tt=df","retail_price":"189.95","sale_price":"189.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416599\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416599.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849635&amp;link=&amp;tabs=-Details\"></script>","variants":{"8496350001":{"sku":"8496350001","vendor_sku":"06898","upc":"040818068984","size":"1 LTR","retail_price":"189.95","sale_price":"189.95"}},"categories":["camping-hiking","camp-kitchen","stoves"]}
