{"sku":"849752","manufacturer_id":"K-CARI YP","brand_name":"Eddyline","product_name":" Eddyline Caribbean 12 Sit-On-Top Kayak","long_description":"The Eddyline Caribbean 12 sit-on-top kayak glides through the water with a high-quality hull construction and top-notch features. Unique hull construction offers the looks and performance of a composite kayak with the durability of plastic. Named Carbonite 2000 by Eddyline, a co-extruded ABS laminate creates a hull that rivals the qualities of fiberglass. Plastic is first shaped into a 2-layer sheet with durable interior and an abrasion- and UV-resistant exterior. Dheet is then thermorformed into the hull of the kayak using very high temperatures and a vacuum. This 2-layer plastic laminate offers incredible stiffness and a hard, glossy appearance that resists abrasion and impact while remaining easy to repair. Gull wing hull configuration provides high initial stability without sacrificing its excellent tracking or efficient forward motion through the water. High-backed adjustable seat provides additional comfort for longer paddling excursions. Removable seat includes fittings made from tough but lightweight plastic instead of the typical metal buckles that can scratch up your kayak. Multiple hatches provide access to interior space; flat and accessible mounting surfaces provide ample space for mounting accessories.","short_description":"The Eddyline Caribbean 12 sit-on-top kayak glides through the water with a high-quality hull construction and top-notch features.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s430659.png","image_url":"http://i1.avlws.com/115/l430659.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430659&tt=df","retail_price":"1379.00","sale_price":"1379.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430659\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430659.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849752&amp;link=&amp;tabs=-Details\"></script>","variants":{"8497520002":{"sku":"8497520002","vendor_sku":"K-CARI YP","upc":"610256850801","color":"YELLOW/PEARL","retail_price":"1379.00","sale_price":"1379.00"}}}
