{"sku":"849793","manufacturer_id":"06952","brand_name":"Platypus","product_name":"Platypus GravityWorks Filter System Bottle Kit - 2 Liter","long_description":"Platypus took the already fast and easy-to-use GravityWorks(TM) filter system and came up with this smaller and lighter 2-liter version to fill your water bottles on backcountry adventures. System includes a 2-liter dirty collection reservoir, GravityWorks filter cartridge, universal bottle adapter and hoses. Fill the dirty collection reservoir, hang it above your water bottle and let gravity carry the water through the filter and hoses-filtering water has never been so easy! Bottle adapter fits Platypus and most Nalgene, MSR, Sigg and Klean Kanteen bottles (sold separately); also attaches to most hydration reservoir shutoff valves and tubes. Hollow fiber filter technology offers a high flow rate of 1.5 liters per min. Filter physically removes particles, protozoa, and bacteria down to 0.2 microns in size, including giardia, salmonella, cryptosporidia and others. Unfiltered reservoir features a quick-disconnect valve that automatically shuts off the flow of water when hose is disconnected. Shutoff hose clamp on the clean water hose allows on-demand water control for filling bottles; clamp also shuts off the system when not in use. Clean the system by simply holding the filtered-water container above the unfiltered-water reservoir to backflush the filter. Taste-free reservoir and silicone hoses ensure great-tasting water. Platypus GravityWorks Filter System Bottle kit weighs only 9.5 oz.","short_description":"Platypus took the already fast and easy-to-use GravityWorks(TM) filter system and came up with this smaller and lighter 2-liter version to fill your water bottles on backcountry adventures.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426407.png","image_url":"http://i1.avlws.com/115/l426407.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426407&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426407\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426407.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849793&amp;link=&amp;tabs=-Details\"></script>","variants":{"8497930001":{"sku":"8497930001","vendor_sku":"06952","upc":"040818069523","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
