{"sku":"849753","manufacturer_id":"K-CARI 14 RED P","brand_name":"Eddyline","product_name":" Eddyline Caribbean 14 Sit-On-Top Kayak","long_description":"The obvious quality of the Eddyline Caribbean 14 sit-on-top kayak enhances the fun of being on the water. Hop in and get out there! Similar to its shorter 12 ft. relative, the Eddyline Caribbean 14 sit-on-top kayak features additional space for accessories and a slightly narrower body for covering distance. Lengthened cockpit suits large paddlers or those looking to carry lots of gear for day trips of fishing. Unique hull construction offers the looks and performance of a composite kayak with the durability of plastic. Named Carbonite 2000 by Eddyline, a co-extruded ABS laminate creates a hull that rivals the qualities of fiberglass. Plastic is first shaped into a 2-layer sheet with durable interior and an abrasion- and UV-resistant exterior. Sheet is then thermorformed into the hull of the kayak using very high temperatures and a vacuum. This 2-layer plastic laminate offers incredible stiffness and a hard, glossy appearance that resists abrasion and impact while remaining easy to repair. Gull wing hull configuration provides high initial stability without sacrificing its excellent tracking or efficient forward motion. High-backed adjustable seat provides additional comfort for longer paddling excursions. Removable seat includes fittings made from tough but lightweight plastic instead of the typical metal buckles that can scratch up your kayak. Multiple hatches provide access to interior space; flat and accessible mounting surfaces provide ample space for mounting accessories. Spacious tank well is configured for a milk crate or 5 gal. pail; forward end of the cockpit features a platform for box storage. Retractable carry handles, paddle holders on both sides and multiple flat spots for accessories are perfect finishing touches for a fully equipped kayak you can take anywhere.","short_description":"The obvious quality of the Eddyline Caribbean 14 sit-on-top kayak enhances the fun of being on the water. Hop in and get out there!","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s430663.png","image_url":"http://i1.avlws.com/115/l430663.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430663&tt=df","retail_price":"1679.00","sale_price":"1679.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430663\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430663.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849753&amp;link=&amp;tabs=-Details\"></script>","variants":{"8497530002":{"sku":"8497530002","vendor_sku":"K-CARI 14 RED P","upc":"610256851471","color":"RED/PEARL","retail_price":"1679.00","sale_price":"1679.00"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
