{"sku":"849756","manufacturer_id":"100029","brand_name":"Bic Sport","product_name":" BIC Sport ACE-TEC Wing Stand Up Paddleboard - 11'","long_description":"With a shape meant for speed and all the features of an easy-to-paddle, stable board, the BIC Sport ACE-TEC Wing 11 ft. stand up paddleboard creates a smooth experience in the water. A narrow, high-volume bow section helps cut through choppy water without losing speed; flat hull ensures smooth gliding and a slightly V-shape tail reduces drag. EPS foam core wrapped with an epoxy resin/fiberglass cloth is encased in a styrene polymer outer shell; this construction offers lightweight durability. Multiaxial fiberglass cloth distributes weight in multiple directions in the board, offering excellent stiffness and low weight. Recessed, padded deck supplies reliable wax-free traction when paddling in the standing or kneeling position and increases comfort on long paddles. 10 in. single fin promotes straight tracking in the water. FCS fin features injection-molded construction and a specialized structure on the inside face of the fin that reduces drag and enhances performance. Integrated carry handle on deck makes toting the 30 lb. BIC Sport ACE-TEC Wing 11 ft. stand up paddleboard quick and easy. Please note that the color of the deck pad on the tail of the board may be gray and not colored.","short_description":"With a shape meant for speed and all the features of an easy-to-paddle, stable board, the BIC Sport ACE-TEC Wing 11 ft. stand up paddleboard creates a smooth experience in the water.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430783.png","image_url":"http://i1.avlws.com/115/l430783.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430783&tt=df","retail_price":"1199.95","sale_price":"1199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430783\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430783.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849756&amp;link=&amp;tabs=-Details\"></script>","variants":{"8497560001":{"sku":"8497560001","vendor_sku":"100029","upc":"883667004723","color":"WHITE/BLUE","retail_price":"1199.95","sale_price":"1199.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
