{"sku":"849721","manufacturer_id":"RIVER ROVER","brand_name":"Lakeshore","product_name":" Lakeshore River Rover Stand Up Paddleboard - 14'","long_description":"Load up the Lakeshore Paddleboard Company River Rover stand up paddleboard with everything you need to escape to distant shores. The River Rover features a high weight capacity and multiple tie-downs and bungees-perfect for a long-distance down winder or extended tour. Vertically shaped front bow slices through the water in light chop, and front-displacement hull enhances performance on flatwater. Thick side rails increase stability, durability and buoyancy. 31 in. width and 325 lb. weight capacity make this board a great choice for exploration and discovery. EPS, epoxy, bamboo and fiberglass construction reduces weight, increases durability and creates high responsiveness; bamboo layer reinforces board strength. Comfortable deck pad offers traction and softness under your feet. Tie-down points and front and rear bungee cords transport accessories. Built-in carry handle built at the center of mass eases transport to the water. 2-way air vent reduces condensation and equalizes pressure due to temperature and elevation changes with a waterproof, breathable membrane. 11 in. fiberglass fin enhances tracking.","short_description":"Load up the Lakeshore Paddleboard Company River Rover stand up paddleboard with everything you need to escape to distant shores.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s452775.png","image_url":"http://i1.avlws.com/115/l452775.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=452775&tt=df","retail_price":"1549.00","sale_price":"1549.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=452775\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m452775.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849721&amp;link=&amp;tabs=-Details\"></script>","variants":{"8497210001":{"sku":"8497210001","vendor_sku":"RIVER ROVER","upc":"484972100010","color":"YELLOW/GRAY","retail_price":"1549.00","sale_price":"1549.00"}},"categories":["paddling","paddleboarding","paddleboards"]}
