{"sku":"849727","manufacturer_id":"ST129-1106-RF","brand_name":"Surftech","product_name":" Surftech Generator Stand Up Paddleboard - 11' 6\"","long_description":"The Surftech Generator 11 ft. 6 in. stand up paddleboard has sleek lines and a narrow shape to help it carve through rough waters as well as move efficiently through calm water on longer tours. The blend of surf and flatwater capabilities makes the Generator paddleboard perfect for paddlers who like the simplicity of having one board for all conditions. Surftech's AST technology features layers of glass and fiberglass with an extra layer of wood under the standing area for key structural reinforcement. Waterproof EPS core uses fused cell technology for a fully waterproof foam core that stays watertight even if you ding it up in the surf. Increased width and volume through the middle of the board makes stability a stand-out feature on the Generator 11 ft. 6 in. paddleboard. 11 ft. 6 in. length offers stability and a smooth ride through surf and on long flatwater tours. Tapered rails and tail are made for high manueverability when paddling in surf and whitewater. Integrated deck pad provides exceptional grip and reduces foot fatigue. Center fin and 2 side fins on the Surftech Generator 11 ft. 6 in. stand up paddleboard promote straight tracking in the water.","short_description":"The Surftech Generator 11 ft. 6 in. stand up paddleboard has sleek lines and a narrow shape to help it carve through rough waters as well as move efficiently through calm water on longer tours.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430779.png","image_url":"http://i1.avlws.com/115/l430779.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430779&tt=df","retail_price":"1000.00","sale_price":"1000.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430779\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430779.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849727&amp;link=&amp;tabs=-Details\"></script>","variants":{"8497270001":{"sku":"8497270001","vendor_sku":"ST129-1106-RF","upc":"816209017790","color":"BLUE","retail_price":"1000.00","sale_price":"1000.00"}}}
