{"sku":"849723","manufacturer_id":"WET WOODY SPORT","brand_name":"Lakeshore","product_name":" Lakeshore Wet Woody Sport Stand Up Paddleboard - 11' 6\"","long_description":"Perfect for fun and fitness, the Lakeshore Paddleboard Company Wet Woody Sport Stand Up Paddleboard cuts quickly through flatwater. Vertically shaped front bow slices through the water like the bow of a canoe, and front-displacement hull enhances performance on flatwater. Thick, squared rails increase stability, durability and buoyancy, and low rocker from tip to tail enhances glide. 30-in. width offers performance for any skill level. EPS, epoxy, bamboo and fiberglass construction reduces weight, increases durability and creates high responsiveness; bamboo layer reinforces board strength. Comfortable deck pad offers traction and softness under your feet. Tie-down points and front bungee cord let you carry accessories. 11 in. fiberglass fin enhances tracking. 2-way air vent reduces condensation and equalizes pressure due to temperature and elevation changes. Built-in carry handle built at the center of mass eases transport to the water; the Lakeshore Paddleboard Company Wet Woody Sport Stand Up Paddleboard weighs 27 lbs.","short_description":"Perfect for fun and fitness, the Lakeshore Paddleboard Company Wet Woody Sport Stand Up Paddleboard cuts quickly through flatwater.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s454051.png","image_url":"http://i1.avlws.com/115/l454051.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454051&tt=df","retail_price":"1349.00","sale_price":"1349.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454051\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454051.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849723&amp;link=&amp;tabs=-Details\"></script>","variants":{"8497230001":{"sku":"8497230001","vendor_sku":"WET WOODY SPORT","upc":"484972300014","color":"Wood/Gray/White","retail_price":"1349.00","sale_price":"1349.00"}}}
