{"sku":"849722","manufacturer_id":"BETTY BOARD","brand_name":"Lakeshore","product_name":" Lakeshore Betty Board Stand Up Paddleboard - 11' 6\"","long_description":"Weighing in at a scant 19 lbs., the Lakeshore Paddleboard Company Betty Board stand up paddleboard makes getting out for a quick paddle easy and fun. Lakeshore Paddleboard Company specializes in making boards which are meant for flatwater, and the Betty Board is no exception. Vertically shaped front bow slices through the water like the bow of a canoe, and front-displacement hull enhances performance on flatwater. Thick, squared rails increase stability, durability and buoyancy, and low rocker from tip to tail enhances glide. Light weight makes the Betty Board easy to get on and off your vehicle, and 11 ft. 6 in. length makes it very sporty and easy to maneuver on the water. 30 in. width offers stability that inspires confidence in beginner paddlers and offers pleasurable performance for any skill level. EPS and fiberglass sandwich outer shell and a hollow core reduce weight and create a highly responsive board that's easy to get to the water-board weighs only 19 lbs.! Comfortable deck pad offers traction and softness under your feet. Tie-down points and front bungee cord transport accessories. 11 in. fiberglass fin enhances tracking. 2-way air vent reduces condensation and equalizes pressure due to temperature and elevation changes with a waterproof, breathable membrane. Built-in carry handle built at the center of mass eases transport to the water.","short_description":"Weighing in at a scant 19 lbs., the Lakeshore Paddleboard Company Betty Board stand up paddleboard makes getting out for a quick paddle easy and fun.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s455579.png","image_url":"http://i1.avlws.com/115/l455579.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=455579&tt=df","retail_price":"1849.00","sale_price":"1849.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=455579\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m455579.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849722&amp;link=&amp;tabs=-Details\"></script>","variants":{"8497220001":{"sku":"8497220001","vendor_sku":"BETTY BOARD","upc":"484972200017","color":"SKY BLUE","retail_price":"1849.00","sale_price":"1849.00"}}}
