{"sku":"849998","manufacturer_id":"PEGV1.5","brand_name":"Npower","product_name":" nPower PEG Personal Energy Generator","long_description":"The nPower PEG personal energy generator captures and stores the kinetic energy created from walking, running and biking and uses it to recharge your mobile electronic devices. Slip the PEG into a pack, bag or purse and go about your usual activities; as you move, its 2,000 mAh lithium ion polymer battery charges. PEG can also be charged from a computer using the included USB cable. When you're moving, the PEG charges itself with out any additional effort on your part; when your device needs a charge, simply plug it into your PEG and press the button. Internal battery holds a full charge for up to 100 days sitting still; add movement and it will continue to stay charged even longer. If the battery is empty, vigorously shaking the PEG for 10 min. will give you enough power to make a short phone call from a dead phone. Comes with USB cable for charging from a computer, cable for connecting PEG to your device that needs to be charged and microUSB adapter tip. The nPower PEG personal energy generator is compatible with thousands of devices including phones, cameras, GPS, music players, game devices, eReaders, LED lights and radios. Note: this product is not compatible with laptops, netbooks or iPad(R) tablets.","short_description":"The nPower PEG personal energy generator captures and stores the kinetic energy created from walking, running and biking and uses it to recharge your mobile electronic devices.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Solar And Portable Power","thumb_url":"http://i1.avlws.com/115/s413155.png","image_url":"http://i1.avlws.com/115/l413155.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413155&tt=df","keywords":"charger,rechargeable batteries","retail_price":"129.95","sale_price":"96.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413155\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413155.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849998&amp;link=&amp;tabs=-Details\"></script>","variants":{"8499980001":{"sku":"8499980001","vendor_sku":"PEGV1.5","upc":"859954003007","color":"BLACK","retail_price":"96.93","sale_price":"96.93"}},"categories":["camping-hiking","camp-electronics","solar-and-portable-power"]}
