{"sku":"849965","manufacturer_id":"15220111","brand_name":"Pacsafe","product_name":" Pacsafe Camsafe Venture V16 Anti-theft Camera Slingpack","long_description":"The PacSafe CamSafe Venture V16 Anti-theft camera slingpack helps protect your SLR or DSLR camera and zoom lens from theft-and keeps them handy for that picture-perfect moment! Pack fabric and strap feature slashproof, high-tensile stainless-steel wire laminated between nylon to fend off cut-and-run thieves. Metal clip allows anchoring to a secure fixture. Tamperproof, lockable zippers prevent pickpockets from getting to the interior. Sling design and zippered side compartment offer quick access to your camera-simply swing the bag around and start taking pictures. Molded EVA back panel and adjustable, padded shoulder strap offer hour after hour of comfort. Removable, padded camera compartment features padded, modular, rip-and-stick dividers that let you customize the space. Roomy main compartment carries a jacket or travel gear; drawstring inner divider opens to transform it into a single 16-liter compartment. Zippered sleeve can hold a 13 in. MacBook or 3-liter hydration reservoir (sold separately). PacSafe CamSafe Venture V16 Anti-theft camera slingpack features a front organizer pocket, side water-bottle/tripod pocket, hideaway raincover and removable stabilizer strap.","short_description":"The PacSafe CamSafe Venture V16 Anti-theft camera slingpack helps protect your SLR or DSLR camera and zoom lens from theft-and keeps them handy for that picture-perfect moment!","category":"Electronics","subcategory":"Photography","product_group":"Camera Bags","thumb_url":"http://i1.avlws.com/115/s426879.png","image_url":"http://i1.avlws.com/115/l426879.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426879&tt=df","retail_price":"179.95","sale_price":"179.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426879\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426879.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=849965&amp;link=&amp;tabs=-Details\"></script>","variants":{"8499650002":{"sku":"8499650002","vendor_sku":"15220111","upc":"688334009342","color":"STORM GREY","retail_price":"179.95","sale_price":"179.95"}}}
