{"sku":"850028","manufacturer_id":"AE1041-Y","brand_name":"Advanced Elements","product_name":"Advanced Elements AirFusion Elite Kayak","long_description":"The Advanced Elements AirFusion(TM) Elite kayak performs comparably to a skin-on-frame kayak while offering a simplified set up. With a slightly wider footprint and speedier setup than the previous models, the AirFusion Elite increases stability in the water and offers a roomy, comfortable feel. Combination of aluminum alloy frame materials and high-pressure air tubes results in a rigid, high-performance inflatable kayak. PVC tarpaulin skin offers superb puncture resistance; welded seams ensure long life. Zippered access on bow and stern aids in setup and offers access to items stored below the deck, and rear roll-top hatch offers additional storage. Molded, low-profile rubber handles ease transport to the water; inflatable cockpit coaming offers easy attachment of optional sprayskirt (not included). Bungee deck lacing allows easy access to gear, and beverage pockets behind the seat offer thirst-quenching storage. D-ring gear tie-downs offer attachment points. Easy-to-use Boston valves and Twistlok(TM) valves are compatible with most pumps and speed setup time. Comes with a repair kit, instruction manual and a heavy-duty duffel storage bag. Do not under inflate your boat! Advanced Elements recommends inflate with a 12V electric pump, and then top off with a quality hand pump to get up to the recommended pressure.","short_description":"The Advanced Elements AirFusion(TM) Elite kayak performs comparably to a skin-on-frame kayak while offering a simplified set up.","category":"Paddling","subcategory":"Kayaks","product_group":"Inflatable Kayaks","thumb_url":"http://i1.avlws.com/115/s430539.png","image_url":"http://i1.avlws.com/115/l430539.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430539&tt=df","retail_price":"899.00","sale_price":"899.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430539\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430539.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850028&amp;link=&amp;tabs=-Details\"></script>","variants":{"8500280001":{"sku":"8500280001","vendor_sku":"AE1041-Y","upc":"832994001004","color":"YELLOW/GRAY","retail_price":"899.00","sale_price":"899.00"}},"categories":["paddling","kayaks","inflatable-kayaks"]}
