{"sku":"850071","manufacturer_id":"GDI-EGBT501","brand_name":"Ecoxgear","product_name":"ECOXGEAR ECOXBT Waterproof Bluetooth Speaker","long_description":"The ECOXGEAR ECOXBT speaker system brings together wireless and rechargeable convenience, a floating and waterproof design, and rugged and shock-resistant durability with rich, full-range sound. Dual 2 in. speakers crank out clear, dynamic sound. Easily stream and play music from an Bluetooth(R)-enabled smartphone or other audio device-and answer phone calls over the built-in microphone. An auxiliary-in jack on the back of the speaker provides the option of directly linking an audio device with a standard 3.5mm connection. Polycarbonate outer shell with a rubber overmold provides waterproofness, flotation and shock-resistant durability. Top panel features controls for power, Bluetooth, volume and speaker phone; LED indicators show statuses for power, Bluetooth pairing and recharging. Rechargeable lithium battery provides over 10 hrs. of playtime at a medium volume setting; battery recharges fully in approximately 2 hrs. The ECOXGEAR ECOXBT speaker system comes with a USB cord, USB-to-AC power adapter and a carabiner clip.","short_description":"The ECOXGEAR ECOXBT speaker system brings together wireless and rechargeable convenience, a floating and waterproof design, and rugged and shock-resistant durability with rich, full-range sound.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412795.png","image_url":"http://i1.avlws.com/115/l412795.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412795&tt=df","retail_price":"99.00","sale_price":"99.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412795\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412795.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850071&amp;link=&amp;tabs=-Details\"></script>","variants":{"8500710001":{"sku":"8500710001","vendor_sku":"GDI-EGBT501","upc":"819127010003","color":"BLACK","retail_price":"99.00","sale_price":"99.00"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
