{"sku":"850003","manufacturer_id":"20721-322","brand_name":"Mountain Equipment","product_name":" Mountain Equipment Helium 600 Sleeping Bag","long_description":"The Helium 600 down sleeping bag by Mountain Equipment showcases 50 years of experience in making down bags. They understand the needs of climbers and backpackers and it shows. Insulated with high-loft, premium 725-fill-power duck down for warmth, light weight and compressibility. Downproof and wind-resistant, the densely woven synthetic shell is light, compressible and tough; silky soft lining is also downproof and highly breathable. Durable Water Repellent finish on shell causes water to bead up and roll off. Ground-level side seams allow top layer to fully wrap around body and keeps draft tube in place, further helping prevent cold air from seeping through the zipper. Slant box wall baffle construction uses slanted walls for stability and thermal efficiency; construction keeps down from migrating, eliminating cold spots. 4-baffle trapezoid footbox is wide in toe area and narrow at the heels for comfort that does not compromise warmth. Protecting the head and neck, the hood features 5 baffles and an anatomic fit to provide warmth and low weight. Alpine Fit features a semi-tapered mummy profile with a tapered lower leg section to maximize warmth and minimize weight without restrictiveness. Single antisnag draft tube (along the 3/4 length zipper) and semi-floating neck collar drapes comfortably, blocking the escape of heat and sealing out drafts. Mountain Equipment Helium 600 sleeping bag comes with a lightweight stuff sack and mesh storage bag.","short_description":"The Helium 600 down sleeping bag by Mountain Equipment showcases 50 years of experience in making down bags. They understand the needs of climbers and backpackers and it shows.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421483.png","image_url":"http://i1.avlws.com/115/l421483.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421483&tt=df","keywords":"compact","retail_price":"340.00","sale_price":"340.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421483\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421483.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850003&amp;link=&amp;tabs=-Details\"></script>","variants":{"8500030001":{"sku":"8500030001","vendor_sku":"20721-322","size":"Regular Left","color":"LIGHT OCEAN/SHADOW GREY","retail_price":"310.00","sale_price":"310.00"},"8500030002":{"sku":"8500030002","vendor_sku":"20721-322","size":"Long Left","color":"LIGHT OCEAN/SHADOW GREY","retail_price":"340.00","sale_price":"340.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
