{"sku":"850177","manufacturer_id":"ML-LUMORA-BLUE","brand_name":"Uco","product_name":" UCO Lumora LED Lantern","long_description":"The collapsible UCO Lumora LED lantern doubles as a flashlight and outputs up to 180 lumens of diffused white light to brighten your campsite long after the sun goes down. The Lumora can be used as both a lantern and flashlight; simply slide the frosted globe up for lantern mode and down for flashlight mode. Bright XP-G R3 Cree LED shines a diffused white light on your campsite; outputs up to 180 lumens and projects a beam up to 75m (250 ft.). Hold down the on/off button to activate the dimmer switch and choose the brightness you need for the task at hand. Includes a hook for hanging the lantern at your campsite; lantern can also be attached to any tripod, walking stick or other device with a 1/4-20 mounting screw. 4 AA alkaline batteries (sold separately) provide up to 190 hrs. of use on low. Lantern collapses down to 5.5 in. tall for simple storage and transportation. Durable plastic base stands up to regular use in the outdoors; extendable feet add stability. UCO Lumora LED lantern has an IPX6 water resistance rating to ensure operation in inclement weather.","short_description":"The collapsible UCO Lumora LED lantern doubles as a flashlight and outputs up to 180 lumens of diffused white light to brighten your campsite long after the sun goes down.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Lanterns","thumb_url":"http://i1.avlws.com/115/s417375.png","image_url":"http://i1.avlws.com/115/l417375.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417375&tt=df","retail_price":"29.95","sale_price":"21.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417375\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417375.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850177&amp;link=&amp;tabs=-Details\"></script>","variants":{"8501770001":{"sku":"8501770001","vendor_sku":"ML-LUMORA-BLUE","upc":"054269000813","color":"BLUE","retail_price":"21.93","sale_price":"21.93"}},"categories":["camping-hiking","camp-lighting","lanterns"]}
