{"sku":"850155","manufacturer_id":"M-1121OR","brand_name":"Yuba","product_name":"Yuba Mundo Cargo Bike - 2014","long_description":"Fully outfitted with fenders, rack and kickstand, the Yuba Mundo is a sturdy workhorse, carrying cargo to and fro with ease. It's a great alternative means of transportation for errands or commutes. This edition of the Mundo includes extras that offer great value: includes utlity deck, fenders, rack, kickstand, front-tire stability spring for parking, and wheelskirts. Rear rack features smooth bamboo decking that small passengers can straddle and ride at low speeds. Steel runners along the base offer a convenient place for passenger's feet. Extended steel frame offers the strength, stiffness and stability necessary for hauling heavy loads-whether it's the kids, groceries or sweet flea market finds. Frame-integrated rear rack is extremely sturdy and offers plenty of lashing points for securing cargo; bamboo decking provides frame protection and load support. Frame and wheels are disc-brake ready for easy upgrading down the road; frame can also support a battery for an electric-assist upgrade (not included). Oversized, 2-legged kickstand provides plenty of stability and keeps the bike upright when loading passengers and cargo or parking the bike. Specialized spring mechanism called a \"Deflopilator\" keeps front tire from flopping around while bike is parked. Triple crankset is matched up with a 7-speed cassette to offer 21 cargo-hauling gear combinations to ease pedaling. Sturdy 26 in. wheels are built around stout hubs with 48-hole rear and 36-hole front lacing to ensure supportive, lasting performance carrying heavy loads over rough roads. Finer details include front and rear fenders, a cushy seat, swept-back handlebar and a bell to alert others to your presence. Also includes wheelskirts to keep shoelaces and loose clothing out of rear spokes if a passenger is sitting on rear rack. Please note: the Yuba Mundo cargo bike has an upper weight limit of 440 lbs. of rear cargo, plus the rider.","short_description":"Fully outfitted with fenders, rack and kickstand, the Yuba Mundo is a sturdy workhorse, carrying cargo to and fro with ease. It's a great alternative means of transportation for errands or commutes.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s458171.png","image_url":"http://i1.avlws.com/115/l458171.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458171&tt=df","retail_price":"1299.00","sale_price":"1299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458171\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458171.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850155&amp;link=&amp;tabs=-Details\"></script>","variants":{"8501550001":{"sku":"8501550001","vendor_sku":"M-1121BK","upc":"854923004016","color":"BLACK MATTE","retail_price":"1299.00","sale_price":"1299.00"},"8501550002":{"sku":"8501550002","vendor_sku":"M-1121OR","upc":"854923004047","color":"TANGERINE","retail_price":"1299.00","sale_price":"1299.00"},"8501550003":{"sku":"8501550003","vendor_sku":"M-1121BL","upc":"854923004054","color":"BLUE","retail_price":"1299.00","sale_price":"1299.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
