{"sku":"850259","manufacturer_id":"391","brand_name":"Sea To Summit","product_name":" Sea to Summit Rapid 26L DryPack","long_description":"The sleek Sea to Summit Rapid 26L DryPack bag helps keep your gear snug and dry while you enjoy water sports or other outdoor adventures in wet, rainy or snowy weather. Ventilated and perforated shoulder straps, removable waist strap, and ergonomic back panel provide breathability, comfort and load support. Waterproof roll-top closure features quick-release side straps that enhance the pack's svelte and streamlined shape; large top handle makes it easy to hoist the pack. Main compartment is lined with white fabric for improved visibility of contents. Easy-access hydration compartment accommodates reservoir and drink tube (sold separately). Internal zippered pocket keeps small items organized and accessible. Large external pocket on the front of the pack body features a water-resistant vertical zipper. Side stretch-mesh pockets hold water bottles or other small items. Hypalon front lash loop offers an attachment point for tools and gear. Durable, 7075 aircraft alloy buckles stand up to years of heavy use. The Sea to Summit Rapid 26L DryPack is made of 420-denier nylon with thermoplastic urethane lamination and fully sealed seams for complete waterproof protection.","short_description":"The sleek Sea to Summit Rapid 26L DryPack bag helps keep your gear snug and dry while you enjoy water sports or other outdoor adventures in wet, rainy or snowy weather.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s440679.png","image_url":"http://i1.avlws.com/115/l440679.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440679&tt=df","retail_price":"169.95","sale_price":"169.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440679\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440679.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850259&amp;link=&amp;tabs=-Details\"></script>","variants":{"8502590001":{"sku":"8502590001","vendor_sku":"391","color":"YELLOW","retail_price":"169.95","sale_price":"169.95"}},"categories":["camping-hiking","backpacks","day-packs"]}
