{"sku":"850449","manufacturer_id":"BF106MCITRRBK","brand_name":"Badfish","product_name":"Badfish MCIT Inflatable Stand Up Paddleboard - 10' 6\"","long_description":"Pushing the envelope to create a tougher, more maneuverable, and higher floating inflatable paddleboard, adventure-ready Badfish 10 ft. 6 in. MCIT is right at home in moving currents and swift waters. High air pressure and drop-stitch construction create a rigid hull without the use of frame parts; performance is suited to whitewater, flatwater and surf. PVC-coated, high-denier polyester stands up to heavy use. 10 ft. 6 in. length maneuvers well in waves and tracks well on flatwater; 35 in. width offers stability that's extremely friendly to beginners. MCIT stands for Multi Chamber Inflatable Technology, and it means that the designers can incorporate special features to enhance performance in roily, unpredictable currents. A unique feature in the world of inflatable SUPs, tapered rails enhance stability and make the board more maneuverable. Deck sits below the rail height to make the MCIT stand up paddleboard very stable in unpredictable currents. Stiffening system increases side-to-side response, and tough cone in the bow increases impact resistance. Deck pad reduces foot fatigue and provides a soft surface when kneeling on board. Center fin with 2 side-bite fins promotes stability; 7 in. center fin is removable if you want to paddle in shallow water. Forward deck bungee straps secure day-tripping accessories. The Badfish MCIT paddleboard packs into a durable backpack and includes a high-pressure, 2-way air pump with gauge, valve adaptors and repair kit.","short_description":"Pushing the envelope to create a tougher, more maneuverable, and higher floating inflatable paddleboard, adventure-ready Badfish 10 ft. 6 in. MCIT is right at home in moving currents and swift waters.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s456951.png","image_url":"http://i1.avlws.com/115/l456951.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456951&tt=df","retail_price":"1449.00","sale_price":"1449.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456951\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456951.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850449&amp;link=&amp;tabs=-Details\"></script>","variants":{"8504490001":{"sku":"8504490001","vendor_sku":"BF106MCITRRBK","upc":"848201007066","color":"RED","retail_price":"1449.00","sale_price":"1449.00"}},"categories":["paddling","paddleboarding","paddleboards"]}
