{"sku":"850584","manufacturer_id":"05995","brand_name":"Msr","product_name":" MSR Flex 3 System Cookset","long_description":"A complete cookset for a group of 3, the MSR Flex(TM) 3 System includes a full selection of nesting components that let you create and enjoy campsite delicacies. Take along the whole set for elaborate meals for 3 campers, or take just what you need for a light and fast journey. Cookset includes a 2.3-liter nonstick hard-anodized pot, 3.3-liter hard-anodized pot, 1 strainer lid, 3 polypropylene DeepDish(TM) plates, 3 insulated mugs and 1 pot handle. 2.3-liter aluminum pot features a nonstick finish that cleans up easily; hard-anodization boasts excellent durability and stick resistance. Brushed aluminum lid features an integrated strainer to eliminate the hassle of draining water from noodles or steamed vegetables. Talon(TM) pot handle attaches to and removes from both pots via exterior brackets, ensuring you don't scratch the inner surface. 3 DeepDish plates work well no matter what's on the menu, be it soup or pasta. 12.5 fl. oz. stainless-steel mugs have insulated sleeves to keep your drinks hot and easy to handle; include sip-through lids. Mugs and plates are color coded to prevent mixups. All components in the MSR Flex 3 System cookset nest within the 3.3-liter pot for efficient packing.","short_description":"A complete cookset for a group of 3, the MSR Flex(TM) 3 System includes a full selection of nesting components that let you create and enjoy campsite delicacies.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414927.png","image_url":"http://i1.avlws.com/115/l414927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414927&tt=df","keywords":"messkit","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850584&amp;link=&amp;tabs=-Details\"></script>","variants":{"8505840001":{"sku":"8505840001","vendor_sku":"05995","upc":"040818059951","retail_price":"129.95","sale_price":"129.95"}}}
