{"sku":"850585","manufacturer_id":"05996","brand_name":"Msr","product_name":" MSR Flex 4 Cookware System","long_description":"A complete cookset for a group of 4, the MSR Flex 4 System includes a full selection of nesting components that let you create and enjoy campsite delicacies. Take along the whole set for elaborate meals for 4 campers, or take just what you need for a light and fast journey. Includes a 3.2-liter nonstick hard-anodized pot, 5.3-liter hard-anodized pot, 2 strainer lids, 4 polypropylene DeepDish(TM) plates, 4 insulated mugs and a pot handle. Nonstick aluminum pot features a nonstick finish that cleans up easily; hard-anodization pot boasts excellent durability and stick resistance. Brushed aluminum lids feature integrated strainers to eliminate the hassle of draining water from noodles or steamed vegetables. Talon(TM) pot handle attaches to and removes from the 3.2-liter pot via exterior brackets, ensuring you don't scratch the inner surface. 5.3-liter pot has 2 built-in handles. 4 DeepDish plates work well no matter what's on the menu, be it soup or pasta. 12.5 oz. stainless-steel mugs have insulated sleeves to keep your drinks hot and easy to handle; include sip-through lids. Mugs and plates are color coded to prevent mixups. All components of the MSR Flex 4 System cookset nest within the 5.3-liter pot for efficient packing.","short_description":"A complete cookset for a group of 4, the MSR Flex 4 System includes a full selection of nesting components that let you create and enjoy campsite delicacies.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Cookware And Dinnerware","thumb_url":"http://i1.avlws.com/115/s414931.png","image_url":"http://i1.avlws.com/115/l414931.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=414931&tt=df","keywords":"messkit","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=414931\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m414931.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850585&amp;link=&amp;tabs=-Details\"></script>","variants":{"8505850001":{"sku":"8505850001","vendor_sku":"05996","upc":"040818059968","retail_price":"159.95","sale_price":"159.95"}}}
