{"sku":"850736","manufacturer_id":"X5DMB-HUVT","brand_name":"Inova","product_name":"Inova X5 UV Flashlight","long_description":"The Inova X5 UV flashlight emits ultraviolet light that can be used to detect counterfeit bills and IDs, and spot fluorescent dyes. It can even be used when hunting or investigating a crime scene. Features 5 high-powered 365 - 400 nanometer UV LEDs; UV light can also be used to cure adhesives, find leaks during vehicle repair, detect rodents and identify pottery repairs. Stainless-steel head with individual recessed reflectors protects the 5 LEDs while directing light. LEDs output 31 lumens on high and throws a beam up to 40m. Powered by 2 CR123A lithium batteries (included), the light runs for 17 hrs. 30 min. on high and 85 hrs. on low. Regulated output maintains consistent light output over the lifetime of the batteries. Aerospace-grade aluminum body with anodized finish stands up to regular use in the outdoors; body is shockproof, crushproof and water resistant. 3-position end-cap switch activates constant and momentary high and low settings, and lets you lock the light off to prevent accidental operation. Inova X5 UV flashlight provides IPX4 water resistance for reliability in inclement weather.","short_description":"The Inova X5 UV flashlight emits ultraviolet light that can be used to detect counterfeit bills and IDs, and spot fluorescent dyes. It can even be used when hunting or investigating a crime scene.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416835.png","image_url":"http://i1.avlws.com/115/l416835.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416835&tt=df","retail_price":"44.95","sale_price":"32.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416835\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416835.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850736&amp;link=&amp;tabs=-Details\"></script>","variants":{"8507360001":{"sku":"8507360001","vendor_sku":"X5DMB-HUVT","upc":"094664020016","color":"TITANIUM","retail_price":"32.93","sale_price":"32.93"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
