{"sku":"850735","manufacturer_id":"X3RDMA-HB","brand_name":"Inova","product_name":"Inova X3R USB Rechargable Flashlight","long_description":"Stop spending money on disposable batteries and pick up the Inova X3R USB Rechargeable flashlight. Its internal lithium battery recharges from any USB power source, saving you money in the long run. Recharge the built-in lithium-ion battery via any USB power source, such as a solar panel, computer or battery pack (all sold separately), using the included USB cable. High-quality LED outputs 227 lumens on high and throws a beam up to 151m; switch to low to conserve battery power and the light outputs 22 lumens. Light runs for 2 hrs. 45 min. on high and 41 hrs. on low. Regulated output maintains consistent light output over the lifetime of the batteries. Aerospace-grade aluminum body with anodized finish stands up to regular use in the outdoors; body is shockproof, crushproof and water resistant. 3-position end-cap switch activates constant and momentary high and low settings and lets you lock the light off to prevent accidental operation. Indicator light lets you know when the battery is fully charged. Inova X3R USB Rechargeable flashlight provides IPX4 water resistance for reliability in inclement weather.","short_description":"Stop spending money on disposable batteries and pick up the Inova X3R USB Rechargeable flashlight. Its internal lithium battery recharges from any USB power source, saving you money in the long run.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416831.png","image_url":"http://i1.avlws.com/115/l416831.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416831&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416831\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416831.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850735&amp;link=&amp;tabs=-Details\"></script>","variants":{"8507350001":{"sku":"8507350001","vendor_sku":"X3RDMA-HB","upc":"094664023505","color":"BLACK","retail_price":"89.95","sale_price":"89.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
