{"sku":"850714","manufacturer_id":"01.6820.1030","brand_name":"Old Town","product_name":"Old Town Dirigo 106 Kayak","long_description":"The Old Town Dirigo 106 kayak is all you need to get out on local waters and enjoy the paddle. The Old Town Dirigo 106 is perfect for casual paddlers looking to explore lakes, bays and gentle rivers, and it's a great boat to enhance and expand paddling skills. Short hull and 44 lb. weight is great for small paddlers who want a kayak that's easy to transport to the water and easy to control on the water. Crafted from super-durable, 3-layer polyethylene for affordability and a long life of easy care. Updated, high-gloss polyethylene compound maximizes distribution of plastic over the kayak mold for dependable strength and durability that stays lightweight and efficient. Stabil-form(TM) hull design delivers outstanding stability and speed with exceptional tracking for its length. Cushioned, adjustable seat offers comfort from launch to take-out, and a cup holder keeps hydration close at hand. Thigh pads and adjustable footbraces personalize the boat fit to enhance stability and control while paddling. Updated footbrace system is contoured to fit your feet, and clear position indicators let you know when the foot pegs are even. Small, \"glove box\" hatch stores cell phones, keys and wallet inside a sealed compartment; built-in cup holder also included. You won't have to question if your gear is protected because the stern hatch seals with an audible click, and a stern bulkhead helps keep contents dry. Bungee deck rigging at bow and stern secures extra gear on board; toggle carry handles offer convenient transport to and from the water. Safety perimeter line offers a handhold for re-entry in case of a wet exit. Paddle keeper holds paddle secure when taking pictures, birding or fishing.","short_description":"The Old Town Dirigo 106 kayak is all you need to get out on local waters and enjoy the paddle.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s460187.png","image_url":"http://i1.avlws.com/115/l460187.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460187&tt=df","retail_price":"599.95","sale_price":"599.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460187\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460187.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850714&amp;link=&amp;tabs=-Details\"></script>","variants":{"8507140001":{"sku":"8507140001","vendor_sku":"01.6820.1030","upc":"759239283462","color":"SUNRISE","retail_price":"599.95","sale_price":"599.95"}},"categories":["paddling","kayaks","recreational-kayaks"]}
