{"sku":"850718","manufacturer_id":"07.6400.7051","brand_name":"Ocean Kayak","product_name":" Ocean Kayak Prowler Big Game Angler Sit-On-Top Kayak","long_description":"We have no doubt that anglers will fall hook, line and sinker for the Ocean Kayak Prowler Big Game(TM) sit-on-top kayak; it's perfectly outfitted for reeling in the big one. Updated linear polyethylene compound maximizes distribution of plastic throughout the kayak mold for dependable strength and durability that stays lightweight and efficient. Hull design prioritizes stability; long center keel area aids tracking while the wide areas of the hull provide comfort and stability without compromising speed. Skid plate at rear of kayak increases durability. Large cockpit area with new, easily adjustable support track footbrace system uses clear indicators so you know each footbrace is the same length. 20 x 10.75 in. bow hatch stores extra gear away from splashes; open the hatch with an easy-to-use buckle and strap system. 2 flush mounted rod holders behind the seat offer an out-of-the-way, paddle-friendly position to store fishing rods. Aft tank well is large enough to hold live bait wells and tackle boxes. Includes self-bailing scupper holes, paddle keepers, cup holder, drain plug, reflective rigging, toggled bow and stern carry handles and side-mounted carry handles. The Prowler Big Game Angler uses up to 6 Scupper Stoppers (sold separately): 2 medium scuppers each in the foot and tank wells and 2 large scuppers in the seat well.","short_description":"We have no doubt that anglers will fall hook, line and sinker for the Ocean Kayak Prowler Big Game(TM) sit-on-top kayak; it's perfectly outfitted for reeling in the big one.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s430671.png","image_url":"http://i1.avlws.com/115/l430671.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430671&tt=df","retail_price":"979.95","sale_price":"832.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430671\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430671.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850718&amp;link=&amp;tabs=-Details\"></script>","variants":{"8507180001":{"sku":"8507180001","vendor_sku":"07.6400.7051","upc":"785978070308","color":"SAND","retail_price":"832.93","sale_price":"832.93"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
