{"sku":"850951","manufacturer_id":"9006XT","brand_name":"Thule","product_name":"Thule Gateway 2 Bike Trunk Rack","long_description":"The Thule Gateway 2 Bike Trunk rack carrier is better than ever for hauling up to 2 bikes with added security and cushion. Long, dual arching bike arms provide excellent clearance over rear spoilers; Thule Cinch Lever allows bike arms to adjust independently for unique bike frames. Rack comes with strong nylon attachment straps to secure the rack to your vehicle; molded rubber pads at contact points protect vehicle. Improved Hold Fast Cradles are shaped to cushion bike frames and feature Thermal Plastic Elastomer (TPE) road damping pads that absorb road vibrations to protect bikes. Anti-Sway Cages with integrated soft-touch TPE strips protect bike frame finishes and prevent bike-to-bike and bike-to-vehicle contact; reinforced rubber cradle straps. Easy-to-use, Thule-patented FitDial with QuickFit levers allows easy adjustment to your vehicle for quick, hassle-free installation. Bike arms are positioned to allow ample space between bikes, preventing bike-to-bike contact. Thule Gateway 2 Bike Trunk rack folds up flat for convenient storage when not in use. Not intended for tandem or recumbent bikes; carrying bikes with step-through frames requires the purchase of an adapter (sold separately).","short_description":"The Thule Gateway 2 Bike Trunk rack carrier is better than ever for hauling up to 2 bikes with added security and cushion.","category":"Car Racks","subcategory":"Bike Racks","product_group":"Trunk-Mounted Bike Racks","thumb_url":"http://i1.avlws.com/115/s380739.png","image_url":"http://i1.avlws.com/115/l380739.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380739&tt=df","keywords":"rear","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380739\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380739.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850951&amp;link=&amp;tabs=-Details\"></script>","variants":{"8509510001":{"sku":"8509510001","vendor_sku":"9006XT","upc":"091021647602","retail_price":"159.95","sale_price":"159.95"}},"categories":["car-racks","bike-racks","trunkmounted-bike-racks"]}
