{"sku":"850932","manufacturer_id":"6860005","brand_name":"Bell Plantation","product_name":"Bell Plantation PB2 Powdered Peanut Butter","long_description":"When mixed with water, Bell Plantation PB2 Powdered peanut butter has the same consistency and natural roasted peanut flavor as traditional peanut butter, but with nearly 85% fewer fat calories. Use PB2 powdered peanut butter as you would regular peanut butter-in a sandwich, on crackers or in oatmeal. It also works well in recipes calling for peanut butter, such as cookies, smoothies and spicy peanut sauces. Bell Plantation PB2 Powdered peanut butter is made with high-quality peanuts that are slow roasted and then pressed to remove the oil. All natural with no artificial flavors, sweeteners or preservatives. To prepare, mix 2 tablespoons of PB2 with 1 tablespoon of water and stir until smooth. Each packet weighs only 24g (0.85 oz.), so it's easy to carry one or more along on lightweight backpacking trips. Chocolate flavor blends roasted peanuts with cocoa powder for an extra tasty treat; works well in recipes that call for both chocolate and peanut butter. Original flavor consists of only roasted peanuts, sugar and salt. *Discount will be applied when you check out; offer not valid for sale-price items ending in $._3 or $._9.","short_description":"When mixed with water, Bell Plantation PB2 Powdered peanut butter has the same consistency and natural roasted peanut flavor as traditional peanut butter, but with nearly 85% fewer fat calories.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Food","thumb_url":"http://i1.avlws.com/115/s416111.png","image_url":"http://i1.avlws.com/115/l416111.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416111&tt=df","retail_price":"1.50","sale_price":"1.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416111\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416111.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=850932&amp;link=&amp;tabs=-Details\"></script>","variants":{"8509320001":{"sku":"8509320001","vendor_sku":"6860005","upc":"850791002116","color":"ORIGINAL","retail_price":"1.50","sale_price":"1.50"},"8509320002":{"sku":"8509320002","vendor_sku":"6860006","upc":"850791002123","color":"CHOCOLATE","retail_price":"1.50","sale_price":"1.50"}},"categories":["camping-hiking","camp-kitchen","food"]}
