{"sku":"851048","manufacturer_id":"612","brand_name":"Thule","product_name":"Thule Hyper XL Roof Box","long_description":"The new Thule Hyper XL roof box features a patented aerodynamic design for slicing through the air. In addition to reducing drag, box features a rugged design and extra features for convenience. Front of cargo box features a patented AeroNose design that is pointed so box cuts through the air, helping to reduce drag and noise. Rear of cargo box also features a patented rear-angled base design, helping to maximize trunk and hatch clearance. Reinforced ultra-thick lid and base for long-lasting, enduring use. Interior of cargo box features an integrated light that helps nighttime loading and unloading. Mounting system clicks when you reach the optimal hold, so you'll be on the road in seconds; can be mounted on square and round crossbars and most factory racks (see Fit List). Patented, dual-side openings let you access your gear from either side of the box. Locking system features an external lock-assist knob that is easy to use; built-in safety feature means the key can only be removed when the box is fully closed. User-friendly locking system includes an oversize key; a lock is located on each side of the box, and each lock comes with 2 keys. Thule Hyper XL roof box holds 6 - 8 pairs of skis or 4 - 6 snowboards.","short_description":"The new Thule Hyper XL roof box features a patented aerodynamic design for slicing through the air. In addition to reducing drag, box features a rugged design and extra features for convenience.","category":"Car Racks","subcategory":"Cargo Boxes, Baskets And Bags","product_group":"Roof Rack Boxes","thumb_url":"http://i1.avlws.com/115/s447471.png","image_url":"http://i1.avlws.com/115/l447471.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=447471&tt=df","retail_price":"959.95","sale_price":"959.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=447471\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m447471.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851048&amp;link=&amp;tabs=-Details\"></script>","variants":{"8510480001":{"sku":"8510480001","vendor_sku":"612","upc":"091021980723","color":"BLACK/SILVER","retail_price":"959.95","sale_price":"959.95"}},"categories":["car-racks","cargo-boxes-baskets-and-bags","roof-rack-boxes"]}
