{"sku":"851033","manufacturer_id":"SUP12-PM90V","brand_name":"Naish","product_name":"Naish Makani Vario RDS Adjustable Stand Up Paddle","long_description":"The Naish Makani Vario adjustable stand up paddle is designed for high-performance SUP riders who appreciate the finer nuances of a lightweight, responsive paddle. 8 in. blade is ideal for medium to light paddlers using a high-cadence stroke rate used during flatwater tours and racing. 8.5 in. blade is designed for medium to heavy paddlers using a mix between high-cadence stroke rates and power strokes for touring or surfing. 9 in. blade is designed for large paddlers who want the most power from every stroke; ideal for surfing and applications that focus on maneuverability. Carbon fiber and Kevlar(R) shaft provides an extremely lightweight, stiff and responsive connection to the water; shaft material also increases impact resistance. The Naish Makani Vario stand up paddle adjusts from 64 - 89 in. using an easy flip-open tab; flip open tab on ferrule, adjust length, and then close tab to lock down shaft. Adjustable length is ideal for switching between a long stroke when touring and a short stroke when surfing; also great for sharing with friends of differing heights. Vertical markings on the shaft help ensure you adjust the T-shaped handle in alignment with the blade, and horizontal markings adjust the length of the paddle. Fiberglass and carbon-fiber blade provides responsive power, and blade shape pulls smoothly through the water. Tough fiberglass edge protects the blade from impact with barnacles, rocks and other perils of the water. Hollow, T-shaped grip fits naturally in your hand and includes a coating that allows you to maintain your grip when wet.","short_description":"The Naish Makani Vario adjustable stand up paddle is designed for high-performance SUP riders who appreciate the finer nuances of a lightweight, responsive paddle.","category":"Paddling","subcategory":"Paddles","product_group":"Paddleboard Paddles","thumb_url":"http://i1.avlws.com/115/s431079.png","image_url":"http://i1.avlws.com/115/l431079.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431079&tt=df","retail_price":"299.00","sale_price":"238.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431079\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431079.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851033&amp;link=&amp;tabs=-Details\"></script>","variants":{"8510330001":{"sku":"8510330001","vendor_sku":"SUP12-PM80V","upc":"485103300019","size":"8","color":"WHITE/BLACK","retail_price":"238.93","sale_price":"238.93"},"8510330003":{"sku":"8510330003","vendor_sku":"SUP12-PM90V","upc":"485103300033","size":"9","color":"WHITE/BLACK","retail_price":"238.93","sale_price":"238.93"}},"categories":["paddling","paddles","paddleboard-paddles"]}
