{"sku":"851050","manufacturer_id":"634S","brand_name":"Thule","product_name":"Thule Sonic L Roof Box","long_description":"Slicing through the air like a hot knife through butter, the new Thule Sonic L roof box features a patented aerodynamic design and room to haul your gear for a weekend adventure or weekend errands. Front of cargo box features a patented AeroNose design that is pointed so box cuts through the air, helping to reduce drag and noise. Rear of cargo box also features a patented rear-angled base design, helping to maximize trunk and hatch clearance. Mounting system clicks when you reach the optimal hold, so you'll be on the road in seconds; can be mounted on square and round crossbars and most factory racks (see Fit List). Patented, dual-side openings let you access yoru gear from either side of the box. Locking system features an external lock-assist knob that is easy to use; built-in safety feature means the key can only be removed when the box is fully closed. User-friendly locking system includes an oversize key; a lock is located on each side of the box, and each lock comes with 2 keys. Thule Sonic L roof box holds 3 - 4 snowboards.","short_description":"Slicing through the air like a hot knife through butter, the new Thule Sonic L roof box features a patented aerodynamic design and room to haul your gear for a weekend adventure or weekend errands.","category":"Car Racks","subcategory":"Cargo Boxes, Baskets And Bags","product_group":"Roof Rack Boxes","thumb_url":"http://i1.avlws.com/115/s408227.png","image_url":"http://i1.avlws.com/115/l408227.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408227&tt=df","retail_price":"549.95","sale_price":"549.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408227\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408227.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851050&amp;link=&amp;tabs=-Details\"></script>","variants":{"8510500002":{"sku":"8510500002","vendor_sku":"634S","upc":"091021018617","color":"SILVER","retail_price":"549.95","sale_price":"549.95"}},"categories":["car-racks","cargo-boxes-baskets-and-bags","roof-rack-boxes"]}
