{"sku":"851001","manufacturer_id":"1517701456","brand_name":"Mountain Hardwear","product_name":"Mountain Hardwear Agami Daypack - Women's","long_description":"The women-specific Mountain Hardwear Agami daypack easily shifts from weekend trails to weekday commutes thanks to its shaped back panel, stable suspension and thoughtfully-designed pockets. Lightweight and strong framesheet is shaped to match the curve of your back and shape of your waist so the load remains stable and well balanced; the pack won't round out. Women-specific shoulder straps and fully padded back panel feature fast-wicking air mesh and strategically placed venting channels to keep you cooler. Large main compartment features a multipurpose sleeve that fits a 15 in. laptop or a hydration reservoir (sold separately). Secondary pocket features a sleeve for a tablet plus 2 zippered security pockets (1 mesh, 1 fabric). Large front pocket with stretch mesh panels and side compression straps is perfect for stashing shoes, a bike helmet, jacket or other gear. Mountain Hardwear Agami daypack has a fleece-lined top zip pocket for quick access to sunglasses or phone. Tuck-away waistbelt; adjustable sternum strap; stretch side pockets; front and back grab handles.","short_description":"The women-specific Mountain Hardwear Agami daypack easily shifts from weekend trails to weekday commutes thanks to its shaped back panel, stable suspension and thoughtfully-designed pockets.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s463855.png","image_url":"http://i1.avlws.com/115/l463855.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463855&tt=df","keywords":"backpack","retail_price":"99.00","sale_price":"99.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463855\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463855.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851001&amp;link=&amp;tabs=-Details\"></script>","variants":{"8510010002":{"sku":"8510010002","vendor_sku":"1517701456","upc":"786559909536","color":"BAY BLUE","retail_price":"99.00","sale_price":"99.00"}},"categories":["travel","day-bags-and-packs","travel-daypacks"]}
