{"sku":"851115","manufacturer_id":"176423","brand_name":"Electra","product_name":" Electra Hawaii 1 16'' Girls' Bike - 2014","long_description":"Send her off on her own with the fun and stable Electra Hawaii 1 16 in. bike. Great design details and a comfortable seat ensure an awesome start to a lifetime of biking. Sturdy steel frame withstands all sorts of abuse; metal chain cover and fenders help protect child from grime and moving parts. Floral graphics on the frame, fenders and chain guard suit a young lady's tastes; she'll find them on the spring-cushioned saddle as well. Low step-through frame accommodates a wide range of heights and makes mounting and dismounting the saddle quick and easy. Integrated coaster brake is both effective and intuitively simple to use-just have her pedal in reverse. With a single speed and coaster brakes, the child-size Hawaii is simplicity itself; there are no shifters or hand brakes to concern a new rider. Removable training wheels make learning easy and do wonders for a child's comfort level. Ergonomic saddle helps balance the child atop the bike in comfort; handlebar design accommodates an upright ride and enhances control. The Electra Hawaii 1 16 in. girls' bike features wide balloon tires that enhance stability and traction. Specs are subject to change.","short_description":"Send her off on her own with the fun and stable Electra Hawaii 1 16 in. bike. Great design details and a comfortable seat ensure an awesome start to a lifetime of biking.","category":"Cycling","subcategory":"Bikes","product_group":"Kids' Bikes","thumb_url":"http://i1.avlws.com/115/s376383.png","image_url":"http://i1.avlws.com/115/l376383.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376383&tt=df","retail_price":"239.00","sale_price":"239.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376383\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376383.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851115&amp;link=&amp;tabs=-Details\"></script>","variants":{"8511150001":{"sku":"8511150001","vendor_sku":"176423","upc":"846635022303","size":"16 IN","color":"PINK","retail_price":"239.00","sale_price":"239.00"}},"categories":["cycling","bikes","kids-bikes"]}
