{"sku":"851189","manufacturer_id":"00016249","brand_name":"Novara","product_name":"Novara Afterburner 2.0 Trailer Bike","long_description":"Hear the giggles and share the sights with your child with our Novara Afterburner 2.0 trailer bike. Quick to install, it lets you both enjoy the ride while you control the pace and keep them close. The single-speed Novara Afterburner folds quickly without tools to stow compactly in your car, garage or a closet. Afterburner 2.0 easily and securely mounts to the seatpost of an adult bike; the sturdy hitch adapts to a wide range of seatpost diameters. Adjusts easily to offer comfort and a good fit for kids of various sizes-simply move the seat up or down and angle the handlebars for best fit. Mud deflector helps protect child from any splashes coming off the adult-bike's wheel; full-length chainguard helps keep them and their clothing clean and out of the chain. High-tensile steel frame provides a sturdy, solid ride and the durability to last from one child to the next. For more fun, kids can pedal along at their leisure without hindering the adult pace; large platform pedals make it easy for small feet to stay in place. Includes bright orange safety flag and rod, increasing the visibility of you and your small rider. Please note: 75 lbs. max. weight capacity; measures approximately 53 in. long when folded, 74 in. when unfolded. Our Novara Afterburner 2.0 trailer bike is easily assembled upon arrival-just install the handlebars and pedals and you're ready to hook up and go!","short_description":"Hear the giggles and share the sights with your child with our Novara Afterburner 2.0 trailer bike. Quick to install, it lets you both enjoy the ride while you control the pace and keep them close.","category":"Cycling","subcategory":"Bikes","product_group":"Kids' Bikes","thumb_url":"http://i1.avlws.com/115/s376391.png","image_url":"http://i1.avlws.com/115/l376391.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376391&tt=df","keywords":"trsp123","retail_price":"249.00","sale_price":"249.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376391\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376391.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851189&amp;link=&amp;tabs=-Details\"></script>","variants":{"8511890001":{"sku":"8511890001","vendor_sku":"00016249","upc":"485118900013","color":"GRAY","retail_price":"249.00","sale_price":"249.00"}},"categories":["cycling","bikes","kids-bikes"]}
