{"sku":"851131","manufacturer_id":"159 375 528","brand_name":"Native Eyewear","product_name":" Native Eyewear Kodiak Reflex Polarized Sunglasses - Men's","long_description":"Protect your eyes from sun, snow, wind and everything else your eyes encounter with the Native Eyewear Kodiak Reflex polarized sunglasses. Includes 1 set of polarized Reflex lenses and 1 set of SportFlex(TM) lenses, for a total of 2 sets of lenses. Interchangeable lens system lets you switch out lenses to accommodate a variety of light conditions and activities. N3(TM) polarized Reflex lenses block 40% of infrared light (decreasing eye fatigue), offer blue light filtering and 100% UV protection to minimize haze and enhance clarity. Reflex lenses also reduce glare. Additional SportFlex orange-yellow lenses have a mirror coating suitable for a range of low lighting(TM)cloudy, overcast, dusk and dawn. Lenses and lightweight, yet durable frames are built to withstand a high-velocity impact. Frames endure extreme highs and lows in temperature. Self-adjusting nosepads and ear stems create a nonslip grip that keeps sunglasses in place, ensuring a soft feel and personalized fit. Temple ends hug behind your ears to keep sunglasses in place. Cam-action spring hinges quickly lock temples into position. Native Eyewear Kodiak Reflex interchangeable polarized sunglasses include a protective case and a soft pouch that doubles as a cleaning cloth. Frames best fit medium profiles.","short_description":"Protect your eyes from sun, snow, wind and everything else your eyes encounter with the Native Eyewear Kodiak Reflex polarized sunglasses.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423095.png","image_url":"http://i1.avlws.com/115/l423095.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423095&tt=df","keywords":"Cycling","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423095\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423095.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851131&amp;link=&amp;tabs=-Details\"></script>","variants":{"8511310001":{"sku":"8511310001","vendor_sku":"159 375 528","upc":"764824011481","size":"SILVER REFLEX","color":"CRYSTAL/WHITE","retail_price":"149.00","sale_price":"149.00"}}}
