{"sku":"851107","manufacturer_id":"610373584481","brand_name":"Piggyback Rider","product_name":"Piggyback Rider NOMIS Basic Stand Up Child Carrier","long_description":"Remember the joy of piggyback rides when you were young? The Piggyback Rider NOMIS Basic Stand Up child carrier lets you offer your kid the ultimate piggyback ride-with mutual comfort! Both you and your child will enjoy this innovative carrier's ease, comfort and height advantage; it enables hour after hour of quality time together in the great outdoors. It's ideal for hikes, walking tours, shopping, amusement parks, carnivals, sporting events, farmers' markets and anywhere else you and your youngster may roam. Carrier functions like a backpack, utilizing a shoulder-mounted foot bar that distributes a child's weight (up to 60 lbs.) at your core for a natural, upright walking position. Your little passenger stands comfortably on the wide, stable, tempered aluminum foot bar and holds on to the integrated grab handles; safety tether helps keep the child secure. Foot-bar height adjustment accommodates growing kids; textured standing surface on the foot bar offers surefooted grip. Simple, compact and portable design uses high-quality materials and integrated safety features for a hassle- and worry-free experience. Adjustable shoulder harness and a robust foam core provide lasting comfort; buckle on the sternum strap features a built-in whistle. The Piggyback Rider NOMIS Basic Stand Up child carrier features a cell-phone pocket on the right shoulder strap and a rear zip pocket that stores small essentials.","short_description":"Remember the joy of piggyback rides when you were young? The Piggyback Rider NOMIS Basic Stand Up child carrier lets you offer your kid the ultimate piggyback ride-with mutual comfort!","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Baby Carrier Packs","thumb_url":"http://i1.avlws.com/115/s410355.png","image_url":"http://i1.avlws.com/115/l410355.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410355&tt=df","retail_price":"90.00","sale_price":"62.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410355\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410355.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851107&amp;link=&amp;tabs=-Details\"></script>","variants":{"8511070001":{"sku":"8511070001","vendor_sku":"610373584481","upc":"610373584481","color":"ORANGE/GRAY","retail_price":"62.93","sale_price":"62.93"}},"categories":["camping-hiking","backpacks","baby-carrier-packs"]}
