{"sku":"851150","manufacturer_id":"154141","brand_name":"Electra","product_name":"Electra Gypsy 3i Women's Bike - 2014","long_description":"Wander freely and comfortably aboard this Electra Gypsy 3i women's cruiser bike, which boasts a handlebar basket and cute style for any occasion. Flat Foot Technology(TM) geometry offers a relaxed, efficient pedaling position that also allows you to easily and comfortably put both feet down on the ground when stopped. Aluminum frame is resilient and is adorned with fun graphics; step-through design makes mounting and dismounting the bike quick and easy. Shimano Nexus 3-speed internally geared rear hub with coaster brake offers silky-smooth shifting and low-maintenance stopping power. Easy-shifting twist shifter and comfortable ergonomic hand grips add cruising convenience and comfort. The painted-to-match chain cover and front and rear fenders prevent splashes and road grit from covering your clothing; saddle and grips complement the graphics. Included front basket makes a great place to stash your essentials or carry home the bounties of a farmer's market. Platform pedals are compatible with most types of footwear-just hop on and go! Keep other cyclists and pedestrians apprised of your presence with the handlebar-mounted bell. One size fits most. Specs on the Electra Gypsy 3i women's cruiser bike are subject to change.","short_description":"Wander freely and comfortably aboard this Electra Gypsy 3i women's cruiser bike, which boasts a handlebar basket and cute style for any occasion.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378423.png","image_url":"http://i1.avlws.com/115/l378423.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378423&tt=df","keywords":"beach","retail_price":"699.00","sale_price":"699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378423\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378423.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851150&amp;link=&amp;tabs=-Details\"></script>","variants":{"8511500001":{"sku":"8511500001","vendor_sku":"154141","upc":"846635021207","color":"FOREST GREEN","retail_price":"699.00","sale_price":"699.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
