{"sku":"851248","manufacturer_id":"261-11D","brand_name":"Maui Jim","product_name":"Maui Jim Surf Rider Polarized Sunglasses - Men's","long_description":"The Maui Jim Surf Rider polarized sunglasses are inspired by surfing, and are equally at home catching waves or commuting to your favorite beach. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Maui Jim PolarizedPlus(R)2 technology blocks glare and UV rays from all angles; manages harmful blue light and boosts colors for clarity and contrast. Tortoise frame option features HCL(R) Bronze lenses, ideal for variable conditions from sun to overcast. Grey black stripe frame option features neutral grey lenses, ideal for bright, direct sunlight days. Glass lenses offer amazing optical clarity and are scratch resistant. Lightweight nylon frames offer a consistent fit and flexibility at any temperature, and they are extremely impact resistant. Frame shape is ideal for oval, round, square, pear and diamond face shapes. Built-in silicone nose pads prevent slippage. Includes a protective case and cleaning cloth.","short_description":"The Maui Jim Surf Rider polarized sunglasses are inspired by surfing, and are equally at home catching waves or commuting to your favorite beach.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423155.png","image_url":"http://i1.avlws.com/115/l423155.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423155&tt=df","keywords":"Cycling","retail_price":"219.00","sale_price":"219.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423155\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423155.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851248&amp;link=&amp;tabs=-Details\"></script>","variants":{"8512480001":{"sku":"8512480001","vendor_sku":"261-11D","upc":"603429024031","size":"NEUTRAL GREY","color":"GREY BLACK STRIPE","retail_price":"219.00","sale_price":"219.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
