{"sku":"851249","manufacturer_id":"259-11","brand_name":"Maui Jim","product_name":" Maui Jim Dorado Polarized Sunglasses - Men's","long_description":"Named for the dolphinfish and meaning very strong, the Dorado polarized sunglasses from Maui Jim are built to last. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Maui Jim PolarizedPlus(R)2 technology blocks glare and UV rays from all angles; manages harmful blue light and boosts colors for clarity and contrast. Matte black frame option features Maui HT(TM) high transmission lenses for times when most lenses would be too dark-they offer great contrast and definition. Translucent dark grey frame option features neutral grey lenses, ideal for bright, direct sunlight days. Evolution(R) lenses fuse the best properties of glass and polycarbonate, giving you an extremely lightweight, impact- and scratch-resistant lens. CLEARSHELL(R) scratch coating offers added durability. Lightweight nylon frames offer a consistent fit and flexibility at any temperature, and they are extremely impact resistant. Frame shape is ideal for those with larger heads and facial features. Lenses and frames are treated for use in saltwater. Built-in silicone nose pads prevent slippage. Maui Jim Dorado polarized sunglasses come with a protective case and cleaning cloth.","short_description":"Named for the dolphinfish and meaning very strong, the Dorado polarized sunglasses from Maui Jim are built to last.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423159.png","image_url":"http://i1.avlws.com/115/l423159.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423159&tt=df","keywords":"Cycling","retail_price":"249.00","sale_price":"249.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423159\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423159.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851249&amp;link=&amp;tabs=-Details\"></script>","variants":{"8512490001":{"sku":"8512490001","vendor_sku":"HT259-2M","upc":"603429024048","size":"MAUI HT","color":"MATTE BLACK","retail_price":"249.00","sale_price":"249.00"},"8512490002":{"sku":"8512490002","vendor_sku":"259-11","upc":"603429024062","size":"NEUTRAL GREY","color":"TRANSLUCENT DK GREY","retail_price":"249.00","sale_price":"249.00"}}}
