{"sku":"851286","manufacturer_id":"1060100101","brand_name":"Tifosi","product_name":"Tifosi Slip Asian Fit Interchangable Sunglasses - Men's","long_description":"The Tifosi Slip Asian Fit interchangable sunglasses feature a narrowed nose pad that fits higher on the face, and abbreviated lens curvature that clears the cheeks and temples for a great fit. Frame includes 3 sets of lenses (gray, red and clear tints) that accommodate bright light, low-medium light and nighttime conditions. Lightweight and virtually shatterproof, polycarbonate lenses are 20 times more impact-resistant than glass and one-third the weight. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Adjustable, hydrophilic rubber nosepieces and temple ends become tackier when wet for reliable grip during exercise and hot weather. Glare Guard(TM) reflective lens coating reduces glare and decreases eye fatigue. Ventilated lenses increase airflow to reduce fogging. Fit small to large faces. Tifosi Slip Asian Fit interchangable sunglasses come with a hardshell zippered case and cleaning cloth.","short_description":"The Tifosi Slip Asian Fit interchangable sunglasses feature a narrowed nose pad that fits higher on the face, and abbreviated lens curvature that clears the cheeks and temples for a great fit.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423183.png","image_url":"http://i1.avlws.com/115/l423183.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423183&tt=df","keywords":"Cycling","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423183\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423183.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851286&amp;link=&amp;tabs=-Details\"></script>","variants":{"8512860001":{"sku":"8512860001","vendor_sku":"1060100101","upc":"848869001376","size":"SMOKE","color":"MATTE BLACK","retail_price":"59.95","sale_price":"59.95"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
