{"sku":"851285","manufacturer_id":"1030600160","brand_name":"Tifosi","product_name":" Tifosi Duro Polarized Fototec Photochromic Sunglasses - Men's","long_description":"TheTifosi Duro Polarized Fototec(TM) Photochromic sunglasses combine glare-reducing properties and variable tint, keeping you covered whether hiking, skiing or kayaking. Fototec lenses automatically adjust tint according to light conditions; lenses darken in bright light and lighten in dim conditions. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Lightweight and virtually shatterproof, polycarbonate lenses are 20 times more impact-resistant than glass and one-third the weight. Ventilated lenses increase airflow to help eliminate fogging. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit, flexibility and impact-resistance in all temperatures. Hydrophilic rubber nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. Interchangeable design allows you to swap out lenses when the lighting changes (additional lenses not included). Fits medium to large faces. Tifosi Duro Polarized Fototec Photochromic sunglasses include a semirigid zippered storage case and cleaning cloth.","short_description":"TheTifosi Duro Polarized Fototec(TM) Photochromic sunglasses combine glare-reducing properties and variable tint, keeping you covered whether hiking, skiing or kayaking.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423179.png","image_url":"http://i1.avlws.com/115/l423179.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423179&tt=df","keywords":"Cycling","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423179\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423179.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851285&amp;link=&amp;tabs=-Details\"></script>","variants":{"8512850001":{"sku":"8512850001","vendor_sku":"1030600160","upc":"848869000201","size":"BROWN POLARIZED","color":"MATTE BLACK","retail_price":"99.95","sale_price":"99.95"}}}
