{"sku":"851363","manufacturer_id":"49340","brand_name":"Patagonia","product_name":"Patagonia Black Hole Duffel - 60L","long_description":"The Patagonia Black Hole 60L duffel is a highly water resistant and highly durable duffel designed to carry your gear to faraway places. This size includes shoulder straps as a carrying option. The burly 60L Black Hole duffel protects your gear from rain, rough handling and miles of traveling abuse; it's inspired by the simple utility of shipping containers on trains. Made from waterproof fabric with water-resistant construction and zippers; seams are not sealed. U-shaped lid allows quick access to the main compartment, while 2 zippered internal mesh pockets keeps small items organized. Padded bottom panel adds structure and cushions the load when your duffel gets tossed around by baggage handlers. Carrying options include removable, padded and adjustable shoulder straps, handles with a snap closure and end haul-handles. 4 corner-mounted webbing daisy chains facilitate hauling and tying down big loads, and let you lash additional gear to the outside. Exterior zip pocket holds the stuff you need to access quickly. Fabric detail: 14.7-oz. 1200-denier polyester (50% solution-dyed) with a TPU-film laminate and Durable Water Repellent finish.","short_description":"The Patagonia Black Hole 60L duffel is a highly water resistant and highly durable duffel designed to carry your gear to faraway places. This size includes shoulder straps as a carrying option.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Duffel Bags","thumb_url":"http://i1.avlws.com/115/s273999.png","image_url":"http://i1.avlws.com/115/l273999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=273999&tt=df","keywords":"duffel bag,gear bag","retail_price":"119.00","sale_price":"119.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=273999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m273999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851363&amp;link=&amp;tabs=-Details\"></script>","variants":{"8513630007":{"sku":"8513630007","vendor_sku":"49340","upc":"887187219711","color":"WAX RED","retail_price":"119.00","sale_price":"119.00"}}}
