{"sku":"851552","manufacturer_id":"ML-ARKA","brand_name":"Uco","product_name":"UCO Arka LED Rechargeable Lantern","long_description":"The powerful little UCO Arka LED rechargeable lantern doubles as a flashlight and can also be used to recharge your USB devices, such as a cell phone, camera or GPS. High-quality Cree XP-G R3 LED provides adjustable brightness up to 180 lumens to illuminate your campsite. Slide the frosted globe up to diffuse the light for use as a lantern or slide it down for use as a flashlight; throws a beam up to 75m (250 ft.) when used as a flashlight. Built-in, rechargeable 4AH lithium-ion battery doubles as a charging station for your USB devices, such as a phone, camera, flashlight or GPS (sold separately). Recharge the lantern battery using the included 100 - 240V charger and USB cable; recharge your devices using their respective USB cables. 3 red LEDs can be used to help preserve your night vision or signal for help. Glow-in-the-dark on/off switch makes the lantern simple to find and operate at night. LED indicator light displays the battery level and the charging status. Use the convenient split ring on top to easily hang the lantern inside your tent. Legs fold out to make the lantern more stable on the ground or picnic table. UCO Akra LED rechargeable lantern has an IPX6 water-resistance rating to ensure operation in inclement weather.","short_description":"The powerful little UCO Arka LED rechargeable lantern doubles as a flashlight and can also be used to recharge your USB devices, such as a cell phone, camera or GPS.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Lanterns","thumb_url":"http://i1.avlws.com/115/s417383.png","image_url":"http://i1.avlws.com/115/l417383.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417383&tt=df","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417383\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417383.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851552&amp;link=&amp;tabs=-Details\"></script>","variants":{"8515520001":{"sku":"8515520001","vendor_sku":"ML-ARKA","upc":"054269000912","color":"RED","retail_price":"69.95","sale_price":"69.95"}},"categories":["camping-hiking","camp-lighting","lanterns"]}
