{"sku":"851521","manufacturer_id":"9043","brand_name":"Thule","product_name":"Thule Helium Aero 3 Bike Hitch Rack","long_description":"Weighing only 19 lbs., the Thule Helium Aero 3-Bike Hitch Rack carries 3 bikes and features lightweight, durable aluminum that's easy to handle when installing and removing. Sleek aero design improves ground clearance and increases distance between bikes for protection. Tilt-down design with Hitch Switch(TM) quick-release lever allows arms to fold down when not in use and tilts carrier away from vehicle for fast rear vehicle access. Hold Fast Cradles(TM) are shaped to cushion bike frames and feature Thermal Plastic Elastomer road damping pads that absorb road forces and vibration to protect bikes. Anti-Sway Cages with integrated soft-touch TPE strips protect bike frame finishes and prevent bike-to-bike and bike-to-vehicle contact; reinforced rubber cradle straps. Thule Helium Aero accommodates both 2 in. and 1.25 in. receiver hitches with included hitch adapter. Integrated locking cable and AutoAttach lock knob lock the bike to carrier and carrier to vehicle; bike cable stores in rack's support arms. Easy mounting of hitch rack requires no tools; push rack into receiver until auto-pin engages, tighten knob and lock the hood of the housing. Not intended for tandem or recumbent bikes; carrying bikes with step-through frames requires the purchase of an adapter (sold separately).","short_description":"Weighing only 19 lbs., the Thule Helium Aero 3-Bike Hitch Rack carries 3 bikes and features lightweight, durable aluminum that's easy to handle when installing and removing.","category":"Car Racks","subcategory":"Bike Racks","product_group":"Trailer Hitch Bike Racks","thumb_url":"http://i1.avlws.com/115/s317157.png","image_url":"http://i1.avlws.com/115/l317157.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=317157&tt=df","keywords":"mount,hitch-mount,rear","retail_price":"389.95","sale_price":"389.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=317157\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m317157.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851521&amp;link=&amp;tabs=-Details\"></script>","variants":{"8515210001":{"sku":"8515210001","vendor_sku":"9043","upc":"091021512993","retail_price":"389.95","sale_price":"389.95"}},"categories":["car-racks","bike-racks","trailer-hitch-bike-racks"]}
