{"sku":"851659","manufacturer_id":"4418014","brand_name":"Julbo","product_name":" Julbo Swell Photochromic Sunglasses - Men's","long_description":"The Julbo Swell photochromic sunglasses are awesome for paddleboarding, kayaking or sailing-they help keep your eyes protected from the sun's harsh rays while you're out playing on the water. Octopus(R) photochromic lenses are designed specifically for water sports and feature an external hydrophobic coating to shed water for improved visibility. Lenses lighten and darken according to the light intensity, regardless of temperature. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Optical polymer lenses are lightweight and virtually shatterproof. Lightweight nylon frame wraps close around your face for excellent peripheral protection. Adjustable, shockproof nose and temple pads become tacky as you perspire, further helping keep eyewear in place. Floating frame and adjustable neckcord greatly reduce the chance you'll lose the Julbo Swell sunglasses while at play. The Julbo Swell photochromic sunglasses come with a protective hard case.","short_description":"The Julbo Swell photochromic sunglasses are awesome for paddleboarding, kayaking or sailing-they help keep your eyes protected from the sun's harsh rays while you're out playing on the water.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423235.png","image_url":"http://i1.avlws.com/115/l423235.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423235&tt=df","keywords":"Cycling","retail_price":"180.00","sale_price":"180.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423235\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423235.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851659&amp;link=&amp;tabs=-Details\"></script>","variants":{"8516590001":{"sku":"8516590001","vendor_sku":"4418014","size":"OCTOPUS PHOTOCHROMIC","color":"BLACK/ORANGE","retail_price":"180.00","sale_price":"180.00"}}}
