{"sku":"851722","manufacturer_id":"63009904","brand_name":"Topeak","product_name":" Topeak Air BackPack Cycling Backpack","long_description":"The lightweight Topeak Air BackPack bike backpack has a clever inflatable back panel and waistbelt for custom comfort on your ride. Included hydration reservoir lets you quench your thirst on the way. Back panel and waistbelt have air chambers that can be filled with air to suit your comfort and support needs; removable pump lets you quickly inflate or deflate chambers. With air instead of metal or plastic as the support system, the pack is impressively lightweight and allows for compact storage when deflated. Lightweight yet rugged ballistic nylon stands up to regular use; pack features a low-profile, formfitting shape. Top-loading, separate hydration compartment holds the included 70 fl. oz. reservoir, letting you easily bring water along for the ride. Main compartment opens wide for fast, easy access to contents; additional smaller pockets help keep on-the-go essentials organized and easy to grab. Internal gear organizer has numerous pockets to secure a pump, tools, tubes, snacks and more in an orderly, easily accesible fashion; can be removed when more space is needed. Integrated raincover helps protect pack if you get caught in unexpected wet weather. Secure your helmet when you're off of the bike with the included helmet holder, which tidily stows away when it's not needed. Topeak Air BackPack cycling backpack can be packed away in its own bag for compact storage or transport.","short_description":"The lightweight Topeak Air BackPack bike backpack has a clever inflatable back panel and waistbelt for custom comfort on your ride. Included hydration reservoir lets you quench your thirst on the way.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411835.png","image_url":"http://i1.avlws.com/115/l411835.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411835&tt=df","keywords":"day packs","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411835\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411835.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851722&amp;link=&amp;tabs=-Details\"></script>","variants":{"8517220001":{"sku":"8517220001","vendor_sku":"63009904","upc":"883466003880","size":"L","color":"BLACK","retail_price":"149.95","sale_price":"149.95"},"8517220002":{"sku":"8517220002","vendor_sku":"63009904M","upc":"883466004078","size":"M","color":"BLACK","retail_price":"149.95","sale_price":"149.95"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
