{"sku":"851868","manufacturer_id":"RP-BK","brand_name":"Princeton Tec","product_name":" Princeton Tec Reef Pack Flashlight Set","long_description":"The Princeton Tec Reef pack is your lighting solution for exploring the underwater landscapes of the Florida Keys or the coast of Australia. Use the Miniwave(R) LED as your primary dive light on underwater explorations; 3 Maxbright LEDs output 390 lumens on high to light up dark areas. LEDs throw a bright, broad beam up to 145m on high and 113m on low. 4 C alkaline batteries (included) power the Miniwave for 4 hrs. on high and 10 hrs. on low. League(R) 100 back-up dive light has 1 Maxbright LED that outputs 210 lumens; LED throws a beam up to 181m. Large switch is easy to operate, even with gloves on; locking switch keeps the light turned off when it's in your bag and on when it's in use. 4 AA alkaline batteries (included) provide up to 10 hrs. of use on high. Tiny Amp(R) 1LC includes a snap-on cone to convert the flashlight into a marker light. 1 Maxbright LED outputs 45 lumens; light is visible from up to 58m away. Use the large loop to attach the flashlight to your pack with a carabiner (sold separately); loop doubles as a bottle opener. 2 AAA alkaline batteries (included) power the Amp 1LC for 72 hrs. Information on the Specs tab is based on the Miniwave LED dive light; specifications for the League 100 and Amp 1LC are listed below.","short_description":"The Princeton Tec Reef pack is your lighting solution for exploring the underwater landscapes of the Florida Keys or the coast of Australia.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416843.png","image_url":"http://i1.avlws.com/115/l416843.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416843&tt=df","retail_price":"169.95","sale_price":"126.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416843\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416843.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851868&amp;link=&amp;tabs=-Details\"></script>","variants":{"8518680001":{"sku":"8518680001","vendor_sku":"RP-BK","upc":"795626020142","color":"BLACK","retail_price":"126.93","sale_price":"126.93"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
