{"sku":"851860","manufacturer_id":"943301","brand_name":"Burley","product_name":" Burley Cub Bike Trailer","long_description":"For family outings that venture off the beaten path, the Burley Cub bike trailer provides hard-bottomed protection and an adjustable suspension to make sure your little passengers have a smooth ride. Trailer has a hard-bottomed, double-walled molded base that adds durability and protection, making it great for use over changing terrain, from roads to gravel paths and more. Reclining seats accommodate 1 or 2 children; removable, washable seat pad and shoulder straps offer comfort for the kids and easy clean-up for the adults. 5-point harness system with padded shoulder straps keeps kids secure. Recessed helmet pocket lets helmeted children move their heads around, or sleep, comfortably. Interior pocket stashes their travel necessities, such as toys or snacks. Convenient weather-resistant cover shields little ones from the elements; also includes retractable sunshield. Tinted side windows are UV protected and offer great visibility, whether looking in or out. Trailer frame is made with light, strong aluminum tubes and features a full internal roll cage for enhanced safety. Included tow arm and hitch installs quickly and makes it easy to tow the Cub behind your bicycle. Features 20 in. quick-release wheels that can be attached and detached with the push of a button. Adjustable suspension system keeps the kids comfortable by softening bumps, jostles and shimmies. Wheel guards on the trailer's frame keep the trailer wheels from coming into contact with obstacles. Rear cargo area stores extra gear, toys or groceries. Reflective materials, wheel reflectors and a safety flag enhance visibility of trailer. Convert your Burley Cub trailer to a stroller with the Stroller accessory kit, sold separately. Includes a height-adjustable, padded handlebar and a parking brake for convenient conversion to a stroller when accessory kit is added. Trailer can be folded down quickly for storage and transport.","short_description":"For family outings that venture off the beaten path, the Burley Cub bike trailer provides hard-bottomed protection and an adjustable suspension to make sure your little passengers have a smooth ride.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trailers","thumb_url":"http://i1.avlws.com/115/s376795.png","image_url":"http://i1.avlws.com/115/l376795.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376795&tt=df","keywords":"baby,trsp123","retail_price":"629.00","sale_price":"629.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376795\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376795.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851860&amp;link=&amp;tabs=-Details\"></script>","variants":{"8518600001":{"sku":"8518600001","vendor_sku":"943301","upc":"840840007292","color":"YELLOW","retail_price":"629.00","sale_price":"629.00"}}}
