{"sku":"851984","manufacturer_id":"SO923-001","brand_name":"Smartwool","product_name":" SmartWool PhD Run Divide Jacket - Men's","long_description":"You don't need an advanced degree to recognize the advantages of working out in the men's SmartWool PhD Run Divide jacket. It uses windproof panels to hold on to your heat when its cold outside. Merino wool and nylon blend helps maintain a comfortable temperature when you're on the move, wicking moisture to keep you comfortable without a chill. Windproof panels at front of jacket and arms boost protection to prevent chilling wind from sapping your energy. Smartwool items are naturally antimicrobial, preventing the funk traditionally associated with standard workout wear. Full-length zipper with draft flap and zipper guard ventilates instantly to keep you cool when you heat up during activity. Secure zippered pocket features a cord port that works with your media player. Flatlock seam construction reduces chafing; low-profile, on-seam thumbholes allow sleeves to extend over top of hands for warmth. Reflictive logos are visible from any angle. Unlike traditional wool, SmartWool items do not itch and can be repeatedly machine washed and dried without shrinking. The men's SmartWool PhD Run Divide jacket is semifitted.","short_description":"You don't need an advanced degree to recognize the advantages of working out in the men's SmartWool PhD Run Divide jacket. It uses windproof panels to hold on to your heat when its cold outside.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Running Jackets","thumb_url":"http://i1.avlws.com/115/s402287.png","image_url":"http://i1.avlws.com/115/l402287.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=402287&tt=df","retail_price":"200.00","sale_price":"139.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=402287\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m402287.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=851984&amp;link=&amp;tabs=-Details\"></script>","variants":{"8519840007":{"sku":"8519840007","vendor_sku":"SO923-001","upc":"605284721216","size":"L","color":"BLACK","retail_price":"139.93","sale_price":"139.93"}},"categories":["mens","mens-jackets","mens-running-jackets"]}
