{"sku":"852030","manufacturer_id":"16049","brand_name":"Rei","product_name":"REI Acumen Daypack","long_description":"The savvy REI Acumen daypack carries your laptop, electronic gadgets, books, folders and lunch. With a simple design and clean style, it's ideal for students, commuters and professionals. Rear laptop compartment has a fully padded sleeve that sits up from the pack bottom so your laptop won't hit the ground; sleeve fits most 15 in. laptops. Panel-loading zip compartment has planty of room to carry books, papers, lunch and gym clothes. Fully featured organizer panel holds electronic gadgets and day-to-day items; includes pen and pencil slots; includes a key clip. Mesh side pockets provide quick-access storage for water bottles. Top carry handle is padded for hauling comfort; front handle gives an additional point for quick grab-and-go action. Shoulder straps with ergonomic contours provide comfort and a great fit; padded panel protects your back from bulky and pointy items. Strap keepers keep shoulder strap webbing tails controlled and out of the way. 1 in. webbing waistbelt improves comfort and can be removed if you don't want it. Includes a clip loop for LED blinker light; blinker light sold separately. The REI Acumen daypack has reflective trim for enhanced visibility in low light.","short_description":"The savvy REI Acumen daypack carries your laptop, electronic gadgets, books, folders and lunch. With a simple design and clean style, it's ideal for students, commuters and professionals.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s315491.png","image_url":"http://i1.avlws.com/115/l315491.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=315491&tt=df","keywords":"small,travel,pack,commute,carry on","retail_price":"79.50","sale_price":"79.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=315491\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m315491.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852030&amp;link=&amp;tabs=-Details\"></script>","variants":{"8520300002":{"sku":"8520300002","vendor_sku":"16049","upc":"485203000024","color":"CASTLEROCK","retail_price":"79.50","sale_price":"79.50"},"8520300003":{"sku":"8520300003","vendor_sku":"16049","upc":"485203000031","color":"BORDEAUX","retail_price":"79.50","sale_price":"79.50"}}}
