{"sku":"852106","manufacturer_id":"F70701","brand_name":"Ortlieb","product_name":"Ortlieb Office Bag Pannier - Single","long_description":"Take your portable office along for the ride with the Ortlieb Office Bag pannier, which keeps your work essentials organized and protected from the weather on your bike commute. Pannier is made of durable, coated nylon fabric for excellent weather protection and features a convenient roll-top closure for additional weather protection. The Ortlieb Office Bag pannier is designed to carry files, documents and your laptop (up to a 15 in. laptop in a protective sleeve, sleeve not included). Numerous internal organizer pockets help keep smaller items organized and easily accessible. Includes a removable, padded shoulder strap and carry handle for easy transport off the bike. Bag is rated to IP64 protection, meaning it is dust-proof and protected against splashing water coming from all directions. Quick-Lock2 (QL2) system allows quick and single-handed placement and removal of the pannier; mounts can be adjusted to allow extra heel clearance and left- or right-side use. QL2 mounting system is compatible with all standard rear racks with diameters of 8, 10 or 16mm, sold separately. Ortlieb Office Bag pannier has 3M Scotchlite(TM) reflective detailing to increase your visibility in low light.","short_description":"Take your portable office along for the ride with the Ortlieb Office Bag pannier, which keeps your work essentials organized and protected from the weather on your bike commute.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Panniers And On-Bike Packs","thumb_url":"http://i1.avlws.com/115/s379939.png","image_url":"http://i1.avlws.com/115/l379939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379939&tt=df","keywords":"bags","retail_price":"140.00","sale_price":"140.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852106&amp;link=&amp;tabs=-Details\"></script>","variants":{"8521060002":{"sku":"8521060002","vendor_sku":"F70702","size":"SINGLE","color":"GRAPHITE/BLACK","retail_price":"140.00","sale_price":"140.00"}},"categories":["cycling","bike-accessories","panniers-and-onbike-packs"]}
