{"sku":"852137","manufacturer_id":"T5K726F5","brand_name":"Timex","product_name":"Timex Ironman Target Trainer Heart Rate Monitor - Men's","long_description":"The Timex Ironman Target Trainer heart rate monitor will help you train for your first 5K or run a marathon. Its advanced training features and sleek design will keep you on track. TapScreen(TM) technology lets you simply tap anywhere on the screen to activate laps and timers; customize the required tap force to meet your needs. Included heart rate chest strap uses digital transmission to eliminate crosstalk with other heart rate monitors nearby. Watch has 5 preset heart rate zones (based off a percentage of your maximum heart rate) and 5 customizable zones to help you track your performance and make the most gains. Recovery timer allows you to select 20 sec., 1, 2, 5 or 10-min. countdown to track your heart rate recovery; recovery data is recorded and can be viewed in recall mode. Recall function stores up to 3 workouts by date with times of every lap/split, your target times, best lap and average lap. Recall shows your average heart rate per lap and per workout; also view your maximum, minimum and recovery heart rate, and your elapsed time within heart rate zones. 100-hr. chronograph includes a Target Time Pacer and 150-lap memory recall. Target Time Pacer provides audible alerts that let you know whether you're behind, ahead of or on your desired pace. 2 interval modes can each be linked to up to 8 timers with user-selectable labels (Interval #, Warm Up, Slow, Med, Fast, and Cool) to facilitate interval training. Intervals can also be linked to heart rate zones, letting you spend 1 interval in zone 3 and then the next interval in zone 5, for example. Watch automatically stores workouts from the chronograph and can hold two hundred 1-lap workouts, one 200-lap workout, or anything in between. Watch displays calories burned based on basal metabolic rate (BMR) or heart rate. 3 alarms have daily, weekday, weekend and day-of-week settings.","short_description":"The Timex Ironman Target Trainer heart rate monitor will help you train for your first 5K or run a marathon. Its advanced training features and sleek design will keep you on track.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427131.png","image_url":"http://i1.avlws.com/115/l427131.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427131&tt=df","keywords":"watch","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427131\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427131.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852137&amp;link=&amp;tabs=-Details\"></script>","variants":{"8521370001":{"sku":"8521370001","vendor_sku":"T5K726F5","upc":"753048459605","color":"BLACK/YELLOW","retail_price":"129.95","sale_price":"129.95"}},"categories":["fitness","running","fitness-electronics"]}
