{"sku":"852136","manufacturer_id":"T5K722F5","brand_name":"Timex","product_name":"Timex Ironman Road Trainer Heart Rate Monitor - Women's","long_description":"The women's Timex Ironman Road Trainer heart rate monitor helps you get the edge on the competition, giving you the necessary data to improve your performance, play hard and train smart. Included a heart rate sensor features a comfortable, washable and adjustable chest strap. 1-workout memory gathers elapsed time and heart-rate data when you run the watch's chronograph or interval timer so that you can track progress. Interval timer with 2 segments is useful when workouts include different segments, such as a run/walk method. Both segments in the interval timer can be set for heart rate zone and duration, so you can get time and effort guidance during a workout. Average heart rate is given for total workout, for each lap and for total time in your zone. Provides total calories burned and displays percentage of maximum heart rate. Recovery heart rate timer measures your heart rate after a timed recovery, during or after your workout. 50-lap memory with average heart rate per lap. Digital transmission protects your data from crosstalk with other heart rate monitors and electronic interference from exercise equipment. INDIGLO(R) night-light illuminates the display for easy use at night. Water resistant to 50m (165 ft.). The Timex Ironman Road Trainer heart rate monitor features 2 daily alarms and a second time zone.","short_description":"The women's Timex Ironman Road Trainer heart rate monitor helps you get the edge on the competition, giving you the necessary data to improve your performance, play hard and train smart.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427127.png","image_url":"http://i1.avlws.com/115/l427127.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427127&tt=df","keywords":"watch","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427127\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427127.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852136&amp;link=&amp;tabs=-Details\"></script>","variants":{"8521360002":{"sku":"8521360002","vendor_sku":"T5K723F5","upc":"753048459599","color":"BLACK/PURPLE","retail_price":"99.95","sale_price":"99.95"}},"categories":["fitness","running","fitness-electronics"]}
