{"sku":"852189","manufacturer_id":"F3150","brand_name":"Ortlieb","product_name":"Ortlieb Ultimate 6 Plus Handlebar Bag","long_description":"With waterproof protection from the elements, the Ortlieb Ultimate 6 Plus handlebar bag keeps your riding necessities easily accessible and protected no matter the weather. Made of polyurethane-coated Cordura(R) nylon, the pack is rated to protect against splashes from all directions. Lid features external fastening points for compatible Ortlieb accessories, such as a map case or GPS cover (not included). Internal zip pocket, key clip and removable internal dividers help keep contents secure and organized. Stable design will stand up on its own, thanks in part to the rigid lid and internal dividers. 2 external zippered mesh pockets make it easy to stash and reach on-the-go essentials. 3M Scotchlite(TM) reflective detailing increases your visibility in low light. Bag comes with a removable shoulder strap and lockable mounting kit; face of the mounting kit is reflective for increased front-side visibility when riding without the bag. Maximum load capacity is 6 lbs. 9 oz. (3 kg). Ortlieb Ultimate 6 Plus handlebar bag is designed to fit handlebars with a diameter up to 31.8mm; compatible with Rixen & Kaul KLICKfix system (not included).","short_description":"With waterproof protection from the elements, the Ortlieb Ultimate 6 Plus handlebar bag keeps your riding necessities easily accessible and protected no matter the weather.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Panniers And On-Bike Packs","thumb_url":"http://i1.avlws.com/115/s446115.png","image_url":"http://i1.avlws.com/115/l446115.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=446115&tt=df","retail_price":"125.00","sale_price":"125.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=446115\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m446115.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852189&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bike-accessories","panniers-and-onbike-packs"]}
