{"sku":"852238","manufacturer_id":"A12QKZ3","brand_name":"The North Face","product_name":"The North Face Himalayan Down Parka - Men's","long_description":"Designed for those aiming to reach the top of the world, The North Face Himalayan down parka for men keeps elite alpine mountaineers protected during demanding ascents to the summit. This ultra-warm parka is built with lightweight Pertex(R) Endurance ripstop nylon that is 100% windproof, highly water resistant, and breathable. HyVent(R) Alpha 2-layer nylon fabric reinforces high-abrasion areas; tough grip zones on shoulders and hips keep a pack in place. Premium 800-fill-power goose down is extremely compressible and offers exceptional warmth for its weight. Welded baffle construction eliminates cold spots and weak points that accompany needle holes. Fully adjustable hood preserves visiblity; thick, warm draft yoke around neck and shoulders seals cold out and warmth in. Magnetic collar clip manages venting during high winds and foul weather. Two enormous chest drop pockets offer external or internal access; also includes zippered hand pockets, 2 internal stretch water-bottle-size pockets and a zip security pocket. Rip-and-stick adjustable exterior cuffs and internal stretchy cuffs with thumbholes seal in warmth. The North Face Himalayan down parka for men has an expedition fit and features a drawcord hem to adjust fit and warmth. Abundant reflectivity increases visibility on alpine starts and in vicious weather. This item is part of the North Face Summit Series(TM), apparel designed and tested for use in harsh environments.","short_description":"Designed for those aiming to reach the top of the world, The North Face Himalayan down parka for men keeps elite alpine mountaineers protected during demanding ascents to the summit.","category":"Men's","subcategory":"Men's Jackets","product_group":"Men's Down Jackets","thumb_url":"http://i1.avlws.com/115/s349035.png","image_url":"http://i1.avlws.com/115/l349035.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=349035&tt=df","keywords":"snow jacket,men's down jackets,insulated,winter jacket,warm","retail_price":"649.00","sale_price":"649.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=349035\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m349035.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852238&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
