{"sku":"852416","manufacturer_id":"33000","brand_name":"Danner","product_name":" Danner Light II GTX Hiking Boots - Men's","long_description":"The hand-crafted Danner Light II GTX hiking boots are rugged yet comfortable hiking boots. They'll quickly become your favorite trail accessory. Full-grain leather uppers offer a premium look and feature nylon panels for improved breathability and comfort. GORE-TEX(R) waterproof liners let feet breathe while protecting them from the elements, keeping them dry and comfortable. Nylon linings wick moisture away from feet for all-day comfort. Hand-crafted stitchdown construction offers a wider platform for increased stability on uneven terrain. Airthotic(R) half-length molded polyurethane instep cups the heels and supports the arches. Fiberglass shanks offer the torsional rigidity and stability required when carrying a multiday pack. Vibram Kletterlift rubber otusoles are specifically designed for comfort, stability and shock absportion. The Danner Light II GTX hiking boots are 6 in. high. Danner fit tip: regular width boots feature a narrow toe box.","short_description":"The hand-crafted Danner Light II GTX hiking boots are rugged yet comfortable hiking boots. They'll quickly become your favorite trail accessory.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385195.png","image_url":"http://i1.avlws.com/115/l385195.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385195&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385195\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385195.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852416&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
