{"sku":"852412","manufacturer_id":"37440","brand_name":"Danner","product_name":"Danner Crater Rim GTX Hiking Boots - Men's","long_description":"Built for extended backpacking trips or day-long adventures, the Danner Crater Rim GTX hiking boots offer amazing comfort for your backcountry adventures. The Crater Rim GTX hiking boots are the 2012 Outside Magazine Gear of the Year award winner in the Trail Shoe Category. Waterproof nubuck leather uppers stand up to wear and tear on the trail; 360deg abrasion-resistant Vibram rubber rands protect boots from scuffs. Gore-Tex(R) waterproof liners let feet breathe while protecting them from the elements, keeping them dry and comfortable. Nylon linings wick moisture away for extended comfort while on the trail. Shock-absorbent EVA midsoles provide support and cushioning; polyurethane footbeds offer lightweight support. Fiberglass shanks provide torsional rigidity and stability on uneven terrain. Vibram Bifida rubber outsoles on the Danner Crater Rim GTX hiking boots provide superior traction. Made in the USA. Danner fit tip: the Danner Crater Rim boots offer a wider fit in the regular width; wide width is a true wide.","short_description":"Built for extended backpacking trips or day-long adventures, the Danner Crater Rim GTX hiking boots offer amazing comfort for your backcountry adventures.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385187.png","image_url":"http://i1.avlws.com/115/l385187.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385187&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385187\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385187.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852412&amp;link=&amp;tabs=-Details\"></script>","variants":{"8524120010":{"sku":"8524120010","vendor_sku":"37440","upc":"098397700221","size":"13","color":"BROWN","retail_price":"299.00","sale_price":"299.00"}},"categories":["footwear","mens-footwear","mens-boots"]}
