{"sku":"852486","manufacturer_id":"YR20W","brand_name":"Yeti","product_name":" YETI Roadie 20 Cooler","long_description":"The Yeti Roadie 20 cooler is built tough to endure your adventurous lifestyle. Pack the 20-liter cooler full of food and beverages and hit the road or head to the work site. Extra-thick walls contain proprietary PermaFrost(TM) insulation that is pressure injected, giving the cooler excellent resistance to outside temperatures. Rotomolded polyethylene construction, the same process used to make whitewater kayaks, ensures excellent impact resistance and long-lasting durability. Yeti coolers are designed to handle extremely low temperatures and are compatible with dry ice; dry ice provides about 3 times the cooling power of regular ice. Roadie 20 cooler has a 22-liter capacity (23 qt.) that will hold 12 cans and plenty of ice; designed to accommodate long-neck bottles. Roadie 20 lid doesn't just close, it seals shut with a freezer-quality gasket around the entire lid to minimize air exchange. Durable rubber T-latches fit in the molded latch keepers on the cooler to ensure the lid stays closed. Interagency Grizzly Bear Committee has certified the Roadie 20 as a bear-resistant food container when used with 2 padlocks (sold separately) on both front corners. Tie-down slots are molded into the cooler body for solid mounting in your boat or truck; cooler can be secured while allowing access to the inside; straps sold separately. Full-length, rustproof aluminum rod connects and holds the body and lid together; hinge stops are molded in the lid so the hinge will never break. Screw-in gasketed drain plug won't leak; partially unscrew the plug to drain water. Full-length stainless-steel handle locks upright for easy transportation. Nonmarking rubber feet on the bottom of the cooler keep it from sliding around the deck of your boat. Yeti Roadie 20 cooler measures 20 x 13.4 x 14.4 in. and weighs 16 lbs.","short_description":"The Yeti Roadie 20 cooler is built tough to endure your adventurous lifestyle. Pack the 20-liter cooler full of food and beverages and hit the road or head to the work site.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Coolers","thumb_url":"http://i1.avlws.com/115/s442835.png","image_url":"http://i1.avlws.com/115/l442835.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442835&tt=df","keywords":"ice chests","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442835\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442835.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852486&amp;link=&amp;tabs=-Details\"></script>","variants":{"8524860001":{"sku":"8524860001","vendor_sku":"YR20T","upc":"014394530180","color":"TAN","retail_price":"250.00","sale_price":"250.00"},"8524860002":{"sku":"8524860002","vendor_sku":"YR20W","upc":"014394530173","color":"WHITE","retail_price":"250.00","sale_price":"250.00"}},"categories":["camping-hiking","camp-kitchen","coolers"]}
