{"sku":"852565","brand_name":"The North Face","product_name":"The North Face Base Camp Duffel Special Edition - Large","long_description":"The Special Edition of The North Face Base Camp large-size duffel offers rugged resilience like the standard version, but features deluxe embossed shell material, leather trim and metal hardware. Large 90-liter duffel provides storage for trips lasting 4 days or more. Made from heavy-duty 300-denier phthalate-free thermoplastic elastomer laminate and 840-denier ballistics nylon, this duffel is ready for anything you can dish at it. Features rugged construction with extra bartacks, double stitching and durable metal hardware. Linen-like embossing adds textural interest to the shell material; leather accents are featured on haul handles, shoulder straps and ID window. Main compartment features a D-shaped zippered opening with zipper flap; internal mesh pockets offer organization. Duffel-style handles and twin haul handles on ends provide carrying options; shaped shoulder straps provide comfortable, easy hauling as a backpack. The North Face Base Camp large-size duffel includes 4 side compression straps, dual daisy chains along sides. Zippers are travel-lock compatible (locks sold separately).","short_description":"The Special Edition of The North Face Base Camp large-size duffel offers rugged resilience like the standard version, but features deluxe embossed shell material, leather trim and metal hardware.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Duffel Bags","thumb_url":"http://i1.avlws.com/115/s318123.png","image_url":"http://i1.avlws.com/115/l318123.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=318123&tt=df","keywords":"gear bag,duffel bag","retail_price":"200.00","sale_price":"200.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=318123\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m318123.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852565&amp;link=&amp;tabs=-Details\"></script>","variants":{"8525650003":{"sku":"8525650003","vendor_sku":"A6SNJK3","upc":"766182198620","size":"L","color":"TNF BLACK","retail_price":"200.00","sale_price":"200.00"}}}
