{"sku":"852554","manufacturer_id":"YT65T","brand_name":"Yeti","product_name":" YETI Tundra 65 Cooler","long_description":"Most coolers come away from a life full of adventure with cracked corners, caved-in lids and busted hinges. Not the Yeti Tundra 65. It's built tough to take the abuse that comes with the way you play. Rotomolded polyethylene construction, the same process used to make whitewater kayaks, ensures excellent impact resistance and long-lasting durability. Extra-thick walls contain proprietary PermaFrost(TM) insulation that is pressure injected, giving the cooler excellent resistance to outside temperatures. Yeti coolers are designed to handle extremely low temperatures and are compatible with dry ice; dry ice provides about 3 times the cooling power of regular ice. Tundra 65 cooler has a 57.6-liter capacity (61 qt.) that will hold 39 cans and plenty of ice; designed to accommodate long-neck bottles. Tundra lid doesn't just close, it seals shut with a freezer-quality gasket around the entire lid to minimize air exchange. Durable rubber T-latches fit in the molded latch keepers on the cooler to ensure the lid stays closed. Interagency Grizzly Bear Committee has certified the Tundra 65 as a bear-resistant food container when used with 2 padlocks (sold separately) on both front corners. Tie-down slots are molded into the cooler body for solid mounting in your boat or truck; cooler can be secured while allowing access to the inside; straps sold separately. Full-length, rustproof aluminum rod connects and holds the body and lid together; hinge stops are molded in the lid so the hinge will never break. Screw-in gasketed drain plug won't leak; partially unscrew the plug to drain water. Haul handles on the ends are designed to make carrying a loaded cooler easier for 2 people; textured grips are secured with marine-grade nylon rope. Use the Integrated recessed handles when you're carrying the cooler by yourself. Included dry goods rack keeps your sandwiches from getting soggy.","short_description":"Most coolers come away from a life full of adventure with cracked corners, caved-in lids and busted hinges. Not the Yeti Tundra 65. It's built tough to take the abuse that comes with the way you play.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Coolers","thumb_url":"http://i1.avlws.com/115/s442851.png","image_url":"http://i1.avlws.com/115/l442851.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442851&tt=df","keywords":"ice chests","retail_price":"400.00","sale_price":"400.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442851\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442851.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852554&amp;link=&amp;tabs=-Details\"></script>","variants":{"8525540001":{"sku":"8525540001","vendor_sku":"YT65T","upc":"014394530661","color":"TAN","retail_price":"400.00","sale_price":"400.00"},"8525540002":{"sku":"8525540002","vendor_sku":"YT65W","upc":"014394530654","color":"WHITE","retail_price":"400.00","sale_price":"400.00"}},"categories":["camping-hiking","camp-kitchen","coolers"]}
