{"sku":"852731","manufacturer_id":"A94MJK3","brand_name":"The North Face","product_name":"The North Face Crowley Gloves","long_description":"Great for spring ski tours or tasks that require good dexterity, The North Face Crowley gloves have light insulation, grippy palms and durable shells to meet the demands of your adventurous lifestyle. Rugged Durastretch nylon exteriors are lined with soft polyester with FlashDry(TM) technology to keep your hands warm and dry. FlashDry(TM) fabric additive dramatically improves drying time and breathability without adding weight or bulk or washing out. Heatseeker(TM) insulation on the backs of the hands has a great warmth-to-weight ratio, and is highly compressible and extremely durable, making it ideal for cold weather. 5 Dimensional Fit(TM) uses 5 measurements of the hand to construct gloves with an accurate and consistent fit. Radiametric Articulation(TM) improves warmth and blood flow to your fingers by mirroring the natural relaxed curve of the hand. Rip-and-stick tabs at the wrists for easy on and off; low-profile cuffs fit under your jacket sleeves. The North Face Crowley gloves have synthetic suede palms with silicone prints to provide good grip on your ski poles.","short_description":"Great for spring ski tours or tasks that require good dexterity, The North Face Crowley gloves have light insulation, grippy palms and durable shells to meet the demands of your adventurous lifestyle.","category":"Men's","subcategory":"Men's Gloves And Mittens","product_group":"Men's Insulated Gloves","thumb_url":"http://i1.avlws.com/115/s340323.png","image_url":"http://i1.avlws.com/115/l340323.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=340323&tt=df","keywords":"winter gloves,warm,men's insulated gloves,snow gloves","retail_price":"75.00","sale_price":"75.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=340323\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m340323.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852731&amp;link=&amp;tabs=-Details\"></script>","variants":{"8527310002":{"sku":"8527310002","vendor_sku":"A94MJK3","upc":"053329803159","size":"M","color":"TNF BLACK","retail_price":"75.00","sale_price":"75.00"}}}
