{"sku":"852830","manufacturer_id":"QUEST10WBKIT","brand_name":"Riot","product_name":" Riot Quest 10 Kayak with Paddle - 2013 Special Buy","long_description":"Sporty, maneuverable and welcoming to beginning paddlers, the Riot Quest 10 kayak with paddle gets you out on the flatwater and ready to have a wonderful time. 10 ft. length offers excellent maneuverability, and stable, multi-chine hull offers performance suitable to flatwater, sheltered bays and slow-moving rivers. Rock-solid stability makes it perfect for fishing, photography and family paddling; versatile size is great for adults and kids alike. Rotomolded polyethylene construction offers performance, rugged durability and affordability. Integrated thighbraces add comfort to the cockpit, and adjustable footbraces ensure a comfortable paddling position for any size of paddler. Rear hatch is easy to open and easy to seal, and rear bulkhead enhances floatation when hatch is sealed. Riot Quest 10 also features a flushmounted rod holder and a drainplug. Includes a durable double-bladed kayak paddle with an aluminum shaft, reinforced polymer blades and rubber drip rings. Special buy.","short_description":"Sporty, maneuverable and welcoming to beginning paddlers, the Riot Quest 10 kayak with paddle gets you out on the flatwater and ready to have a wonderful time.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s430591.png","image_url":"http://i1.avlws.com/115/l430591.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430591&tt=df","retail_price":"608.99","sale_price":"486.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430591\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430591.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852830&amp;link=&amp;tabs=-Details\"></script>","variants":{"8528300001":{"sku":"8528300001","vendor_sku":"QUEST10WBKIT","upc":"325841073458","size":"10 FT","color":"WHITE/BLUE","retail_price":"486.73","sale_price":"486.73"}}}
