{"sku":"852941","manufacturer_id":"9502","brand_name":"Cycleops","product_name":"CycleOps Aluminum Rollers with Resistance","long_description":"Whether an aspiring amateur or a seasoned pro rider, the CycleOps Aluminum Rollers with Resistance help improve your balance and bike handling skills, and your cardio while you're at it. Precision-lathed aluminum drums supply a smooth ride with excellent real-world feel; because your bike isn't locked onto a trainer, balance and handling skills are required. Adjustable resistance unit uses a magnetic bar behind the rear roller to provide 5 levels of resistance, so you can increase the intensity of your training as needed. Because the resistance is provided through magnets, there's no additional noise and no moving parts to break down; resistance is set manually while off the bike. Flat steel frame withstands the rigors of frequent use and transport; tool-free roller adjustment accommodates different wheelbase widths. Rubber foot pads secure your rollers so you can enjoy a stable ride. Place the belt connecting the 2 front roller drums on the left or right side to accommodate your preferred side for mounting and dismounting. Since mastering the rollers can take a few tries, the generous 16 in. width of the drums gives you room to move around as you fine-tune your skills. CycleOps Alumium Rollers can be conveniently folded up for grab-and-go transport or compact storage.","short_description":"Whether an aspiring amateur or a seasoned pro rider, the CycleOps Aluminum Rollers with Resistance help improve your balance and bike handling skills, and your cardio while you're at it.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trainers","thumb_url":"http://i1.avlws.com/115/s379575.png","image_url":"http://i1.avlws.com/115/l379575.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379575&tt=df","retail_price":"351.00","sale_price":"351.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379575\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379575.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=852941&amp;link=&amp;tabs=-Details\"></script>","variants":{"8529410001":{"sku":"8529410001","vendor_sku":"9502","upc":"012527002535","color":"GRAY","retail_price":"351.00","sale_price":"351.00"}},"categories":["cycling","bike-accessories","bike-trainers"]}
