{"sku":"853143","manufacturer_id":"05183","brand_name":"Platypus","product_name":"Platypus Origin 22 Hydration Pack - 20\" - 2012 Closeout","long_description":"From peak-bagging day trips to minimalist overnights, the Platypus Origin 22 pack delivers effortless hydration and clutter-free gear hauling. Best fits torsos 18-20 in. Dedicated pocket holds the included 2.0 Big Zip SL 2-liter reservoir; its wide opening easily swallows drink mixes and ice cubes and facilitates easy cleaning. Features an ergonomic 90deg shut-off valve for easy drinking; HyperFlow(TM) bite valve delivers a thirst-quenching high flow rate. SlideLock with secondary reinforcement ensures a secure and leak-free closure every time. Reservoir is lined with SlimeGuard(TM), an antimicrobial treatment that keeps water fresh and taste-free. Pack features padded shoulder straps, sternum strap, webbing waistbelt and 2 integrated tube clips (1 on each shoulder strap) for directing drinking tube. Pack's main compartment features a small hanging zippered organizer pocket and key clip, helping you keep your essentials close at hand and easy to access. Stash large, bulky gear under the removable front compression storage panel pocket; front of pack also has an ice axe loop and retainer. Waterproof, welded, all-weather zippers and heat-taped seams ensure a weatherproof construction. Twin side pockets and 2 on-the-go zippered waist pockets stash small essentials and often-used items such as snacks, lip balm, sunscreen and a multi-tool. Lash points, light loops and reflective detailing allow you to strap on extra gear and lights for dusk-to-dawn epic adventures. Closeout.","short_description":"From peak-bagging day trips to minimalist overnights, the Platypus Origin 22 pack delivers effortless hydration and clutter-free gear hauling. Best fits torsos 18-20 in.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411239.png","image_url":"http://i1.avlws.com/115/l411239.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411239&tt=df","retail_price":"139.95","sale_price":"61.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411239\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411239.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853143&amp;link=&amp;tabs=-Details\"></script>","variants":{"8531430001":{"sku":"8531430001","vendor_sku":"05182","upc":"040818051825","color":"BLACK","retail_price":"61.73","sale_price":"61.73"},"8531430002":{"sku":"8531430002","vendor_sku":"05183","upc":"040818051832","color":"BLUE","retail_price":"61.73","sale_price":"61.73"}},"categories":["camping-hiking","backpacks","day-packs"]}
