{"sku":"853237","manufacturer_id":"560","brand_name":"Sea To Summit","product_name":"Sea to Summit Hydraulic Dry Bag with Harness - 65L","long_description":"The 65L Sea to Summit Hydraulic dry bag with harness keeps your gear protected while you paddle and then makes it easy to haul your gear backpack-style from boat to campsite and vice versa. Hydraulic dry bags are designed for heavy use and feature very tough, laminated fabric and welded seams; they also have a high resistance to UV light and cold temperatures. Harness promotes cooling airflow with EVA foam and quick-drying mesh, and it features adjustable back length and a height-adjustable sternum strap to personalize the fit. Removable harness attches via a series of very tough, corrosion-resistant anodized aluminum buckles, and low-profile attachment points reduce snagging when harness is removed. Thermoplastic urethane (TPU) roll-top closure seals easily and provides reliable waterproof performance. Oval base resists rolling and stays where you put it. Durable attachment points secure dry bag to a pack or kayak. The 65L Sea to Summit Hydraulic dry bag with harness is PVC free.","short_description":"The 65L Sea to Summit Hydraulic dry bag with harness keeps your gear protected while you paddle and then makes it easy to haul your gear backpack-style from boat to campsite and vice versa.","category":"Paddling","subcategory":"Paddling Bags And Cases","product_group":"Dry Bags","thumb_url":"http://i1.avlws.com/115/s431295.png","image_url":"http://i1.avlws.com/115/l431295.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431295&tt=df","retail_price":"169.95","sale_price":"169.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431295\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431295.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853237&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["paddling","paddling-bags-and-cases","dry-bags"]}
