{"sku":"853326","manufacturer_id":"075M01 358 M","brand_name":"Nau","product_name":" Nau Synfill Stretch Hoody Jacket - Men's","long_description":"A winterized spin on a comfortable classic, the waterproof Nau Synfill Stretch hoody jacket combines the best features of a technical jacket into a quiet piece that wears like your favorite hoody. Recycled polyester stretch knit allows for full range of motion, while the recycled polyester with Cocona(R) insulation provides lightweight warmth and odor management. Completely seam-sealed, recycled polyester 4-way stretch exterior has a waterproof, breathable laminate and Durable Water Repellent finish to keep you dry. Polyester taffeta lining with inset stretch panels won't limit your mobility. Offset waterproof zipper with windflap keeps the weather out. Helmet-compatible hood has a 2-way drawcord so you can find just the right fit. Two zippered hand pockets and 1 left chest zippered pocket; 1 internal mesh drop-in pocket and 1 internal zippered pocket with cord routing system for your music player. Low-profile zippered cuffs and a drawcord hem keep out the cold. Nau Synfill Stretch hoodie jacket has a regular fit.","short_description":"A winterized spin on a comfortable classic, the waterproof Nau Synfill Stretch hoody jacket combines the best features of a technical jacket into a quiet piece that wears like your favorite hoody.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s401555.png","image_url":"http://i1.avlws.com/115/l401555.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=401555&tt=df","retail_price":"320.00","sale_price":"160.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=401555\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m401555.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853326&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
