{"sku":"853391","manufacturer_id":"84761","brand_name":"Patagonia","product_name":" Patagonia Ultralight Down Jacket - Women's","long_description":"Built with lightweight, special-edition fabric and highly compressible 800-fill-power goose down, the women's Ultralight Down Hoodie jacket from Patagonia boosts your heat the moment you zip it on. Wear it as a belay parka over light layers at shady autumn crags or layered under a shell for unmatched warmth; also great for minimalist summer alpine bivies. Special edition nylon ripstop shell fabric is half the weight and has twice the strength of other Patagonia down shell fabrics. 800-fill-power premium European goose down yields tremendous warmth with low weight and low bulkiness. Sewn-through construction, a tight channel pattern and just the right amount of down increase versatility for use in moderate temperatures and diverse activities. Durable Water Repellent finish causes water to bead up and roll off, fending off light rain showers and snow. Drawcord hem seals in warm air and keeps out cold and spindrift. Includes handwarmer zip pockets and a chest zip pocket. Slim silhouette provides thermal efficiency under a shell or as a stand-alone layer. The Patagonia Ultralight Down Hoodie jacket comes with a stuff sack.","short_description":"Built with lightweight, special-edition fabric and highly compressible 800-fill-power goose down, the women's Ultralight Down Hoodie jacket from Patagonia boosts your heat the moment you zip it on.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s393511.png","image_url":"http://i1.avlws.com/115/l393511.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=393511&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=393511\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m393511.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853391&amp;link=&amp;tabs=-Details\"></script>","variants":{"8533910004":{"sku":"8533910004","vendor_sku":"84761","upc":"887187010615","size":"L","color":"BLACK","retail_price":"299.00","sale_price":"299.00"}}}
