{"sku":"853582","manufacturer_id":"A7GE70M","brand_name":"The North Face","product_name":"The North Face Sickline Shell Jacket - Men's","long_description":"In pursuit of the sickest lines? The North Face Sickline shell jacket rises to the challenge with Gore-Tex(R) Pro 3-layer protection and lightweight, tough construction for lasting performance. Gore-Tex(R) Pro 3-layer construction delivers excellent waterproof, windproof and highly breathable protection to keep you dry and comfortable, even in harsh conditions. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Externally accessed, weather-resistant zippered chest pocket has an elastic loop to keep your two-way radio secure and easily accessible. Flap-covered zip handwarmer pockets; wrist pocket (with goggles cloth); internal insulated, weather-resistant cell phone pocket; internal goggles pocket; internal stash pocket. Offset center YKK Aquaguard Vislon zipper boasts a new tooth design that's integrated with a polyurethane-laminated tape for excellent weather resistance. Powder skirt helps seal out cold air and snow entry; clip-in tabs let you connect the powder skirt to compatible pants (sold separately) for an integrated, protective barrier. Pit-zip vents let you dump excess heat and provide cooling ventilation. Helmet-compatible, adjustable hood offers excellent peripheral vision. The North Face Sickline jacket has a drawcord hem and rip-and-stick cuffs to keep snow out and retain warmth; cuffs have thumb loops to help keep sleeves from riding up.","short_description":"In pursuit of the sickest lines? The North Face Sickline shell jacket rises to the challenge with Gore-Tex(R) Pro 3-layer protection and lightweight, tough construction for lasting performance.","category":"Skiing","subcategory":"Men's Ski Clothing","product_group":"Men's Ski Jackets","thumb_url":"http://i1.avlws.com/115/s336151.png","image_url":"http://i1.avlws.com/115/l336151.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=336151&tt=df","keywords":"hardshell,jacket,ski jacket","retail_price":"549.00","sale_price":"549.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=336151\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m336151.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853582&amp;link=&amp;tabs=-Details\"></script>","variants":{"8535820002":{"sku":"8535820002","vendor_sku":"A7GE70M","upc":"808390978578","size":"M","color":"TNF YELLOW","retail_price":"549.00","sale_price":"549.00"},"8535820003":{"sku":"8535820003","vendor_sku":"A7GE70M","upc":"808390978585","size":"L","color":"TNF YELLOW","retail_price":"549.00","sale_price":"549.00"}}}
