{"sku":"853552","manufacturer_id":"A7FJE4D","brand_name":"The North Face","product_name":"The North Face Baker Delux Insulated Jacket - Women's","long_description":"With a twist of urban style, the women's Baker Delux insulated jacket by The North Face meets your riding and style needs with waterproof, insulated protection and a look that will last seasons. Rugged HyVent(TM) 2-layer construction is waterproof, windproof and breathable; fully sealed seams prevent moisture from seeping through. Heatseeker(TM) polyester fiber insulation is strategically placed around your body to keep you warm without inhibiting movement. External chest pocket with access to media pocket; dual-entry zip and flap handwarmer pockets; waist zip pocket; wrist pocket with goggle cloth; internal goggles pocket. Removable stretch powder skirt with gripping elastic keeps snow out; snaps let you integrate the powder skirt with compatible pants by The North Face (sold separately). Cinch adjustable hem and rip-and-stick wrist cuffs help seal out cold air and retain valuable warmth; core vents let you control airflow and your comfort. Fully adjustable, detachable hood with removable faux fur trim ensures a weather-blocking, personalized fit; hood can be secured to jacket so it doesn't flap around. The North Face Baker Delux women's insulated jacket has a relaxed fit with a roomy body and sleeves.","short_description":"With a twist of urban style, the women's Baker Delux insulated jacket by The North Face meets your riding and style needs with waterproof, insulated protection and a look that will last seasons.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s393559.png","image_url":"http://i1.avlws.com/115/l393559.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=393559&tt=df","retail_price":"299.00","sale_price":"178.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=393559\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m393559.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853552&amp;link=&amp;tabs=-Details\"></script>","variants":{"8535520002":{"sku":"8535520002","vendor_sku":"A7FJE4D","upc":"808390973320","size":"S","color":"URCHIN PURPLE","retail_price":"178.83","sale_price":"178.83"}},"categories":["womens","womens-jackets","womens-insulated-jackets"]}
