{"sku":"853581","manufacturer_id":"A7GFF1V","brand_name":"The North Face","product_name":" The North Face Free Thinker Shell Jacket - Men's","long_description":"The North Face Free Thinker jacket boasts rugged construction and tough Gore-Tex(R) Pro protection to withstand demanding use and keep you comfortable on big mountains and steep descents. Gore-Tex(R) Pro 3-layer construction delivers excellent waterproof, windproof and highly breathable protection to keep you dry and comfortable, even in harsh conditions. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. One chest pocket features a water-resistant, insulated cell phone sleeve; other chest pocket has an elastic loop to keep a radio secure and easily accessible. Additional pockets: flap-covered zip handwarmer pockets, wrist pocket (with goggles cloth), internal goggles pocket and internal stash pocket. Center YKK Aquaguard Vislon zipper boasts a new tooth design that's integrated with a polyurethane-laminated tape for excellent weather resistance. Powder skirt helps seal out cold air and snow entry; clip-in tabs let you connect the powder skirt to compatible pants (sold separately) for an integrated, protective barrier. Pit-zip vents let you dump excess heat and provide cooling ventilation; double flap guards resist the elements for enhanced protection. Adjustable hood is compatible with your helmet and offers excellent peripheral vision. The North Face Free Thinker jacket has a drawcord hem and rip-and-stick cuffs to help retain warmth; cuffs have thumbholes to help keep cuffs in place.","short_description":"The North Face Free Thinker jacket boasts rugged construction and tough Gore-Tex(R) Pro protection to withstand demanding use and keep you comfortable on big mountains and steep descents.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Snow Jackets","thumb_url":"http://i1.avlws.com/115/s455983.png","image_url":"http://i1.avlws.com/115/l455983.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=455983&tt=df","keywords":"hardshell","retail_price":"599.00","sale_price":"418.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=455983\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m455983.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853581&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["mens","mens-jackets","mens-snow-jackets"]}
