{"sku":"853558","manufacturer_id":"A7GXD1T","brand_name":"The North Face","product_name":"The North Face Pemby Hybrid Insulated Jacket - Women's","long_description":"The North Face Pemby Hybrid Insulated women's jacket combines warm PrimaLoft(R) One insulation in the core with uninsulated, breathable sleeves for comfortable layering in the backcountry. Jacket body features 100g PrimaLoft One ultrafine microfiber insulation, which offers downlike softness that's incredibly lightweight and water repellent. Uninsulated shoulders and sleeves are made with highly breathable, moisture-wicking and quick-drying FlashDry(TM) fleece to ensure you don't overheat when you're going hard. Durable Water Repellent finish causes water to bead up and roll off, fending off light rain showers and snow. Offset center Vislon zipper is snag- and weather-resistant for easy, hassle-free use. Chest pocket and hand pockets have water-resistant zippers to help protect contents. Cuffs have thumbholes to help keep cuffs in place. The North Face Pemby Hybrid Insulated Jacket for women has an adjustable hem to seal out the elements and help you stay cozy.","short_description":"The North Face Pemby Hybrid Insulated women's jacket combines warm PrimaLoft(R) One insulation in the core with uninsulated, breathable sleeves for comfortable layering in the backcountry.","category":"Skiing","subcategory":"Women's Ski Clothing","product_group":"Women's Insulated Ski Jackets","thumb_url":"http://i1.avlws.com/115/s334867.png","image_url":"http://i1.avlws.com/115/l334867.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=334867&tt=df","keywords":"jacket,hardshell,insulated","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=334867\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m334867.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853558&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
