{"sku":"853594","manufacturer_id":"A7GG70M","brand_name":"The North Face","product_name":"The North Face Free Thinker Bib Shell Pants - Men's","long_description":"Rugged and ready, The North Face Free Thinker Bib shell pants are built to withstand demanding use on big, steep mountains, offering highly breathable Gore-Tex(R) Pro protection to keep you dry. Gore-Tex Pro 3-layer construction delivers excellent waterproof, windproof and highly breathable protection to keep you dry and comfortable, even in harsh conditions. Detachable bib offers waterproof protection, adjustable suspenders and a touch of stretch for comfort; use bib for added warmth and protection or remove it if it's not needed. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. The North Face Free Thinker Bib shell pants adjust via waist tabs for a comfortable fit; zippered inner thigh vents let you dump excess heat and provide cooling ventilation. Internal stretch gaiters have gripper elastic and boot hooks to keep gaiters in place and prevent snow from entering legs; cuffs also have zip gussets for use over boots. Reinforced cuffs stand up to sharp edges and abrasion; backsides of cuffs can be hitched up via internal \"Lot Lift System\" to avoid uneccesary cuff wear when walking. Water-resistant zippers on the two hand pockets and two cargo pockets help keep contents dry. Clip-in tabs let you connect the bib shell pants to a compatible jacket (sold separately) for an integrated, protective barrier.","short_description":"Rugged and ready, The North Face Free Thinker Bib shell pants are built to withstand demanding use on big, steep mountains, offering highly breathable Gore-Tex(R) Pro protection to keep you dry.","category":"Skiing","subcategory":"Men's Ski Clothing","product_group":"Men's Ski Pants","thumb_url":"http://i1.avlws.com/115/s334911.png","image_url":"http://i1.avlws.com/115/l334911.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=334911&tt=df","keywords":"snowpant,pants,snow pants,pant,hardshell pants","retail_price":"459.00","sale_price":"459.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=334911\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m334911.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853594&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
