{"sku":"853572","manufacturer_id":"A7GVD3R","brand_name":"The North Face","product_name":"The North Face NFZ Insulated Pants - Women's","long_description":"Featuring Gore-Tex(R) waterproof protection and PrimaLoft One(R) insulation, the women's NFZ insulated pants by The North Face are designed to keep you dry and cozy as you shred all season long. Rugged 2-layer Gore-Tex laminate and seam sealed construction delivers waterproof protection and breathable comfort for dependable performance throughout winter. Pants feature PrimaLoft One ultrafine microfiber insulation to offer warm, downlike performance and comfort in the cold; extra insulation is added in critical areas. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Clip-in tabs let you connect the pants to compatible jacket powder skirts (jacket sold separately) for an integrated, protective barrier. Zippered thigh vents let you control airflow for comfort; mesh gussets help keep snow out when vents are open. Rip-and-stick tabs on waistband adjust the fit; zippered, snap-closure fly. Water-resistant zippered hand pockets and cargo pockets. The North Face NFZ insulated pants feature reinforced cuffs that resist abrasion from boots, boards and skis.","short_description":"Featuring Gore-Tex(R) waterproof protection and PrimaLoft One(R) insulation, the women's NFZ insulated pants by The North Face are designed to keep you dry and cozy as you shred all season long.","category":"Skiing","subcategory":"Women's Ski Clothing","product_group":"Women's Ski Pants","thumb_url":"http://i1.avlws.com/115/s351911.png","image_url":"http://i1.avlws.com/115/l351911.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=351911&tt=df","keywords":"snowpant,hardshell pants,pant,snow pants,pants","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=351911\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m351911.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853572&amp;link=&amp;tabs=-Details\"></script>","variants":{"8535720008":{"sku":"8535720008","vendor_sku":"A7GVD3R","upc":"808390981592","size":"M","color":"GREYSTONE BLUE","retail_price":"299.00","sale_price":"299.00"}}}
