{"sku":"853629","manufacturer_id":"8900151N","brand_name":"Cateye","product_name":" CatEye HL-EL135 Front / Omni 3 Rear Bike Light Set","long_description":"The economical CatEye HL-EL135 Front / Omni 3 Rear Bike Light Set alerts others to your presence, using both front and rear lights, when you're biking in less than full sunshine. Offering a white (front) and red (rear) version of the same light, this package delivers visibility-enhancing performance with 2 compact, easy-to-use lights. Both lights employ 3 bright LEDs to deliver a wide spread of light to enhance your visibility to others behind or in front of you; rear light has red bulbs, front has white. Tailor your lighting needs and preferences with 3 lighting modes for both lights: constant, standard flash and rapid flash. Front light provides 320 hrs. of run time in flashing mode and 80 hrs. in constant mode. Rear light has up to 150 hrs. of run time in flashing mode, 200 hrs. in rapid flash mode and 100 hrs. in constant mode. Lights operates on 2, easily replaceable AAA batteries (batteries are included with each light). Flex-Tight(TM) universal mounting brackets are included with each light, letting you easily attach lights securely your bike without the need for tools. Front light's mounting bracket fites nearly any handlebar; rear light's mounting bracket fits tube diameters of 12 - 32 mm. CatEye HL-EL135 Front / Omni 3 Rear Bike Light Set also comes with clothing clips, making it easy to attach either of the lights to a pack or your clothes. Includes both the HL-EL135 front and Omni 3 TL-LD135 rear bike lights, 2 mounting brackets, 2 clothing clips and batteries for each light.","short_description":"The economical CatEye HL-EL135 Front / Omni 3 Rear Bike Light Set alerts others to your presence, using both front and rear lights, when you're biking in less than full sunshine.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Lights","thumb_url":"http://i1.avlws.com/115/s375487.png","image_url":"http://i1.avlws.com/115/l375487.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375487&tt=df","keywords":"flashing","retail_price":"30.00","sale_price":"30.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375487\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375487.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853629&amp;link=&amp;tabs=-Details\"></script>","variants":{"8536290001":{"sku":"8536290001","vendor_sku":"8900151N","upc":"725012024836","retail_price":"30.00","sale_price":"30.00"}}}
