{"sku":"853612","manufacturer_id":"1603700","brand_name":"Cateye","product_name":" CatEye Stealth 10 Bike Computer","long_description":"The CatEye Stealth 10 is a simple GPS-enabled bike computer that's easy to set up and easy to operate, making it a great value for light training and everyday cycling use. Provides valuable data for bike training, touring, commuting or casual everyday rides, measuring speed, distance, time and more. Very easy to use: simply affix the included bike mount to a bike handlebar or stem, and then attach the Stealth 10; no additional setup or sensors are necessary. The Stealth 10 can be quickly and easily swapped between bikes. Mini USB connection lets you upload ride data, including GPS location/route data, for post-ride analysis or sharing via web-based training sites. Auto Pause feature stops the timer when you're not moving, then resumes recording data automatically when you're rolling again. Display backlight can be programmed to turn on during the hours you typically ride, a great feature for when you're commuting in the early morning or late evening. Rechargeable internal lithium ion battery lasts up to 10 hrs. with typical use; fully recharges in approx. 5 hours via USB2.0 port. Unit is rated waterproof to 20m for excellent protection in wet weather. The CatEye Stealth 10 bike computer comes with a low-profile bike mount, mini USB cable/charger and relevant manuals.","short_description":"The CatEye Stealth 10 is a simple GPS-enabled bike computer that's easy to set up and easy to operate, making it a great value for light training and everyday cycling use.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s453211.png","image_url":"http://i1.avlws.com/115/l453211.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=453211&tt=df","retail_price":"120.00","sale_price":"70.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=453211\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m453211.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853612&amp;link=&amp;tabs=-Details\"></script>","variants":{"8536120001":{"sku":"8536120001","vendor_sku":"1603700","upc":"725012024713","color":"BLACK","retail_price":"70.93","sale_price":"70.93"}},"categories":["cycling","bike-accessories","bike-computers"]}
