{"sku":"853809","manufacturer_id":"A28QRQ9","brand_name":"The North Face","product_name":"The North Face Kannon Insulated Pants - Men's - 2012 Closeout","long_description":"The highly breathable, waterproof and insulated Kannon pants from The North Face let you rip though the deep powder and mountain chutes while outfitted like a pro. 2.5-layer construction HyVent(R) with laminate offers waterproof, breathable protection over a wider range of temperatures and conditions. 40g synthetic insulation with FlashDry(TM) additive is extremely lightweight, warm and packable; plus, it retains warmth when wet and dries quickly. FlashDry microparticles are embedded in the insulation to dramatically improve dry time and breathability. Made of crushed coconut shells and crushed volcanic rock, the FlashDry additive leads to faster dry times and will not wash out. Fully taped seams create the ultimate seal against wind and snow. Rip-and-stick adjustment tabs at side of waist and zippered, snap-closure fly secure the fit. Inner thigh vents and internal leg gaiters with stretch-mesh gussets work together to control airflow and temperature. 2 hand pockets and a thigh cargo pocket-all with waterproof, bonded zippers-keep accessories organized. Pant-a-locks tabs secure Kannon pants to coordinating jackets from The North Face (not included). Reinforced edge guards resist abrasion from boots, boards and skis. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors for quicker acquisition of position in an avalanche. From The North Face Summit Series(TM), featuring cutting-edge fabrics and the most advanced technology for the ambitious, technical skier or rider. Closeout.","short_description":"The highly breathable, waterproof and insulated Kannon pants from The North Face let you rip though the deep powder and mountain chutes while outfitted like a pro.","category":"Skiing And Snowboarding","subcategory":"Men's Ski And Snowboard Clothing","product_group":"Men's Ski And Snowboard Pants","thumb_url":"http://i1.avlws.com/115/s319195.png","image_url":"http://i1.avlws.com/115/l319195.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=319195&tt=df","keywords":"snowboarding,ski,skiing,men,outerwear","retail_price":"249.00","sale_price":"173.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=319195\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m319195.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853809&amp;link=&amp;tabs=-Details\"></script>","variants":{"8538090005":{"sku":"8538090005","vendor_sku":"A28QRQ9","upc":"053329568881","size":"XXL","color":"ATHENS BLUE","retail_price":"173.73","sale_price":"173.73"}}}
