{"sku":"853811","manufacturer_id":"A0HZVA7","brand_name":"The North Face","product_name":"The North Face Kizamm Insulated Jacket - Women's - 2012 Closeout","long_description":"The North Face Kizamm insulated women's jacket features exceptional winter protection and a colorblock style that will have you standing out from the crowd on the mountain. Quiet and abrasion-resistant 2-layer HyVent(TM) coated nylon is completely waterproof, windproof and breathable; fully sealed seams prevent moisture seepage. Jacket uses Heatseeker(TM) polyfiber insulation to keep you warm without inhibiting mobility (100g in body, 80g in sleeves/hood). Slick embossed and quilted polyester taffeta lining helps wick away moisture, dries fast and eases layering. Fixed, fully adjustable hood ensures a weather-blocking, personalized fit. Features handwarmer pockets for chilly fingers and a zip chest pocket to stash a few small essentials. Zippered interior security pocket holds your cash, ID, phone or other accessories; goggles pocket keeps your optics secure when not needed; wrist pocket features goggles cloth. Snap-back powder skirt with gripping elastic keeps snow out; attachment loops for coordinating snow pants (not included) create a seamless fit. Drawcord hem and rip-and-stick adjustable cuffs help seal out snow and cold air while retaining warmth. The North Face Kizamm insulated jacket features a buddy lift clip to keep your lift pass close at hand for quick access in line. Pit zippers let you quickly and easily control core temperature, expelling excess body heat as needed during high activity. Closeout.","short_description":"The North Face Kizamm insulated women's jacket features exceptional winter protection and a colorblock style that will have you standing out from the crowd on the mountain.","category":"Skiing And Snowboarding","subcategory":"Women's Ski And Snowboard Clothing","product_group":"Women's Ski And Snowboard Jackets","thumb_url":"http://i1.avlws.com/115/s319199.png","image_url":"http://i1.avlws.com/115/l319199.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=319199&tt=df","keywords":"women,snow,snowboard,boarding,skiing","retail_price":"220.00","sale_price":"153.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=319199\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m319199.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=853811&amp;link=&amp;tabs=-Details\"></script>","variants":{"8538110001":{"sku":"8538110001","vendor_sku":"A0HZVA7","upc":"053329614946","size":"S","color":"BOYCE GREEN","retail_price":"153.73","sale_price":"153.73"},"8538110002":{"sku":"8538110002","vendor_sku":"A0HZVA7","upc":"053329614953","size":"M","color":"BOYCE GREEN","retail_price":"153.73","sale_price":"153.73"},"8538110003":{"sku":"8538110003","vendor_sku":"A0HZVA7","upc":"053329614960","size":"L","color":"BOYCE GREEN","retail_price":"153.73","sale_price":"153.73"}}}
