{"sku":"854045","brand_name":"Rei","product_name":"REI Trail 25 Pack","long_description":"The REI Trail 25 pack transitions smoothly from the wilderness to the city with durable construction, all-day load support and a modern design with easy organization for urban gadgets or outdoor gear. Soft, conforming shoulder straps are comfortable and incorporate stiff load-carrying zones for heavy loads. Removable hipbelt and sternum strap let you lighten up or stabilize your load as you need. Smooth ventilated mesh in critical contact areas provides ventilation and comfort. Internal HDPE framesheet adds structure and helps shield your back from the contents of the pack. Panel-loading main compartment holds your hiking or commuting essentials and includes a sleeve and tube port for a hydration reservoir (sold separately). Organizer panel sports multiple pockets for pens, electronics and small essentials; front pocket and side mesh pockets offer on-the-go access to bottles, sunscreen and snacks. The REI Trail 25 pack has pulley-style compression straps to cinch down loads for jostle-free carrying; lightweight lash points let you strap gear to the front of the pack. Cordura polyester fabric offers durability for years of heavy use; TuffCoat bottom panels add waterproof durability and resistance to abrasion.","short_description":"The REI Trail 25 pack transitions smoothly from the wilderness to the city with durable construction, all-day load support and a modern design with easy organization for urban gadgets or outdoor gear.","category":"Camping & Hiking","subcategory":"Daypacks, Hydration Packs And Waistpacks","product_group":"Daypacks","thumb_url":"http://i1.avlws.com/115/s317207.png","image_url":"http://i1.avlws.com/115/l317207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=317207&tt=df","keywords":"pack,rucksack,day,backpack,daypack","retail_price":"69.50","sale_price":"69.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=317207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m317207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854045&amp;link=&amp;tabs=-Details\"></script>","variants":{"8540450001":{"sku":"8540450001","vendor_sku":"15976","upc":"485404500019","color":"DARK OLIVE/CITRON","retail_price":"69.50","sale_price":"69.50"},"8540450002":{"sku":"8540450002","vendor_sku":"15976","upc":"485404500026","color":"BLACK/VERMILLION","retail_price":"69.50","sale_price":"69.50"}}}
