{"sku":"854092","manufacturer_id":"A53YJK3","brand_name":"The North Face","product_name":"The North Face Radish Mid Layer Fleece Jacket - Men's - 2012 Closeout","long_description":"The North Face Radish Mid Layer stretch fleece jacket fits the bill for a warm mid layer that's made for outdoor adventures. Lightweight and incredibly versatile, you'll want to take it on every trip. Pontetorto hard-face stretch fleece is extraordinarily durable and the soft, brushed interior wicks moisture away from you. FlashDry(TM) fabric additive dramatically improves drying time and breathability without adding weight or bulk or washing out. Made of crushed coconut shells and crushed volcanic rock, FlashDry moves moisture from one layer to another to keep you dry. Fitted hood follows your head as you turn it, allowing an unobstructed view. The Radish Mid Layer jacket sports reinforced shoulder and hip zones for protection from backpack abrasion. Flatlock stitching increases comfort and enhances fit when layering. Roomy chest pocket is sleek thanks to its laser-cut bonded (rather than stitched) construction. The North Face Summit Series(TM) apparel is designed and tested for use in harsh environments. Closeout.","short_description":"The North Face Radish Mid Layer stretch fleece jacket fits the bill for a warm mid layer that's made for outdoor adventures. Lightweight and incredibly versatile, you'll want to take it on every trip.","category":"Men's Clothing","subcategory":"Fleece, Down And Wind Outerwear","product_group":"Men's Fleece Jackets","thumb_url":"http://i1.avlws.com/115/s283263.png","image_url":"http://i1.avlws.com/115/l283263.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=283263&tt=df","keywords":"top,jacket,men,fleece,pile","retail_price":"230.00","sale_price":"159.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=283263\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m283263.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854092&amp;link=&amp;tabs=-Details\"></script>","variants":{"8540920004":{"sku":"8540920004","vendor_sku":"A53YJK3","upc":"485409200044","size":"XXL","color":"TNF BLACK","retail_price":"159.73","sale_price":"159.73"}}}
