{"sku":"854046","manufacturer_id":"15975","brand_name":"Rei","product_name":" REI Lookout 40 Pack - Women's","long_description":"The women's REI Lookout 40 pack offers a gender-specific fit and comfort for all kinds of outdoor adventures, whether you're enjoying a cool forest hike or a done-in-a-day summit scramble. Sculpted shoulder straps, canted hipbelt and short torso length all work together to offer women a comfortable fit. Updated shoulder straps and hipbelt provide a soft and ergonomic fit while stiff load-carrying sections preserve comfort under heavy weight. FreeFlow back panel features multiple ventilation channels so cool air can flow across your back. Spring steel frame transfers weight to the hipbelt and stabilizes the load from unwanted side-to-side movement; perimeter design allows the back panel to conform to your back. Panel-loading main compartment makes it easy to organize your gear; bottom zipper adds easy access. Hydration pocket can be accessed from the pack's exterior, allowing you quick access to refill your reservoir (sold separately) without digging into your pack. Small zippered pocket with soft lining provides an ideal spot for storing delicate items such as sunglasses or electronics. Innovative water-bottle pocket design allows a bottle to be stored in an easy-to-reach position, then rotated and locked in place for secure storage. Trekking pole attachments feature adjustable lower loops that capture the pole tips, while an elastic quick-clip securely fastens your poles to the pack. Simple, pulley-style side compression straps compress more of the bag than traditional single straps and with less extra weight and material than dual straps. Quick-release compression straps on the bottom provide an easy attachment point for sit pads or other bulky items. Lightweight lash points allow additional gear to be strapped to the front of the pack. The REI Lookout 40 pack features a thermoplastic elastomer bottom panel that provides waterproof durability to withstand years of heavy use.","short_description":"The women's REI Lookout 40 pack offers a gender-specific fit and comfort for all kinds of outdoor adventures, whether you're enjoying a cool forest hike or a done-in-a-day summit scramble.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411271.png","image_url":"http://i1.avlws.com/115/l411271.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411271&tt=df","retail_price":"99.50","sale_price":"99.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411271\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411271.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854046&amp;link=&amp;tabs=-Details\"></script>","variants":{"8540460001":{"sku":"8540460001","vendor_sku":"15975","upc":"485404600016","color":"DARK GRAPE/MAGENTA","retail_price":"99.50","sale_price":"99.50"},"8540460002":{"sku":"8540460002","vendor_sku":"15975","upc":"485404600023","color":"NIGHTSEA/TURQUOISE JUNGLE","retail_price":"99.50","sale_price":"99.50"}}}
