{"sku":"854043","manufacturer_id":"15977","brand_name":"Rei","product_name":" REI Traverse 30 Pack","long_description":"The REI Traverse 30 pack hauls a day's worth of gear with a contoured fit that helps keep you comfy over miles of trails. Its technical, trail-ready design serves seasoned hikers and beginners alike. Curved, padded hipbelt and stiff, load-carrying sections in the shoulder straps create a soft and conforming fit without sacrificing comfort under heavy loads. Multiple ventilation channels in the sculpted foam back panel allowing cooling air to flow across your back while you hike. Spring steel perimeter frame transfers weight to the hipbelt, stabilizes unwanted side-to side-movement and allows the back panel to conform comfortably to your back. Panel-loading main compartment makes it easy to load and access your gear; sleeve and tube port accommodate a hydration reservoir (sold separately). Pack has a top zippered pocket with soft lining for delicate items such as sunglasses or your smartphone. Zippered front pocket offers easy access to your map or other slim items. StraightShot water-bottle pocket makes it easy to store and retrieve a bottle; simply rotate and lock the bottle securely in place; elastic bungee adds even more security. TipGrip loops cinch to secure trekking-pole tips while the elastic quick clips securely fasten the poles' shafts to the pack. Pulley-style compression straps let you cinch down loads for jostle-free carrying; lightweight lash points let you strap gear to to the front of the pack. Cordura polyester fabric offers durability for years of heavy use; TuffCoat bottom panels add waterproof durability and resistance to abrasion.","short_description":"The REI Traverse 30 pack hauls a day's worth of gear with a contoured fit that helps keep you comfy over miles of trails. Its technical, trail-ready design serves seasoned hikers and beginners alike.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411259.png","image_url":"http://i1.avlws.com/115/l411259.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411259&tt=df","retail_price":"89.50","sale_price":"61.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411259\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411259.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854043&amp;link=&amp;tabs=-Details\"></script>","variants":{"8540430001":{"sku":"8540430001","vendor_sku":"15977","upc":"485404300015","color":"BLACK","retail_price":"61.93","sale_price":"61.93"}}}
