{"sku":"854489","manufacturer_id":"A93T70J","brand_name":"The North Face","product_name":"The North Face Base Camp Hot Shot Pack - 2012 Closeout","long_description":"The North Face Base Camp Hot Shot pack melds the durable and waterproof fabric of the Base Camp duffel with the proven and popular design of the Hot Shot pack, creating a pack that outlasts all. Constructed with durable, waterproof Base Camp fabric, this pack is built to last-and keep your contents dry. Flexible, ventilated shoulder straps are injection-molded and contoured for load-carrying comfort. Padded back panel with a breathable spine channel helps keep you comfortable during intense activity and warm weather. Large main compartment can accommodate most 15-in. laptops; universal sleeve with hydration port holds a hydration reservoir (sold separately). Organization compartment makes small items easy to find; mesh pockets on each side keep water bottles or snacks within easy reach. The North Face Base Camp Hot Shot pack features side compression straps and water-resistant zippers. Closeout.","short_description":"The North Face Base Camp Hot Shot pack melds the durable and waterproof fabric of the Base Camp duffel with the proven and popular design of the Hot Shot pack, creating a pack that outlasts all.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s282911.png","image_url":"http://i1.avlws.com/115/l282911.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=282911&tt=df","keywords":"sack,bag,rucksack,carryon,carry-on","retail_price":"109.00","sale_price":"74.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=282911\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m282911.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854489&amp;link=&amp;tabs=-Details\"></script>","variants":{"8544890001":{"sku":"8544890001","vendor_sku":"A93T70J","upc":"485448900011","size":"One Size","color":"TNF YELLOW/BLACK","retail_price":"74.73","sale_price":"74.73"}}}
