{"sku":"854490","manufacturer_id":"A93UNZ3","brand_name":"The North Face","product_name":"The North Face Base Camp Double Shot Pack - Women's - 2012 Closeout","long_description":"The North Face Base Camp Double Shot women's pack was inspired by the orginial Base Camp Duffel. This pack offers the same sleek and rugged performance for hauling essentials in all kinds of weather. Constructed with the same durable, waterproof fabric as the legendary Base Camp duffel, this pack is built to last-and keep your contents dry. Injection-molded shoulder straps alleviate clavicle hot spots, pressure points and neck strain. Comfortable air-mesh back panel features a recessed channel to take pressure off your spine; polyethylene framesheet offers extra back support. Main compartment contains a padded laptop sleeve that fits most 13 in. laptops; secondary sleeve fits a tablet. The North Face Base Camp Double Shot pack features a front pocket that makes small items easy to find. Using BackSaver technology, the bottom front is designed with a lifted angle helping to position pack's load higher on your back for ideal carrying. Safety features include an integrated whistle on chest buckle. Closeout.","short_description":"The North Face Base Camp Double Shot women's pack was inspired by the orginial Base Camp Duffel. This pack offers the same sleek and rugged performance for hauling essentials in all kinds of weather.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s284767.png","image_url":"http://i1.avlws.com/115/l284767.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=284767&tt=df","keywords":"traveling,travel,pack,luggage,backpack","retail_price":"109.00","sale_price":"39.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=284767\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m284767.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854490&amp;link=&amp;tabs=-Details\"></script>","variants":{"8544900002":{"sku":"8544900002","vendor_sku":"A93UNZ3","upc":"485449000024","size":"One Size","color":"TNF WHITE/ZINC GREY","retail_price":"39.73","sale_price":"39.73"}}}
