{"sku":"854495","manufacturer_id":"APNKUA1","brand_name":"The North Face","product_name":"The North Face Surge Laptop Pack - Women's - 2012 Closeout","long_description":"The North Face Surge laptop pack features a suspension designed for women, letting you carry a 15 in. laptop, plus school or work essentials in comfort. Women-specific adjustable, padded shoulder straps and padded back panel offer load-carrying comfort; polyethylene sheet along back helps add structure and support. Dedicated, zippered and padded laptop sleeve handles laptops up to 15 in.; main compartment works great for organizing books, files or other large items. Middle pocket features a deluxe organizer; front pocket features dual zip access to multiple pockets for must-have items. Zippered and padded bottom compartment is sized to hold a power cord and other accessories. Side stretch-woven pockets keep your water bottles from bouncing around. Padded and stowable hipbelt provides additional carrying support and stability. Constructed of abrasion-, moisture- and tear-resistant ballistic nylon for exceptional durability. The North Face women's Surge laptop pack also has reflective hits to increase visibility in low light. This pack is endorsed by the American Chiropractic Association, recognizing the comfort and function of its shoulder straps, back panel and interior organization. Closeout.","short_description":"The North Face Surge laptop pack features a suspension designed for women, letting you carry a 15 in. laptop, plus school or work essentials in comfort.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Computer Bags","thumb_url":"http://i1.avlws.com/115/s289927.png","image_url":"http://i1.avlws.com/115/l289927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=289927&tt=df","keywords":"schoolpack,computer,carrier,day,laptop","retail_price":"125.00","sale_price":"86.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=289927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m289927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854495&amp;link=&amp;tabs=-Details\"></script>","variants":{"8544950002":{"sku":"8544950002","vendor_sku":"APNKUA1","upc":"617932302883","size":"One Size","color":"VAPOROUS GREY HEATHER","retail_price":"86.73","sale_price":"86.73"}}}
