{"sku":"854456","manufacturer_id":"A92XYH3","brand_name":"The North Face","product_name":"The North Face Recon Pack - 2012 Closeout","long_description":"You'll treasure The North Face Recon pack as it takes you on towering summit adventures and everyday urban adventures to work and school. Injection-molded shoulder straps alleviate clavicle hot spots, pressure points and neck strain; padded, winged hipbelt can be stowed out of the way when not in use. Comfortable air-mesh back panel features a recessed channel to take pressure off your spine; polyethylene framesheet offers extra back support. Panel-loading main compartment offers plenty of room for gear and clothing, or books and binders. Laptop sleeve fits most 15 in. laptops; it doubles as a hydration pocket with drinking tube exit port (reservoir not included). Secondary compartment with organizer helps keep track of pens and pencils, wallet, cell phone, electronics and other daily essentials. Large front mesh drop pocket closes with a buckle to securely hold a bike helmet or jacket. Small front zippered stash pocket stows small necessities. The North Face Recon pack features dual side mesh pockets that can hold water bottles or snacks. This pack is endorsed by the American Chiropractic Association, recognizing the comfort and function of its shoulder straps, back panel and interior organization. Closeout.","short_description":"You'll treasure The North Face Recon pack as it takes you on towering summit adventures and everyday urban adventures to work and school.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s282883.png","image_url":"http://i1.avlws.com/115/l282883.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=282883&tt=df","keywords":"school,bag,rucksack,carry-on,bookbag","retail_price":"99.00","sale_price":"73.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=282883\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m282883.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854456&amp;link=&amp;tabs=-Details\"></script>","variants":{"8544560002":{"sku":"8544560002","vendor_sku":"A92XYH3","upc":"485445600020","size":"One Size","color":"FIERY RED PLAID","retail_price":"73.73","sale_price":"73.73"}}}
