{"sku":"854455","manufacturer_id":"A92WYH3","brand_name":"The North Face","product_name":"The North Face Hot Shot Pack - 2012 Closeout","long_description":"The generously sized North Face Hot Shot pack is a panel-loader with plenty of the technical features you need for an all-day adventure. Injection-molded shoulder straps alleviate clavicle hot spots, pressure points and neck strain; padded, winged hipbelt can be stowed out of the way when not in use. Comfortable air-mesh back panel features a recessed channel to take pressure off your spine; polyethylene framesheet offers extra back support. Large main compartment can accommodate most 15-in. laptops; universal sleeve with hydration port holds a hydration reservoir (not included). Organization compartment makes small items easy to find; mesh pockets on each side hold water bottles or other accessories. Clip or tie your extra gear onto the daisy chain to keep it within easy reach. The North Face Base Hot Shot pack features side compression straps. This pack is endorsed by the American Chiropractic Association, recognizing the comfort and function of its shoulder straps, back panel and interior organization. Closeout.","short_description":"The generously sized North Face Hot Shot pack is a panel-loader with plenty of the technical features you need for an all-day adventure.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s283035.png","image_url":"http://i1.avlws.com/115/l283035.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=283035&tt=df","keywords":"travel,traveling,backpack,pack,luggage","retail_price":"99.00","sale_price":"68.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=283035\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m283035.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854455&amp;link=&amp;tabs=-Details\"></script>","variants":{"8544550001":{"sku":"8544550001","vendor_sku":"A92WYH3","upc":"053329800196","size":"One Size","color":"FIERY RED PLAID","retail_price":"68.73","sale_price":"68.73"}}}
