{"sku":"854689","brand_name":"Patagonia","product_name":"Patagonia Rubicon Rider Insulated Jacket - Women's","long_description":"Designed for cold days on the slopes, the Patagonia Rubicon Rider women's jacket boasts cozy insulation and good weather protection to ensure you're toasty warm as you fly down the mountain. Jacket features a hybrid construction, with the ripstop polyester shell fabric featuring highly water resistant and breathable Deluge(R) Durable Water Repellent coating. Shoulders, elbows and bottom hem are reinforced with 2-layer waterproof, breathable H2No(R) panels to prevent wet-through and increase durability at critical points. 150g synthetic insulation (90% of which is recycled material) provides insulating warmth, even if it gets damp; it also compresses easily for compact stowing. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Removable, helmet-compatible hood can be easily adjusted with just one hand; collar is lined with soft microfleece at back of neck and at chin for next-to-skin comfort. Adjustable powder skirt features webbing loops that connect to compatible ski or snowboard pants to keep snow out (pants sold separately). Zippered handwarmer pockets; zippered chest pockets (one with cable routing); one internal zip stash pocket and an internal open pocket for your goggles. Drawcord hem seals out drafts and can be adjusted from within the front pockets; rip-and-stick cuffs fit over or under gloves and adjust comfortably around your wrists. Pit zippers on Patagonia Rubicon Rider women's insulated jacket let you control your comfort; articulated sleeves enable easy movement.","short_description":"Designed for cold days on the slopes, the Patagonia Rubicon Rider women's jacket boasts cozy insulation and good weather protection to ensure you're toasty warm as you fly down the mountain.","category":"Skiing","subcategory":"Women's Ski Clothing","product_group":"Women's Insulated Ski Jackets","thumb_url":"http://i1.avlws.com/115/s337039.png","image_url":"http://i1.avlws.com/115/l337039.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=337039&tt=df","keywords":"jacket,insulated,hardshell","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=337039\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m337039.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854689&amp;link=&amp;tabs=-Details\"></script>","variants":{"8546890001":{"sku":"8546890001","vendor_sku":"29461","upc":"887187117598","size":"XS","color":"BIRCH WHITE","retail_price":"299.00","sale_price":"299.00"},"8546890006":{"sku":"8546890006","vendor_sku":"29461","upc":"887187116416","size":"XS","color":"WILLOW HERB GREEN","retail_price":"299.00","sale_price":"299.00"}}}
