{"sku":"854624","manufacturer_id":"31441","brand_name":"Patagonia","product_name":"Patagonia Insulated Powder Bowl Jacket - Men's","long_description":"In- or out-of-bounds, the Patagonia Insulated Powder Bowl jacket keeps you warm and dry with Gore-Tex(R) protection and cozy synthetic insulation so you can play in the pow as long as you want. Sturdy Gore-Tex waterproof, breathable shell fabric ensures you stay dry in heavy storms; 2-layer construction incorporates a sweat-wicking mesh lining to keep you comfortable. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Synthetic insulation (90% of which is recycled material) provides insulating warmth, even if it gets damp; it also compresses easily for compact stowing. Adjustable powder skirt features webbing loops that connect to compatible ski or snowboard pants to keep snow out (pants sold separately). Removable, 2-way adjustable and helmet-compatible hood has a visor for added protection in bad conditions; tall collar protects neck and face, even when hood is down. Zippered pockets-including handwarmers, chest, forearm and interior-offer ample storage for small items; separate secure media pocket features cable routing. Pleated gussets at wrists create a secure fit over or under gloves. Coated zippers are watertight and optimized for reduced bulk and weight. Underarm zips on the Patagonia Insulated Powder Bowl jacket let you vent excess heat, whether you're skinning up your favorite slope or hanging out in the lodge.","short_description":"In- or out-of-bounds, the Patagonia Insulated Powder Bowl jacket keeps you warm and dry with Gore-Tex(R) protection and cozy synthetic insulation so you can play in the pow as long as you want.","category":"Skiing","subcategory":"Men's Ski Clothing","product_group":"Men's Insulated Ski Jackets","thumb_url":"http://i1.avlws.com/115/s338791.png","image_url":"http://i1.avlws.com/115/l338791.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=338791&tt=df","keywords":"insulated,hardshell,jacket","retail_price":"479.00","sale_price":"479.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=338791\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m338791.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854624&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
