{"sku":"854623","manufacturer_id":"31672","brand_name":"Patagonia","product_name":"Patagonia Snowshot 3-in-1 Insulated Jacket - Men's","long_description":"The Patagonia Snowshot 3-in-1 insulated jacket delivers all-in-one versatility from the slopes to the village. Wear the waterproof shell or the insulated liner jacket on their own, or combine them. Rugged, two-layer polyester shell with H2No(R) waterproof, breathable laminate provides all-weather protection. Jacket is treated with a Deluge Durable Water Repellent finish to shed light rain and snow. Shell features a polyester mesh lining that moves moisture away from your body and glides easily over base layers. Removable, two-way adjustable hood is helmet compatible and has a visor for added protection in bad conditions; tall collar protects neck and face from cold air. Patagonia Snowshot jacket features generous underarm zips to dump excess heat quickly and allow good airflow. Adjustable powder skirt helps seal out snow and offers webbing loops to connect to any Patagonia snow pants (sold separately). Drawcord hem helps keeps chilling drafts at bay; rip-and-stick cuffs adjust comfortably around wrists, over or under your gloves. Zippered handwarmer pockets, chest pocket (holds electronic device with cable routing) and an interior pocket. Removable puffy liner jacket features Thermogreen insulation that stays warm even when wet; zip it into the shell jacket for serious warmth or wear it solo as weather permits. Thermogreen synthetic insulation in liner jacket is made from 90% recycled materials. Liner jacket is also treated with a Deluge Durable Water Repellent finish for water resistance and quick drying.","short_description":"The Patagonia Snowshot 3-in-1 insulated jacket delivers all-in-one versatility from the slopes to the village. Wear the waterproof shell or the insulated liner jacket on their own, or combine them.","category":"Skiing","subcategory":"Men's Ski Clothing","product_group":"Men's Insulated Ski Jackets","thumb_url":"http://i1.avlws.com/115/s337007.png","image_url":"http://i1.avlws.com/115/l337007.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=337007&tt=df","keywords":"hardshell,insulated,jacket","retail_price":"399.00","sale_price":"399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=337007\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m337007.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854623&amp;link=&amp;tabs=-Details\"></script>","variants":{"8546230014":{"sku":"8546230014","vendor_sku":"31672","upc":"887187256747","size":"XL","color":"PRAIRIE GOLD","retail_price":"399.00","sale_price":"399.00"}}}
