{"sku":"854717","manufacturer_id":"71540-4506","brand_name":"Marmot","product_name":" Marmot Tower Three Insulated Jacket - Men's","long_description":"With light and lofty Thermal R insulation and a resilient MemBrain(R) waterproof laminate, the Marmot Tower Three insulated jacket will keep you warm and dry on midwinter mountain adventures. MemBrain(R) 2-layer waterproof, breathable laminated fabric fends off moisture and wind while reducing internal condensation, so you stay dry, warm and comfortable. All seams are taped to prevent moisture from seeping in. Thermal R polyester fiber insulation keeps you warm on cold winter mornings; Thermal R insulation has an excellent warmth-to-weight ratio and is very durable. Internal powder skirt helps seal out cold air and wet snow while retaining valuable warmth. PitZips(TM) extend along body of jacket, offering excellent ventilation control. Zip-off storm hood with laminated brim protects you in poor conditions. Roomy Angel-Wing Movement(TM) fit accommodates layering so you can stay comfortable at both the top and bottom of the mountain. 1 zippered chest pocket; 1 flap chest pocket; zippered sleeve pocket and hand pockets; mesh goggles pocket; zippered sunglasses pocket. Polyester-lined collar and chin guard wick moisture and are soft against your skin. Marmot Tower Three insulated jacket has rip-and-stick cuffs and an elastic drawcord hem that help seal warmth in.","short_description":"With light and lofty Thermal R insulation and a resilient MemBrain(R) waterproof laminate, the Marmot Tower Three insulated jacket will keep you warm and dry on midwinter mountain adventures.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s401611.png","image_url":"http://i1.avlws.com/115/l401611.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=401611&tt=df","retail_price":"300.00","sale_price":"149.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=401611\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m401611.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854717&amp;link=&amp;tabs=-Details\"></script>","variants":{"8547170001":{"sku":"8547170001","vendor_sku":"71540-4506","upc":"785562681613","size":"S","color":"GATOR/GREEN ENVY","retail_price":"149.83","sale_price":"149.83"},"8547170004":{"sku":"8547170004","vendor_sku":"71540-4506","upc":"785562681651","size":"XL","color":"GATOR/GREEN ENVY","retail_price":"149.83","sale_price":"149.83"}}}
