{"sku":"854742","manufacturer_id":"12676","brand_name":"Arc'teryx","product_name":" Arc'teryx Keibo Insulated Jacket - Men's","long_description":"When your friends head for the lodge, you can keep carving turns despite cold temps and blowing snow thanks to the warmth and protection provided by the waterproof Arc'teryx Keibo insulated jacket. Windproof, waterproof Gore-Tex(R) three-layer construction is supple, durable and breathable; all seams are taped. Features lightweight, compressible and non-woven Coreloft(TM) Compact 80g synthetic insulation; it retains warmth even when wet and has excellent loft recovery. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Powder skirt with snap closure keeps out cold air and snow; slide-and-lock snaps attach jacket to compatible pants (sold separately). Helmet-compatible StormHood(TM) and generous collar protect you in inclement weather without sacrificing your peripheral vision. Pit zippers let you vent body heat quickly; mesh prevents snow from getting in through the vents. Includes insulated hand pockets, a sleeve pocket, internal mesh pocket and internal secure media pocket. The Arc'teryx Keibo jacket has a relaxed fit.","short_description":"When your friends head for the lodge, you can keep carving turns despite cold temps and blowing snow thanks to the warmth and protection provided by the waterproof Arc'teryx Keibo insulated jacket.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s401619.png","image_url":"http://i1.avlws.com/115/l401619.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=401619&tt=df","retail_price":"750.00","sale_price":"479.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=401619\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m401619.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854742&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["mens","mens-jackets","mens-insulated-jackets"]}
