{"sku":"854706","manufacturer_id":"31475","brand_name":"Patagonia","product_name":"Patagonia Slim Insulated Powder Bowl Pants - Women's","long_description":"Slim in fit but not in features, the Patagonia Slim Insulated Powder Bowl pants boast Gore-Tex(R) waterproof protection and lightweight, warm insulation for all-mountain, all-condition performance. Sturdy Gore-Tex waterproof, breathable shell fabric ensures you stay dry in heavy storms; 2-layer construction incorporates a sweat-wicking mesh lining to keep you comfortable. Durable Water Repellent finish causes water to bead up and roll off, fending off melting snow to help keep you dry. Thermogreen synthetic insulation (with 90% recycled material) in critical areas provides insulating warmth, even if it gets damp; it also compresses for compact stowing. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Mesh-lined thigh vents let you release excess body heat while keeping out snow. Loop at rear of waistband lets you securely connect a compatible Patagonia jacket's powder skirt to the pants for an integrated riding system (jacket sold separately). Brushed lining on waistband wicks sweat and provides against-the-skin comfort; zip-fly, two-snap closure and adjustable waistband tabs provide a personalized fit. Snow gaiters securely wrap around boots to keep snow from entering pants; scuff guards protect insides of legs and cuffs from abrasion and sharp edges. Slim fit reduces bulk; gusseted crotch and articulated knees on the Patagonia Slim Powder Bowl shell pants enable unrestricted movement. Zippered handwarmer pockets; zippered thigh cargo pocket; zippered back pocket.","short_description":"Slim in fit but not in features, the Patagonia Slim Insulated Powder Bowl pants boast Gore-Tex(R) waterproof protection and lightweight, warm insulation for all-mountain, all-condition performance.","category":"Skiing","subcategory":"Women's Ski Clothing","product_group":"Women's Ski Pants","thumb_url":"http://i1.avlws.com/115/s338843.png","image_url":"http://i1.avlws.com/115/l338843.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=338843&tt=df","keywords":"snowpant,pant,hardshell pants,snow pants,pants","retail_price":"379.00","sale_price":"379.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=338843\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m338843.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854706&amp;link=&amp;tabs=-Details\"></script>","variants":{"8547060003":{"sku":"8547060003","vendor_sku":"31475","upc":"887187173112","size":"M","color":"BLACK","retail_price":"379.00","sale_price":"379.00"},"8547060004":{"sku":"8547060004","vendor_sku":"31475","upc":"887187173143","size":"L","color":"BLACK","retail_price":"379.00","sale_price":"379.00"},"8547060008":{"sku":"8547060008","vendor_sku":"31475","upc":"887187175000","size":"M","color":"IKAT PURPLE","retail_price":"379.00","sale_price":"379.00"},"8547060009":{"sku":"8547060009","vendor_sku":"31475","upc":"887187175017","size":"L","color":"IKAT PURPLE","retail_price":"379.00","sale_price":"379.00"}}}
