{"sku":"854705","manufacturer_id":"31135","brand_name":"Patagonia","product_name":" Patagonia Snowbelle Insulated Pants - Women's Long","long_description":"Stay out and play in the snow all day with the women's Patagonia Insulated Snowbelle snow pants, which boast a long inseam and a waterproof, lightweight and insulated design. Rugged, 2-layer polyester shell is backed with a waterproof, breathable laminate to deliver all-weather protection, from late spring slush to snorkel-deep pow. Durable Water Repellent finish causes water to bead up and roll off, fending off melting snow to help keep you dry. 60g of synthetic insulation-90% of which is recycled content-provides insulating warmth, even if it gets damp; plus, it compresses easily for compact stowing. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Polyester lining helps move sweat away from your body and glides smoothly over base layers; thigh vents let you release excess body heat for comfort. Brushed lining on waistband wicks sweat and provides against-the-skin comfort; zip-fly, 2-snap closure and adjustable waistband tabs provide a personalized fit. Snow gaiters securely wrap around boots with gripper elastic to keep snow from entering pants; scuff guards protect cuffs from abrasion and sharp edges. Zippered handwarmer pockets. Articulated knees allow unrestricted movement for deep knee drops and radical aerials.","short_description":"Stay out and play in the snow all day with the women's Patagonia Insulated Snowbelle snow pants, which boast a long inseam and a waterproof, lightweight and insulated design.","category":"Women's Clothing","subcategory":"Women's Pants","product_group":"Women's Snow Pants","thumb_url":"http://i1.avlws.com/115/s395515.png","image_url":"http://i1.avlws.com/115/l395515.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=395515&tt=df","keywords":"hardshell","retail_price":"199.00","sale_price":"148.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=395515\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m395515.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854705&amp;link=&amp;tabs=-Details\"></script>","variants":{"8547050001":{"sku":"8547050001","vendor_sku":"31135","upc":"887187254965","size":"XS LONG","color":"BLACK","retail_price":"148.93","sale_price":"148.93"}}}
