{"sku":"854805","manufacturer_id":"75020-2381","brand_name":"Marmot","product_name":"Marmot Freerider Insulated Pants - Women's","long_description":"The women's Marmot Freerider pants protect you from weather on the slopes and look good doing it. Gore-Tex(R) 2-layer fabric seals out the weather and polyester insulation fends off winter's chill. Waterproof, breathable and windproof 2-layer Gore-Tex laminate construction provides an excellent defense against heat-robbing moisture and windchill. All seams are taped to prevent moisture from seeping in. Thermal R polyester fiber insulation keeps you warm on cold winter mornings; Thermal R insulation has an excellent warmth-to-weight ratio and is very durable. Zip-in gasket allows the pants to zip together with compatible jackets, such as the Marmot Dawn Patrol jacket (sold separately), to completely seal out winter weather. Unzip the leg vents when you're working up a sweat skinning in the backcountry. Internal gaiters with gripper elastic prevent snow from getting into your boots. Ankle zippers allow easy on and off over boots; Cordura(R) nylon scuff guards at the hems. Handwarmer pockets and back pockets have water-resistant zippers to keep moisture from getting in; flapped cargo pocket with zipper pocket provides additional storage. Brushed tricot lines the seat and thighs to add warmth and help wick moisture. The Marmot Freerider pants have a loose fit that is fuller than a regular cut in the hips, thighs, knees and cuffs.","short_description":"The women's Marmot Freerider pants protect you from weather on the slopes and look good doing it. Gore-Tex(R) 2-layer fabric seals out the weather and polyester insulation fends off winter's chill.","category":"Women's Clothing","subcategory":"Women's Pants","product_group":"Women's Snow Pants","thumb_url":"http://i1.avlws.com/115/s395527.png","image_url":"http://i1.avlws.com/115/l395527.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=395527&tt=df","keywords":"hardshell","retail_price":"380.00","sale_price":"284.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=395527\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m395527.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854805&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["womens","womens-pants","womens-snow-pants"]}
