{"sku":"854906","manufacturer_id":"376276-310","brand_name":"Nike","product_name":"Nike Zoom Kaiju Snowboard Boots - 2013/2014","long_description":"If you're an all-mountain rider who enjoys a softer boot, choose the Nike Zoom Kaiju snowboard boots. They feature Nike Free-inspired outsoles for a more connected feel to your board. Lace locking hardware personalizes the fit by allowing the upper and lower zones to tighten independently of each other. High-end synthetic waterproof leather uppers keep feet dry; full-length internal backstays give boots a soft flex for great control in turns. Custom moldable polyethylene and EVA foam liners feature an easy-to-use, secure lace-lock power strap and stretchy neoprene toe boxes for extra comfort. Internal lacing harnesses keep your heels locked down; neoprene flex zones at ankles encourage forward flex so you can rip big turns and control your edges. Warming Blanket Strobel is a heat-reflective material in both the shell and the liner that helps retain heat and keep the cold out. Nike Free-inspired midsoles/outsoles feature embedded Zoom Air cushioning for superior comfort when on your board and when walking around.","short_description":"If you're an all-mountain rider who enjoys a softer boot, choose the Nike Zoom Kaiju snowboard boots. They feature Nike Free-inspired outsoles for a more connected feel to your board.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s383099.png","image_url":"http://i1.avlws.com/115/l383099.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383099&tt=df","retail_price":"360.00","sale_price":"251.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383099\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383099.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854906&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboard-boots","mens-snowboard-boots"]}
