{"sku":"854945","brand_name":"Rei","product_name":"REI Quantum Laptop Pack","long_description":"The REI Quantum Laptop pack hauls up to 15.6 in. laptops in a stable backpack bag design. It provides convenience, protection, organization and comfort for commuters, students and professionals. Main pocket has a generously padded pocket that fits most 15 in. laptops; laptop can also be accessed through a side zipper. Separate neoprene sleeve inside the main pocket houses most tablets or smaller electronic devices as well. Fully featured front organizer pocket holds pens, electronics and small essentials. Side mesh pocket fits 1-liter water bottle. Shoulder harness with ergonomic contours provides comfort and great fit; includes a sternum strap to secure the pack when you're on the move. Top and side grab handles for easy hauling of the REI Quantum Laptop daypack. Cordura(R) nylon fabric offers superior abrasion resistance and tear strength; fabric is coated for water resistance and durability. Reflective trim enhances visibility in dusk/dark conditions; web loop holds blinky light (sold separately).","short_description":"The REI Quantum Laptop pack hauls up to 15.6 in. laptops in a stable backpack bag design. It provides convenience, protection, organization and comfort for commuters, students and professionals.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s323131.png","image_url":"http://i1.avlws.com/115/l323131.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=323131&tt=df","keywords":"travel,pack,daypack,carry on,small","retail_price":"99.50","sale_price":"99.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=323131\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m323131.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854945&amp;link=&amp;tabs=-Details\"></script>","variants":{"8549450001":{"sku":"8549450001","vendor_sku":"16052","upc":"485494500012","color":"BLACK","retail_price":"99.50","sale_price":"99.50"}}}
