{"sku":"854947","brand_name":"Rei","product_name":"REI Quantum Brief","long_description":"The REI Quantum Brief offers professionals and travelers a smart option for carrying 15 in. laptops in a TSA checkpoint-friendly design and the ability to securely carry the brief on wheeled luggage. Fits most 15.6 in. laptops and is designed to be TSA checkpoint-friendly: dedicated rear pocket opens flat to allow laptop to remain inside during security screening. Main compartment is sized to carry letter-size documents and file folders. Interior mesh pocket expands to varying sizes and fits up to 1-liter water bottles. Fully featured front organizer pocket holds pens, electronics and small essentials; key clip. Shoulder strap offers sliding shoulder pad and easy length adjustments, and is removable; top carry handle. Cordura(R) nylon fabric offers superior abrasion resistance and tear strength; fabric is coated for water resistance and durability. Reflective trim enhances visibility in dusk/dark conditions; web loop holds blinky light (sold separately). REI Quantum Brief slides over wheeled luggage pull handles for secure attachment, getting you through the airport smoothly and easily.","short_description":"The REI Quantum Brief offers professionals and travelers a smart option for carrying 15 in. laptops in a TSA checkpoint-friendly design and the ability to securely carry the brief on wheeled luggage.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s323147.png","image_url":"http://i1.avlws.com/115/l323147.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=323147&tt=df","keywords":"carry on,small,shoulder bag,crossbody,briefcase","retail_price":"89.50","sale_price":"89.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=323147\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m323147.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854947&amp;link=&amp;tabs=-Details\"></script>","variants":{"8549470001":{"sku":"8549470001","vendor_sku":"16057","upc":"485494700016","color":"BLACK","retail_price":"89.50","sale_price":"89.50"},"8549470002":{"sku":"8549470002","vendor_sku":"16057","upc":"485494700023","color":"CARDAMOM","retail_price":"89.50","sale_price":"89.50"}}}
