{"sku":"854917","manufacturer_id":"ARGTJ00003-PPV3","brand_name":"Roxy","product_name":" Roxy American Pie Printed Insulated Jacket - Girls'","long_description":"She is the future of snowboarding, and she wants stylish comfort. Grant her wish with the girls' Roxy American Pie Printed insulated jacket and warmth, waterproof protection and fun fashion. Waterproof, windproof polyester shell combines taped critical seams with a Durable Water Repellent coating to create a dependable barrier against rain and snow. 200g synthetic polyester insulation in the body (140g in the sleeves and 80g in the hood) effectively traps heat, even when wet. Smooth polyester taffeta lining slides easily over layers when she's bundling up for a cold day. Jacket-to-pants interface attaches the jacket to compatible Roxy pants (sold separately). Polyurethane-coated powder skirt, adjustable cuffs and Lycra(R) spandex wrist gaiters help seal out snow and cold air. Adjustable hood; soft fleece chin guard; zippered handwarmer pockets; easy-access media and goggles pockets; mesh-lined vents; O-ring ticket holder.","short_description":"She is the future of snowboarding, and she wants stylish comfort. Grant her wish with the girls' Roxy American Pie Printed insulated jacket and warmth, waterproof protection and fun fashion.","category":"Kids' Clothing","subcategory":"Kids' Jackets","product_group":"Kids' Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s428619.png","image_url":"http://i1.avlws.com/115/l428619.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=428619&tt=df","retail_price":"109.95","sale_price":"54.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=428619\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m428619.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854917&amp;link=&amp;tabs=-Details\"></script>","variants":{"8549170004":{"sku":"8549170004","vendor_sku":"ARGTJ00003-PPV3","upc":"887170897292","size":"L","color":"STRIPE FLOWERS","retail_price":"54.83","sale_price":"54.83"}}}
