{"sku":"854943","manufacturer_id":"16056","brand_name":"Rei","product_name":"REI Quantum Shoulder Bag","long_description":"The REI Quantum Shoulder bag fits small laptops and features a TSA checkpoint-friendly design. It provides convenience, protection, organization and comfort for commuters, students and professionals. Fits most 13 - 14 in. laptops and is designed to be TSA checkpoint-friendly: dedicated rear pocket opens flat to allow laptop to remain inside during security screening. Rear pocket also includes a sleeve that will hold a tablet separate from your laptop. Main compartment is sized to carry letter-size documents and file folders. Fully featured front organizer pocket holds pens, electronics and small essentials; key clip. Fully padded side zipper pocket keeps smaller belongings protected and accessible. Mesh side pocket expands to varying sizes and fits up to 1-liter water bottles. Shoulder strap offers sliding shoulder pad and easy length adjustments, and is removable; top carry handle. Cordura(R) nylon fabric offers superior abrasion resistance and tear strength; fabric is coated for water resistance and durability. Reflective trim enhances visibility in dusk/dark conditions; web loop holds blinky light (sold separately).","short_description":"The REI Quantum Shoulder bag fits small laptops and features a TSA checkpoint-friendly design. It provides convenience, protection, organization and comfort for commuters, students and professionals.","category":"Luggage & Travel","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s323143.png","image_url":"http://i1.avlws.com/115/l323143.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=323143&tt=df","keywords":"small,purse,shoulder bag,crossbody,shoulder","retail_price":"79.50","sale_price":"79.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=323143\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m323143.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854943&amp;link=&amp;tabs=-Details\"></script>","variants":{"8549430001":{"sku":"8549430001","vendor_sku":"16056","upc":"485494300018","color":"BLACK","retail_price":"79.50","sale_price":"79.50"}}}
