{"sku":"854912","brand_name":"Patagonia","product_name":"Patagonia Powslayer Shell Bib Pants - Men's","long_description":"Slice and carve your way through endless powder in the Patagonia Powslayer shell bib pants, which boast highly breathable Gore-Tex(R) Pro Shell construction with the increased coverage of bibs. 3-layer Gore-Tex Pro Shell material is tough, extremely breathable and durably waterproof and windproof for protection in any weather. Durable Water Repellent finish causes water to bead up and roll off, fending off melting snow to help keep you dry. Full-coverage bibs have a drop-seat configuration and center-font zipper with snap closure for venting; thigh vents let you release excess body heat while keeping snow out. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Loop on rear yoke lets you securely connect a compatible Patagonia jacket's powder skirt to the bibs for an integrated riding system (jacket sold separately). Snow gaiters securely wrap around boots to keep snow from entering pants; scuff guards protect insides of legs and cuffs from abrasion and sharp edges. Gusseted crotch and articulated knees on the Patagonia Powslayer bibs allow a great range of motion. Belt loops at waist make it easy to convert the bibs to pants for comfort when you're hiking up slopes. Zippered handwarmer pockets; drop-in thigh cargo pockets.","short_description":"Slice and carve your way through endless powder in the Patagonia Powslayer shell bib pants, which boast highly breathable Gore-Tex(R) Pro Shell construction with the increased coverage of bibs.","category":"Skiing","subcategory":"Men's Ski Clothing","product_group":"Men's Ski Pants","thumb_url":"http://i1.avlws.com/115/s338835.png","image_url":"http://i1.avlws.com/115/l338835.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=338835&tt=df","keywords":"snowpant,hardshell pants,pant,snow pants,pants","retail_price":"599.00","sale_price":"599.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=338835\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m338835.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=854912&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
