{"sku":"855066","manufacturer_id":"999515","brand_name":"Kryptonite","product_name":"Kryptonite New York 1210 Chain Lock","long_description":"Delivering excellent security, the Kryptonite New York 1210 chain lock has 12mm thick chain links and a sturdy lock to help protect your valuable bike from theft. Robust 12mm, 6-sided chain links are made from 3t hardened manganese steel for stout strength. Chain is covered with a protective nylon cover to ensure lasting use that also helps protect your frame's finish; rip-and-stick loops at ends hold cover in place. Evolution series U-lock has a 14mm MAX-Performance hardened steel shackle that resists bolt cutters and leverage attacks; oval crossbar is stronger than most round crossbars. Disc-style cylinder delivers high security protection that is pull- and drill-resistant; hardened double-deadbolt locking mechanism offers sure holding power. Centrally placed key slot offers added defense against leverage attacks; rotating dust cover protects and extends the life of the lock's internals. Comes with 3 stainless-steel keys; 1 key features a built-in light with a high-intensity bulb and replaceable battery. Kryptonite rates the Kryptonite New York 1210 chain lock a 9 on a 10-point system with 1 being simple, deterrent security and 10 being extreme security. Eligible for Key Safe Program; register your key number with Kryptonite for easy replacement of lost or worn keys for a minimal fee.","short_description":"Delivering excellent security, the Kryptonite New York 1210 chain lock has 12mm thick chain links and a sturdy lock to help protect your valuable bike from theft.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Locks","thumb_url":"http://i1.avlws.com/115/s376251.png","image_url":"http://i1.avlws.com/115/l376251.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376251&tt=df","retail_price":"104.95","sale_price":"104.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376251\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376251.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855066&amp;link=&amp;tabs=-Details\"></script>","variants":{"8550660001":{"sku":"8550660001","vendor_sku":"999515","upc":"720018999515","retail_price":"104.95","sale_price":"104.95"}},"categories":["cycling","bike-accessories","bike-locks"]}
