{"sku":"855041","manufacturer_id":"31139-16","brand_name":"Obermeyer","product_name":" Obermeyer Aria Insulated Jacket - Women's","long_description":"With a flattering fit and confident weather protection, the Obermeyer Aria insulated jacket offers style and performance, plus warm insulation, to keep you cozy from the slopes to the village. HydroBlock(R) X waterproof, breathable laminate supplies refuge from wind and snow; critical seams sealed for added weather protection. ComforMax(R) polyester fiber insulation provides a high level of warmth with minimal weight. Integrated, adjustable powder skirt keeps you dry by sealing out the spindrift. Pit zippers let you quickly and easily control core temperature, expelling excess body heat as needed during high activity. Top half of jacket features an external stormflap with snap closure to lock out windchill. Removable, adjustable hood; roomy, fleece-lined collar for added warmth. Stretch fleece inner cuffs add warmth and an extra barrier against snow entry. Zippered handwarmer pockets; zip waist pockets; interior media pocket; internal zip pocket; detachable, scratch-free goggles cloth; integrated key ring. Obermeyer Aria jacket fits long and is slightly shaped.","short_description":"With a flattering fit and confident weather protection, the Obermeyer Aria insulated jacket offers style and performance, plus warm insulation, to keep you cozy from the slopes to the village.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s393611.png","image_url":"http://i1.avlws.com/115/l393611.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=393611&tt=df","retail_price":"269.50","sale_price":"159.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=393611\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m393611.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855041&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
