{"sku":"855040","manufacturer_id":"31167-55","brand_name":"Obermeyer","product_name":" Obermeyer Brynn Insulated Jacket - Women's","long_description":"Stay warm and protected from winter elements in the Obermeyer Brynn jacket, which offers waterproof, insulated comfort to keep you going from first chair to last call. HydroBlock(R) X waterproof, breathable laminate supplies refuge from wind and snow; critical seams sealed for added weather protection. ComforMax(R) polyester fiber insulation provides a high level of warmth with minimal weight. Integrated, adjustable powder skirt keeps you dry by sealing out the spindrift. Pit zippers let you quickly and easily control core temperature, expelling excess body heat as needed during high activity. Full-length external stormflap blocks windchill. Zippered handwarmer pockets; Napoleon pocket; sleeve patch pocket; interior media pocket; detachable, scratch-free goggles cloth; integrated key ring. Removable, adjustable hood; roomy, fleece-lined collar for added warmth. Adjustable cuffs have stretch fleece inner cuffs with thumbholes that add warmth and an extra barrier against snow entry. Obermeyer Brynn jacket fits long and is slightly shaped.","short_description":"Stay warm and protected from winter elements in the Obermeyer Brynn jacket, which offers waterproof, insulated comfort to keep you going from first chair to last call.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s393607.png","image_url":"http://i1.avlws.com/115/l393607.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=393607&tt=df","retail_price":"249.50","sale_price":"186.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=393607\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m393607.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855040&amp;link=&amp;tabs=-Details\"></script>","variants":{"8550400004":{"sku":"8550400004","vendor_sku":"31167-55","upc":"700599950570","size":"10","color":"BLUE","retail_price":"186.93","sale_price":"186.93"}}}
