{"sku":"855064","manufacturer_id":"V041032","brand_name":"Rei","product_name":" REI V04 10 x 32 Waterproof Binoculars","long_description":"Slip the tough, light and compact REI V04 10 x 32 waterproof binoculars into your pack and pull the action in close with bright, clear image quality you'd expect to find in much more expensive optics. Fully multicoated, anti-reflective lenses and dielectric coated prisms provide effective light transmission, even in low light. Roof-prism style creates a more compact design than traditional porro prism styles, making these binoculars light, small and easy to carry when hiking or backpacking. Long eye relief enhances viewing comfort by reducing eye strain regardless of whether user is wearing eyeglasses or not; twist-up eyecups let you use when wearing glasses. Excellent close focus ability allows user to enjoy a sharp view of images at a short distance. Shockproof, rubberized aluminum body stands up to rugged use in the field; binoculars are water- and fogproof thanks to sealed O-rings and nitrogen filling. The REI V04 10 x 32 waterproof binoculars include a carry case, neck strap and lens cleaning cloth.","short_description":"Slip the tough, light and compact REI V04 10 x 32 waterproof binoculars into your pack and pull the action in close with bright, clear image quality you'd expect to find in much more expensive optics.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Binoculars And Optics","thumb_url":"http://i1.avlws.com/115/s417999.png","image_url":"http://i1.avlws.com/115/l417999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417999&tt=df","retail_price":"200.00","sale_price":"200.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855064&amp;link=&amp;tabs=-Details\"></script>","variants":{"8550640001":{"sku":"8550640001","vendor_sku":"V041032","upc":"485506400019","color":"BLACK","retail_price":"200.00","sale_price":"200.00"}},"categories":["camping-hiking","gadgets","binoculars-and-optics"]}
