{"sku":"855259","manufacturer_id":"KCR106B","brand_name":"686","product_name":" 686 Smarty Command 3-in-1 Insulated Jacket - Men's","long_description":"The tricked-out 686 Smarty Command 3-in-1 insulated jacket has weatherproof protection and a warm fleece liner jacket for versatility and comfort on the slopes. Liner jacket features 260g fleece insulation; wear the shell and liner jacket together for the most warmth and protection, or wear either piece solo in appropriate weather. Durable polyester shell jacket features INFIDRY-10(TM) waterproof, breathable coating, supplying weather protection and ample breathability. Critical seams are taped for added weather protection. Single-pull hood adjustment with laminated brim offers protection from inclement weather. Pit-zip vents regulate core temperature and feature mesh gussets to keep snow out; use the right chest vent to increase airflow and access lining pockets. Articulated sleeves are designed to move with the body, increasing comfort and range of motion. Internal, adjustable powder skirt helps seal out cold air and wet snow while retaining valuable warmth. Two-way front zipper has inner draft flap protection from cold wind. Includes zippered handwarmer pockets, right chest cargo pocket, left chest flip-up pocket with ski pass holder and internal lining pockets. 686 Smarty Command 3-in-1 jacket is rated to keep you warm from about 0degF to 32degF. All-access fit allows plenty of room for you to move around and be comfortable when you're snowboarding.","short_description":"The tricked-out 686 Smarty Command 3-in-1 insulated jacket has weatherproof protection and a warm fleece liner jacket for versatility and comfort on the slopes.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s401635.png","image_url":"http://i1.avlws.com/115/l401635.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=401635&tt=df","retail_price":"250.00","sale_price":"149.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=401635\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m401635.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855259&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
