{"sku":"855262","manufacturer_id":"L3W106","brand_name":"686","product_name":"686 Plexus Stealth Thermagraph Shell Jacket - Men's","long_description":"You'll eventually encounter stormy weather when you're up high on the ski hill and it's best to be prepared. Get robust protection with the waterproof 686 Plexus Stealth Thermagraph shell jacket. INFIDRY-20(TM) breathable waterproof coating provides the highest level of weather protection offered by 686 for use in blizzardlike conditions and cold temps. 160g polyester insulation panels in the body deliver warmth; fully taped seams ensure water doesn't make its way inside. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Flip up the hood to hunker down when the winds start swirling snow around; zip off the hood when you don't need it. Internal, adjustable powder skirt helps seal out cold air and wet snow while retaining valuable warmth. Oversize hand pockets and a left chest pocket have zippered closures to keep items secure; hand pockets can still be accessed when wearing a backpack. Invisible zippered sleeve vents and right chest vent allow cooling airflow when you start to heat up; chest vent allows access to the lining pockets. Expedition fit has an ergonomic tailored cut that moves with you and doesn't get in the way. 686 Plexus Stealth Thermagraph shell jacket is rated to keep you warm from about 10degF to 32degF.","short_description":"You'll eventually encounter stormy weather when you're up high on the ski hill and it's best to be prepared. Get robust protection with the waterproof 686 Plexus Stealth Thermagraph shell jacket.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Snow Jackets","thumb_url":"http://i1.avlws.com/115/s402439.png","image_url":"http://i1.avlws.com/115/l402439.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=402439&tt=df","keywords":"hardshell","retail_price":"300.00","sale_price":"179.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=402439\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m402439.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855262&amp;link=&amp;tabs=-Details\"></script>","variants":{"8552620006":{"sku":"8552620006","vendor_sku":"L3W106","upc":"883510225169","size":"M","color":"BRICK HOUNDSTOOTH","retail_price":"179.83","sale_price":"179.83"},"8552620008":{"sku":"8552620008","vendor_sku":"L3W106","upc":"883510225183","size":"XL","color":"BRICK HOUNDSTOOTH","retail_price":"179.83","sale_price":"179.83"}},"categories":["mens","mens-jackets","mens-snow-jackets"]}
