{"sku":"855370","manufacturer_id":"131528-611-1-O/","brand_name":"Osprey","product_name":" Osprey Ozone Wheeled Convertible Luggage - 28\"","long_description":"Giving you more options than ever, the Osprey Ozone Wheeled Convertible 28\" luggage features an integrated zip-off daypack and zip-stow removable backpack harness, at an incredibly low weight. HighRoad LT(TM) chassis is light, strong and smooth rolling; it shaves almost 20% off the weight of the original HighRoad chassis. HighRoad LT premium suspension features a 6001 aluminum frame; highly durable, injection-molded, high-clearance ABS base; and large polyurethane wheels with sealed bearings. Extendable handle is ergonomically designed for comfortable gripping. Torso-adjustable suspension system is built-in and stows quickly for rolling or check-in; can be removed when your trip won't require carrying a backpack. Removable 15L daypack gives you versatility with a padded sleeve that fits most 15 in. laptops, a padded tablet sleeve, organization for small items and mesh side pockets. Lightweight construction and fabrics feature strategic reinforcements at key wear areas. Large panel zippered access to main compartment has lockable sliders. Two external compression straps secure load and help protect zippers. External zip top pocket is ideal for toiletries, liquids and frequently needed items. Internal compression straps keep gear and clothing neat and secure; 3 large internal zip pockets keep gear organized. Ozone Handle-It(TM) slot on the daypack lets you slide the daypack (when unzipped from the luggage) over the luggage handle for secure attachment. Low-profile, padded top and side handles let you lift and carry the Osprey Ozone 28\" in comfort.","short_description":"Giving you more options than ever, the Osprey Ozone Wheeled Convertible 28\" luggage features an integrated zip-off daypack and zip-stow removable backpack harness, at an incredibly low weight.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433879.png","image_url":"http://i1.avlws.com/115/l433879.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433879&tt=df","retail_price":"329.95","sale_price":"329.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433879\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433879.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855370&amp;link=&amp;tabs=-Details\"></script>","variants":{"8553700001":{"sku":"8553700001","vendor_sku":"131528-611-1-O/","upc":"877257020750","color":"LIGHT BLUE","retail_price":"329.95","sale_price":"329.95"},"8553700002":{"sku":"8553700002","vendor_sku":"131528-711-1-O/","upc":"877257020767","color":"LIGHT GREEN","retail_price":"329.95","sale_price":"329.95"}},"categories":["travel","luggage","wheeled-luggage"]}
