{"sku":"855418","manufacturer_id":"12701","brand_name":"Arc'teryx","product_name":" Arc'teryx Beta AR Jacket - Men's","long_description":"Perfect for backcountry minimalists, the Arc'teryx Beta AR jacket ensures durable storm protection in a lightweight, waterproof and windproof jacket that's easy to take along. Hip-length Gore-Tex(R) Pro Shell jacket reduces layering overlap and bulkiness; the reinforced shoulders and elbows survive alpine abuse. Gore-Tex Pro Shell three-layer laminate fabric is tough, extremely breathable and durably waterproof and windproof. Fewer seams mean lighter weight; thin (flat seams) reduce chafing and abrasion. Thin, low-denier, low-density Gore Micro Grid lining slides easily over layers. Helmet-compatible Drop Hood(TM) offers fast access to storm protection; it lies below the high collar when not in use and can be cinched in to seal the collar. Hood's cord locks are concealed underneath a waterproof flap to maintain a clean finish and protect them from potential snow and ice buildup; they adjust easily with one hand. WaterTight(TM) front zipper and pocket zippers reduce flap bulkiness; Molded Zipper Garages(TM) ensure a leak-free seal. Features a full-length front zipper backed by a laminated interior windflap; laminated chin guard protects sensitive skin. Pit zippers allow easy and efficient ventilation; WaterTight zippers do away with bulky zipper flaps. Features a laminated hem drawcord and micro die-cut cuffs with rip-and-stick closures. Hand pockets are vertically oriented in a traditional \"chicken-wing\" position for everyday comfort and are accessible while wearing a harness or backpack. Internal chest pocket features a durable, low-bulk laminated zipper. No-lift gusseted underarms allow jacket to stay in place when arms are raised, ensuring unhindered movement; articulated elbows ensure a non-binding fit. The Arc-teryx Beta AR jacket features a dropped rear hem exceptional coverage. Athletic, close-fitting cut aids warmth without inhibiting movement.","short_description":"Perfect for backcountry minimalists, the Arc'teryx Beta AR jacket ensures durable storm protection in a lightweight, waterproof and windproof jacket that's easy to take along.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Rain Jackets","thumb_url":"http://i1.avlws.com/115/s401987.png","image_url":"http://i1.avlws.com/115/l401987.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=401987&tt=df","keywords":"hardshell","retail_price":"550.00","sale_price":"550.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=401987\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m401987.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855418&amp;link=&amp;tabs=-Details\"></script>","variants":{"8554180022":{"sku":"8554180022","vendor_sku":"12701","upc":"806955636130","size":"S","color":"BLACK","retail_price":"550.00","sale_price":"550.00"},"8554180023":{"sku":"8554180023","vendor_sku":"12701","upc":"806955636123","size":"M","color":"BLACK","retail_price":"550.00","sale_price":"550.00"},"8554180024":{"sku":"8554180024","vendor_sku":"12701","upc":"806955636116","size":"L","color":"BLACK","retail_price":"550.00","sale_price":"550.00"},"8554180025":{"sku":"8554180025","vendor_sku":"12701","upc":"806955636147","size":"XL","color":"BLACK","retail_price":"550.00","sale_price":"550.00"},"8554180026":{"sku":"8554180026","vendor_sku":"12701","upc":"806955636161","size":"XXL","color":"BLACK","retail_price":"550.00","sale_price":"550.00"}}}
