{"sku":"855593","manufacturer_id":"1108008","brand_name":"Time","product_name":" Time Xpresso 8 Carbon Bike Pedals","long_description":"Lightweight, highly adjustable and easy to get in and out of, these Time Xpresso 8 Carbon bike pedals deliver excellent performance for your demanding road-riding exploits. Instead of metal springs, flexible carbon fiber blades tension the retention mechanisms, ensuring a secure pedal connection while reducing weight. Getting into the pedals is a breeze, thanks to the low-tension engagement of the retention mechanism: step in with little pressure, pedal engages cleat, and then pedal away! Oversize pedal platform and low stack height (distance from shoe sole to pedal axle) provide solid power transfer and excellent foot-to-pedal stability. Carbon fiber-reinforced composite pedal bodies spin smoothly around sturdy and light hollow steel axles; replaceable stainless-steel wear plates enhance pedal durability. Foot/pedal interface can be tuned and optimized, offering adjustment to Q-factor (side-to-side), +/-5deg of angular float and 2.5mm of lateral float; 15deg release angle. Time Xpresso 8 Carbon bike pedals come with cleats and mounting hardware; compatible with most road cycling shoes with 3-hole mounts.","short_description":"Lightweight, highly adjustable and easy to get in and out of, these Time Xpresso 8 Carbon bike pedals deliver excellent performance for your demanding road-riding exploits.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Pedals","thumb_url":"http://i1.avlws.com/115/s388723.png","image_url":"http://i1.avlws.com/115/l388723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=388723&tt=df","retail_price":"249.00","sale_price":"249.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=388723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m388723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855593&amp;link=&amp;tabs=-Details\"></script>","variants":{"8555930001":{"sku":"8555930001","vendor_sku":"1108008","upc":"485559300014","retail_price":"249.00","sale_price":"249.00"}},"categories":["cycling","bike-components","bike-pedals"]}
