{"sku":"855501","manufacturer_id":"OL5615-370","brand_name":"Mountain Hardwear","product_name":"Mountain Hardwear Vanskier Insulated Jacket - Women's","long_description":"Combining a top-notch waterproof exterior and warm insulation, the Mountain Hardwear Vanskier(TM) insulated jacket keeps you dry and warm without feeling clammy while you're on the slopes. Dry.Q(TM) Elite premium waterproof, breathable technology offers a high level of breathability while preventing snow, rain and wind from getting in. Thermal.Q(TM) polyester insulation offers good loft and compressibility for lightweight, evenly distributed warmth. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Removable, adjustable stretch powder skirt helps seal out cold air and wet snow while keeping valuable warmth in. Open up the pit zips to allow cooling airflow when you're working up a sweat; adjustable hood fits over your ski helmet. Stash your lift pass in the pocket on the lower left arm; zippered hand pockets are positioned so you can still access them while wearing a backpack. Internal mesh pockets and a zippered security pocket provide additional storage. Cinch the hem around your waist with the hidden adjusters in the hand pockets; chin guard is lined with soft tricot for comfort next to skin. Mountain Hardwear Vanskier insulated jacket snaps to the Vanskier pants (sold separately) for coordinating style and excellent performance in snow.","short_description":"Combining a top-notch waterproof exterior and warm insulation, the Mountain Hardwear Vanskier(TM) insulated jacket keeps you dry and warm without feeling clammy while you're on the slopes.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s462467.png","image_url":"http://i1.avlws.com/115/l462467.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=462467&tt=df","retail_price":"400.00","sale_price":"239.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=462467\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m462467.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855501&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["womens","womens-jackets","womens-insulated-jackets"]}
