{"sku":"855637","manufacturer_id":"036718-627-1-O/","brand_name":"Osprey","product_name":"Osprey Reverb 18 Snow Pack","long_description":"When powdery side-country adventure awaits, load up the Osprey Reverb 18 snow pack with your snow-riding essentials and enjoy low-profile style and practical utility on the chairlift or out of bounds. Reinforced lower front-panel wing and a stowable strap on the left shoulder allow vertical board carry; reinforced hipbelt wing accommodates horizontal carry for short hikes. For quick and comfortable diagonal ski carry, slide the tails through the bottom front-panel webbing and secure the top of the ski with the left shoulder strap's webbing cinch. Back-panel entry to the main compartment allows access to gear when carrying skis or a snowboard and helps keep the back panel, shoulder straps and hipbelt out of the snow. Zippered protective sleeve with external drain and insulated tube route accommodate a reservoir (sold separately). Front-panel pocket offers speedy access to avalanche gear; larger probes and shovel handles stow in secure, external storage sleeves. the Osprey Reverb 18 snow pack also features a zippered goggles pocket.","short_description":"When powdery side-country adventure awaits, load up the Osprey Reverb 18 snow pack with your snow-riding essentials and enjoy low-profile style and practical utility on the chairlift or out of bounds.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s342519.png","image_url":"http://i1.avlws.com/115/l342519.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=342519&tt=df","keywords":"day packs","retail_price":"99.00","sale_price":"99.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=342519\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m342519.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855637&amp;link=&amp;tabs=-Details\"></script>","variants":{"8556370001":{"sku":"8556370001","vendor_sku":"036718-627-1-O/","upc":"877257020712","size":"18 LTR","color":"BERG BLUE","retail_price":"99.00","sale_price":"99.00"}},"categories":["snow","ski-packs-and-bags","ski-packs"]}
