{"sku":"855634","manufacturer_id":"036632-703-1-S/","brand_name":"Osprey","product_name":" Osprey Kode 32 Snow Pack","long_description":"Incorporating feedback from backcountry professionals and athletes, the redesigned Osprey Kode 32 snow pack offers logical organization and sharp style for riders seeking off-piste snow play. Wide ski loops and glove-friendly buckles let you carry skis diagonally or A-frame style; reinforced front-panel and hipbelt wings allow vertical or horizontal snowboard carry. Anatomically shaped shoulder straps, hipbelt and back panel feature supportive EVA foam padding; adjustable sternum strap features a whistle built into the buckle. Internal HDPE frame sheet provides structural support and transfers load weight to the hips. Pack volume easily fits the tools you need for a day of backcountry fun; improved access and organization offer convenience and aid in emergencies where speed matters. Back-panel entry to the main compartment allows access to gear when carrying skis or a snowboard and helps keep the back panel, shoulder straps and hipbelt out of the snow. Zippered protective sleeve with external drain and insulated tube route accommodate a reservoir (sold separately); zippered interior pocket helps keep small items organized. Extra-large, front-panel J-zipper ensures fast access to the avalanche-kit pocket, even when a board or skis are attached; inside sleeves hold shovel handles and probes. Stowable stretch-mesh at the top lets you secure a helmet; attachment loop lets you lash on an ice tool. The Osprey Kode 32 ski pack also features reinforced wear points, a scratch-free goggles pocket and zippered hipbelt pockets.","short_description":"Incorporating feedback from backcountry professionals and athletes, the redesigned Osprey Kode 32 snow pack offers logical organization and sharp style for riders seeking off-piste snow play.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s342011.png","image_url":"http://i1.avlws.com/115/l342011.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=342011&tt=df","keywords":"day packs","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=342011\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m342011.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855634&amp;link=&amp;tabs=-Details\"></script>","variants":{"8556340001":{"sku":"8556340001","vendor_sku":"036632-703-1-S/","upc":"877257020675","size":"S/M","color":"NITRO GREEN","retail_price":"149.00","sale_price":"149.00"},"8556340002":{"sku":"8556340002","vendor_sku":"036632-703-2-M/","upc":"877257020682","size":"M/L","color":"NITRO GREEN","retail_price":"149.00","sale_price":"149.00"}}}
