{"sku":"855635","manufacturer_id":"036642-550-1-S/","brand_name":"Osprey","product_name":" Osprey Kode 42 Snow Pack","long_description":"Incorporating design feedback from backcountry professionals and athletes, the updated Osprey Kode 42 snow pack adds logical organization and sharp style to a full day or overnight off-piste venture. Wide ski loops and glove-friendly buckles let you carry skis diagonally or A-frame style; reinforced front-panel and hipbelt wings allow vertical or horizontal snowboard carry. Anatomically shaped shoulder straps, hipbelt and back panel feature supportive EVA foam padding; adjustable sternum strap features a whistle built into the buckle. Internal HDPE frame sheet provides structural support and transfers load weight to the hips. Pack volume easily fits the tools you need for a day of backcountry fun; improved access and organization offer convenience and aid in emergencies where speed matters. Top and back-panel entry to the main compartment lets you access gear when carrying skis or a snowboard and helps keep shoulder straps and hipbelt out of the snow. Zippered protective sleeve with external drain and insulated tube route accommodate a reservoir (sold separately); zippered interior pocket helps keep small items organized. Extra-large, front-panel J-zipper ensures fast access to the avalanche-kit pocket, even when a board or skis are attached; inside sleeves hold shovel handles and probes. Top lid pocket features an integrated helmet attachment and under-lid rope carry; attachment loop lets you lash on an ice tool. The Osprey Kode 42 snow pack also features reinforced wear points, a scratch-free goggles pocket and zippered hipbelt pockets.","short_description":"Incorporating design feedback from backcountry professionals and athletes, the updated Osprey Kode 42 snow pack adds logical organization and sharp style to a full day or overnight off-piste venture.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s342015.png","image_url":"http://i1.avlws.com/115/l342015.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=342015&tt=df","keywords":"day packs","retail_price":"169.00","sale_price":"169.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=342015\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m342015.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855635&amp;link=&amp;tabs=-Details\"></script>","variants":{"8556350001":{"sku":"8556350001","vendor_sku":"036642-302-1-S/","upc":"877257021337","size":"S/M","color":"HOODOO RED","retail_price":"169.00","sale_price":"169.00"},"8556350002":{"sku":"8556350002","vendor_sku":"036642-302-2-M/","upc":"877257021344","size":"M/L","color":"HOODOO RED","retail_price":"169.00","sale_price":"169.00"},"8556350003":{"sku":"8556350003","vendor_sku":"036642-550-1-S/","upc":"877257021351","size":"S/M","color":"BLACK","retail_price":"169.00","sale_price":"169.00"}},"categories":["snow","ski-packs-and-bags","ski-packs"]}
