{"sku":"855723","manufacturer_id":"SM8387-342","brand_name":"Columbia","product_name":" Columbia Aerial Arson Shell Pants - Men's","long_description":"Cold, wet winter weather doesn't stand a chance against the Columbia Aerial Arson pants. They provide the protection you need from the top of the chair lift all the way to the bottom of the ski slope. Omni-Tech(R) waterproof, breathable protection with fully sealed seams keeps you warm and dry in all types of weather. Pant lining features Omni-Heat(TM) thermal reflective technology to retain body warmth while dispersing moisture and excess heat. Nylon shell fabric wicks away moisture to reduce chilling condensation buildup on the inside. Contoured waist with adjustable tabs lets you dial in the fit. Lower leg snap closures offer venting and easy on and off over footwear. Columbia Aerial Arson pants sport internal, adjustable leg gaiters to prevent snow from sneaking in. Waterproof zip handwarmer pockets and cargo pockets; reinforced cuff guards; zip and snap waist. Pants feature tabs to connect a compatible Columbia jacket, sold separately.","short_description":"Cold, wet winter weather doesn't stand a chance against the Columbia Aerial Arson pants. They provide the protection you need from the top of the chair lift all the way to the bottom of the ski slope.","category":"Men's Clothing","subcategory":"Men's Pants","product_group":"Men's Snow Pants","thumb_url":"http://i1.avlws.com/115/s403723.png","image_url":"http://i1.avlws.com/115/l403723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=403723&tt=df","keywords":"hardshell","retail_price":"150.00","sale_price":"111.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=403723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m403723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855723&amp;link=&amp;tabs=-Details\"></script>","variants":{"8557230004":{"sku":"8557230004","vendor_sku":"SM8387-342","upc":"887253229392","size":"XL","color":"CYBER GREEN","retail_price":"111.93","sale_price":"111.93"}}}
