{"sku":"855742","manufacturer_id":"010-01066-10","brand_name":"Garmin","product_name":" Garmin Oregon 600t GPS","long_description":"With pre-loaded 100K mapping and WAAS and GLONASS compatibility, the Garmin 600t GPS combines dual orientation and customizable buttons to take handheld navigation to the next level. Built-in 100K topographic mapping data covers the entire United States, including Alaska, Hawaii and Puerto Rico. Map detail includes national, state and local parks and forests, terrain contours, elevation information, trails, rivers, lakes and points of interest. Included worldwide basemap features shaded relief; easily add more maps such as TOPO U.S. 24K and City Navigator(R) (sold separately) with the microSD(TM) card slot. Basemap stores up to 4,000 waypoints, 200 routes and 200 tracks with up to 10,000 points. Compatibility with Russian GLONASS system allows up to 20% faster and more reliable satellite acquisition, helpful in challenging spots such as deep canyons or heavy cover. GLONASS lets the Oregon 600t lock on to 24 more satellites than using GPS alone; WAAS (Wide Area Augmentation System) receiver is accurate to within 10 ft. in North America. Brilliant, sunlight-readable touchscreen is reinforced for impact resistance; dual-orientation display lets you view maps and data in portrait or landscape mode. Reflective display technology uses external light, such as sunlight, along with an LED backlight to increase brightness. Multi-touch design accommodates easy operation while wearing gloves; customizable buttons allow 1-touch waypoint marking. 3-axis electronic compass with accelerometer tilt compensation shows where your're heading even when you're standing still, without the need to hold the unit level. Barometric altimeter tracks changes in pressure to help pinpoint your altitude; it also plots barometric pressure over time to track changing weather conditions. Full Track view shows your entire elevation profile; Future Plot uses your mapping data to predict the elevation profile of your route ahead.","short_description":"With pre-loaded 100K mapping and WAAS and GLONASS compatibility, the Garmin 600t GPS combines dual orientation and customizable buttons to take handheld navigation to the next level.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412599.png","image_url":"http://i1.avlws.com/115/l412599.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412599&tt=df","retail_price":"480.00","sale_price":"480.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412599\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412599.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855742&amp;link=&amp;tabs=-Details\"></script>","variants":{"8557420001":{"sku":"8557420001","vendor_sku":"010-01066-10","upc":"753759994839","retail_price":"480.00","sale_price":"480.00"}},"categories":["camping-hiking","camp-electronics","gps"]}
