{"sku":"855729","manufacturer_id":"010-01064-00","brand_name":"Garmin","product_name":"Garmin Edge 510 GPS Bike Computer","long_description":"With a color touchscreen and advanced connectivity, the Garmin Edge 510 GPS bike computer provides abundant ride data at your fingertips so you can train smarter and share easier. Large 2.2 in. color touchscreen displays info in an easily accessible and navigable format; touchscreen is resistive, so you can still use it with gloves or in wet conditions. Smart connectivity capability lets you tether the Edge 510 to your smartphone, and its data connection, via Bluetooth. This connection, paired with the Garmin Connect mobile app on your smartphone, enables instant uploads of ride data, live-tracking, social network sharing and weather updates. Because the Edge 510 is handling all the GPS and processor-heavy work, your smartphone's battery is spared from demanding, battery-draining use. Activity profiles let you customize settings and displayed data based on the types of riding you do; switching between profiles is as easy as pushing the touchscreen. Edge 510 measures your distance, time, elevation calories burned, altitude, climb and descent. Motivational features include interval training, courses, alerts, workouts and personal records; Virtual Partner(R) pits you against previous performances. Compatible with 3rd-party ANT+-enabled devices or power meters for even more robust data analysis (devices and power meters sold separately). Support for 5 heart rate zones and 7 power zones lets you train smarter. High-sensitivity GPS receiver with HotFix(R) satellite prediction offers fast position calculation. For extra-precise climb and descent data, Edge 510 also incorporates a barometric altimeter to pinpoint changes in elevation. Analyze your ride and interact with a worldwide network of cyclists and outdoor enthusiasts through Garmin Connect(TM), a free website and app.","short_description":"With a color touchscreen and advanced connectivity, the Garmin Edge 510 GPS bike computer provides abundant ride data at your fingertips so you can train smarter and share easier.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375231.png","image_url":"http://i1.avlws.com/115/l375231.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375231&tt=df","retail_price":"330.00","sale_price":"330.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375231\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375231.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855729&amp;link=&amp;tabs=-Details\"></script>","variants":{"8557290001":{"sku":"8557290001","vendor_sku":"010-01064-00","upc":"753759995461","retail_price":"330.00","sale_price":"330.00"}},"categories":["cycling","bike-accessories","bike-computers"]}
