{"sku":"855851","manufacturer_id":"A1NFG8G","brand_name":"The North Face","product_name":"The North Face Shellista Lace Luxe Boots - Women's","long_description":"Ideal for icy, cold commutes, the warm and waterproof Shellista Lace Luxe boots from The North Face are designed with performance materials and fashion-forward style. Waterproof leather uppers combine with mesh panels treated with a Durable Water Repellent for added weather resistance. Waterproof thermoplastic rubber shell bottoms provide durable protection where most elements are met. Ample and lofty PrimaLoft(R) Eco insulation throughout offers warmth in conditions down to about -25degF. Faux fur collars add a touch of style and help keep snow out of boots. Dual-density EVA midsoles in The North Face Shellista Lace Luxe boots provide cushioning against shock. 3/4-length nylon shanks offer torsional stability for trekking on uneven ground. TNF Winter Grip(TM) rubber outsoles supply tenacious traction in wet, slick conditions; omnidirectional lugs are both grippy and self-cleaning. Temperature-sensitive Ice Pick(TM) rubber lugs on outsoles harden when temps fall below freezing, providing extra bite into the terrain.","short_description":"Ideal for icy, cold commutes, the warm and waterproof Shellista Lace Luxe boots from The North Face are designed with performance materials and fashion-forward style.","category":"Footwear","subcategory":"Women's Snow And Rain Boots","product_group":"Women's Multi-Sport Winter Boots","thumb_url":"http://i1.avlws.com/115/s347431.png","image_url":"http://i1.avlws.com/115/l347431.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=347431&tt=df","keywords":"snow boots,womens,winterboot,winter boots,winter hiking boots","retail_price":"160.00","sale_price":"160.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=347431\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m347431.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855851&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
