{"sku":"855888","manufacturer_id":"10001100","brand_name":"Burton","product_name":" Burton AK 2L Swash Shell jacket - Men's","long_description":"Advanced Gore-Tex(R) waterproof protection meets lightweight warmth in the Burton AK 2L Swash shell jacket to keep you happy on your big-mountain snowboarding adventures. Waterproof, breathable, windproof Gore-Tex(R) laminate provides an excellent defense against heat-robbing moisture and windchill. Fully taped seams with Gore-Tex tape create the ultimate seal against wind and snow. 40g PrimaLoft(R) insulation is placed strategically at the upper back and front body to retain warmth and keep you comfortable on cold days. Breathable taffeta lining keeps warmth inside and wicks away moisture. Contoured hood is designed to fit the shape of your head, providing all-weather defense without impairing your vision or limiting your motion. Pit zippers let you vent body heat quickly. Removable, water-resistant waist gaiter with jacket-to-pants interface creates a barrier against snow entry with compatible Burton pants (sold separately). Zippered hand pockets and zippered chest pockets with water-resistant zippers give you plenty of storage space; jacket includes an internal goggles/media pocket. Cuffs seal around your wrists to keep snow from getting in. The Burton AK 2L Swash shell jacket has a performance-oriented articulated fit with a pattern designed to mimic the body's natural flex while riding and hiking.","short_description":"Advanced Gore-Tex(R) waterproof protection meets lightweight warmth in the Burton AK 2L Swash shell jacket to keep you happy on your big-mountain snowboarding adventures.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s401703.png","image_url":"http://i1.avlws.com/115/l401703.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=401703&tt=df","retail_price":"400.00","sale_price":"279.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=401703\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m401703.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855888&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
