{"sku":"855892","manufacturer_id":"10186100","brand_name":"Burton","product_name":" Burton Cargo Shell Pants - Men's","long_description":"A tried-and-true classic, Burton Cargo waterproof breathable shell pants have a loose fit and are loaded with features to keep you stylin', comfortable and stocked up with your on-slope essentials. Fully seam-taped, DRYRIDE Durashell(TM) 2-layer coated polyester pants deliver reliable waterproof, windproof protection in any weather; mesh lining wicks interior moisture. Mesh-lined inner thigh vents keep you dry and comfortable whether you're hiking the pipe or riding the lift. Bellowed cargo pockets hold a day's worth of stuff, including your cellular link to the outside world; zippered, fleece-lined hand pockets keep fingers warm. Internal waist adjustment tabs personalize the fit; they're low profile to maximize comfort. Soft microfleece fly and waistband lining let you ride with your shirt untucked with no worries about pinching or chafing; antimicrobial finish helps keep odors at bay. Stretch gaiters with lace hooks help prevent snow from getting into boots, even in deep powder. Zippers in hems make getting your boots on and off easy, and add a relaxed look and feel. Snap-up leg lifts let you raise and secure pant cuffs, protecting the pants from parking lot carnage. Special interface connects pants to compatible Burton jackets (sold separately) to ensure snow stays outside. Secure your gloves to the glove tab to keep them from dangling in the way when you're checking maps, digging through your pack or working on your board. Include a headphone cable port and a key clip. Burton Cargo Shell pants are built with articulation for movement, and enough room to layer underneath to let them them sag, without being overly baggy.","short_description":"A tried-and-true classic, Burton Cargo waterproof breathable shell pants have a loose fit and are loaded with features to keep you stylin', comfortable and stocked up with your on-slope essentials.","category":"Men's Clothing","subcategory":"Men's Pants","product_group":"Men's Snow Pants","thumb_url":"http://i1.avlws.com/115/s403727.png","image_url":"http://i1.avlws.com/115/l403727.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=403727&tt=df","keywords":"hardshell","retail_price":"165.00","sale_price":"122.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=403727\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m403727.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855892&amp;link=&amp;tabs=-Details\"></script>","variants":{"8558920009":{"sku":"8558920009","vendor_sku":"10186100","upc":"886888480642","size":"XL","color":"CYANIDE","retail_price":"122.93","sale_price":"122.93"}},"categories":["mens","mens-pants","mens-snow-pants"]}
