{"sku":"855887","manufacturer_id":"10081100","brand_name":"Burton","product_name":" Burton Jet Set Insulated Jacket - Women's","long_description":"The waterproof Burton Jet Set insulated women's jacket will have you looking good and staying warm and dry while flying down the slopes. Two-layer woven dobby shell features DRYRIDE Durashell(TM) coating and taped critical seams for waterproof, breathable protection from the elements. Throughout jacket, 40g lightweight 3M Thinsulate(TM) is distributed for non-bulky warmth and comfort even when damp. Breathable taffeta lining keeps warmth inside and wicks away moisture; plush collar is soft against wind-blown cheeks. Mesh-lined pit zips dump excess heat and provide cooling airflow when needed. Contoured, adjustable hood fits the shape of your head, providing an all-weather defense without obstructing vision or limiting motion. Removable waist gaiter/powder skirt protects against wayward powder; interface connects jacket to compatible Burton pants to ensure snow stays outside (pants sold separately). Stow your wallet, phone and camera in the roomy, microfleece-lined handwarmer pockets, or stash your hands inside to warm them up on chilly days. Media pocket keeps your tunes close at hand; flash pass pocket ensures your ticket is readily accessible in the lift line; goggles pocket stores your eyewear. The Burton Jet Set jacket features a contoured waist and slim fit for a tailored look.","short_description":"The waterproof Burton Jet Set insulated women's jacket will have you looking good and staying warm and dry while flying down the slopes.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s393643.png","image_url":"http://i1.avlws.com/115/l393643.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=393643&tt=df","retail_price":"180.00","sale_price":"134.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=393643\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m393643.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855887&amp;link=&amp;tabs=-Details\"></script>","variants":{"8558870010":{"sku":"8558870010","vendor_sku":"10081100","upc":"886888444651","size":"XL","color":"FOXFIRE","retail_price":"134.93","sale_price":"134.93"}}}
