{"sku":"855968","manufacturer_id":"10084100","brand_name":"Burton","product_name":"Burton Trinity Insulated Jacket - Women's","long_description":"Warm, comfortable and waterproof, the Burton Trinity insulated women's jacket is finished with faux fur trim on the hood to keep your style high when you're shredding down the snowy slopes. Two-layer woven dobby shell features DRYRIDE Durashell(TM) coating and taped critical seams for windproof, waterproof breathable protection from the elements. 100g 3M(TM) Thinsulate(TM) insulation in the body, 60g in the sleeves and 40g in the hood is placed strategically to retain warmth and keep you comfortable on cold days. Breathable taffeta lining keeps warmth inside and wicks away moisture; plush collar is soft against wind-blown cheeks. Contoured, adjustable fleece hood fits the shape of your head, providing good warmth without obstructing vision; removable faux fur trim adds appeal. Mesh-lined pit zips dump excess heat and provide cooling airflow when needed. Removable waist gaiter with jacket-to-pants interface creates a barrier against snow entry with compatible Burton pants (sold separately. Stow your wallet, phone and camera in the roomy, microfleece-lined handwarmer pockets, or stash your hands inside to warm them up on chilly days. Media pocket keeps your tunes close at hand; flash pass pocket ensures your ticket is readily accessible in the lift line; goggles pocket stores your eyewear. The Burton Trinity jacket features a contoured waist and slim fit for a tailored look.","short_description":"Warm, comfortable and waterproof, the Burton Trinity insulated women's jacket is finished with faux fur trim on the hood to keep your style high when you're shredding down the snowy slopes.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s439927.png","image_url":"http://i1.avlws.com/115/l439927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=439927&tt=df","retail_price":"210.00","sale_price":"156.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=439927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m439927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855968&amp;link=&amp;tabs=-Details\"></script>","variants":{"8559680004":{"sku":"8559680004","vendor_sku":"10084100","upc":"886888445689","size":"L","color":"BURNT OLIVE","retail_price":"156.93","sale_price":"156.93"},"8559680005":{"sku":"8559680005","vendor_sku":"10084100","upc":"886888445719","size":"XL","color":"BURNT OLIVE","retail_price":"156.93","sale_price":"156.93"}},"categories":["womens","womens-jackets","womens-insulated-jackets"]}
