{"sku":"855937","manufacturer_id":"L35264300","brand_name":"Salomon","product_name":" Salomon Zero Insulated Jacket - Men's","long_description":"With progressive style, waterproof protection and insulated warmth, the Salomon Zero insulated jacket delivers in spades for freeskiers and freeriders who want to make a statement. climaPRO(TM) waterproof breathable laminate construction and fully taped seams deliver waterproof protection. Embedded RECCO(R) reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. ActiLOFT(TM) synthetic insulation provides warmth without bulk. Core vents with mesh backing let you dump excess heat and provide cooling ventilation. Powder skirt helps seal out cold air and prevent snow entry; snap-in integration lets you connect powder skirt to compatible Salomon pants (pants sold separately). Adjustable hood is removable. Rip-and-stick cuffs with Lycra(R) gaskets seal out the elements and retain warmth. Zippered handwarmer pockets; zip chest pocket; left arm lift pass pocket; inner stash pocket; mesh goggles pocket; goggles wipe. Salomon Zero insulated jacket has a relaxed fit with a longer length cut.","short_description":"With progressive style, waterproof protection and insulated warmth, the Salomon Zero insulated jacket delivers in spades for freeskiers and freeriders who want to make a statement.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s401711.png","image_url":"http://i1.avlws.com/115/l401711.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=401711&tt=df","retail_price":"280.00","sale_price":"195.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=401711\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m401711.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855937&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["mens","mens-jackets","mens-insulated-jackets"]}
