{"sku":"855927","manufacturer_id":"SL7845-012","brand_name":"Columbia","product_name":" Columbia Alpine Alliance Interchange 3-in-1 Insulated Jacket - Women's","long_description":"The Columbia Alpine Alliance(TM) Interchange 3-in-1 insulated jacket pairs a waterproof shell with a warm liner. Wear them together for serious warmth, or don either one solo as weather dictates. Shell jacket features waterproof, breathable Omni-Tech(R) coating to keep you dry in all conditions; critical seams are taped to boost weather protection. Polyester synthetic insulation retains warmth even when wet, providing cozy comfort when you're playing in the snow. Storm hood is fully adjustable to protect you from gusty winds and blowing snow. Powder skirt with elastic gripper seals out cold air and snow and retains valuable heat; powder skirt snaps out of your way when not in use. Drawcord hem and adjustable rip-and-stick cuffs seal out the elements and retain warmth. Underarm venting keeps you cool in crucial spots. Zippered chest and handwarmer pockets provide dry, secure storage of small goodies; interior includes a security stash pocket and goggle pocket. Synthetic-insulated nylon taffeta liner jacket features Omni-Shield(TM) advanced repellency to resist water and stains at the surface. Columbia Alpine Alliance jacket is fitted with a 3-point interchange system, which quickly secures the liner jacket to the shell jacket.","short_description":"The Columbia Alpine Alliance(TM) Interchange 3-in-1 insulated jacket pairs a waterproof shell with a warm liner. Wear them together for serious warmth, or don either one solo as weather dictates.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s393647.png","image_url":"http://i1.avlws.com/115/l393647.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=393647&tt=df","retail_price":"195.00","sale_price":"135.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=393647\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m393647.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855927&amp;link=&amp;tabs=-Details\"></script>","variants":{"8559270001":{"sku":"8559270001","vendor_sku":"SL7845-012","upc":"887253271315","size":"XS","color":"BLACK/QUILL","retail_price":"135.93","sale_price":"135.93"}}}
