{"sku":"855971","manufacturer_id":"10106101002","brand_name":"Burton","product_name":"Burton Fly Insulated Pants - Women's","long_description":"Down the mountain or down the pipe, the waterproof Burton Fly insulated women's pants will keep you shredding long after your friends are hiding in the lodge. Polyester shell features DRYRIDE Durashell(TM) coating and fully taped seams for waterproof, breathable protection from the elements. Throughout pants, 60g 3M(TM) Thinsulate(TM) insulation is distributed for non-bulky warmth and comfort even when damp. Polyester taffeta lining slides easily over layers. Mesh-lined inner thigh vents release excess body heat and prevent snow entry. Internal waist adjustment tabs lay flat and are lined with soft microfleece for a customized fit and comfort without bulkiness. Jacket-to-pants interface creates a solid connection with compatible Burton jackets for maximum snow seal. Zippered, microfleeced-lined handwarmer pockets quickly warm chilly fingers; dual cargo pockets and rear pockets let you stash a few snacks and essentials. Snap-up leg lifts allow you to raise and secure pant cuffs, protecting the pants from parking lot carnage. Zips in hems make getting your boots on/off easy, and add a relaxed look and feel. Stretch boot gaiters prevent snow from getting into your boots, even in deep snow. Burton Fly insulated pants have the Burton Sig Fit that provides room for layering without being overly baggy; like your jeans, the waist and hip sit below your belly button.","short_description":"Down the mountain or down the pipe, the waterproof Burton Fly insulated women's pants will keep you shredding long after your friends are hiding in the lodge.","category":"Women's Clothing","subcategory":"Women's Pants","product_group":"Women's Snow Pants","thumb_url":"http://i1.avlws.com/115/s395551.png","image_url":"http://i1.avlws.com/115/l395551.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=395551&tt=df","keywords":"hardshell","retail_price":"180.00","sale_price":"134.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=395551\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m395551.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=855971&amp;link=&amp;tabs=-Details\"></script>","variants":{"8559710011":{"sku":"8559710011","vendor_sku":"10106100","upc":"886888453653","size":"XS","color":"TRUE PENNY HUNTSMEN PLAID","retail_price":"134.93","sale_price":"134.93"}},"categories":["womens","womens-pants","womens-snow-pants"]}
