{"sku":"856069","manufacturer_id":"MT1010T2","brand_name":"New Balance","product_name":"New Balance MT1010v2 Minimus Trail-Running Shoes - Men's","long_description":"The New Balance WT1010v2 Minimus men's trail-running shoes combine a smooth, minimalist ride with additional midsole support to protect against rocky, uneven trails. Thermoplastic urethane shanks offer greater structure and underfoot support than most minimalist shoes. 4mm heel-to-toe drop encourages a fore- or midfoot strike, reducing heel strike impact. Nylon mesh uppers with polyurethane overlays provide lightweight comfort and support. Polyester/nylon linings wick perspiration away from your feet and then dry quickly so your feet stay cool, comfortable and odor-free. WT1010v2 Minimus trail-running shoes feature EVA midsoles for superb flexibility and a featherweight cushion. Vibram rubber outsoles provide lightweight performance without compromising grip or stability; updated lugs on medial sides increase traction.","short_description":"The New Balance WT1010v2 Minimus men's trail-running shoes combine a smooth, minimalist ride with additional midsole support to protect against rocky, uneven trails.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Shoes","thumb_url":"http://i1.avlws.com/115/s385859.png","image_url":"http://i1.avlws.com/115/l385859.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385859&tt=df","retail_price":"109.95","sale_price":"74.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385859\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385859.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856069&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","mens-footwear","mens-shoes"]}
