{"sku":"856065","manufacturer_id":"L35377100","brand_name":"Bonfire","product_name":"Bonfire Morris Insulated Jacket - Men's","long_description":"Built to take on the snowy slopes of your favorite ski resort, the waterproof Bonfire Morris insulated jacket blends rugged and iconic American workwear styling with tough-as-nails performance. Waterproof, breathable nylon shell with critically taped seams keeps wet winter weather from getting inside. Durable water repellent finish causes water to bead up and roll off, fending off light rain showers and snow. 40g polyester fiber synthetic insulation throughout and a brushed tricot lining keep you warm on mid-winter days on the ski slopes. Internal, adjustable powder skirt helps seal out cold air and wet snow while retaining valuable warmth. Mesh-backed underarm vents let in generous airflow when you need it, but keep out snow. Articulated sleeves are designed to move with the body, increasing comfort and range of motion. Includes handwarmer pockets with a key hook; chest pockets; sleeve pocket holds your ski pass; internal pocket with cable routing holds your digital music player. Snap pant interface offers a seamless connection between jacket and coordinating Bonfire pants to keep out snow and cold air (pants sold separately). Bonfire Morris insulated jacket has a classic fit.","short_description":"Built to take on the snowy slopes of your favorite ski resort, the waterproof Bonfire Morris insulated jacket blends rugged and iconic American workwear styling with tough-as-nails performance.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s462943.png","image_url":"http://i1.avlws.com/115/l462943.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=462943&tt=df","retail_price":"209.95","sale_price":"104.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=462943\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m462943.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856065&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["mens","mens-jackets","mens-insulated-jackets"]}
