{"sku":"856099","manufacturer_id":"A205-TL2-MT1-00","brand_name":"Freeplay","product_name":" Freeplay Indigo Plus Lantern","long_description":"When you need to shed a little light on the issue, the versatile Freeplay Indigo Plus lantern offers reliable, hand-cranked power and emits a range of brightness to fit all your needs. Winner of a 2007 Consumer Electronics Show Innovations Award for superior design. Compact lantern features a cluster of 9 LEDs; dimmer switch lets you adjust from area lighting to nightlight use. Single, side-mounted LED provides flashlight-style directional lighting. Rechargeable NiMH battery powers light cluster up to 60 hrs. in nightlight mode and 3 hrs. at maximum brightness. It also charges the directional light up to 60 hrs. But should the NiMH run down while power is out, no problem-simply wind the handle for quick, dependable lighting. 60 sec. of winding powers cluster up to 2 hrs. on nightlight and 2 min. at maximum brightness; powers directional light for 12 min. USB-compatible wall adaptor (sold separately) recharges NiMH battery to 100% capacity in 20 hrs. LEDs are nearly indestructible and provide as much as 100,000 hrs. use. Features a wire-bail handle curved to accommodate fingers; bail also provides a convenient means of hanging lantern.","short_description":"When you need to shed a little light on the issue, the versatile Freeplay Indigo Plus lantern offers reliable, hand-cranked power and emits a range of brightness to fit all your needs.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Lanterns","thumb_url":"http://i1.avlws.com/115/s417391.png","image_url":"http://i1.avlws.com/115/l417391.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417391&tt=df","retail_price":"49.95","sale_price":"49.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417391\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417391.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856099&amp;link=&amp;tabs=-Details\"></script>","variants":{"8560990001":{"sku":"8560990001","vendor_sku":"A205-TL2-MT1-00","color":"SILVER","retail_price":"49.95","sale_price":"49.95"}}}
