{"sku":"856137","manufacturer_id":"47925","brand_name":"Patagonia","product_name":"Patagonia Chacabuco 32L Backpack - 2012 Closeout","long_description":"Across Chile or across campus, the versatile Patagonia Chacabuco 32L backpack transitions easily from globe-trotting to global studies. 3 compartments accommodate a ton of gear while keeping everything organized. Large main compartment holds most of your gear, and features a padded laptop sleeve that accommodates laptops up to 17 in.; sleeve secures with a buckle closure. Sleeve also fits a hydration reservoir (not included) for the trail and features a tube port for easy access. Zippered pocket features an organizer panel to keep pens, electronics, keys and other small items secure. Exterior zippered stash pocket is perfect for accessing essential items such as energy food and a multitool. Exterior bungee cord is perfect for attaching items to outside of pack. Airflow-mesh shoulder straps and back panel prevent overheating; webbing hipbelt and sternum strap with emergency whistle keep pack close to body. The Patagonia Chacabuco pack features stretch-mesh side pockets for stashing your water bottles. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline). Closeout.","short_description":"Across Chile or across campus, the versatile Patagonia Chacabuco 32L backpack transitions easily from globe-trotting to global studies.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Computer Bags","thumb_url":"http://i1.avlws.com/115/s294527.png","image_url":"http://i1.avlws.com/115/l294527.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=294527&tt=df","keywords":"schoolpack,day,computer,carrier,bag","retail_price":"99.00","sale_price":"68.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=294527\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m294527.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856137&amp;link=&amp;tabs=-Details\"></script>","variants":{"8561370003":{"sku":"8561370003","vendor_sku":"47925","upc":"885657502592","size":"One Size","color":"BRILLIANT GREEN","retail_price":"68.73","sale_price":"68.73"}}}
