{"sku":"856158","manufacturer_id":"48315","brand_name":"Patagonia","product_name":"Patagonia Half Mass Courier Bag - 2012 Closeout","long_description":"Books, tablet, lunch, a jacket and more-the Patagonia Half Mass courier bag holds enough gear to keep you going all day. Half Mass is built for bike commuters and sized for a day's worth of gear; padding on the backside and along the contoured base protects the contents and provides structure. Main compartment features a drop pocket that secures with a rip-and-stick tab, a mesh pocket, a padded electronics pocket, pen sleeves and a secure zippered pocket. Inside, a padded computer sleeve cradles a 15 in. or smaller laptop safely off the bottom; sleeve secures with a buckle and strap. Cover flap overlaps the sides of the bag to block rain; zippered pocket on flap has moisture-shedding reverse coil zipper. External side pocket stows a cell phone, power cords or water bottle. Nonslip shoulder strap with floating pad is fully adjustable; stowaway waist strap holds pack secure for riding. Patagonia Half Mass courier bag features a topside carrying handle, reflective panels for visibility at night and a bike-light mount. Made of 600-denier 100% recycled polyester with a polyurethane coating and a Durable Water Repellent finish. Closeout.","short_description":"Books, tablet, lunch, a jacket and more-the Patagonia Half Mass courier bag holds enough gear to keep you going all day.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Day Bags","thumb_url":"http://i1.avlws.com/115/s295523.png","image_url":"http://i1.avlws.com/115/l295523.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=295523&tt=df","keywords":"shoulder,crossbody,day,luggage,bag","retail_price":"89.00","sale_price":"61.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=295523\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m295523.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856158&amp;link=&amp;tabs=-Details\"></script>","variants":{"8561580002":{"sku":"8561580002","vendor_sku":"48315","upc":"885657503957","size":"One Size","color":"LIGHT BALSAMIC","retail_price":"61.73","sale_price":"61.73"}}}
