{"sku":"856239","manufacturer_id":"FW140106","brand_name":"Now","product_name":"Now Drive Snowboard Bindings - 2013/2014","long_description":"If you're a big-mountain rider looking for a connected feel with your board, choose the Now Drive snowboard bindings. These bindings feature increased lateral support for amazing control. All-new Asym Flippit ankle straps can be flipped over: wear them in freestyle mode for added support over the top of your foot, or flip it to freeride mode for ankle support. Glass-filled nylon hangers feature I-beam reinforcements that are rigid and light; floating design offers uninterrupted board flex and quickly transfers power to your edges. Hangers connect to hollow rivet Kingpin pivot point-the fulcrum for all energy transfer; the fulcrum change increases your edge-to-edge power. Stainless-steel rivets are extremely lightweight and strong. Alumi-ring discs reduce the amount of rigid board fixtures to help keep even flex; discs are compatible with all interfaces. Drive Hanger design features a full 15mm EVA footbed for superior comfort and cushioning; tool-free access to mounting hardware. Dual-injected bushings quickly connect to Hangers; bushings apply energy while diffusing board chatter. Includes two sets of bushings in two durometers. Rigid Drive binding highbacks feature a higher medial side that matches leg angle while wider lateral side provides support.","short_description":"If you're a big-mountain rider looking for a connected feel with your board, choose the Now Drive snowboard bindings. These bindings feature increased lateral support for amazing control.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382959.png","image_url":"http://i1.avlws.com/115/l382959.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382959&tt=df","retail_price":"299.95","sale_price":"254.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382959\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382959.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856239&amp;link=&amp;tabs=-Details\"></script>","variants":{"8562390001":{"sku":"8562390001","vendor_sku":"FW140106","size":"M","color":"BLACK/ORANGE","retail_price":"254.93","sale_price":"254.93"},"8562390002":{"sku":"8562390002","vendor_sku":"FW140105","size":"L","color":"BLACK/ORANGE","retail_price":"254.93","sale_price":"254.93"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
