{"sku":"856238","manufacturer_id":"FW140101","brand_name":"Now","product_name":" Now iPO Snowboard Bindings - 2013/2014","long_description":"Now iPO snowboard bindings were designed based on the movements of skateboard trucks, offering you a dynamic ride that transfers energy directly from the straps to your board. Glass-filled nylon hangers feature I-beam reinforcements that are rigid and light; floating design offers uninterrupted board flex and quickly transfers power to your edges. Hangers connect to hollow rivet Kingpin pivot point-the fulcrum for all energy transfer; the fulcrum change increases your edge-to-edge power. Stainless-steel rivets are extremely lightweight and strong. Alumi-ring discs reduce the amount of rigid board fixtures to help keep even flex; discs are compatible with all interfaces. Baseless Hanger design features a full 15mm EVA footbed for superior comfort and cushioning; tool-free access to mounting hardware. Dual-injected bushings quickly connect to Hangers; bushings apply energy while diffusing board chatter. Includes two sets of bushings in two durometers. Asym highbacks are pre rotated 5deg laterally for better edge control and comfort; higher medial side matches leg angle while wider lateral side provides support. Flex hinge built into binding highbacks damps chatter and eliminates calf bite by matching the contour and shape of your legs. Flushcup highback and heel cup interface holds your boots in place; bindings can be ridden in NoBack mode-heel cups will keep feet in place.","short_description":"Now iPO snowboard bindings were designed based on the movements of skateboard trucks, offering you a dynamic ride that transfers energy directly from the straps to your board.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382955.png","image_url":"http://i1.avlws.com/115/l382955.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382955&tt=df","retail_price":"279.95","sale_price":"237.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382955\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382955.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856238&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
