{"sku":"856410","manufacturer_id":"13Y0702","brand_name":"Vibram","product_name":"Vibram FiveFingers EL-X LS Shoes - Boys'","long_description":"The boys' Vibram FiveFingers EL-X LS shoes offer the same minimalist performance as the adult version, but with the addition of speed lacing to accommodate many different foot shapes. Individual toe slots enhance dexterity, control and stability to deliver a natural walking motion. Thin, abrasion-resistant polyester stretch mesh with polyurethane overlays fits low on feet and offers breathable, quick-drying comfort. Speed lacing system is easy to operate and provides a secure fit. Footbeds feature AEGIS Microbe Shield(R) antimicrobial treatment to help deter odors from developing. Thin EVA midsoles help provide light cushioning underfoot. Vibram outsoles are designed to follow the contours of feet and toes; they're made of nonmarking Vibram TC1 performance rubber with a maximum thickness of 2.7mm. In order to allow kids' feet to adapt to using different muscles, gradually increase usage of these shoes. The boys' Vibram FiveFingers EL-X LS shoes are machine washable in cold water; air dry only. To determine size, stand with heels against a wall and measure from the wall to the tip of the longest toe; use the longest toe length in conjunction with the size chart. All-synthetic construction makes these vegan-friendly.","short_description":"The boys' Vibram FiveFingers EL-X LS shoes offer the same minimalist performance as the adult version, but with the addition of speed lacing to accommodate many different foot shapes.","category":"Footwear","subcategory":"Kids' Footwear","product_group":"Kids' Shoes","thumb_url":"http://i1.avlws.com/115/s449791.png","image_url":"http://i1.avlws.com/115/l449791.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449791&tt=df","retail_price":"70.00","sale_price":"70.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449791\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449791.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856410&amp;link=&amp;tabs=-Details\"></script>","variants":{"8564100005":{"sku":"8564100005","vendor_sku":"13Y0702","upc":"847100039505","size":"37","color":"GREY/RED","retail_price":"70.00","sale_price":"70.00"}},"categories":["footwear","kids-footwear","kids-shoes"]}
