{"sku":"856426","manufacturer_id":"IPD9000E1","brand_name":"Shimano","product_name":"Shimano Dura-Ace PD-9000 SPD-SL LS Pedals","long_description":"These Shimano Dura-Ace PD-9000 SPD-SL LS road pedals offer top-of-the-line performance thanks to carbon construction and a wide, power-transferring platform. Pedal bodies are made from an injection-molded, long-fiber carbon composite to offer great weight savings without compromising strength. Extra-wide pedal platform delivers foot-to-pedal stability, increased power transfer and makes it easier to clip in without having to look down and locate the pedal. Each pedal features silky smooth 3-bearing axle system to ensure buttery, efficient spinning and lasting performance. Replaceable stainless-steel protector plates provide a smooth and durable surface under the cleat and help protect pedal body for improved longevity. Release tension adjustment offers easy customization of the amount of force needed to unclip from the pedals. Included cleats feature blue-colored grip tips for off-bike traction; cleats also allow 1deg of float at the front for moderate comfort without sloppy play. Shimano Dura-Ace PD-9000 SPD-SL LS road pedals come with pedals, cleats and mounting hardware; compatible with most road cycling shoes with 3-hole mounts. Please note: LS refers to \"long spindle\", where the spindles are 4mm longer than the standard length, offering a wider Q-factor (the width of your ''stance'' on the pedals).","short_description":"These Shimano Dura-Ace PD-9000 SPD-SL LS road pedals offer top-of-the-line performance thanks to carbon construction and a wide, power-transferring platform.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Pedals","thumb_url":"http://i1.avlws.com/115/s388735.png","image_url":"http://i1.avlws.com/115/l388735.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=388735&tt=df","retail_price":"280.00","sale_price":"280.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=388735\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m388735.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856426&amp;link=&amp;tabs=-Details\"></script>","variants":{"8564260001":{"sku":"8564260001","vendor_sku":"IPD9000E1","upc":"689228560871","retail_price":"280.00","sale_price":"280.00"}},"categories":["cycling","bike-components","bike-pedals"]}
