{"sku":"856592","manufacturer_id":"2610-00630-5548","brand_name":"Mammut","product_name":" Mammut Ride Removable Avalanche Airbag Pack - 22L","long_description":"The 22-liter Mammut Ride Removable Avalanche Airbag pack conceals an inflatable airbag designed to keep your head at or near the surface of the snow during an avalanche. Easily stowable deployment handle is located on the left shoulder strap; airbag inflates in 3 sec. and is positioned so that it won't interfere with your vision or movement. Two-layer, high-density, EVA shoulder straps, hipbelt and back panel provide direct body contact and good ventilation; hipbelt is removable. U-shaped aluminum frame supports the load and helps transfer weight to the hipbelt; frame is adjustable. Snowboard carrier features a fully adjustable stabilization belt so board doesn't impede movement of legs. Ski attachement system holds skis diagonally; skis can also be carried A-frame style. Panel-loading pack also features full-zip access to main compartment from back of the pack. Carry your backcountry tools in the front pocket for quick access; external attachment points hold ice axe and poles. Includes a stowable helmet carrying system. The Mammut Ride Removable Avalanche Airbag pack features a sleeve for a hydration reservoir (sold separately) and an insulated tube cover to prevent a frozen hose. Padded goggles pocket protects your lenses; zippered interior compartment with key clip secures small essentials. Mammut Cartridge Refillable 207 Bar Alu sold separately.","short_description":"The 22-liter Mammut Ride Removable Avalanche Airbag pack conceals an inflatable airbag designed to keep your head at or near the surface of the snow during an avalanche.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s348143.png","image_url":"http://i1.avlws.com/115/l348143.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=348143&tt=df","keywords":"day packs","retail_price":"679.95","sale_price":"543.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=348143\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m348143.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856592&amp;link=&amp;tabs=-Details\"></script>","variants":{"8565920001":{"sku":"8565920001","vendor_sku":"2610-00630-5548","size":"22 LTR","color":"IMPERIAL/SMOKE","retail_price":"543.93","sale_price":"543.93"}},"categories":["snow","ski-packs-and-bags","ski-packs"]}
