{"sku":"856579","manufacturer_id":"535032-312-1-O/","brand_name":"Osprey","product_name":" Osprey Spin 32 Cycling Pack","long_description":"Providing quick access to everyday items with a flap-style opening, the Osprey Spin 32 cycling pack is designed for bike commutes and holds your laptop, U-lock and plenty of gear. Flap with hook closure opens to the interior with a padded sleeve for your 15 in. laptop, zippered tablet sleeve, mesh folder sleeve and plenty of space for riding gear. A top zippered slash pocket with internal key clip keeps smaller items organized. Padded mesh back panel provides excellent breathability. Front panel pocket stretches to store a U-lock (not included). Securing a helmet is super-easy and fast, thanks to the LidLock(TM) helmet clip; a bungee on the exterior of the pack allows easy adjustment of the LidLock feature. Dual zippered side pockets, one with internal mesh gusseting, provide additional storage options and quick access to needed items. Stretch-mesh pockets on each side of hipbelt keep small essentials within easy reach. Integrated raincover stashes away in zip compartment at bottom of pack, providing on-demand protection from the elements; cover can be removed to save weight. Reflective trim on the Osprey Spin32 cycling pack increases visibility in low light; rear-facing attachment point lets you affix a rear bike light (not included). Adjustable sternum strap features a whistle.","short_description":"Providing quick access to everyday items with a flap-style opening, the Osprey Spin 32 cycling pack is designed for bike commutes and holds your laptop, U-lock and plenty of gear.","category":"Cycling","subcategory":"Cycling Backpacks And Bags","product_group":"Cycling Commuter Backpacks","thumb_url":"http://i1.avlws.com/115/s390491.png","image_url":"http://i1.avlws.com/115/l390491.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390491&tt=df","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390491\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390491.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856579&amp;link=&amp;tabs=-Details\"></script>","variants":{"8565790001":{"sku":"8565790001","vendor_sku":"535032-312-1-O/","upc":"877257020934","size":"One Size","color":"HOPHEAD RED","retail_price":"149.95","sale_price":"149.95"},"8565790002":{"sku":"8565790002","vendor_sku":"535032-550-1-O/","upc":"877257020941","size":"One Size","color":"BLACK","retail_price":"149.95","sale_price":"149.95"}},"categories":["cycling","cycling-backpacks-and-bags","cycling-commuter-backpacks"]}
