{"sku":"856551","manufacturer_id":"33212-74100","brand_name":"Deuter","product_name":"Deuter ACT Trail 38 EL Pack","long_description":"With extended length for long torsos, the Deuter ACT Trail 38 EL pack offers great craftsmanship in a sturdy and light daypack that hauls your gear on day hikes, summit scrambles and technical routes. Aircontact back system with Delrin(R) U-frame rod allows warm air to escape and fresh air to circulate between your back and the pack. 3D air-mesh fabric lining adds breathability to the contoured, padded shoulder straps; anatomic hipbelt wraps body, stabilizing the pack's lateral movements. Easy-access main compartment with two-way zippers offers plenty of room for an all-day hike; reservoir sleeve and drink tube port accommodate a reservoir (sold separately). Hipbelt pocket holds snacks; mesh side pocket stores water bottle, headlamp, gloves or sunscreen; lid pocket holds a map, compass or GPS, spare batteries and other small items. Large stuff-it pocket on the front holds rain gear or other bulky items; integrated, tuck-away rain cover stands ready to protect your load from sudden downpours. Compression straps let you cinch down loads for jostle-free carrying; simple, lightweight tool loops let you quickly stash trekking poles and ice axes. The Deuter ACT Trail 38 EL pack is made with lightweight and abrasion-resistant 210-denier ripstop nylon.","short_description":"With extended length for long torsos, the Deuter ACT Trail 38 EL pack offers great craftsmanship in a sturdy and light daypack that hauls your gear on day hikes, summit scrambles and technical routes.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s440683.png","image_url":"http://i1.avlws.com/115/l440683.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440683&tt=df","retail_price":"139.00","sale_price":"139.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440683\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440683.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856551&amp;link=&amp;tabs=-Details\"></script>","variants":{"8565510001":{"sku":"8565510001","vendor_sku":"33212-74100","color":"BLACK/GRANITE","retail_price":"139.00","sale_price":"139.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
