{"sku":"856526","manufacturer_id":"EC-20434010","brand_name":"Eagle Creek","product_name":" Eagle Creek Switchback 22 Wheeled Convertible Luggage - 22\"","long_description":"The Eagle Creek Switchback 22 wheeled convertible luggage is a study in travel versatility. Sized as a wheeled carry-on or backpack, it features a removable daypack for multiple gear-carrying options. Carry or wheel the Swtichback and zip-off daypack as one, or separate the two; wear the daypack on your front or back or quickly stack it on top of your wheeled luggage. Adjustable backpack suspension with cool, breathable air-mesh padding fits torsos 17 - 21 in.; suspension zips away when not in use. Contoured shoulder straps and padded hip belt ensure carrying comfort when using luggage as a backpack; sternum strap secures pack. Oversize front panel opening on the main bag includes self-repairing zipper and storm flap; central locking point secures main entry with a single lock (locks sold separately). Rugged wheels have sturdy wheel housings; skid plate and bumpers add protection against curbs and rough usage. Handle extends smoothly and offers a comfortable grip; cleanly zips away when not deployed; top, front and side grab handles. Zip-off daypack features moisture-wicking, breathable air-mesh back panel and the wheeled luggage shoulder straps transfer from the main backpack for comfortable carrying. Main pocket of the daypack has an interior padded sleeve that fits most 15 in. laptops and an additional sleeve sized to fit most tablets. Back slip panel lets you stack the zip-off daypack on the wheeled luggage; also includes a webbing carry handle. Daypack includes side zip stash pockets and a daisy chain for lashing gear; full-panel front zip pocket has organizational pockets, a key fob and bottle opener. Reflective accents on the Eagle Creek Switchback 22 wheeled convertible luggage offer low-light visibility; hide-away ID tag. Bi-Tech(TM) nylon and Bi-Tech(TM) Armor fabrics in high-wear zones provide extreme abrasion- and weather-resistance.","short_description":"The Eagle Creek Switchback 22 wheeled convertible luggage is a study in travel versatility. Sized as a wheeled carry-on or backpack, it features a removable daypack for multiple gear-carrying options.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433891.png","image_url":"http://i1.avlws.com/115/l433891.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433891&tt=df","retail_price":"340.00","sale_price":"340.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433891\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433891.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856526&amp;link=&amp;tabs=-Details\"></script>","variants":{"8565260001":{"sku":"8565260001","vendor_sku":"EC-20434010","upc":"766182139869","color":"BLACK","retail_price":"340.00","sale_price":"340.00"}},"categories":["travel","luggage","wheeled-luggage"]}
