{"sku":"856574","manufacturer_id":"60220111","brand_name":"Pacsafe","product_name":"Pacsafe Venturesafe 325 GII Cross Body Pack","long_description":"Sized for an iPad and built to prevent theft during travel, the Pacsafe Venturesafe 325 G2 Cross Body pack keeps important items secure. Wear it on your back as a sling or on the front for security. Flexible, lightweight stainless-steel wire is integrated into adjustable carry strap to prevent bag slashers from slicing through and running off with your gear. Lightweight stainless-steel wire mesh is also built discreetly into vulnerable areas to prevent thieves from slashing through the fabric. Exterior zippers fasten to concealed clips, making it hard for pickpockets to unzip and snatch your valuables. Special internal pocket blocks unauthorized scanning of RFID (radio frequency identification) chips inside passports and credit and debit cards to prevent ID theft. Roomy zippered main compartment holds guide book, tickets, passport and more; an internal padded sleeve holds your iPad or tablet. The Pacsafe Venturesafe 325 G2 Cross Body pack has a padded, adjustable cross-body strap. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline). Key clip inside internal zip pocket; pen holder.","short_description":"Sized for an iPad and built to prevent theft during travel, the Pacsafe Venturesafe 325 G2 Cross Body pack keeps important items secure. Wear it on your back as a sling or on the front for security.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s432611.png","image_url":"http://i1.avlws.com/115/l432611.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432611&tt=df","keywords":"sling,purses,courier","retail_price":"90.00","sale_price":"90.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432611\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432611.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856574&amp;link=&amp;tabs=-Details\"></script>","variants":{"8565740001":{"sku":"8565740001","vendor_sku":"60220111","upc":"688334009847","color":"STORM GRAY","retail_price":"90.00","sale_price":"90.00"}},"categories":["travel","day-bags-and-packs","shoulder-bags"]}
