{"sku":"856580","manufacturer_id":"536026-772-2-M/","brand_name":"Osprey","product_name":"Osprey Radial 26 Cycling Pack","long_description":"The Osprey Radial 26 cycling pack offers a laptop sleeve, organizer pockets and a suspended mesh back panel to keep you cool as you take on the rigors of bike commuting.. Zippered main pocket offers storage space for your riding gear, lunch and low-volume extras, and it includes a padded compartment for your 15 in. laptop or tablet. Large front zip pocket features organization sleeves and mesh pockets, making it a breeze to store and get to pumps, bike tools and tubes; includes a key clip. Ventilated and supportive AirSpeed(TM) suspension incorporates a wire frame with suspended mesh, ridged foam and side vents for excellent breathability. Contoured shoulder straps feature breathable mesh and perforated foam to enhance breathability and comfort. Front panel pocket stretches to store a U-lock (not included). Stretch-mesh pockets on each side of hipbelt keep small essentials within easy reach. Securing a helmet is super-easy and fast, thanks to the LidLock(TM) helmet clip; a bungee on the exterior of the pack allows easy adjustment of the LidLock feature. Integrated raincover stashes away in zip compartment at bottom of pack, providing on-demand protection from the elements; cover can be removed to save weight. Reflective trim on the Osprey Radial 26 cycling pack increases visibility in low light; rear-facing attachment point lets you affix a rear bike light (not included).","short_description":"The Osprey Radial 26 cycling pack offers a laptop sleeve, organizer pockets and a suspended mesh back panel to keep you cool as you take on the rigors of bike commuting..","category":"Cycling","subcategory":"Cycling Backpacks And Bags","product_group":"Cycling Commuter Backpacks","thumb_url":"http://i1.avlws.com/115/s390495.png","image_url":"http://i1.avlws.com/115/l390495.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390495&tt=df","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390495\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390495.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856580&amp;link=&amp;tabs=-Details\"></script>","variants":{"8565800001":{"sku":"8565800001","vendor_sku":"536026-550-1-S/","upc":"877257020835","size":"S/M","color":"BLACK","retail_price":"159.95","sale_price":"159.95"},"8565800003":{"sku":"8565800003","vendor_sku":"536026-772-1-S/","upc":"877257020859","size":"S/M","color":"MANTIS GREEN","retail_price":"159.95","sale_price":"159.95"}},"categories":["cycling","cycling-backpacks-and-bags","cycling-commuter-backpacks"]}
