{"sku":"856582","manufacturer_id":"537122-800-1-O/","brand_name":"Osprey","product_name":" Osprey Momentum 22 Bike Commuter Pack","long_description":"Designed for bike commuting, the Osprey Momentum 22 bike pack organizes and comfortably hauls your laptop, tablet and daily essentials to work, campus, the store or the cafe. Dedicated access to the padded laptop/tablet compartment makes it easy to get to your computer on the go; fits most laptops with screens up to 15 in. (measured diagonally). Panel-loading design offers easy access to the spacious main compartment, which has an internal document sleeve and mesh organization pockets to secure your stuff. Top zip pocket secures smaller items-such as your keys, wallet, and phone-allowing you to get at them quickly. The back panel of the Osprey Momentum 22 bike pack features ample mesh-covered foam padding for breathable comfort. Stretch woven side pockets stash other on-the-go essentials or small water bottles. Securing a helmet is super-easy and fast, thanks to the LidLock(TM) helmet clip; a bungee on the exterior of the pack allows easy adjustment of the LidLock feature. Built-in, snug-fitting, high-visibility raincover can be deployed quickly and easily to protect pack's contents in wet weather. Side compression straps let you cinch down your load for jostle-free carrying.","short_description":"Designed for bike commuting, the Osprey Momentum 22 bike pack organizes and comfortably hauls your laptop, tablet and daily essentials to work, campus, the store or the cafe.","category":"Cycling","subcategory":"Cycling Backpacks And Bags","product_group":"Cycling Commuter Backpacks","thumb_url":"http://i1.avlws.com/115/s390503.png","image_url":"http://i1.avlws.com/115/l390503.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390503&tt=df","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390503\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390503.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856582&amp;link=&amp;tabs=-Details\"></script>","variants":{"8565820001":{"sku":"8565820001","vendor_sku":"537122-572-1-O/","upc":"877257020903","size":"One Size","color":"CARBIDE GREY","retail_price":"129.95","sale_price":"129.95"},"8565820002":{"sku":"8565820002","vendor_sku":"537122-800-1-O/","upc":"877257020897","size":"One Size","color":"ATOMIC ORANGE","retail_price":"129.95","sale_price":"129.95"}}}
