{"sku":"856555","manufacturer_id":"T3B5N.9125","brand_name":"Asics","product_name":" ASICS GEL-Nimbus 15 Road-Running Shoes - Women's","long_description":"Boasting a cushy ride, the ASICS GEL-Nimbus 15 women's road-running shoes offer comfort and mild support for a range of runners from underpronators to moderate overpronators. Lightweight and flexible synthetic textile and polyester mesh uppers offer maximum breathability and comfort; exoskeletal heel counters help cradle heels for increased support. Memory foam-lined collars mold to feet for excellent comfort around the ankles. Durable FluidRide polymer midsoles offer springy bounce back and cushioning without added weight. Rearfoot and forefoot silicone-based gel inserts absorb excess shock in all directions, delivering cushioning and stability. Impact Guidance System (IGS(R)) helps slow pronation for an optimal gait and natural foot movement from heel strike through toe-off. Vertical flex groove in rubber outsoles follows the line of progression throughout the gait cycle to enhance gait efficiency. Abrasion-resistant rubber in critical areas on the outsoles provides exceptional durability.","short_description":"Boasting a cushy ride, the ASICS GEL-Nimbus 15 women's road-running shoes offer comfort and mild support for a range of runners from underpronators to moderate overpronators.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s387583.png","image_url":"http://i1.avlws.com/115/l387583.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=387583&tt=df","retail_price":"145.00","sale_price":"109.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=387583\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m387583.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856555&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","womens-footwear","womens-shoes"]}
