{"sku":"856658","manufacturer_id":"1100106-SVC","brand_name":"Dakine","product_name":" DAKINE Targa Gloves - Women's","long_description":"The DAKINE Targa gloves provide breathable, waterproof warmth, high durability and excellent dexterity. They have a low-profile design and breathe well for days that aren't super frigid. Nylon/polyester shells have GORE-TEX(R) waterproof breathable inserts to keep your hands dry on winter outings; exterior has a Durable Water Repellent treatment. High-loft synthetic insulation keeps your hands toasty; polyester tricot linings add warmth and wick moisture. Durable, perforated fabric on the back of the DAKINE Targa gloves enhances breathability; a great feature when you're active or the weather isn't extremely cold. Leather palms offer good grip and durability; they're treated with a Durable Water Repellent finish to repel wet snow. Zippered cuff closures create a snug seal around your wrists and fit underneath your jacket's sleeves to seal in warmth. Wipe your cold nose with the soft panels on the thumbs.","short_description":"The DAKINE Targa gloves provide breathable, waterproof warmth, high durability and excellent dexterity. They have a low-profile design and breathe well for days that aren't super frigid.","category":"Women's Clothing","subcategory":"Women's Clothing Accessories","product_group":"Women's Gloves And Mittens","thumb_url":"http://i1.avlws.com/115/s444335.png","image_url":"http://i1.avlws.com/115/l444335.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=444335&tt=df","retail_price":"75.00","sale_price":"51.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=444335\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m444335.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856658&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
