{"sku":"856700","manufacturer_id":"S1308003014","brand_name":"K2","product_name":" K2 Rival Pro Snow Helmet - Men's","long_description":"If you're looking for a lightweight and low-profile helmet, look no further than the K2 Rival Pro snow helmet. It fully integrates with your mobile device for communication and audio. In-mold shell construction yields a lightweight helmet you can wear comfortably all day long. K2 Level 3 Baseline Audio System offers integrated headphones and on-cord mini mic-perfect for connecting to your cell phone or audio player; cord is detachable. 360 K2dialed Fit System delivers a customized fit regardless of head shape with a twist of a dial. 360 K2dialed Fit System features a webbing interface integrated into the helmet's textile liner to evenly distribute pressure. Washable, Full-Wrap Liner cradles the head with a mesh panel that wicks moisture and breathes well to prevent overheating. Passive-Channel Venting directs airflow between the helmet and your head to keep you comfortable and dry. K2 Rival Pro snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards.","short_description":"If you're looking for a lightweight and low-profile helmet, look no further than the K2 Rival Pro snow helmet. It fully integrates with your mobile device for communication and audio.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Men's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s439811.png","image_url":"http://i1.avlws.com/115/l439811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=439811&tt=df","retail_price":"129.95","sale_price":"103.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=439811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m439811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856700&amp;link=&amp;tabs=-Details\"></script>","variants":{"8567000001":{"sku":"8567000001","vendor_sku":"S1308003014","upc":"886745209966","size":"M","color":"PRO BLACK","retail_price":"103.93","sale_price":"103.93"}}}
