{"sku":"856703","manufacturer_id":"AO-008517-203","brand_name":"Delorme","product_name":"DeLorme Topo North America 10.0 - DVD","long_description":"The updated DeLorme Topo North America 10.0 DVD offers the latest terrain, road and GPS mapping for accurate, confident planning and navigation of your outdoor adventures. Scout your destination as if you were there with new terrain, trail and road detail; fly over realistic 3D and aerial imagery and map out your travels over roads and trails. Find public recreation lands, see elevation profiles and customize and print maps at a wide range of scales, and then navigate worry-free by car, on foot or across the water. Road and trail data across North America includes more than 800,000 new road names in the U.S.; enjoy highly detailed lake, river and stream data for all 50 U.S. states. DeLorme Topo North America 10.0 now includes data for 38 national parks and 100 provincial parks in Canada, as well as elevation data for all of the U.S., Canada and Mexico. Topo North America 10.0 provides points of interest, GPS compatability, editing and printing capabilities in an easy-to-use interface. Maps are created by integrating the most up-to-date digital USGS map data into the programming process, allowing a wide range of exclusive features. Download GPS tracks as routable roads or trails; it exchanges GPS waypoints and tracks with all popular GPS receivers. Route your road trip from home to trailhead, and route your hike from trailhead to destination; share trips with others online via MapShare feature. MapShare allows easy online sharing of routes, maps and profiles with other users, including 2D and 3D maps with elevation profiles. Create elevation profiles, showing the degree of difficulty for any trip; offers enhanced printing of profile view. Customizable split-screen option allows easy comparisons of 2D and 3D maps, or maps and aerial images; prints easily on single page.","short_description":"The updated DeLorme Topo North America 10.0 DVD offers the latest terrain, road and GPS mapping for accurate, confident planning and navigation of your outdoor adventures.","category":"Books And Maps","subcategory":"Maps","product_group":"Mapping Software","thumb_url":"http://i1.avlws.com/115/s409867.png","image_url":"http://i1.avlws.com/115/l409867.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=409867&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=409867\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m409867.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856703&amp;link=&amp;tabs=-Details\"></script>","variants":{"8567030001":{"sku":"8567030001","vendor_sku":"AO-008517-203","upc":"019916004118","retail_price":"99.95","sale_price":"99.95"}},"categories":["books","maps","mapping-software"]}
