{"sku":"856858","manufacturer_id":"33683 55600","brand_name":"Deuter","product_name":" Deuter Cruise 28 SL Pack - Women's","long_description":"Light and efficient, the Deuter Cruise 28 SL pack takes your skiing, snowboarding and mountaineering to new heights of comfort and convenience with a women-specific fit and snow-specific functions. Board straps and wide ski slots let you carry a snowboard vertically or skis A-frame style; external attachment points make it easy to lash on an ice axe and poles. Hipbelt and shoulder straps are tailored to a woman's shape for all-day comfort while you chase powder stashes and bag peaks. Adjusters on the shoulder straps fine-tune the fit; loosen them for comfort during approaches and quickly tighten them down for precise load control. Two vertical, air-channeling foam strips on the back panel ensure maximum circulation and stability. Back-panel access lets you get to the main compartment's contents when lashed-on gear blocks access from the front, and helps you avoid letting snow in. Spindrift collar and top lid help keep snow out of the main compartment; hydration-compatible design accommodates a reservoir and tube (sold separately). Snow-shedding stretch side pockets; easy-access front pocket for shovel and probe; hidden pocket under lid for valuables; dual side compression straps.","short_description":"Light and efficient, the Deuter Cruise 28 SL pack takes your skiing, snowboarding and mountaineering to new heights of comfort and convenience with a women-specific fit and snow-specific functions.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s344095.png","image_url":"http://i1.avlws.com/115/l344095.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=344095&tt=df","keywords":"day packs","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=344095\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m344095.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856858&amp;link=&amp;tabs=-Details\"></script>","variants":{"8568580001":{"sku":"8568580001","vendor_sku":"33683 55600","size":"28 LTR","color":"FIRE/CRANBERRY","retail_price":"149.00","sale_price":"149.00"}},"categories":["snow","ski-packs-and-bags","ski-packs"]}
