{"sku":"856860","manufacturer_id":"33634 05100","brand_name":"Deuter","product_name":"Deuter Guide Tour 45+ Pack","long_description":"Launch into your snow-filled mountain adventure with the Deuter Guide Tour 45+ pack on your back. Comfortable and customizable, it hauls skis or a snowboard and all your alpine essentials with ease. Board straps and ski slots carry your skis diagonally or A-frame style, or your snowboard vertically; attachment points let you securely lash on ice tools and other gear. Removable, pivoting hipbelt with gear loops follows your every move with fluid ease, helping you keep your balance and preserve energy on uneven terrain. Adjusters on the shoulder straps fine-tune the fit; loosen them for comfort during approaches and quickly tighten them down for precise load control. Back panel features two vertical, air-channeling foam strips that help ensure maximum circulation and stability. Removable aluminum stays effectively transfer load weight to the hips; removable foam mat creates additional support and can be used as a seat. Expanding spindrift collar and floating top lid accommodate up to 10 extra liters of capacity; hydration-compatible design accommodates a reservoir and tube (sold separately). Bottom-access compartment with zip-away divider; easy-access zippered pocket for shovel and probe; small hidden pocket under the lid for valuables.","short_description":"Launch into your snow-filled mountain adventure with the Deuter Guide Tour 45+ pack on your back. Comfortable and customizable, it hauls skis or a snowboard and all your alpine essentials with ease.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s344103.png","image_url":"http://i1.avlws.com/115/l344103.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=344103&tt=df","keywords":"day packs","retail_price":"189.00","sale_price":"189.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=344103\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m344103.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856860&amp;link=&amp;tabs=-Details\"></script>","variants":{"8568600001":{"sku":"8568600001","vendor_sku":"33634 05100","size":"45 LTR","color":"FIRE/TITAN","retail_price":"189.00","sale_price":"189.00"}},"categories":["snow","ski-packs-and-bags","ski-packs"]}
