{"sku":"856899","manufacturer_id":"FI13M1NX2SBLK5X","brand_name":"Flow","product_name":"Flow NX2-SE Snowboard Bindings - 2013/2014","long_description":"Built for the park, the Flow NX2-SE snowboard bindings feature SpeedEntry and SideEntry, so the bindings go on fast. Drop-in first, every run. Rockered aluminum alloy baseplates feature 2.5deg BankBeds for response, support and a natural feel when strapped in. OC-Kush base pads feature extra cushioning in the heels to absorb landings and damp chatter. Modback highbacks feature separated upper flexible zones and lower aluminum heel cup zones; upper zone uses independently adjustable support panels for fine-tuned performance. Four-way adjustable Apex.6 upper zones are freestyle oriented, featuring asymmetric medial support and lateral freedom. KushControl highback pads for all-day comfort. New Active Strap Technology (N.A.S.T.Y) straps automatically lift up when you open the reclining highbacks and actively tighten when you close the highback. N.A.S.T.Y straps reduce friction and create more room for easy in and out of bindings-using Flow bindings is now even easier. Power Triangle design links the highbacks directly to the center area of the baseplates with a high-tensile steel cable, increasing control and power transfer. Active HYBRID PowerCapStrap bridges the gap between traditional bindings and Flow SpeedEntry straps; bindings feature 3D-shaped ankle straps that diagonally cover the foot. Ankle straps connect to toe straps for pressure distribution and energy transfer, and offer perfect boot positioning. LockingSlapRatchet (LSR) buckles offer dual entry into bindings, either SpeedEntry or SideEntry-just slap them to open or lock them down to shred. Bindings are compatible with Burton The Channel snowboards and include disc kit.","short_description":"Built for the park, the Flow NX2-SE snowboard bindings feature SpeedEntry and SideEntry, so the bindings go on fast. Drop-in first, every run.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Speed-Entry Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382923.png","image_url":"http://i1.avlws.com/115/l382923.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382923&tt=df","retail_price":"329.95","sale_price":"263.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382923\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382923.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856899&amp;link=&amp;tabs=-Details\"></script>","variants":{"8568990001":{"sku":"8568990001","vendor_sku":"FI13M1NX2SNLI4L","upc":"845493038860","size":"L","color":"NEON LIME","retail_price":"263.93","sale_price":"263.93"},"8568990002":{"sku":"8568990002","vendor_sku":"FI13M1NX2SNLI5X","upc":"845493038877","size":"XL","color":"NEON LIME","retail_price":"263.93","sale_price":"263.93"},"8568990003":{"sku":"8568990003","vendor_sku":"FI13M1NX2SBLK4L","upc":"845493038839","size":"L","color":"BLACK","retail_price":"263.93","sale_price":"263.93"},"8568990004":{"sku":"8568990004","vendor_sku":"FI13M1NX2SBLK5X","upc":"845493038846","size":"XL","color":"BLACK","retail_price":"263.93","sale_price":"263.93"}},"categories":["snow","snowboard-bindings","speedentry-snowboard-bindings"]}
