{"sku":"856893","manufacturer_id":"H14-VCOWLG","brand_name":"Smith","product_name":"Smith Variance Snow Helmet - Men's","long_description":"The newly designed Smith Variance snow helmet offers reliable protection and advanced comfort when you're cruising down corduroy or exploring the side country. Hybrid in-mold shell construction creates a low-profile helmet with reduced volume and light weight. Micro-adjustable x Boa(R) fit system sports an intuitive dial system for on-the-fly, single-handed control; 3/4 halo design offers self-centering and vertical adjustability. AirEvac 2 ventilation drives warm air away from your goggles and out of the helmet through internal channels and 18 vents. Low-profile Regulator climate control system allows you to easily modify the amount of airflow and heat exhaust, even while wearing gloves. Removable and machine-washable Nanosilver performance lining incorporates silver-based antimicrobial material and soft cushioning to keep your helmet clean and comfortable. Removable, machine-washable ear pads provide a comfortable seal from the weather on stormy days; for a warm spring day, remove the earpads to reduce weight and enhance cooling. Ultralight, removable goggles lock helps ensure your goggles stay with you after that head-over-heels wipeout through blower powder. The Smith Variance snow helmet is compatible with Skullcandy audio systems (not included). This snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards.","short_description":"The newly designed Smith Variance snow helmet offers reliable protection and advanced comfort when you're cruising down corduroy or exploring the side country.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Men's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381423.png","image_url":"http://i1.avlws.com/115/l381423.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381423&tt=df","retail_price":"180.00","sale_price":"143.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381423\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381423.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856893&amp;link=&amp;tabs=-Details\"></script>","variants":{"8568930001":{"sku":"8568930001","vendor_sku":"H14-VCOWMD","upc":"715757425661","size":"M","color":"ORANGE W3","retail_price":"143.93","sale_price":"143.93"},"8568930002":{"sku":"8568930002","vendor_sku":"H14-VCOWLG","upc":"715757425678","size":"L","color":"ORANGE W3","retail_price":"143.93","sale_price":"143.93"}},"categories":["snow","ski-helmets","mens-ski-helmets"]}
