{"sku":"856896","manufacturer_id":"H14-MZCBLG","brand_name":"Smith","product_name":" Smith Maze Snow Helmet - Men's","long_description":"Slip on the crazy-light Smith Maze snow helmet to protect your noggin with clean, modern, minimalist design while you charge the deep in the backcountry or hit epic tricks in the terrain park. In-mold construction bonds the liner directly to the shell to create durable strength and light weight. Lifestyle fit system uses a forgiving elastic band to flex around your head for a dynamic fit that moves with you; lateral adjustment accommodates a wide range of head sizes. AirEvac 2 ventilation drives warm air away from your goggles and out of the helmet through internal channels and 9 vents. Airflow climate control features fabric flaps in the lining that let you open or close vents for comfort in mild or cold temperatures. Removable and machine-washable X-Static performance lining incorporates silver-based antimicrobial material and soft cushioning to keep your helmet clean and comfortable. Removable, machine-washable ear pads provide a comfortable seal from the weather on stormy days; for a warm spring day, remove the earpads to reduce weight and enhance cooling. Removable goggles lock helps ensure your goggles stay with you after that head-over-heels wipeout through blower powder. The Smith Maze snow helmet is compatible with Skullcandy audio systems (not included). This snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards.","short_description":"Slip on the crazy-light Smith Maze snow helmet to protect your noggin with clean, modern, minimalist design while you charge the deep in the backcountry or hit epic tricks in the terrain park.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Men's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381427.png","image_url":"http://i1.avlws.com/115/l381427.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381427&tt=df","retail_price":"100.00","sale_price":"79.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381427\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381427.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856896&amp;link=&amp;tabs=-Details\"></script>","variants":{"8568960001":{"sku":"8568960001","vendor_sku":"H14-MZCBMD","upc":"715757426613","size":"M","color":"CHARCOAL BATIK","retail_price":"79.93","sale_price":"79.93"},"8568960002":{"sku":"8568960002","vendor_sku":"H14-MZCBLG","upc":"715757426620","size":"L","color":"CHARCOAL BATIK","retail_price":"79.93","sale_price":"79.93"}},"categories":["snow","ski-helmets","mens-ski-helmets"]}
