{"sku":"856913","manufacturer_id":"10678100001","brand_name":"Anon","product_name":" Anon Rodan Snow Helmet - Men's","long_description":"The Anon Rodan helmet offers riders streamlined style with a forget-it's-there feel. Strap Stash allows you to comfortably run your goggles strap under the helmet for a skate-inspired look. Strap-Stash is a customized ABS foam recess that allows you to wear your goggles strap underneath your helmet for low-profile, low-bulk style. In-mold helmets fuse a lightweight polycarbonate shell with an EPS (expanded polystyrene) liner for the best in performance and comfort with a sleek, low-profile fit. Low-pile, pill-resistant expedition fleece lining maximizes warmth and moisture-wicking properties during high-heat riding and hiking. Passive ventilation channels are integrated into the helmet and draw fresh air in the front and pull moisture out the back. Goggles ventilation channels help keep goggles from fogging. Simple Fit allows riders to rock a beanie underneath their lid by simply removing the ear pads and inner liner for a skate-inspired, low-profile fit and feel. Compatible with Anon ASFX helmet audio system (sold separately) for flawless audio integration on the mountain. Anon helmets are optimized for use with Anon goggles, offering an airtight, seamless connection between helmet and goggles (goggles not included). This snow helmet complies with ASTM F 2040 and/or CE EN 1077B alpine ski and snowboard helmet safety standards.","short_description":"The Anon Rodan helmet offers riders streamlined style with a forget-it's-there feel. Strap Stash allows you to comfortably run your goggles strap under the helmet for a skate-inspired look.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Men's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381439.png","image_url":"http://i1.avlws.com/115/l381439.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381439&tt=df","retail_price":"129.95","sale_price":"90.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381439\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381439.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856913&amp;link=&amp;tabs=-Details\"></script>","variants":{"8569130001":{"sku":"8569130001","vendor_sku":"10678100001","upc":"632059347012","size":"S","color":"BLACK","retail_price":"90.83","sale_price":"90.83"},"8569130002":{"sku":"8569130002","vendor_sku":"10678100001","upc":"632059347005","size":"M","color":"BLACK","retail_price":"90.83","sale_price":"90.83"},"8569130003":{"sku":"8569130003","vendor_sku":"10678100001","upc":"632059346992","size":"L","color":"BLACK","retail_price":"90.83","sale_price":"90.83"}}}
