{"sku":"856902","manufacturer_id":"FI13W2MINSHPK4L","brand_name":"Flow","product_name":"Flow Minx-SE Snowboard Bindings - Women's - 2013/2014","long_description":"With a forgiving flex built for the park, the Flow Minx-SE snowboard bindings outfit you for a day full of throwing tricks. Drop the highbacks, slide your feet in and get to shredding. Molded baseplates feature a wide platform for stability and ease of entry and exit; nylon-reinforced channels channel power to the board. EVA cushioning absorbs harsh landings and high-speed chatter; toe ramps adjust for a personalized fit. Modback highbacks feature separated upper flexible zones and lower aluminum heel-cup zones; upper zone uses independently-adjustable support panels for fine-tuned performance. Tweak.6 upper zones offer a softer flex in the top zone, and feature KushControl wrapped EVA-pads for comfort. Reclining highbacks provide easy entry and exit, and an integrated forward lean lever with tool-free snaplock adjustment; padding eliminates highback bite. Power Triangle design links the highbacks directly to the center area of the baseplates with a high-tension steel cable, increasing control and power transfer. Active HYBRID PowerCapStrap bridges the gap between traditional bindings and Flow SpeedEntry straps; 3D-shaped ankle straps cover your feet diagonally for even pressure. Ankle straps connect to toe straps for pressure distribution and energy transfer, and offer perfect boot positioning. LockingSlapRatchet (LSR) buckles offer dual entry into bindings, either SpeedEntry or SideEntry-just slap them to open or lock them down to shred. Flow Minx-SE bindings are compatible with Burton The Channel snowboards, disc kit is sold separately.","short_description":"With a forgiving flex built for the park, the Flow Minx-SE snowboard bindings outfit you for a day full of throwing tricks. Drop the highbacks, slide your feet in and get to shredding.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Speed-Entry Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382935.png","image_url":"http://i1.avlws.com/115/l382935.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382935&tt=df","retail_price":"219.95","sale_price":"175.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382935\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382935.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856902&amp;link=&amp;tabs=-Details\"></script>","variants":{"8569020001":{"sku":"8569020001","vendor_sku":"FI13W2MINSHPK3M","upc":"845493039577","size":"M","color":"HOT PINK","retail_price":"175.93","sale_price":"175.93"},"8569020002":{"sku":"8569020002","vendor_sku":"FI13W2MINSHPK4L","upc":"845493039584","size":"L","color":"HOT PINK","retail_price":"175.93","sale_price":"175.93"}},"categories":["snow","snowboard-bindings","speedentry-snowboard-bindings"]}
