{"sku":"856945","manufacturer_id":"3213610","brand_name":"Gnu","product_name":" GNU Beauty Series C3 BTX Snowboard - Women's - 2013/2014","long_description":"When you strap on the all-new GNU Beauty Series C3 BTX snowboard and survey the steep slopes ahead of you, you'll know you've picked a board built for any and all terrain on the hill. C3 BTX technology features a camber-dominant profile, with mild Banana Tech rocker between the feet and maximum camber at the tip and tail for control, power and stability. Camber provides end-to-end stability and plenty of pop for boosting off natural terrain; Banana Traction technology offers carving performance and soft-snow float. Magne-Traction improves edge grip by adding seven contact points along the running length of the board, resulting in amazing control whether riding ice or pow. Columbian Gold wood core, built with aspen wood, is ultra lightweight and strong, and features lively fibers for amazing pop; fiberglass increases board stiffness and pop. Impact-resistant end-grain internal sidewalls; UHMW sidewalls stand up to wear and tear; steel edges; sintered base is fast and low maintenance. Beauty Series C3 BTX graphics are from the Shared Spirits Blanket by Pendleton Woolen Mills. .","short_description":"When you strap on the all-new GNU Beauty Series C3 BTX snowboard and survey the steep slopes ahead of you, you'll know you've picked a board built for any and all terrain on the hill.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Freeride Snowboards","thumb_url":"http://i1.avlws.com/115/s344207.png","image_url":"http://i1.avlws.com/115/l344207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=344207&tt=df","retail_price":"539.95","sale_price":"377.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=344207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m344207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856945&amp;link=&amp;tabs=-Details\"></script>","variants":{"8569450001":{"sku":"8569450001","vendor_sku":"3213605","upc":"842910070984","size":"149 CM","retail_price":"377.83","sale_price":"377.83"},"8569450002":{"sku":"8569450002","vendor_sku":"3213610","upc":"842910070977","size":"152 CM","retail_price":"377.83","sale_price":"377.83"}},"categories":["snow","snowboards","freeride-snowboards"]}
