{"sku":"856900","manufacturer_id":"FI13W1ISISWHT4L","brand_name":"Flow","product_name":" Flow Isis-SE Snowboard Bindings - Women's - 2013/2014","long_description":"Built for the park, the Flow Isis-SE snowboard bindings deliver a great foot-to-board connection and feel thanks to the forgiving nylon baseplates and cushioned BankBeds. Rockered nylon baseplates feature 2.5deg Canted BankBeds for response, support and a natural feel when strapped in. Modback highbacks feature separated upper flexible zones and lower nylon heel cup zones; upper zone uses independently adjustable support panels for fine-tuned performance. New Active Strap Technology (N.A.S.T.Y) straps automatically lift up when you open the reclining highbacks and actively tighten when you close the highback. N.A.S.T.Y straps reduce friction and create more room for easy in and out of bindings-using Flow bindings is now even easier. Power Triangle design links the highbacks directly to the center area of the baseplates with a high-tensile steel cable, increasing control and power transfer. Active HYBRID PowerCapStrap bridges the gap between traditional bindings and Flow SpeedEntry straps; bindings feature 3D-shaped ankle straps that diagonally cover the foot. Ankle straps connect to toe straps for pressure distribution and energy transfer, and offer perfect boot positioning. LockingSlapRatchet (LSR) buckles offer dual entry into bindings, either SpeedEntry or SideEntry-just slap them to open or lock them down to shred. Bindings are compatible with Burton The Channel snowboards and include disc kit.","short_description":"Built for the park, the Flow Isis-SE snowboard bindings deliver a great foot-to-board connection and feel thanks to the forgiving nylon baseplates and cushioned BankBeds.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Speed-Entry Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382927.png","image_url":"http://i1.avlws.com/115/l382927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382927&tt=df","retail_price":"269.95","sale_price":"215.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=856900&amp;link=&amp;tabs=-Details\"></script>","variants":{"8569000001":{"sku":"8569000001","vendor_sku":"FI13W1ISISWHT3M","upc":"845493039539","size":"M","color":"WHITE","retail_price":"215.93","sale_price":"215.93"},"8569000002":{"sku":"8569000002","vendor_sku":"FI13W1ISISWHT4L","upc":"845493039546","size":"L","color":"WHITE","retail_price":"215.93","sale_price":"215.93"}},"categories":["snow","snowboard-bindings","speedentry-snowboard-bindings"]}
