{"sku":"857024","manufacturer_id":"SJ140131","brand_name":"Jones","product_name":" Jones Mothership Snowboard - Women's - 2013/2014","long_description":"The Jones Mothership snowboard is a women-specific, high-performance freeride board that can take you down the steepest slopes with the deepest pow. This board is truly a freerider's dream. Mellow Magne-Traction keeps the board solid on ice; a blunt nose, directional rocker and camber underfoot deliver the float and stability needed for bombing any line, any time. Directional rocker features more tip rocker than tail rocker and a slight camber between feet; rockered tip adds float and improves maneuverability. Blunt nose offers the float of a much longer board tip without the added length or swing weight; slightly rockered tail maintains power and stability when initiating turns. Mellow Magne-Traction improves edge grip by adding five contact points along the running length of the board, resulting in amazing control whether riding ice or pow. Full wood core is comfortable and robust; it's a true all-terrain core and certified by the Forest Stewardship Council. Ash-wood topsheet provides a lively but damp board feel that's big on pop and solid on landings; carbon stringers improve pop and torsional stiffness. Steel edges; sintered base, with recycled P-tex scraps, absorbs wax fast and retains the wax longer; carbon nano particles and other additives enhance glide. P-tex waste is drastically reduced by flip-flopping base graphic colors between boards; base colors are random, thus specific requests cannot be accommodated. .","short_description":"The Jones Mothership snowboard is a women-specific, high-performance freeride board that can take you down the steepest slopes with the deepest pow. This board is truly a freerider's dream.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Freeride Snowboards","thumb_url":"http://i1.avlws.com/115/s344211.png","image_url":"http://i1.avlws.com/115/l344211.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=344211&tt=df","retail_price":"549.00","sale_price":"378.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=344211\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m344211.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857024&amp;link=&amp;tabs=-Details\"></script>","variants":{"8570240001":{"sku":"8570240001","vendor_sku":"SJ140130","size":"148 CM","retail_price":"378.83","sale_price":"378.83"},"8570240002":{"sku":"8570240002","vendor_sku":"SJ140131","size":"152 CM","retail_price":"378.83","sale_price":"378.83"}}}
