{"sku":"857001","manufacturer_id":"7023036","brand_name":"Giro","product_name":" Giro Sheer Snow Helmet - Women's","long_description":"Plush finishing details, amazing fit and featherlight weight make the Giro Sheer snow helmet a great choice for women who want superior performance and style while they ride. Rigorously lab- and field-tested Super Fit(TM) engineering incorporates careful anatomic measurements and rider input to offer high-performance fit and comfort. In Form(TM) fit system with glove-friendly adjustment dial and vertical fine-tuning accommodates different goggles and head shapes for a custom fit. Stack Vent(TM) design offers seamless integration of goggles and helmet ventilation; it aligns a helmet vent with your goggles' center vent, helping keep goggles clear. In-mold construction fuses a tough, ventilated polycarbonate shell with an impact-absorbing foam liner, resulting in a helmet that is lighter and cooler than many others. Super Cool(TM) vents invite cool, fresh air into the helmet while pushing hot, stale air out; optimized vent shapes help regulate temperature to keep you feeling fresh. Thermostat(TM) ventilation control lets you adjust airflow instantly with a simple, low-profile control button on the outside of the helmet. Compatible with after-market Giro audio systems (sold separately). The Giro Sheer snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet standards.","short_description":"Plush finishing details, amazing fit and featherlight weight make the Giro Sheer snow helmet a great choice for women who want superior performance and style while they ride.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Women's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381467.png","image_url":"http://i1.avlws.com/115/l381467.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381467&tt=df","retail_price":"160.00","sale_price":"111.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381467\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381467.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857001&amp;link=&amp;tabs=-Details\"></script>","variants":{"8570010003":{"sku":"8570010003","vendor_sku":"7023042","upc":"768686940767","size":"S","color":"TAHOE BLUE HARVEST","retail_price":"111.93","sale_price":"111.93"}},"categories":["snow","ski-helmets","womens-ski-helmets"]}
