{"sku":"857008","manufacturer_id":"H14-VOSMMD","brand_name":"Smith","product_name":" Smith Voyage Snow Helmet - Women's","long_description":"The women's Smith Voyage snow helmet conceals cutting-edge technology behind its stylish accents. With minimal bulk and maximun ventilation, the Voyage offers up the ultimate in performance. Hybrid in-mold shell construction creates a low-profile helmet with reduced volume and light weight. AirEvac 2 ventilation drives warm air away from your goggles and out of the helmet through internal channels and 16 vents. Micro-adjustable x Boa(R) fit system sports an intuitive dial system for on-the-fly, single-handed control; 3/4 halo design offers self-centering and vertical adjustability. Low-profile Regulator climate control system allows you to easily modify the amount of airflow and heat exhaust, even while wearing gloves. Removable, washable fleeced tricot lining offers soft comfort and lets you wear the helmet over a beanie. Removable, machine-washable ear pads provide a comfortable seal from the weather on stormy days; for a warm spring day, remove the earpads to reduce weight and enhance cooling. Removable goggles lock helps ensure your goggles stay with you after that head-over-heels wipeout through blower powder. The women's Smith Voyage snow helmet is compatible with Skullcandy audio systems (not included). This snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards.","short_description":"The women's Smith Voyage snow helmet conceals cutting-edge technology behind its stylish accents. With minimal bulk and maximun ventilation, the Voyage offers up the ultimate in performance.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Women's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381475.png","image_url":"http://i1.avlws.com/115/l381475.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381475&tt=df","retail_price":"130.00","sale_price":"103.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381475\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381475.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857008&amp;link=&amp;tabs=-Details\"></script>","variants":{"8570080003":{"sku":"8570080003","vendor_sku":"H14-VOSMSM","upc":"715757426422","size":"S","color":"SATIN MIST","retail_price":"103.93","sale_price":"103.93"},"8570080004":{"sku":"8570080004","vendor_sku":"H14-VOSMMD","upc":"715757426439","size":"M","color":"SATIN MIST","retail_price":"103.93","sale_price":"103.93"}},"categories":["snow","ski-helmets","womens-ski-helmets"]}
