{"sku":"857011","manufacturer_id":"H14-ALWEMD","brand_name":"Smith","product_name":" Smith Allure Snow Helmet - Women's","long_description":"The Smith Allure snow helmet for women delivers a plush, fleeced tricot lining in one of the world's lightest certified snow helmets. In-mold construction reduces weight and provides proven impact protection. Lifestyle fit system uses a forgiving elastic band to flex around your head for a dynamic fit that moves with you; lateral adjustment accommodates a wide range of head sizes. AirEvac 2 ventilation drives warm air away from your goggles and out of the helmet through internal channels and 9 vents. Airflow climate control features fabric flaps in the lining so you can open or close vents for comfort in mild or cold temperatures. Removable, machine-washable ear pads provide a comfortable seal from the weather on stormy days; for a warm spring day, remove the earpads to reduce weight and enhance cooling. Removable, washable fleeced tricot lining offers soft comfort and lets you wear the helmet over a beanie. Removable goggles lock helps ensure your goggles stay with you after that head-over-heels wipeout through blower powder. The Smith Allure snow helmet is compatible with Skullcandy audio systems (not included). This snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards.","short_description":"The Smith Allure snow helmet for women delivers a plush, fleeced tricot lining in one of the world's lightest certified snow helmets.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Women's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381483.png","image_url":"http://i1.avlws.com/115/l381483.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381483&tt=df","retail_price":"100.00","sale_price":"79.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381483\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381483.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857011&amp;link=&amp;tabs=-Details\"></script>","variants":{"8570110001":{"sku":"8570110001","vendor_sku":"H14-ALWESM","upc":"715757426811","size":"S","color":"WHITE TIDE","retail_price":"79.93","sale_price":"79.93"}}}
