{"sku":"857015","manufacturer_id":"H12-ZOBKYM","brand_name":"Smith","product_name":" Smith Zoom Jr. Snow Helmet - Boys'","long_description":"The Smith Zoom Jr. snow helmet helps protect young snowhounds' heads when they're straight-lining in a high-speed wedge or flying high in the terrain park. In-mold construction reduces weight and provides proven impact protection. AirEvac 2 ventilation drives warm air away from your goggles and out of the helmet through internal channels and 16 vents. Dial Fit system uses an intuitive, right-tighty/lefty-loosey wheel for quick, easy adjustment. Airflow climate control features fabric flaps in the lining that let you open and close vents for comfort in cold or mild temperatures. Soft and furry tricot lining. Removable, machine-washable ear pads provide a comfortable seal from the weather on stormy days; for a warm spring day, remove the earpads to reduce weight and enhance cooling. Removable goggles lock helps ensure goggles stay with them after a head-over-heels wipeout through blower powder. This snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards.","short_description":"The Smith Zoom Jr. snow helmet helps protect young snowhounds' heads when they're straight-lining in a high-speed wedge or flying high in the terrain park.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Kids' Ski Helmets","thumb_url":"http://i1.avlws.com/115/s346143.png","image_url":"http://i1.avlws.com/115/l346143.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=346143&tt=df","retail_price":"60.00","sale_price":"47.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=346143\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m346143.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857015&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-helmets","kids-ski-helmets"]}
