{"sku":"857009","manufacturer_id":"H14-SQMRMD","brand_name":"Smith","product_name":" Smith Sequel Snow Helmet - Women's","long_description":"The women's Smith Sequel snow helmet combines the timeless style of a classic helmet with Smith's most advanced, ultra-light hybrid shell technology to make the old new again. Hybrid in-mold shell construction creates a low-profile helmet with reduced volume and light weight. AirEvac 2 ventilation drives warm air away from your goggles and out of the helmet through internal channels and 18 vents. Micro-adjustable x Boa(R) fit system sports an intuitive dial system for on-the-fly, single-handed control; 3/4 halo design offers self-centering and vertical adjustability. Low-profile Regulator climate control system allows you to easily modify the amount of airflow and heat exhaust, even while wearing gloves. Removable and machine-washable Nanosilver performance lining incorporates silver-based antimicrobial material and soft cushioning to keep your helmet clean and comfortable. Removable, machine-washable ear pads provide a comfortable seal from the weather on stormy days; for a warm spring day, remove the earpads to reduce weight and enhance cooling. Ultralight, removable goggles lock helps ensure your goggles stay with you after that head-over-heels wipeout through blower powder. The Smith Sequel snow helmet is compatible with Skullcandy audio systems (not included). This snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards.","short_description":"The women's Smith Sequel snow helmet combines the timeless style of a classic helmet with Smith's most advanced, ultra-light hybrid shell technology to make the old new again.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Women's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381479.png","image_url":"http://i1.avlws.com/115/l381479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381479&tt=df","retail_price":"160.00","sale_price":"127.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857009&amp;link=&amp;tabs=-Details\"></script>","variants":{"8570090001":{"sku":"8570090001","vendor_sku":"H14-SQMRSM","upc":"715757426170","size":"S","color":"MERLOT","retail_price":"127.93","sale_price":"127.93"},"8570090002":{"sku":"8570090002","vendor_sku":"H14-SQMRMD","upc":"715757426187","size":"M","color":"MERLOT","retail_price":"127.93","sale_price":"127.93"}}}
