{"sku":"857002","manufacturer_id":"7029468","brand_name":"Giro","product_name":" Giro Lure Snow Helmet - Women's","long_description":"The Giro Lure snow helmet comes armed with a featherlight fit and crucial all-mountain details. Plush earpads and a fun color give the Lure a leg up on other women's helmets. Rigorously lab- and field-tested Super Fit(TM) engineering incorporates careful anatomic measurements and rider input to offer high-performance fit and comfort. Super Cool(TM) vents invite cool, fresh air into the helmet while pushing hot, stale air out; optimized vent shapes help regulate temperature to keep you feeling fresh. Thermostat(TM) ventilation control lets you adjust airflow instantly with a simple, low-profile control button on the outside of the helmet. Stack Vent(TM) design offers seamless integration of goggles and helmet ventilation; it aligns a helmet vent with your goggles' center vent, helping keep goggles clear. In-mold construction fuses a tough, ventilated polycarbonate shell with an impact-absorbing foam liner, resulting in a helmet that is lighter and cooler than many others. Roc Loc(R) 5 fit system provides a high level of comfort, stability, adjustability and weight savings; easily dial in fit tension and vertical position with a single hand. Compatible with after-market Giro audio systems (sold separately). The Giro Lure snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet standards.","short_description":"The Giro Lure snow helmet comes armed with a featherlight fit and crucial all-mountain details. Plush earpads and a fun color give the Lure a leg up on other women's helmets.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Women's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381471.png","image_url":"http://i1.avlws.com/115/l381471.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381471&tt=df","retail_price":"130.00","sale_price":"90.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381471\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381471.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857002&amp;link=&amp;tabs=-Details\"></script>","variants":{"8570020001":{"sku":"8570020001","vendor_sku":"7029467","upc":"768686940927","size":"S","color":"MATTE MAGENTA","retail_price":"90.93","sale_price":"90.93"},"8570020002":{"sku":"8570020002","vendor_sku":"7029468","upc":"768686940934","size":"M","color":"MATTE MAGENTA","retail_price":"90.93","sale_price":"90.93"}},"categories":["snow","ski-helmets","womens-ski-helmets"]}
