{"sku":"857041","manufacturer_id":"62122","brand_name":"Camelbak","product_name":" CamelBak SnoBlast Hydration Snow Pack - 70 fl. oz.","long_description":"The CamelBak SnoBlast hydration snow pack keeps 21 liters of essential gear and two liters of water at the ready while you attack the terrain park, glide the groomers or venture into the sidecountry. Therminator(TM) harness makes it easy to get to your mouthpiece for a drink; it stores a hand warmer (sold separately) to help prevent tube freezing. Fully insulated hydration system features a foam-wrapped, quick-disconnect delivery tube; reservoir holds up to 70 fl. oz. (2 liters) to quench your thirst on demand. Reservoir features a lightweight fill port, a low-profile design and a cap that opens and closes easily; strategically placed access zipper makes it easy to fill the reservoir. HydroGuard(TM) technology inhibits bacterial growth on reservoir and tube surfaces (but does not protect user from disease organisms; wash reservoir after each use). Padded front pocket holds a digital music player, sunglasses or small tools; helmet carry loop makes it easy to stash your helmet while hiking. Padded Snowshed(TM) back panel shrugs off moisture when you set your pack down in the snow; removable hipbelt helps stabilize the pack when you're rocking and rolling.","short_description":"The CamelBak SnoBlast hydration snow pack keeps 21 liters of essential gear and two liters of water at the ready while you attack the terrain park, glide the groomers or venture into the sidecountry.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411839.png","image_url":"http://i1.avlws.com/115/l411839.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411839&tt=df","keywords":"day packs","retail_price":"89.00","sale_price":"70.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411839\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411839.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857041&amp;link=&amp;tabs=-Details\"></script>","variants":{"8570410001":{"sku":"8570410001","vendor_sku":"62122","upc":"886798621227","color":"CHARCOAL","retail_price":"70.93","sale_price":"70.93"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
