{"sku":"857026","manufacturer_id":"SJ140111","brand_name":"Jones","product_name":" Jones Solution Splitboard - Women's - 2013/2014","long_description":"The Jones Solution splitboard for women takes you deep into the backcountry, whether you're traversing ice-covered faces or charging down pow-filled chutes. Find your line with this board. Solution splitboard stands at the top of its class with inner- and outer-edge mellow Magne-Traction and a directional rocker profile with traditional camber underfoot. Mellow Magne-Traction improves edge grip by adding five contact points along the running length of the board, resulting in amazing control whether riding ice or pow. Directional rocker matched with camber underfoot makes the Solution snowboard your answer for any line within sight of your eyes and reach of your legs. Rockered tip adds float and improves maneuverability while the camber underfoot delivers added edge hold and response. Full wood core is comfortable and robust; it's a true all-terrain core and certified by the Forest Stewardship Council. Carbon Quadrax fiberglass meshed with dual carbon fiber bands delivers vibration damping, board stability and snap. Film topsheet saves weight over traditional plastic topsheets; sintered base absorbs and retains wax; includes Karakoram Clips. Jones Solution pairs perfectly with Voile Light Rail splitboard bindings and Voile Universal Splitboard hardware kit for Light Rail bindings, sold separately. .","short_description":"The Jones Solution splitboard for women takes you deep into the backcountry, whether you're traversing ice-covered faces or charging down pow-filled chutes. Find your line with this board.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Splitboards","thumb_url":"http://i1.avlws.com/115/s344227.png","image_url":"http://i1.avlws.com/115/l344227.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=344227&tt=df","retail_price":"849.00","sale_price":"720.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=344227\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m344227.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857026&amp;link=&amp;tabs=-Details\"></script>","variants":{"8570260001":{"sku":"8570260001","vendor_sku":"SJ140111","size":"148 CM","retail_price":"720.93","sale_price":"720.93"}},"categories":["snow","snowboards","splitboards"]}
