{"sku":"857137","manufacturer_id":"1331015","brand_name":"Union","product_name":" Union DLX Snowboard Bindings - 2013/2014","long_description":"Built to last, the Union DLX snowboard bindings feature lightweight, bombproof nylon bases, EVA bushings and cushioned straps for amazing comfort and performance in the park. Union bindings are designed to promote a free, even board flex for sweet response, board control and improved board durability. Stage I bases are made wth high-quality DuPont(TM) Zytel(R) ST nylon; they're strong, supportive and secure, and offer balanced comfort and response. Extruded aluminum heel cups reduce weight and maintain strength; dual-density EVA bushings offering vibration damping that allows you to feel the natural board flex. Multizone DuPont Zytel ST injected highbacks build in flex and tweakability where you want it, and support and durability where you need it; forward lean adjusts without tools. 3D Direct-Connect ankle straps eliminate elasticity and evenly distribute pressure across feet and ankles for increased comfort and board control. Multi-position toe straps offer an improved and updated fit for a wide range of boots. Injected aluminum buckles and steel cages allow fast entry and exit. Union DLX bindings are compatible with Burton The Channel M6 snowboards.","short_description":"Built to last, the Union DLX snowboard bindings feature lightweight, bombproof nylon bases, EVA bushings and cushioned straps for amazing comfort and performance in the park.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382963.png","image_url":"http://i1.avlws.com/115/l382963.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382963&tt=df","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382963\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382963.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857137&amp;link=&amp;tabs=-Details\"></script>","variants":{"8571370001":{"sku":"8571370001","vendor_sku":"1331015","upc":"842852135512","size":"L/XL","color":"BLACK","retail_price":"129.95","sale_price":"129.95"},"8571370002":{"sku":"8571370002","vendor_sku":"1331013","upc":"842852135505","size":"M/L","color":"BLACK","retail_price":"129.95","sale_price":"129.95"}}}
