{"sku":"857174","manufacturer_id":"1330213","brand_name":"Union","product_name":"Union Charger Snowboard Bindings - 2013/2014","long_description":"Union Charger men's snowboard bindings feature a lightweight carbon construction, EVA bushings to damp your landings, and cushioned straps for superior comfort on the hill. Stage III Atlas bases are made with high-quality, carbon-injected DuPont Zytel ST nylon; CNC machined aluminum heel cups have superior torsional stiffness and overall strength. Baseplates are designed to be supremely strong with the smallest footprint possible; this promotes free, even board flex for sweet response, board control and durability. Baseplates and heel cups are machine cored to remove as much material as possible to keep them ultra lightweight without sacrificing strength. Injected EVA bushings damp vibrations underfoot, promoting a comfortable ride and smooth, even board flex with no dead spots. Lightweight, full carbon highbacks offer the flexibility needed to ride anywhere on the mountain; highbacks feature tool-free forward lean. 3D Direct-Connect ankle straps eliminate elasticity and evenly distribute pressure across feet and ankles for increased comfort and board control. Multi-position toe straps fit a wide range of boots; magnesium buckles are 4 times stronger than aluminum with only half the weight. Union Charger bindings are compatible with Burton The Channel M6 snowboards.","short_description":"Union Charger men's snowboard bindings feature a lightweight carbon construction, EVA bushings to damp your landings, and cushioned straps for superior comfort on the hill.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382991.png","image_url":"http://i1.avlws.com/115/l382991.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382991&tt=df","retail_price":"329.95","sale_price":"245.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382991\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382991.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857174&amp;link=&amp;tabs=-Details\"></script>","variants":{"8571740001":{"sku":"8571740001","vendor_sku":"1330213","upc":"842852134874","size":"M/L","color":"BLACK/RED","retail_price":"245.83","sale_price":"245.83"},"8571740002":{"sku":"8571740002","vendor_sku":"1330215","upc":"842852134881","size":"L/XL","color":"BLACK/RED","retail_price":"245.83","sale_price":"245.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
