{"sku":"857178","manufacturer_id":"1331213","brand_name":"Union","product_name":"Union Legacy Snowboard Bindings - Women's - 2013/2014","long_description":"With a woman-specific fit, comfortable straps and lightweight construction, the Union Legacy snowboard bindings ensure all-day comfort, all winter long. Union bindings are designed to promote a free, even board flex for sweet response, board control and improved board durability. Female-specific Stage III Atlas bases are made with high-quality DuPont(TM) Zytel(R) ST nylon which is lightweight yet durable. Union baseplates are designed to provide supreme strength with the smallest footprint possible to reduce interference with your board's true flex. Injected EVA bushings damp vibrations underfoot to promote a comfortable ride and smooth, even board flex with no dead spots. Extruded aluminum heel cups undergo an anodizing process that further increases their strength by 30%; they'll maintain their shape no matter how much wear and tear they see. Asymmetric highbacks build in flex and tweakability where you want it, and support and durability where you need it; tool-less forward lean adjustments. 3D Direct-Connect ankle straps eliminate elasticity and evenly distribute pressure across feet and ankles for increased comfort and board control. Multi-position toe straps fit a wide range of boots; magnesium buckles are 4 times stronger than aluminum with only half the weight. Union Legacy bindings are compatible with Burton The Channel M6 snowboards.","short_description":"With a woman-specific fit, comfortable straps and lightweight construction, the Union Legacy snowboard bindings ensure all-day comfort, all winter long.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s383007.png","image_url":"http://i1.avlws.com/115/l383007.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383007&tt=df","retail_price":"229.95","sale_price":"148.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383007\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383007.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857178&amp;link=&amp;tabs=-Details\"></script>","variants":{"8571780001":{"sku":"8571780001","vendor_sku":"1331213","upc":"842852135574","size":"M","color":"METALLIC PURPLE","retail_price":"148.83","sale_price":"148.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
