{"sku":"857169","manufacturer_id":"1330115","brand_name":"Union","product_name":" Union MC-Metafuse Snowboard Bindings - 2013/2014","long_description":"Union MC-Metafuse bindings are ultra lightweight and ultra stiff. Featuring Metafuse(TM) nanometal/polymer hybrid technology for amazing strength, they are ready to conquer the entire hill. Metafuse technology coats the DuPont(TM) Zytel(R) ST nylon with ultra-stiff nanocrystalling metal particles, giving you the wear resistance of steel without the weight. Union is one of the first companies to bring Metafuse technology to the market and specifically to the binding market to provides high strength with minimum weight. Stage III Atlas bases are made with high-quality carbon-injected DuPont Zytel ST nylon; Metafuse heel cups have superior torsional stiffness and overall strength. Baseplates are designed to be supremely strong with the smallest footprint possible; this promotes free, even board flex for sweet response, board control and durability. Baseplates and heel cups are machine cored to remove as much material as possible to keep them ultra lightweight without sacrificing strength. Injected EVA bushings damp vibrations underfoot, promoting a comfortable ride and smooth, even board flex with no dead spots. Lightweight full carbon toe ramps with dual-density padding cushion landings while transmitting all your energy from edge to edge. Lightweight full carbon highbacks offer the flexibility needed to ride anywhere on the mountain. 3D Direct-Connect ankle straps eliminate elasticity and evenly distribute pressure across feet and ankles for increased comfort and board control. Union MC-Metafuse bindings feature CNC anodized aluminum hardware; multi-position toe straps fit a wide range of boots. Magnesium buckles are 4 times stronger than aluminum with only half the weight. Compatible with Burton The Channel M6 snowboards.","short_description":"Union MC-Metafuse bindings are ultra lightweight and ultra stiff. Featuring Metafuse(TM) nanometal/polymer hybrid technology for amazing strength, they are ready to conquer the entire hill.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382971.png","image_url":"http://i1.avlws.com/115/l382971.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382971&tt=df","retail_price":"399.95","sale_price":"298.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382971\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382971.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857169&amp;link=&amp;tabs=-Details\"></script>","variants":{"8571690001":{"sku":"8571690001","vendor_sku":"1330113","upc":"842852134850","size":"M/L","color":"CARBON","retail_price":"298.83","sale_price":"298.83"},"8571690002":{"sku":"8571690002","vendor_sku":"1330115","upc":"842852134867","size":"L/XL","color":"CARBON","retail_price":"298.83","sale_price":"298.83"}}}
