{"sku":"857177","manufacturer_id":"1331333","brand_name":"Union","product_name":" Union Trilogy Snowboard Bindings - Women's - 2013/2014","long_description":"If you like to ride the entire mountain, from the park to deep pow to carving up groomers, choose Union Trilogy women's snowboard bindings. The strong and supportive design handles the whole mountain. Trilogy II bases are made wth high-quality DuPont(TM) Zytel(R) ST nylon; they're strong, supportive and secure, and offer balanced comfort and response. Baseplates are designed to be supremely strong with the smallest footprint possible; this promotes free, even board flex for sweet response, board control and durability. Lightweight injected EVA bushings damp vibrations underfoot to promote a comfortable ride and smooth, even board flex with no dead spots. Extruded aluminum heel cups undergo an anodizing process that further increases their strength by 30%; they'll maintain their shape no matter how much wear and tear they see. Multizone highbacks offer three different zones of flex for a transitional top-to-bottom flex, with the top third being the softest and the bottom third the stiffest. 3D Direct-Connect ankle straps eliminate elasticity and evenly distribute pressure across feet and ankles for increased comfort and board control. Multi-position toe straps fit a wide range of boots; magnesium buckles are 4 times stronger than aluminum with only half the weight. Union Trilogy bindings are compatible with Burton The Channel M6 snowboards.","short_description":"If you like to ride the entire mountain, from the park to deep pow to carving up groomers, choose Union Trilogy women's snowboard bindings. The strong and supportive design handles the whole mountain.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s383003.png","image_url":"http://i1.avlws.com/115/l383003.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383003&tt=df","retail_price":"199.95","sale_price":"148.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383003\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383003.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857177&amp;link=&amp;tabs=-Details\"></script>","variants":{"8571770002":{"sku":"8571770002","vendor_sku":"1331333","upc":"842852135635","size":"M","color":"SEA FOAM","retail_price":"148.83","sale_price":"148.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
