{"sku":"857172","manufacturer_id":"1330325","brand_name":"Union","product_name":" Union Factory Snowboard Bindings - 2013/2014","long_description":"Endorsed by Travis Rice-enough said-Union Factory bindings feature articulated straps, canted gas pedals and lightweight yet durable construction to meet your all-mountain riding needs. Stage III Atlas bases are made with high-quality DuPont(TM) Zytel(R) ST nylon; they're strong, supportive and secure, and offer balanced comfort and response. Baseplates are designed to be supremely strong with the smallest footprint possible; this promotes free, even board flex for sweet response, board control and durability. Canted gas pedals offer you extra leverage when riding for enhanced power when pulling off an ollie or ripping through the park. Extruded aluminum heel cups reduce weight and maintain strength; injected EVA bushings offering vibration damping that allows you to feel the natural board flex. DuPont Zytel ST injected highbacks build in flex and tweakability where you want it, and support and durability where you need it; forward lean adjusts without tools. New SONICFUSED ankle straps feature a multi-layer construction fused together to form a single articulated strap for amazing comfort and control. Multi-position toe straps fit a wide range of boots; magnesium buckles are 4 times stronger than aluminum with only half the weight. Union Factory bindings are compatible with Burton The Channel M6 snowboards.","short_description":"Endorsed by Travis Rice-enough said-Union Factory bindings feature articulated straps, canted gas pedals and lightweight yet durable construction to meet your all-mountain riding needs.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382983.png","image_url":"http://i1.avlws.com/115/l382983.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382983&tt=df","retail_price":"269.95","sale_price":"200.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382983\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382983.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857172&amp;link=&amp;tabs=-Details\"></script>","variants":{"8571720002":{"sku":"8571720002","vendor_sku":"1330325","upc":"842852134928","size":"L/XL","color":"ASADACHI 6","retail_price":"200.83","sale_price":"200.83"}}}
