{"sku":"857175","manufacturer_id":"1331513","brand_name":"Union","product_name":"Union Rosa Snowboard Bindings - Women's - 2013/2014","long_description":"Just because you're a progressing rider, it doesn't mean you have to sacrifice style or performance in your gear. Union Rosa snowboard bindings give you the performance you need to take on the slopes. Flite bases are built specifically for women; they're made with DuPont(TM) Zytel(R) ST nylon in a super lightweight, low-profile, freestyle-oriented design. Baseplates are designed to be supremely strong with the smallest footprint possible; this promotes free, even board flex for sweet response, board control and durability. Injected EVA bushings damp vibrations underfoot, promoting a comfortable ride and smooth, even board flex with no dead spots. Extruded aluminum heel cups undergo an anodizing process that further increases their strength by 30%; they'll maintain their shape no matter how much wear and tear they see. Women-specific Rosa highbacks feature a lightweight, forgiving design optimized for comfort, and offer tool-free forward lean. 3D Direct-Connect ankle straps eliminate elasticity and evenly distribute pressure across feet and ankles for increased comfort and board control. Multi-position toe straps fit a wide range of boots; magnesium buckles are 4 times stronger than aluminum with only half the weight. Union Rosa bindings are compatible with Burton The Channel M6 snowboards.","short_description":"Just because you're a progressing rider, it doesn't mean you have to sacrifice style or performance in your gear. Union Rosa snowboard bindings give you the performance you need to take on the slopes.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382995.png","image_url":"http://i1.avlws.com/115/l382995.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382995&tt=df","retail_price":"159.95","sale_price":"118.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382995\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382995.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857175&amp;link=&amp;tabs=-Details\"></script>","variants":{"8571750001":{"sku":"8571750001","vendor_sku":"1331513","upc":"842852135710","size":"M","color":"SILVER","retail_price":"118.83","sale_price":"118.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
