{"sku":"857176","manufacturer_id":"1331623","brand_name":"Union","product_name":" Union Flite Lady Snowboard Bindings - Women's - 2013/2014","long_description":"With a women-specific fit, cushioned EVA bushings, and a lightweight design, the Union Flite Lady bindings are your ticket to comfort and performance in the park. Flite bases are built specifically for women; they're made with DuPont(TM) Zytel(R) ST nylon in a super lightweight, low-profile, freestyle-oriented design. Baseplates are designed to be supremely strong with the smallest footprint possible; this promotes free, even board flex for sweet response, board control and durability. Injected EVA bushings damp vibrations underfoot, promoting a comfortable ride and smooth, even board flex with no dead spots. Extruded aluminum heel cups undergo an anodizing process that further increases their strength by 30%; they'll maintain their shape no matter how much wear and tear they see. DuPont Zytel ST highbacks maintain flexibility and strength in a wide range of temperatures; they provide lightweight, easy mobility; tool-free forward lean. Contoured and padded ankle straps keep feet comfortably locked in; straps adjust without tools. Multi-position toe straps fit a wide range of boots; injected aluminum buckles. Flite Lady bindings are compatible with Burton The Channel M6 snowboards.","short_description":"With a women-specific fit, cushioned EVA bushings, and a lightweight design, the Union Flite Lady bindings are your ticket to comfort and performance in the park.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s382999.png","image_url":"http://i1.avlws.com/115/l382999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382999&tt=df","retail_price":"129.95","sale_price":"83.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857176&amp;link=&amp;tabs=-Details\"></script>","variants":{"8571760001":{"sku":"8571760001","vendor_sku":"1331623","upc":"842852135796","size":"M","color":"WHITE","retail_price":"83.83","sale_price":"83.83"}}}
