{"sku":"857259","manufacturer_id":"960","brand_name":"Zamberlan","product_name":"Zamberlan 960 Guide GT RR Hiking Boots - Men's","long_description":"The Zamberlan 960 Guide GT RR hiking boots feature Gore-Tex(R) waterproof, breathable linings for superior moisture protection during extended backpacking trips. Nubuck leather uppers have a distinctive, handsome look; rubber rand reinforcements supply extra durability and protection. Seam-sealed Gore-Tex liners protect feet from wet weather and allow excess moisture vapor to escape, keeping feet dry and comfortable. Nylon linings wick moisture away from feet, further ensuring dry comfort; silky collar linings feel great against calves. Anatomically-shaped removable footbeds provide cushioning and support, wick away moisture and have an active carbon middle layer to help control odor. Dual-density polyurethane is used to create midsoles for a solid foundation underfoot, adding stability and control. Thermoplastic urethane shanks are added to bolster arch protection and increase support. Offering amazing traction, the Vibram(R) Star Trek outsoles are ideal for carrying heavy loads and hiking through rough and steep off-trail terrain.","short_description":"The Zamberlan 960 Guide GT RR hiking boots feature Gore-Tex(R) waterproof, breathable linings for superior moisture protection during extended backpacking trips.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385263.png","image_url":"http://i1.avlws.com/115/l385263.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385263&tt=df","retail_price":"335.00","sale_price":"335.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385263\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385263.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857259&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","mens-footwear","mens-boots"]}
