{"sku":"857241","manufacturer_id":"N102","brand_name":"Kuat","product_name":"Kuat NV 2-Bike Hitch Rack","long_description":"You'll be the envy of your cycle buddies when pulling up to the trailhead with the Kuat NV 2-bike hitch rack. Stylish, easy-to-use and feature packed, the NV-2 is a smart choice for bike transport. Highlights of the NV 2-bike hitch rack include its striking design, an integrated, retractable cable lock and a built-in repair stand for pre-ride prep and post-ride clean up. This rack is an ideal choice for transporting your beefy downhill and freeride bikes, as well as road bikes and cruisers. Built-in TRAIL DOC(TM) repair stand raises and lowers quickly thanks to its quick-release lever; repair stands makes pre-ride tune ups or post-ride clean ups easy. 13 in. of protective space between bikes keeps bikes from touching one another during transport. No wheel removal required and almost no frame contact; dual ratchet arms lift up and over the front wheels to secure bikes in place. Rear-wheel ratchets offer a versatile fit for all styles of wheels and tires. Spring-loaded lever allows easy folding up and down of bike trays; rack tilts 40deg further for access to rear of vehicle-simply release lever and lower or raise rack. Integrated cable locks at rear-wheel tray ends secure bikes to rack, recoiling into rack and securing with magnets when stowed; locking hitch pin delivers maximum security. Fits 20 - 29 in. wheels up to 3 in. wide; carries 2 bikes up to 60 lbs. each. Fits 1.25 or 2 in. receivers; hand-tightening cam system secures rack into hitch receiver-no tools required. Powder-coated finish and anodized aluminum accents offer a striking design that looks great on the back of any vehicle. Folds up quickly for easy storage. Capacity of rack can be increased to 4 bikes with available NV Add-On 2-Bike Hitch Rack extension, sold separately (works only with 2 in. version of the NV 2-bike hitch rack).","short_description":"You'll be the envy of your cycle buddies when pulling up to the trailhead with the Kuat NV 2-bike hitch rack. Stylish, easy-to-use and feature packed, the NV-2 is a smart choice for bike transport.","category":"Car Racks","subcategory":"Bike Racks","product_group":"Trailer Hitch Bike Racks","thumb_url":"http://i1.avlws.com/115/s312331.png","image_url":"http://i1.avlws.com/115/l312331.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=312331&tt=df","keywords":"hitch-mount,rear,mount","retail_price":"529.00","sale_price":"529.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=312331\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m312331.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857241&amp;link=&amp;tabs=-Details\"></script>","variants":{"8572410004":{"sku":"8572410004","vendor_sku":"N106","upc":"896581002454","size":"1 1/4 IN","color":"BLACK","retail_price":"529.00","sale_price":"529.00"}},"categories":["car-racks","bike-racks","trailer-hitch-bike-racks"]}
