{"sku":"857473","manufacturer_id":"EC-20438129","brand_name":"Eagle Creek","product_name":" Eagle Creek Morphus 2-in-1 Wheeled Convertible Luggage - 22\"","long_description":"Streamline your travel with the Eagle Creek Morphus 22 2-in-1 wheeled convertible luggage. Zip off the front bag and expand the back bag for two full-size carry-ons that hold your gear plus souvenirs. Removable front bag features zip-away backpack straps, removable padded shoulder strap and multiple grab handles so you can carry it any way you're comfortable. When the front gear bag is removed, the wheeled main bag expands to 22 x 14 x 9 in.; single compartment allows easy packing. Front bag also measures 22 x 14 x 9 in.; roomy main compartment holds all your gear for a day hike or afternoon exploring a new city. Main wheeled bag features a polycarbonate back shell for lightweight structure, impact-resistance and durability. Sturdy wheels, skid plate and bumper protection help the wheeled bag conquer bumpy, uneven terrain; retractable handle allows comfortable pulling. Front bag features a large zippered pocket with a padded laptop sleeve that fits computers up to 15 in.; additional padded sleeve fits most tablets. Exterior stash pocket lets you keep small items within easy reach; exterior lockable zippered front pocket secures important items like wallet, phone and passport. Main bag features front compression straps to stabilize the load; backpack features side compression straps and lash points for extra gear. Lockable, self-repairing zippers are easy to grab; reflective accents increase visibility in low light; tough Bi-Tech(TM) nylon fabric is water- and abrasion-resistant. Please note that the front bag cannot be zipped onto the main bag while the main bag is expanded; combined bags measure 22 x 14 x 9 in. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"Streamline your travel with the Eagle Creek Morphus 22 2-in-1 wheeled convertible luggage. Zip off the front bag and expand the back bag for two full-size carry-ons that hold your gear plus souvenirs.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433899.png","image_url":"http://i1.avlws.com/115/l433899.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433899&tt=df","retail_price":"395.00","sale_price":"395.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433899\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433899.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857473&amp;link=&amp;tabs=-Details\"></script>","variants":{"8574730001":{"sku":"8574730001","vendor_sku":"EC-20438129","upc":"766182140155","color":"STONE GREY","retail_price":"395.00","sale_price":"395.00"}},"categories":["travel","luggage","wheeled-luggage"]}
