{"sku":"857578","manufacturer_id":"BUS05404","brand_name":"Novara","product_name":" Novara Bonita Women's Bike - 2014","long_description":"A tough mountain bike for winding singletrack, the Novara Bonita women's bike features a nimble aluminum frame, powerful disc brakes and a shock-absorbent fork to smooth out rough trails. Lightweight 6061 aluminum frame features an S-bend downtube to enhance strength and stiffness at critical frame junctures. Suntour XCM V3 suspension fork gives you 80mm of travel to smooth out rough trails. Shimano Alivio crankset is paired with a wide-ranging cassette to power the 27 gear combinations, making easy work of conquering hills and cruising descents. Shimano Acera trigger shifters guide the Acera front and Alivio rear derailleurs for responsive, precise shifts. Tektro hydraulic disc brakes provide reliable stopping power and controlled deceleration. Mineral oil system in the hydraulic disc brakes performs consistently in all conditions and is a great alternative to DOT chemical fluid systems. WTB Nano Comp tires feature a fast-rolling center tread with more-aggressive traction at the edges for all-around performance. The Novara Bonita women's bike has an anatomically designed WTB Speed She Sport saddle for comfort and support. Just get on and ride, no fancy shoes required(TM)aluminum platform pedals accommodate a variety of shoes. Specs on our Novara Bonita bike are subject to change.","short_description":"A tough mountain bike for winding singletrack, the Novara Bonita women's bike features a nimble aluminum frame, powerful disc brakes and a shock-absorbent fork to smooth out rough trails.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374763.png","image_url":"http://i1.avlws.com/115/l374763.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374763&tt=df","retail_price":"649.00","sale_price":"649.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374763\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374763.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857578&amp;link=&amp;tabs=-Details\"></script>","variants":{"8575780002":{"sku":"8575780002","vendor_sku":"BUS05404","upc":"485757800026","size":"S","color":"WHITE","retail_price":"649.00","sale_price":"649.00"}},"categories":["cycling","bikes","mountain-bikes"]}
