{"sku":"857585","manufacturer_id":"US05518","brand_name":"Novara","product_name":"Novara Jaunt XX Women's Bike - 2014","long_description":"Designed to let you stop and put your feet on the ground without getting off the saddle, our Novara Jaunt XX women's bike offers pure comfort for quick errands or casual rides with friends. Our \"Best Foot Forward\" design places the pedals and crank slightly forward and lowers the angle of the seat tube so you can put your feet on the ground while still sitting. Best Foot Forward design also lets you easily pedal without compromising efficiency; step-through frame makes mounting and dismounting a breeze. Relaxed design lets you sit fully upright so you can look around, steer and pedal comfortably. 24 gears means tackling varying terrain is an easy-spinning endeavor; subtle chainring guard helps protect clothing from getting caught in drivetrain. Easy-to-use twist shifters let you keep your hands on the bar in a comfortable and secure position while shifting: it takes just a twist of the wrist to change gears. 26 in. wheels and wide tires offer excellent stability. Tektro linear-pull brakes provide excellent speed control and reliable stopping power. Swept-back handlebar and Velo saddle add style and comfort. Novara Jaunt XX also has a kickstand for convenient parking and storing; eyelets accept a rear rack and front and back fenders (not included). Specs on our Novara Jaunt XX women's bike are subject to change.","short_description":"Designed to let you stop and put your feet on the ground without getting off the saddle, our Novara Jaunt XX women's bike offers pure comfort for quick errands or casual rides with friends.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378455.png","image_url":"http://i1.avlws.com/115/l378455.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378455&tt=df","retail_price":"499.00","sale_price":"499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378455\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378455.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857585&amp;link=&amp;tabs=-Details\"></script>","variants":{"8575850001":{"sku":"8575850001","vendor_sku":"US05518","upc":"485758500017","size":"XS/S","color":"BLACK","retail_price":"499.00","sale_price":"499.00"},"8575850002":{"sku":"8575850002","vendor_sku":"US05518","upc":"485758500024","size":"S/M","color":"BLACK","retail_price":"499.00","sale_price":"499.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
