{"sku":"857590","manufacturer_id":"US05522","brand_name":"Novara","product_name":"Novara Gotham Bike - 2014","long_description":"Our Novara Gotham is a revolutionary design for city riding with a Gates(R) carbon belt drive and a NuVinci(R) N360 rear hub. It's a quiet ride, fully outfitted with a rack, fenders and lights. NuVinci N360 continuously variable planetary (CVP) rear hub uses rotating, tilting balls inside the hub to supply smooth, quiet shifts whenever you want, even when stopped. NuVinci CVP design also means there's no indexed \"ker-chunk\" between gears, just a continuous range that lets you find the amount of resistance that best suits your needs. Gates CenterTrack Belt Drive uses a carbon-reinforced belt instead of a chain for a quiet ride-belt doesn't require lubrication, so there's no greasy chain to deal with. Using the twist shifters is intuitively simple and offers super-smooth, seamless movement throughout the gearing range with a flick of the wrist. 6061 butted aluminum frame and fork are lightweight and strong. Tektro Gemini hydraulic disc brakes deliver superior stopping power. Head tube features Novara \"N Dock\" mounting braze-ons to attach a cargo-hauling Barrow basket (please note that the basket is sold separately). Rear rack on the Gotham is ready for cargo, quickly accepting panniers or trunk bag (not included)-great for carrying groceries or work essentials. Lezyne 500-lumen rechargeable headlight brightly leads the way, and a built-in battery-powered rack-mounted tail light aids rear visibility. Upright-riding cockpit is designed for comfort, thanks to the Selle Royal saddle, mustache-style handlebar and ergonomic grips. Puncture-resistant Schwalbe Marathon tires feature sure grip and a fast, smooth ride. Rounding out the package are polished fenders to keep road grime and water off you and the bike; bell on handlebars signals passing; kickstand makes storage/parking easy. Specs on our Novara Gotham bike are subject to change.","short_description":"Our Novara Gotham is a revolutionary design for city riding with a Gates(R) carbon belt drive and a NuVinci(R) N360 rear hub. It's a quiet ride, fully outfitted with a rack, fenders and lights.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378459.png","image_url":"http://i1.avlws.com/115/l378459.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378459&tt=df","retail_price":"1399.00","sale_price":"1399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378459\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378459.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857590&amp;link=&amp;tabs=-Details\"></script>","variants":{"8575900001":{"sku":"8575900001","vendor_sku":"US05522","upc":"485759000011","size":"XS/S","color":"BLACK","retail_price":"1399.00","sale_price":"1399.00"},"8575900002":{"sku":"8575900002","vendor_sku":"US05522","upc":"485759000028","size":"S/M","color":"BLACK","retail_price":"1399.00","sale_price":"1399.00"},"8575900003":{"sku":"8575900003","vendor_sku":"US05522","upc":"485759000035","size":"L/XL","color":"BLACK","retail_price":"1399.00","sale_price":"1399.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
