{"sku":"857610","manufacturer_id":"AG-009871-201","brand_name":"Delorme","product_name":"DeLorme inReach SE 2-Way Satellite Communicator","long_description":"The Delorme inReach SE 2-Way Satellite Communicator keeps you connected anywhere on the globe. It's a personal locator beacon, GPS and text messenger with mobile-device compatibility, all in 1 unit. Iridium satellite network ensures 100% pole-to-pole coverage with no gaps or fringe areas. Freedom plans with contract-free, month-to-month subscriptions from $14.95 per month or annual subscriptions from $11.95 per month. Adjustable tracking intervals from 2 minutes to 4 hours allow you to track your trip and share your location, including GPS coordinates, elevation, speed, and course. View location information on-board (coordinates, course, elevation and speed). Personal locator beacon sends SOS signals with GPS location data to GEOS worldwide emergency response; communicate with GEOS via 2-way text messaging throughout the rescue. Provides audio and visual delivery confirmation on all messages sent to notify you of successful transmission. Send free-form, 160-character texts or predefined messages to phones, email, social media and other inReach units; read incoming messages on the color screen. Wirelessly transform your Apple iOS or Android mobile device into a global navigation tool and satellite communicator when you pair it to inReach with the free Earthmate app. Earthmate app displays your real-time GPS coordinates and route on a digital map; MapShare portal shares your location and movements with friends. Earthmate app also lets you download unlimited topographic and NOAA maps when connected to the internet; access the cached maps even when you're outside of cellular range. LED indicator shows satellite availability; audible message notification helps guarantee you don't miss an incoming message. Waterproof, dustproof and impact-resistant body shrugs off the abuse of harsh environments; the unit can be submerged down to 1m for up to 30 min.","short_description":"The Delorme inReach SE 2-Way Satellite Communicator keeps you connected anywhere on the globe. It's a personal locator beacon, GPS and text messenger with mobile-device compatibility, all in 1 unit.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Plbs And Satellite Messengers","thumb_url":"http://i1.avlws.com/115/s412671.png","image_url":"http://i1.avlws.com/115/l412671.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412671&tt=df","keywords":"beacon,personal locator beacons,locator,plb","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412671\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412671.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857610&amp;link=&amp;tabs=-Details\"></script>","variants":{"8576100001":{"sku":"8576100001","vendor_sku":"AG-009871-201","upc":"019916004149","color":"BLACK","retail_price":"299.95","sale_price":"299.95"}},"categories":["camping-hiking","camp-electronics","plbs-and-satellite-messengers"]}
