{"sku":"857664","manufacturer_id":"10554100001","brand_name":"Burton","product_name":" Burton Malavita EST Snowboard Bindings - 2013/2014","long_description":"If you dream about sliding rails and ripping through berms, the Burton Malavita EST(TM) are made for you. Fully adjustable heelcups and straps let you dial-in the fit for freestyle perfection. The EST platform offers endless stance options and a truer flex from your board; plus, with personalized cushioning options, you'll enjoy ultimate feel and control. 30% short-glass/nylon composite EST baseplates enhance response and power without sacrificing the mobility that freestyle riders demand. Removable AutoCANT SensoryBED(TM) dual-density EVA cushioning lets your boots settle into a natural position; B3 gel cushioning eats up vibration and impact. Canted Living Hinge(TM) Zero Lean highbacks eliminate hardware to reduce weight, and let you adjust forward lean and highback rotation independently of each other. Asym Reactstrap(TM) ankle straps feature a laterally supportive asymmetric shape for powerful drive; they can be reversed if you prefer greater mobility. Gettagrip capstrap toe straps feature a slim, 3D design; rubber material grips boot toes for a secure, locked-down fit. Durable Smooth Glide(TM) buckles deliver buttery-smooth and reliable ratcheting power season after season. 2014 Malavita EST bindings will fit 2011 through 2014 Channel Boards with the included black hardware.","short_description":"If you dream about sliding rails and ripping through berms, the Burton Malavita EST(TM) are made for you. Fully adjustable heelcups and straps let you dial-in the fit for freestyle perfection.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s383039.png","image_url":"http://i1.avlws.com/115/l383039.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383039&tt=df","retail_price":"289.95","sale_price":"202.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383039\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383039.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857664&amp;link=&amp;tabs=-Details\"></script>","variants":{"8576640002":{"sku":"8576640002","vendor_sku":"10554100001","upc":"886888498869","size":"L","color":"BLACK","retail_price":"202.83","sale_price":"202.83"}}}
