{"sku":"857616","manufacturer_id":"B1304002026","brand_name":"K2","product_name":" K2 Cinch CTS Snowboard Bindings - 2013/2014","long_description":"Don't waste your time strapping in. The K2 Cinch CTS snowboard bindings feature effortless entry and exit, and perform with the fine-tuned fit of a strap binding so you can hit the snow and go. Cinch CTS bindings feature canted Harshmellow footbeds for an unimaginably comfortable, supportive and natural ride. Canted footbeds have an inward angle that supports a natural stance, improves control and reduces fatigue. C2 chassis with aluminum heel cups are super lightweight and offer full flex mobility and precise boot-to-binding fit. Tool-free power ramps adjust toe-side response. Cinch Technology: in unison, the highbacks fold back and the ankle straps lift up, allowing the system to open for quick, easy entry and exit without compromising a snug fit. Asym highbacks match your natural stance and provide heel-side response and smooth side-to-side flex; tool-free forward lean adjustment. Caddi ankle straps feature a contoured 3D shape for free-flexing mobility and durable EVA padding for a cushioned fit; tool-free centering adjustment. Cored toe straps are lightweight and provide a super-snug fit over the toes or on top of your boots; easy, tool-free adjustment. HELLA LTVD RADchet ratchets feature large, composite levers for easy operation. Bindings are compatible with Burton The Channel snowboards, disc conversion kit is sold separately.","short_description":"Don't waste your time strapping in. The K2 Cinch CTS snowboard bindings feature effortless entry and exit, and perform with the fine-tuned fit of a strap binding so you can hit the snow and go.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Speed-Entry Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s441371.png","image_url":"http://i1.avlws.com/115/l441371.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441371&tt=df","retail_price":"209.95","sale_price":"125.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441371\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441371.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857616&amp;link=&amp;tabs=-Details\"></script>","variants":{"8576160001":{"sku":"8576160001","vendor_sku":"B1304002026","upc":"886745151180","size":"L","color":"CAMO","retail_price":"125.83","sale_price":"125.83"}},"categories":["snow","snowboard-bindings","speedentry-snowboard-bindings"]}
