{"sku":"857617","manufacturer_id":"B1304007016","brand_name":"K2","product_name":"K2 Company Snowboard Bindings - 2013/2014","long_description":"Featuring new highbacks that cut weight but not performance, the K2 Company snowboard bindings offer all-mountain fun from jibs to jumps to carving up the slopes. Pro-Fection chassis have a streamlined, straightforward design that focuses on simplicity, strength and a rider-to-board connection. Harshmellow Basepads with polycarbonate support frames reduce snow buildup; inward canting improves control and reduces fatigue. Harshmellow padding in the heels and toes absorbs chatter and sucks up sudden impact from flat landings and rough terrain. Company bindings feature tool-free, adjustable power ramps with multi-compatible discs and pop-top disc covers. Highback/heel cup design eliminates gap between boots and highbacks, ensuring a snug union between you and your board. Laid-back forward lean; maximum forward lean is achieved by an increased range of tool-free adjustment. All-new AT highbacks are made of ultra trough yet light nylon for support and flex; tool-free forward lean. Thin Cored Caddi ankle straps feature an ultra lightweight construction to offer performance and comfort without weighing you down. EZ Set toe straps fit over the toes or on top of the boots; top and bottom of strap adjust independently for a custom fit. Ultra RADchet aluminum ratchet levers feature a lightweight, 1-arm design; EZ feed ratchets feature a wider, tapered ladder opening for easy entry. These bindings are compatible with Burton The Channel snowboards, disc conversion kit is sold separately.","short_description":"Featuring new highbacks that cut weight but not performance, the K2 Company snowboard bindings offer all-mountain fun from jibs to jumps to carving up the slopes.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s441379.png","image_url":"http://i1.avlws.com/115/l441379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441379&tt=df","retail_price":"229.95","sale_price":"137.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857617&amp;link=&amp;tabs=-Details\"></script>","variants":{"8576170001":{"sku":"8576170001","vendor_sku":"B1304007016","upc":"886745151371","size":"L","color":"BLACK","retail_price":"137.83","sale_price":"137.83"},"8576170002":{"sku":"8576170002","vendor_sku":"B1304007018","upc":"886745151388","size":"XL","color":"BLACK","retail_price":"137.83","sale_price":"137.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
