{"sku":"857674","manufacturer_id":"10543100441","brand_name":"Burton","product_name":" Burton Escapade Snowboard Bindings - Women's - 2013/2014","long_description":"If you crave big-mountain lines in deep snow, the women's Burton Escapade snowboard bindings are built for you. Cushioned baseplates soften landings and full adjustability lets you dial in the fit. Women-specific True Fit design means that every element of the product is designed and engineered for the way women ride. Single-component, 30% short-glass/nylon composite baseplate material is responsive yet still plenty playful. Re:Flex(TM) baseplates dramatically improve board flex and feel and reduce weight; AutoCANT FullBED baseplate cushioning features B3 Gel and EVA damping under baseplates. Dual-density EVA settles your boot into a natural position regardless of stance width or angles for improved comfort, reduced fatigue, and more direct board control. Zero-Lean Kickback Hammock highbacks feature tool-free forward lean adjustment and provide increased response and reduced vibration while your heels are cradled in suspension. New Double Take buckles feature polished, chrome-plated aluminum and lightweight polycarbonate levers to give you buttery smooth and reliable ratcheting power. Burton Escapade bindings feature new Hammockstrap ankle straps and lightweight Gettagrip capstrap toe straps. Bindings are compatible with traditional 3D(TM), 4x4 bolt patterns and The Channel.","short_description":"If you crave big-mountain lines in deep snow, the women's Burton Escapade snowboard bindings are built for you. Cushioned baseplates soften landings and full adjustability lets you dial in the fit.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s383079.png","image_url":"http://i1.avlws.com/115/l383079.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383079&tt=df","retail_price":"259.95","sale_price":"181.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383079\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383079.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857674&amp;link=&amp;tabs=-Details\"></script>","variants":{"8576740003":{"sku":"8576740003","vendor_sku":"10543100441","upc":"886888498005","size":"M","color":"THE TEAL DEAL","retail_price":"181.83","sale_price":"181.83"},"8576740004":{"sku":"8576740004","vendor_sku":"10543100441","upc":"886888497992","size":"L","color":"THE TEAL DEAL","retail_price":"181.83","sale_price":"181.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
