{"sku":"857663","manufacturer_id":"10555100801","brand_name":"Burton","product_name":" Burton Cartel EST Snowboard Bindings - 2013/2014","long_description":"The Burton Cartel EST bindings work with your Burton The Channel snowboard. With substantial cushioning and a fully adjustable design, they're a great choice for all-mountain explorations. The EST(TM) platform offers endless stance options and a truer flex from your board; plus, with personalized cushioning options, you'll enjoy ultimate feel and control. 30% short-glass/nylon composite EST baseplates enhance response and power without sacrificing the mobility that riders demand; reground materials reduce waste. Removable AutoCANT SensoryBED(TM) dual-density EVA cushioning lets your boots settle into a natural position; B3 gel cushioning eats up vibration and impact. With AutoCANT underfoot you'll enjoy improved comfort, reduced fatigue and smooth, direct board control regardless of stance width or angles. Canted Living Hinge(TM) Zero-Lean highbacks let you adjust forward lean and highback rotation independently of each other. React ankle straps feature a 3D, curved shape and Enduro padding; improved wrap for constant contact with boots. Gettagrip capstrap toe straps feature a slim, 3D design; rubber material grips boot toes for a secure, locked-down fit. Smooth glide levers deliver buttery-smooth and reliable ratching power season after season. 2014 Cartel EST bindings will fit 2011 through 2014 Channel Boards with the included black hardware.","short_description":"The Burton Cartel EST bindings work with your Burton The Channel snowboard. With substantial cushioning and a fully adjustable design, they're a great choice for all-mountain explorations.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s383035.png","image_url":"http://i1.avlws.com/115/l383035.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383035&tt=df","retail_price":"259.95","sale_price":"181.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383035\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383035.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857663&amp;link=&amp;tabs=-Details\"></script>","variants":{"8576630001":{"sku":"8576630001","vendor_sku":"10555100801","upc":"886888499057","size":"M","color":"BLOOD ORANGE","retail_price":"181.83","sale_price":"181.83"},"8576630002":{"sku":"8576630002","vendor_sku":"10555100801","upc":"886888499040","size":"L","color":"BLOOD ORANGE","retail_price":"181.83","sale_price":"181.83"}}}
