{"sku":"857670","manufacturer_id":"10540100651","brand_name":"Burton","product_name":" Burton Citizen Snowboard Bindings - Women's - 2013/2014","long_description":"Soft, cushioned and forgiving, the women's Burton Citizen bindings are a great choice if you're an all-mountain rider looking to progress to the next level. Women-specific True Fit(TM) design brings the whole package together to create the most comfortable connection possible. Single-component, lightweight yet tough, polycarbonate baseplates create moderate flex and consistent response for a versatile ride on all terrain. Full adjustability offers up a perfect fit, while wall-to-wall EVA padding and the added heel hold of the adaptable toe straps create comfort that just won't quit. Single-component, symmetric highbacks are responsive and feature a cored design to save weight; they rotate to follow natural leg contours, optimizing comfort and power. Tool-free, forward-lean adjustment lets you dial in and lock forward lean angle on the fly; highbacks feature Over The Top padding for extra cushioning. Lushly padded ankle straps lock you into the bindings; they're precurved for natural fit and feature telescoping and multilocation adjustability. Toe straps can be worn over the top of your boots or across the toes to lock heels in place; Smooth Glide(TM) buckles are strong and easy to grab for quick closure. Bindings are compatible with traditional 3D(TM), 4x4 bolt patterns and The Channel.","short_description":"Soft, cushioned and forgiving, the women's Burton Citizen bindings are a great choice if you're an all-mountain rider looking to progress to the next level.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s383063.png","image_url":"http://i1.avlws.com/115/l383063.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383063&tt=df","retail_price":"129.95","sale_price":"90.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383063\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383063.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857670&amp;link=&amp;tabs=-Details\"></script>","variants":{"8576700001":{"sku":"8576700001","vendor_sku":"10540100651","upc":"886888497824","size":"M","color":"PINK PIZZAZ","retail_price":"90.83","sale_price":"90.83"},"8576700002":{"sku":"8576700002","vendor_sku":"10540100651","upc":"886888497817","size":"L","color":"PINK PIZZAZ","retail_price":"90.83","sale_price":"90.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
