{"sku":"857625","manufacturer_id":"10542100301","brand_name":"Burton","product_name":"Burton Custom Snowboard Bindings - 2013/2014","long_description":"With years of research and development into them, the fully adjustable, well-cushioned Burton Custom snowboard bindings are all-mountain slayers that will take your performance to the next level. Single-component, lightweight yet tough, polycarbonate baseplates create moderate flex and consistent response for a versatile ride on all terrain. Single-component, symmetric highbacks are responsive; minimized design saves precious weight, and they rotate to follow natural leg contours, optimizing comfort and power. Tool-free, forward-lean micro adjustment lets you dial in and lock forward your lean angle on the fly; forward lean adjusts independently of side-to-side rotation. Highbacks feature Over The Top padding for extra cushioning that won't bite your calves. FullBED cushioning covers the entire baseplate to maximize comfort and minimize fatigue; extendable toe ramps reduce toe drag and increase responsiveness. Primo Capstrap(TM) toe straps lock you into the bindings; lushly padded, precurved ankle straps feature telescoping and multi-location adjustability. Smooth Glide(TM) buckles are strong and easy to grab for quick closure and release. Burton Custom bindings are compatible with traditional 3D(TM), 4x4 bolt patterns and The Channel.","short_description":"With years of research and development into them, the fully adjustable, well-cushioned Burton Custom snowboard bindings are all-mountain slayers that will take your performance to the next level.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s383015.png","image_url":"http://i1.avlws.com/115/l383015.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383015&tt=df","retail_price":"159.95","sale_price":"111.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383015\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383015.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857625&amp;link=&amp;tabs=-Details\"></script>","variants":{"8576250003":{"sku":"8576250003","vendor_sku":"10542100301","upc":"886888497916","size":"M","color":"LIME","retail_price":"111.83","sale_price":"111.83"},"8576250004":{"sku":"8576250004","vendor_sku":"10542100301","upc":"886888497909","size":"L","color":"LIME","retail_price":"111.83","sale_price":"111.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
