{"sku":"857721","manufacturer_id":"22102","brand_name":"Oboz","product_name":"Oboz Bridger BDry Hiking Boots - Women's","long_description":"While the all-leather uppers of the Oboz Bridger BDry hiking boots give a nod to the classic hikers of yore, there's nothing old-fashioned about these comfortable waterproof boots. Waterproof nubuck leather uppers offer the right combination of breathability and protection to keep your feet dry on long treks; soft nubuck doesn't require breaking in. BDry(TM) waterproof, breathable membranes keep soggy elements out while letting water vapor escape, keeping your feet cool and comfortable. Nylon mesh linings wick moisture, dry quickly and further enhance breathability. BFit Deluxe quality footbeds feature a well-defined arch for support and nest perfectly inside the boots. Dual-density EVA midsoles provide cushioning while keeping the boots light and agile. Nylon shanks and thermoplastic urethane forefoot plates offer torsional stability and protection underfoot, increasing surefootedness on varied terrain. Oboz Bridger BDry hiking boots have rubber randing on toes and heels to protect the uppers from abrasion. High-friction, nonmarking rubber outsoles grip with ease in all directions on both wet and dry surfaces thanks to the toothy side lugs and 4mm directional lugs underfoot.","short_description":"While the all-leather uppers of the Oboz Bridger BDry hiking boots give a nod to the classic hikers of yore, there's nothing old-fashioned about these comfortable waterproof boots.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Boots","thumb_url":"http://i1.avlws.com/115/s386831.png","image_url":"http://i1.avlws.com/115/l386831.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=386831&tt=df","retail_price":"160.00","sale_price":"160.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=386831\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m386831.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857721&amp;link=&amp;tabs=-Details\"></script>","variants":{"8577210004":{"sku":"8577210004","vendor_sku":"22102","upc":"848489002548","size":"7.5","color":"RIO RED","retail_price":"160.00","sale_price":"160.00"}},"categories":["footwear","womens-footwear","womens-boots"]}
