{"sku":"857732","manufacturer_id":"AE1062","brand_name":"Advanced Elements","product_name":"Advanced Elements Lotus YSUP Inflatable Stand Up Paddleboard with Paddle - 2013 Special Buy","long_description":"Designed for flatwater and stable enough for practicing yoga, the Advanced Elements Lotus YSUP inflatable stand up paddleboard offers compact storage and high durability-and includes a paddle. High-pressure, drop-stitch construction and heavy-duty PVC tarpaulin allows for performance that will surprise you for an inflatable (this is no pool toy!). The secret to the performance of the Lotus YSUP is the high inflation pressure that's possible with drop-stitching; a pump with gauge is included to achieve optimal pressure. 32 in. width and 6 in. depth offers a very stable platform that's great for SUP beginners and offers enough surface area to practice yoga on the water. Double layer of outer skin enhances durability against rocks, barnacles and the perils of paddling. Large, soft traction pad offers solid grip even when wet; rear D-rings let you tie down gear on long paddles. Removable center fin and 2 removable side fins help with tracking on flatwater. Includes a durable paddle, single-action hand pump with gauge, repair kit, shoulder strap and storage bag. Special buy.","short_description":"Designed for flatwater and stable enough for practicing yoga, the Advanced Elements Lotus YSUP inflatable stand up paddleboard offers compact storage and high durability-and includes a paddle.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430787.png","image_url":"http://i1.avlws.com/115/l430787.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430787&tt=df","retail_price":"1100.00","sale_price":"617.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430787\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430787.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857732&amp;link=&amp;tabs=-Details\"></script>","variants":{"8577320001":{"sku":"8577320001","vendor_sku":"AE1062","upc":"832994001097","color":"WHITE","retail_price":"617.73","sale_price":"617.73"}},"categories":["paddling","paddleboarding","paddleboards"]}
