{"sku":"857717","manufacturer_id":"FB401PK","brand_name":"Fitbit","product_name":" Fitbit Flex Wireless Activity & Sleep Wristband","long_description":"A perfect companion day and night, the Fitbit Flex Wireless Activity & Sleep wristband helps you achieve your fitness goals by tracking movements, activities, your quality of sleep and more. Slim and stylish wristband doesn't scream fitness tracker, but subtly says, \"check out my cool rubber bracelet\"; includes a small and large wristband for the perfect fit. The Flex tracks your steps taken, calories burned, hours slept, distance traveled, minutes active and your quality of sleep. Silent wake alarm gently vibrates to wake you-no more terrifying alarm clock noises! 5 built-in LED indicator lights let you monitor your progress; each light represents meeting 20% of your goal. Water-, sweat-, and rain-resistant design. Not intended for prolonged submersion. Download the iPhone or Android app and sync your real-time stats via Bluetooth(R) to track your progress throughout the day. App also lets you set goals, log food and workouts and monitor your sleep trends. Make fitness social by connecting with friends through the app to share results, compete with each other, or simply share some encouragement. Rechargable lithium-polymer battery lasts 5 - 7 days per charge. The Flex Wireless Activity & Sleep Wristband includes the tracker, small and large wristbands, charging cable and a wireless sync dongle USB device. Compatible with iPhone 4S and newer, iPad 3rd generation and newer, iPod touch 5th generation, Samsung Galaxy S III, Samsung Note II, PCs and Macs.","short_description":"A perfect companion day and night, the Fitbit Flex Wireless Activity & Sleep wristband helps you achieve your fitness goals by tracking movements, activities, your quality of sleep and more.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s427159.png","image_url":"http://i1.avlws.com/115/l427159.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427159&tt=df","keywords":"odometer,walking","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427159\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427159.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857717&amp;link=&amp;tabs=-Details\"></script>","variants":{"8577170001":{"sku":"8577170001","vendor_sku":"FB401BK","upc":"898628002649","color":"BLACK","retail_price":"99.95","sale_price":"99.95"},"8577170002":{"sku":"8577170002","vendor_sku":"FB401SL","upc":"898628002656","color":"SLATE","retail_price":"99.95","sale_price":"99.95"}}}
