{"sku":"857731","manufacturer_id":"FH201-Y","brand_name":"Friday Harbor","product_name":" Friday Harbor Adventure S1 Inflatable Kayak - 2013 Special Buy","long_description":"At under 16 lbs., the Friday Harbor Adventure S1 inflatable kayak is one you can easily pack to your favorite lake, mellow river, bay or estuary. Just inflate with the included pump and hit the water! Durable, heavy-gauge PVC provides superb puncture resistance; 3 chambers of inflation and I-beam floor construction create rigidity to make it a responsive craft. 600-denier polyester decking ensures a long life for the kayak and protects paddlers from drips. Removable tracking fin improves handling. Adjustable high-back seat promotes comfort. Bungee deck lacing stows gear; low-profile handles allow smooth transport to and from the water. Drain hole with plug removes excess water from your kayak; Friday Harbor Adventure kayak features Boston valves. Includes repair kit and foot pump. Special buy.","short_description":"At under 16 lbs., the Friday Harbor Adventure S1 inflatable kayak is one you can easily pack to your favorite lake, mellow river, bay or estuary. Just inflate with the included pump and hit the water!","category":"Paddling","subcategory":"Kayaks","product_group":"Inflatable Kayaks","thumb_url":"http://i1.avlws.com/115/s430543.png","image_url":"http://i1.avlws.com/115/l430543.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430543&tt=df","retail_price":"170.00","sale_price":"126.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430543\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430543.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857731&amp;link=&amp;tabs=-Details\"></script>","variants":{"8577310001":{"sku":"8577310001","vendor_sku":"FH201-Y","upc":"832994001110","color":"YELLOW","retail_price":"126.73","sale_price":"126.73"}}}
