{"sku":"857887","manufacturer_id":"SS019209000","brand_name":"Suunto","product_name":"Suunto Ambit2 S GPS Multifunction Heart Rate Monitor","long_description":"The Suunto Ambit2 S GPS multifunction heart rate monitor is an ideal training instrument for outdoor athletes, providing all the training data you need to take your performance to the next level. Training and sport-specific features help you take your game to the max, whether it's running, cycling, swimming-or all three. Included Suunto ANT wireless heart rate monitor chest strap is comfortable and provides peak training effect, recovery time, real-time heart rate graph and heart rate limits. Full-featured SiRF IV GPS with multiple coordinate systems offers altitude, waypoint creation, navigation and storage along with 1- or 60-second tracking intervals. Accelerometer-integrated GPS offers highly responsive tracking of pace/speed and distance. Preconfigured multisport modes let you compare, analyze and swap exercise logs between sports. Cycling mode tracks bike power and laps, and graphs peak power curve and power distribution. Swimming mode captures time by pool length or lap, along with pace, distance and stroke rate/count/type. Other training features include a chronograph, coutdown timer, manual or automatic laps. 3D compass shows a correct bearing, even if tilted up to 30deg off level. 2-way USB cable lets you charge the battery and transfer data to a computer; you can upload waypoints, logging and analysis to Movescount.com to keep an online data record. Standard watch functions include button lock, dual time, date and alarm; positive/negative display lets you switch from light to dark for optimal visibility or stealth mode. Rechargeable lithium-ion battery with low-battery indicator features enhanced battery life: 30 days with watch functionality and 50 hours with GPS tracking. The Suunto Ambit2 S GPS multifunction heart rate monitor features a built-to-last casing with tough mineral crystal lens that is water resistant to 100m (330 ft.).","short_description":"The Suunto Ambit2 S GPS multifunction heart rate monitor is an ideal training instrument for outdoor athletes, providing all the training data you need to take your performance to the next level.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413467.png","image_url":"http://i1.avlws.com/115/l413467.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413467&tt=df","keywords":"waterproof,odometer","retail_price":"400.00","sale_price":"400.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413467\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413467.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857887&amp;link=&amp;tabs=-Details\"></script>","variants":{"8578870002":{"sku":"8578870002","vendor_sku":"SS019209000","upc":"045235908561","color":"RED","retail_price":"400.00","sale_price":"400.00"},"8578870003":{"sku":"8578870003","vendor_sku":"SS020133000","upc":"045235909049","color":"LIME","retail_price":"400.00","sale_price":"400.00"},"8578870004":{"sku":"8578870004","vendor_sku":"SS020552000","upc":"045235909391","color":"WHITE","retail_price":"400.00","sale_price":"400.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
