{"sku":"857813","manufacturer_id":"10200-4","brand_name":"Saucony","product_name":"Saucony Ride 6 Road-Running Shoes - Women's","long_description":"WIth highly breathable uppers and cushioned midsoles, the Saucony Ride 6 women's road-running shoes serve up plenty of comfort to neutral runners. Nylon linings and plush collars breathe well, wick moisture and dry quickly to keep your feet cool and comfortable. Breathable insoles are constructed from open-cell foam to provide plenty of cushioning underfoot; antimicrobial treatment deters odors. Responsive, dual-density EVA midsoles maintain rebound over the miles; strobel board construction increases cushioning and comfort. Thermoplastic urethane shanks control torsional flex at midfoot for light arch support. Special impact zones cushion heel and forefoot impact, and reduce shock while setting foot for a smooth transition. 8mm heel-to-toe drop encourages a short, low-impact stride. Outsoles on the Saucony Ride 6 shoes use blown rubber under forefeet for cushioning and flex; carbon rubber at heels deliver traction and durability.","short_description":"WIth highly breathable uppers and cushioned midsoles, the Saucony Ride 6 women's road-running shoes serve up plenty of comfort to neutral runners.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s387655.png","image_url":"http://i1.avlws.com/115/l387655.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=387655&tt=df","retail_price":"110.00","sale_price":"74.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=387655\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m387655.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857813&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","womens-footwear","womens-shoes"]}
