{"sku":"857856","manufacturer_id":"SS019561000","brand_name":"Suunto","product_name":"Suunto Ambit2 GPS Multifunction Watch","long_description":"The Suunto Ambit2 GPS multifunction watch offers outdoor explorers and athletes useful features for outdoor fun, including navigation, weather, speed, pace, distance, altitude and training data. Full-featured SiRF IV GPS with multiple coordinate systems offers waypoint creation, navigation and storage along with 1- or 60-sec. tracking intervals. Accelerometer-integrated GPS offers highly responsive tracking of pace/speed and distance. Preconfigured multisport modes let you compare, analyze and swap exercise logs between sports. Cycling mode tracks bike power and laps, and graphs peak power curve and power distribution. Swimming mode captures time by pool length or lap, along with pace, distance and stroke rate/count/type. Other training features include a chronograph, countdown timer, manual or automatic laps; watch is also compatible with optional Suunto heart rate sensor (not included). 3D compass shows a correct bearing, even if tilted up to 30deg off level; GPS-corrected barometric altimeter tracks your ascent and descent. Barometric sensor helps you predict changes in the weather; thermometer tells the current temperature. Available in Movescount.com's Suunto App Zone, Suunto apps add features such as storm alarm, sunrise/sunset and tide information to help you keep tabs on your surroundings. 2-way USB cable lets you charge the battery and transfer data to a computer; you can upload waypoints, logging and analysis to Movescount.com to keep an online data record. Standard watch functions include button lock, dual time, date and alarm; positive/negative display lets you switch from light to dark for optimal visibility or stealth mode. Rechargeable lithium ion battery with low-battery indicator features enhanced battery life: 30 days with watch functionality and 50 hours with GPS tracking.","short_description":"The Suunto Ambit2 GPS multifunction watch offers outdoor explorers and athletes useful features for outdoor fun, including navigation, weather, speed, pace, distance, altitude and training data.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413463.png","image_url":"http://i1.avlws.com/115/l413463.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413463&tt=df","keywords":"waterproof,odometer","retail_price":"500.00","sale_price":"500.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413463\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413463.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857856&amp;link=&amp;tabs=-Details\"></script>","variants":{"8578560001":{"sku":"8578560001","vendor_sku":"SS019561000","upc":"045235908905","color":"BLACK","retail_price":"500.00","sale_price":"500.00"},"8578560002":{"sku":"8578560002","vendor_sku":"SS019650000","upc":"045235908929","color":"SILVER","retail_price":"500.00","sale_price":"500.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
