{"sku":"857817","manufacturer_id":"R130300201120","brand_name":"Ride","product_name":"Ride Insano Boa Focus Snowboard Boots - 2013/2014","long_description":"If you're known for taking insane lines, you need ready-for-anything boots. The Ride Insano Boa(R) Focus snowboard boots offer proven performance for hard-chargers needing response and comfort. Intuition(TM) Dream liners, with a supportive skeletal structure surrounded by multi-density foam, provide maximum rebound and dreamy performance. Liners securely wrap feet and include internal and external, heel-locking J-bars with cored ankle pockets; 3D-formed, dual-density EVA footbeds provide anatomic support. Impacto multi-density insoles add structural support in the heels for cush landings and all-day comfort. Lock Down speed laces tighten liners quickly and easily for a supportive, nonslip fit; Tallboy Harness wraps insteps and ankles for supportive flex and responsive fit. Boa(R) Focus lacing system personalizes the fit by allowing the upper and lower zones to tighten independently of each other. Boa Focus concentrates closure on the instep and allows superior heel hold no matter how loose or snug the upper zone is cranked. Centered over the forefeet, the Closer Lace Guides drive power down low and even out the lace tension throughout the entire boot; molded 3D tongues add support and comfort. Insano Boa Focus boots are built with Blown Light Apex outsoles;100% phylon gives a barefoot feel, gel pods in heels cushion landings and ice pick inserts grip snow and ice.","short_description":"If you're known for taking insane lines, you need ready-for-anything boots. The Ride Insano Boa(R) Focus snowboard boots offer proven performance for hard-chargers needing response and comfort.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s441383.png","image_url":"http://i1.avlws.com/115/l441383.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441383&tt=df","retail_price":"339.95","sale_price":"235.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441383\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441383.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857817&amp;link=&amp;tabs=-Details\"></script>","variants":{"8578170002":{"sku":"8578170002","vendor_sku":"R130300201090","upc":"886745177920","size":"9","color":"BLACK","retail_price":"235.83","sale_price":"235.83"},"8578170003":{"sku":"8578170003","vendor_sku":"R130300201095","upc":"886745177937","size":"9.5","color":"BLACK","retail_price":"235.83","sale_price":"235.83"}},"categories":["snow","snowboard-boots","mens-snowboard-boots"]}
