{"sku":"857855","manufacturer_id":"SS019651000","brand_name":"Suunto","product_name":"Suunto Ambit2 GPS Multifunction Heart Rate Monitor","long_description":"Explorers and athletes rejoice! The Suunto Ambit2 GPS multifunction heart rate monitor offers all kinds of useful features: navigation, weather, speed, heart rate, altitude and training data. Included Suunto ANT wireless heart rate monitor chest strap is comfortable and provides peak training effect, recovery time, real-time heart rate graph and heart rate limits. Full-featured SiRF IV GPS with multiple coordinate systems offers waypoint creation, navigation and storage along with 1- or 60-second tracking intervals. Accelerometer-integrated GPS offers highly responsive tracking of pace/speed and distance. Preconfigured multisport modes let you compare, analyze and swap exercise logs between sports. Cycling mode tracks bike power and laps, and graphs peak power curve and power distribution. Swimming mode captures time by pool length or lap, along with pace, distance and stroke rate/count/type. Other training features include a chronograph, countdown timer, manual or automatic laps. 3D compass shows a correct bearing, even if tilted up to 30deg off level; GPS-corrected barometric altimeter tracks your ascent and descent. Barometric sensor helps you predict changes in the weather; thermometer keeps you apprised of the current temperature. Available in Movescount.com's Suunto App Zone, Suunto apps add features such as storm alarm, sunrise/sunset and tide information to help you keep tabs on your surroundings. 2-way USB cable lets you charge the battery and transfer data to a computer; you can upload waypoints, logging and analysis to Movescount.com to keep an online data record. Standard watch functions include button lock, dual time, date and alarm; positive/negative display lets you switch from light to dark for optimal visibility or stealth mode.","short_description":"Explorers and athletes rejoice! The Suunto Ambit2 GPS multifunction heart rate monitor offers all kinds of useful features: navigation, weather, speed, heart rate, altitude and training data.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413459.png","image_url":"http://i1.avlws.com/115/l413459.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413459&tt=df","keywords":"odometer,waterproof","retail_price":"550.00","sale_price":"550.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413459\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413459.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857855&amp;link=&amp;tabs=-Details\"></script>","variants":{"8578550001":{"sku":"8578550001","vendor_sku":"SS019562000","upc":"045235908912","color":"BLACK","retail_price":"550.00","sale_price":"550.00"},"8578550002":{"sku":"8578550002","vendor_sku":"SS019651000","upc":"045235908936","color":"SILVER","retail_price":"550.00","sale_price":"550.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
