{"sku":"857976","manufacturer_id":"B130201901152","brand_name":"K2","product_name":" K2 Eco Lite Snowboard - Women's - 2013/2014","long_description":"Loaded with Harshmellow tech for easy turns and vibration damping, the K2 Eco Lite snowboard delivers a fast and free feel for your maximum pleasure all over the mountain. Harshmellow technology employs a thin layer of synthetic polymer to damp the vibrations experienced while riding at high speeds. All-Terrain rocker is designed for use all over the mountain; it allows effortless turning on hardpack but also provides ample float in softer snow and crud. Tweekend baseline profile features a flat base between the feet and a rockered tip for a great feel when sliding rails, landing jumps and carving powder. Directional twin shape provides plenty of overall float and control, offering a balanced ride that's equally versatile ridden regular or switch. Hyper Progressive sidecut mellows out the transitions, leaving you with a predictable, all-around board; make ultrafine adjustments at any speed and in all conditions. Hybrilight construction minimizes the overall amount of materials used to unleash lightweight precision, powerful response and buttery-smooth performance. WH3 wood core features two strips of Honeykomb material between the bindings and rails for a fine-tuned response. Directional fiberglass laminates add torsional stiffness for improved edge hold and increased stability in off-axis landings. Carbon webs near binding area maximize ollie pop and control in all situations. Sintered base has the highest molecular weight available for fast and durable rides; plus, it retains wax longer for consistent performance. .","short_description":"Loaded with Harshmellow tech for easy turns and vibration damping, the K2 Eco Lite snowboard delivers a fast and free feel for your maximum pleasure all over the mountain.","category":"Snowboarding","subcategory":"Snowboards","product_group":"All-Mountain Snowboards","thumb_url":"http://i1.avlws.com/115/s441335.png","image_url":"http://i1.avlws.com/115/l441335.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441335&tt=df","retail_price":"479.95","sale_price":"287.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441335\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441335.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857976&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579760001":{"sku":"8579760001","vendor_sku":"B130201901148","upc":"886745174424","size":"148 CM","retail_price":"287.83","sale_price":"287.83"}}}
