{"sku":"857951","manufacturer_id":"VN-0NFNY61","brand_name":"Vans","product_name":" Vans Encore Snowboard Boots - Women's - 2013/2014","long_description":"Time-tested and rider approved, the Vans Encore women's snowboard boots feature easy-to-use Boa(R) lacing and cushioned liners to give your feet a dialed-in fit that lasts from first run to last. Boa Coiler lacing system, with ankle and cable guides along entire edge of eyestays, distributes closure force evenly for a dialed-in fit that won't loosen up. Boa lacing offers on-the-fly adjustment and never comes untied; you get consistent closure without pressure points. TriFit-X thermal liners feature asymmetric X-Cage inserts that lock your heels in place; low-volume soles help you feel connected to the board. Fleece-lined upper cuffs offer warmth; flexible toe boxes help the boots feel more like shoes when you're walking or hiking. Cuffs flex easily for enhanced board control when carving; wrap-around design offers a secure closure around your ankles and calves. Instep articulation offers a forgiving forward flex that maintains support. Dual-density EVA footbeds feature integrated arch support and dual-density metatarsal and heel impact-relief pads. Cushioned rubber outsoles feature an inverted waffle tread patten design for increased traction.","short_description":"Time-tested and rider approved, the Vans Encore women's snowboard boots feature easy-to-use Boa(R) lacing and cushioned liners to give your feet a dialed-in fit that lasts from first run to last.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Women's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s457387.png","image_url":"http://i1.avlws.com/115/l457387.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457387&tt=df","retail_price":"199.95","sale_price":"118.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457387\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457387.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857951&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboard-boots","womens-snowboard-boots"]}
