{"sku":"857905","manufacturer_id":"R130201501161","brand_name":"Ride","product_name":" Ride Machete Snowboard - 2013/2014","long_description":"With built-in pop, the Ride Machete snowboard ensures you'll have nothing but fun in the park and pipe. Its rockered profile gives you a smooth, surfy, lively ride. LowRize(TM) rocker lifts the contact points out of the snow just enough to give you the ultimate hook-free, smooth ride without sacrificing pop. Twin shape places you in a centered stance for a balanced ride whether riding regular or switch. Pop Rods(R) 2.0 wood core features carbon rods in the tip and tail, creating potent pop without adding stiffness; ideal for all freestyle maneuvers. Carbon Array 3(TM) stringers in the binding zone channel your power to the board for maximum control, regardless of your stance location. Lightweight and forgiving, the top and base are wrapped in a web of stitched biaxial glass, which increases torsional stiffness and snap. Durable, skate-inspired Slimewalls(R) sidewalls absorb impact and smooth the interaction between the board and riding surface; plus, as a bonus, they glow in the dark. Edges contain nearly 50% more steel than standard snowboard edges, resulting in unmatched resistance to edge cracking; edges can be \"detuned\" to enlarge board's turning radii. Ride Machete snowboard features a Fusion 4000 sintered base that is durable, hard and, best of all, fast. .","short_description":"With built-in pop, the Ride Machete snowboard ensures you'll have nothing but fun in the park and pipe. Its rockered profile gives you a smooth, surfy, lively ride.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Freestyle Snowboards","thumb_url":"http://i1.avlws.com/115/s342539.png","image_url":"http://i1.avlws.com/115/l342539.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=342539&tt=df","retail_price":"459.95","sale_price":"275.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=342539\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m342539.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857905&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579050003":{"sku":"8579050003","vendor_sku":"R130201401160","upc":"886745171140","size":"160 CM","retail_price":"275.83","sale_price":"275.83"},"8579050004":{"sku":"8579050004","vendor_sku":"R130201501161","upc":"886745171201","size":"161 CM Wide","retail_price":"275.83","sale_price":"275.83"}}}
