{"sku":"857971","manufacturer_id":"B130201301156","brand_name":"K2","product_name":" K2 Slayblade Snowboard - 2013/2014","long_description":"An all-terrain destroyer, the K2 Slayblade snowboard is built stiff for crud-busting days, but features a rockered tip for amazing float in pow and catch-free performance in the park. All-new Lifted Baseline(TM) offers effortless pop and stability; this board is flat between your feet and is lifted at the tip and tail for camberlike performance. Tweekend profile features a rockered tip for a great feel when sliding rails, landing jumps and carving powder. Evenly weighted contact points give you the straight tracking, effortless precision of a flat board. Hyper Progressive sidecut mellows out the transitions, leaving you with a predictable, all-around board; you can make ultrafine adjustments at any speed and in all conditions. Directional twin shape provides plenty of overall float and control, offering a balanced ride that's equally versatile ridden regular or switch. Hybritech construction minimizes the overall amount of materials used to unleash lightweight precision, powerful response and buttery-smooth performance. WH4 wood core, with generous Honeykomb material between the bindings and rails, provides a fine-tuned response; it's engineered to maintain durability with minimal weight. Bamboo is blended into the core for increased strength and added durability; carbon webs near binding area help you maximize control. A pre-loaded, camber-shaped Ollie Bar is placed in the center backbone section between the bindings to enhance ollie pop and pressing power. Fiberglass laminated in directional layers adds torsional stiffness, improving edge hold and increasing stability during off-axis landings. Sintered Base is an ultrathin, super-conductive base; lightweight with lower material usage, it's the highest quality sintered base offered by K2. .","short_description":"An all-terrain destroyer, the K2 Slayblade snowboard is built stiff for crud-busting days, but features a rockered tip for amazing float in pow and catch-free performance in the park.","category":"Snowboarding","subcategory":"Snowboards","product_group":"All-Mountain Snowboards","thumb_url":"http://i1.avlws.com/115/s441327.png","image_url":"http://i1.avlws.com/115/l441327.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441327&tt=df","retail_price":"559.95","sale_price":"335.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441327\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441327.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857971&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579710002":{"sku":"8579710002","vendor_sku":"B130201301158","upc":"886745173960","size":"158 CM","retail_price":"335.83","sale_price":"335.83"},"8579710003":{"sku":"8579710003","vendor_sku":"B130201301161","upc":"886745173984","size":"161 CM","retail_price":"335.83","sale_price":"335.83"}}}
