{"sku":"857974","manufacturer_id":"B130200601158","brand_name":"K2","product_name":"K2 Ultrasplit Splitboard - 2013/2014","long_description":"With a shape geared toward backcountry riding, the K2 Ultrasplit splitboard snowboard is built to ride what you crave: deep, light and fluffy pow. Tweekend baseline profile features a flat base between your feet and a rockered tip and tail for effortless float in the pow. BC shaping features a longer tip blend zone for more control; compact sidecut locks a turn at any speed; longer tail blend and shorter tail give you control in tight trees. Directional twin shape provides plenty of overall float and control, offering a balanced ride that's equally versatile ridden regular or switch. Bamboo is blended into the core for increased strength and added durability; carbon webs near binding area maximize ollie pop and control. Fiberglass laminated in directional layers adds torsional stiffness, improving edge hold and increasing stability during off-axis landings. ICG 20 support integrates carbon into the fiberglass, reducing overall weight and creating a supersmooth release of power. Sintered Base is an ultrathin, super-conductive base; lightweight with lower material usage, it's the highest quality sintered base offered by K2. K2 Ultrasplit features the all-new K2 Split Track, which lets you use the all-new K2 Kwicker system (sold separately), based on the Clicker system from years ago. Also works with standard bindings or splitboard bindings; requires the Voile Universal Splitboard Binding Interface to mount bindings, sold separately. Skins sold separately. .","short_description":"With a shape geared toward backcountry riding, the K2 Ultrasplit splitboard snowboard is built to ride what you crave: deep, light and fluffy pow.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Splitboards","thumb_url":"http://i1.avlws.com/115/s325939.png","image_url":"http://i1.avlws.com/115/l325939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=325939&tt=df","retail_price":"699.95","sale_price":"699.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=325939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m325939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857974&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579740001":{"sku":"8579740001","vendor_sku":"B130200601158","upc":"886745173403","size":"158 CM","retail_price":"699.95","sale_price":"699.95"},"8579740002":{"sku":"8579740002","vendor_sku":"B130200601161","upc":"886745173540","size":"161 CM","retail_price":"699.95","sale_price":"699.95"}},"categories":["snow","snowboards","splitboards"]}
