{"sku":"857904","manufacturer_id":"R130200101161","brand_name":"Ride","product_name":" Ride Highlife UL Snowboard - 2013/2014","long_description":"Ultralight, responsive and most importantly, fun, the Ride Highlife UL snowboard is an all-mountain slayer that will have you making effortless powder turns, lap after lap. Hybrid All Mountain shape features a rocker in the nose and micro-camber zone that extends under your feet and through the tail for extra pop. Directional twin shape provides plenty of overall float and control, offering a balanced ride that's equally versatile ridden regular or switch. UL wood core features Pop Rods(R) carbon rods in the tip and tail, creating potent pop without adding stiffness; it's ideal for all freestyle maneuvers. Carbon fibers stitched into the fiberglass also lend extra pop without adding extra stiffness. Silencer 5(TM) technology quiets noisy vibrations for a super-smooth ride; Carbon Array 5(TM) stringers in the binding zone channel your power to the board for control. Urethane-infused Membrain(TM) topsheet offers high-quality textures and aesthetics at less than half the weight of traditional plastic topsheets. Skate-inspired Popwalls(R) sidewalls offer amazing stability and enhanced response whether riding groomers, pow or the park. Ride Highlife UL snowboard features a UL (ultralight) core built for high strength without bulk, and a UL sintered base for extremely lightweight performance and precision. .","short_description":"Ultralight, responsive and most importantly, fun, the Ride Highlife UL snowboard is an all-mountain slayer that will have you making effortless powder turns, lap after lap.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Freeride Snowboards","thumb_url":"http://i1.avlws.com/115/s343299.png","image_url":"http://i1.avlws.com/115/l343299.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=343299&tt=df","retail_price":"569.95","sale_price":"341.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=343299\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m343299.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857904&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579040001":{"sku":"8579040001","vendor_sku":"R130200101158","upc":"886745169963","size":"158 CM","retail_price":"341.83","sale_price":"341.83"},"8579040002":{"sku":"8579040002","vendor_sku":"R130200201159","upc":"886745170044","size":"159 CM Wide","retail_price":"341.83","sale_price":"341.83"},"8579040003":{"sku":"8579040003","vendor_sku":"R130200101161","upc":"886745169987","size":"161 CM","retail_price":"341.83","sale_price":"341.83"}}}
