{"sku":"857975","manufacturer_id":"B130200101168","brand_name":"K2","product_name":" K2 Panoramic Splitboard Package - 2013/2014","long_description":"Get out and explore the backcountry with the K2 Panoramic splitboard and kit. The kit includes splitboard hardware and pre-cut skins-just add your bindings and you'll be ready to skin. All-Terrain rocker is designed for use all over the mountain; it allows effortless turning on hardpack but also provides ample float in softer snow and crud. Tweekend baseline profile features a flat base between the feet and a rockered tip for a great feel when sliding rails, landing jumps and carving powder. Set-back stance, a medium rise through the tip, and a lower rise in the tail define the Panoramic splitboard as a multipurpose freerider. Hyper Progressive sidecut mellows out the transitions, leaving you with a predictable, all-around board; make ultrafine adjustments at any speed and in all conditions. Hybrilight construction minimizes the overall amount of materials used to unleash lightweight precision, powerful response and buttery-smooth performance. Bamboo is blended into the core for increased strength and added durability. Carbon webs near binding area maximize ollie pop and control in all situations. ICG 20 base integrates carbon into the fiberglass, reducing overall weight and creating a supersmooth release of power. Fiberglass laminated in directional layers adds torsional stiffness, improving edge hold and increasing stability during off-axis landings. 4000 Sintered base has the highest molecular weight available for fast and durable rides; plus, it retains wax longer for a consistent performance. Includes Voile splitboard connecting hardware and slip-disc multiple adjustment binding system; lightweight K2 climbing skins offer a secure hold and are quick in transition. .","short_description":"Get out and explore the backcountry with the K2 Panoramic splitboard and kit. The kit includes splitboard hardware and pre-cut skins-just add your bindings and you'll be ready to skin.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Splitboards","thumb_url":"http://i1.avlws.com/115/s342583.png","image_url":"http://i1.avlws.com/115/l342583.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=342583&tt=df","retail_price":"899.95","sale_price":"899.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=342583\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m342583.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857975&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579750002":{"sku":"8579750002","vendor_sku":"B130200101158","upc":"886745173243","size":"158 CM","retail_price":"899.95","sale_price":"899.95"},"8579750003":{"sku":"8579750003","vendor_sku":"B130200101162","upc":"886745173267","size":"162 CM","retail_price":"899.95","sale_price":"899.95"},"8579750004":{"sku":"8579750004","vendor_sku":"B130200101168","upc":"886745173281","size":"168 CM","retail_price":"899.95","sale_price":"899.95"}},"categories":["snow","snowboards","splitboards"]}
