{"sku":"857954","manufacturer_id":"VN-0QJK82S","brand_name":"Vans","product_name":" Vans Encore Snowboard Boots - Boys'","long_description":"Vans Encore Snowboard boots for boys give your little shredder the same comfort and proven performance you've come to love from your own Encore boots. Boa(R) lacing system distributes closure force evenly for a glovelike fit; they never come untied and can be adjusted on-the-fly. TriFit thermal liners feature pads that hold in his heels and wrap feet in padded comfort thanks to their open-cell foam construction; foam helps keep little feet warm. \"Grow With You\" footbed shims give kids more room as they grow: simply remove shins as his feet grow. Cuffs flex easily for enhanced board control when carving; wrap-around design offers a secure closure around your ankles and calves. Full instep articulation allows the upper and lower zones of the boots to flex independently, creating a fluid forward motion and minimizing shell distortion. Outsoles with compression-molded EVA midsoles offer a multi-flex lug pattern for great traction when off the snowboard.","short_description":"Vans Encore Snowboard boots for boys give your little shredder the same comfort and proven performance you've come to love from your own Encore boots.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Kids' Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s343283.png","image_url":"http://i1.avlws.com/115/l343283.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=343283&tt=df","keywords":"jstp7615","retail_price":"119.95","sale_price":"70.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=343283\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m343283.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857954&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
