{"sku":"857928","manufacturer_id":"R130202301154","brand_name":"Ride","product_name":" Ride Baretta Snowboard - Women's - 2013/2014","long_description":"The women's Ride Baretta snowboard, featuring a Hybrid All Mountain shape, has rocker in the nose and micro-camber that extends from the front foot to the tail for amazing all-mountain performance. Directional twin shape is a great choice for all-mountain riding; Hybrid All Mountain shape offers tons of float, but also locks in edges when turning. Lightweight Aspen core incorporates bamboo to provide a perfect balance between strength and weight. Carbon Array 3(R) stringers in the binding zone channel your power to the board for maximum control, regardless of your stance location. Fiberglass on top and on the bottom of the core combine to provide a complete web of protection and flex. Durable, skate-inspired Slimewalls(R) sidewalls absorb impact and smooth the interaction between the board and riding surface. Edges contain nearly 50% more steel than standard snowboard edges, resulting in unmatched resistance to edge cracking; edges can be \"detuned\" to enlarge board's turning radii. Ride Baretta snowboard features an extruded base that is durable, hard and, best of all, fast. .","short_description":"The women's Ride Baretta snowboard, featuring a Hybrid All Mountain shape, has rocker in the nose and micro-camber that extends from the front foot to the tail for amazing all-mountain performance.","category":"Snowboarding","subcategory":"Snowboards","product_group":"All-Mountain Snowboards","thumb_url":"http://i1.avlws.com/115/s441323.png","image_url":"http://i1.avlws.com/115/l441323.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441323&tt=df","retail_price":"399.95","sale_price":"239.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441323\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441323.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857928&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579280002":{"sku":"8579280002","vendor_sku":"R130202301151","upc":"886745171829","size":"151 CM","retail_price":"239.83","sale_price":"239.83"},"8579280003":{"sku":"8579280003","vendor_sku":"R130202301154","upc":"886745171843","size":"154 CM","retail_price":"239.83","sale_price":"239.83"}}}
