{"sku":"857977","manufacturer_id":"B130202101150","brand_name":"K2","product_name":" K2 Spot Lite Snowboard - Women's - 2013/2014","long_description":"All-mountain K2 Spot Lite women's snowboard has the Precision Lifted Baseline profile for amazing edge control on hard snow, and a tip and tail with increased surface area for amazing float on pow. All-new Precision Lifted Baseline offers effortless pop and stability; this board is flat between your feet and is lifted at the tip and tail for camberlike performance. Tweekend profile features a rockered tip and tail for a great feel when sliding rails, landing jumps and carving powder. Hybritech construction minimizes the overall amount of materials used to unleash lightweight precision, powerful response and buttery-smooth performance. Twin Hyper Progressive sidecut mellows out the transitions, leaving you with a predictable, all-around board. Rhythm W2 wood core features three types of renewable wood assembled to optimize strength, reduce weight and enhance damping without adding other materials. Integrated carbon and fibergrass support reduces the overall weight of the board while creating a supersmooth ride with increased pop and liveliness. Sintered base is exceptionally durable; it absorbs wax deep into the structure and retains it for continued on-snow performance. .","short_description":"All-mountain K2 Spot Lite women's snowboard has the Precision Lifted Baseline profile for amazing edge control on hard snow, and a tip and tail with increased surface area for amazing float on pow.","category":"Snowboarding","subcategory":"Snowboards","product_group":"All-Mountain Snowboards","thumb_url":"http://i1.avlws.com/115/s441339.png","image_url":"http://i1.avlws.com/115/l441339.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441339&tt=df","retail_price":"479.95","sale_price":"287.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441339\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441339.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857977&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579770001":{"sku":"8579770001","vendor_sku":"B130202101147","upc":"886745174608","size":"147 CM","retail_price":"287.83","sale_price":"287.83"},"8579770002":{"sku":"8579770002","vendor_sku":"B130202101150","upc":"886745174622","size":"150 CM","retail_price":"287.83","sale_price":"287.83"}},"categories":["snow","snowboards","allmountain-snowboards"]}
