{"sku":"857918","manufacturer_id":"SS019210000","brand_name":"Suunto","product_name":"Suunto Ambit2 S GPS Multifunction Watch","long_description":"Perfect for outdoor athletes, the Suunto Ambit2 S GPS multifunction watch provides the key training data you need (speed, distance, bike power, swim stroke) to take your performance to the next level. Training and sport-specific features help you take your game to the max, whether it's running, cycling, swimming-or all three. Full-featured SiRF IV GPS with multiple coordinate systems offers altitude, waypoint creation, navigation and storage along with 1- or 60-second tracking intervals. Accelerometer-integrated GPS offers highly responsive tracking of pace/speed and distance. Preconfigured multisport modes let you compare, analyze and swap exercise logs between sports. Cycling mode tracks bike power and laps, and graphs peak power curve and power distribution. Swimming mode captures time by pool length or lap, along with pace, distance and stroke rate/count/type. Other training features include a chronograph, countdown timer, manual or automatic laps; watch is also compatible with optional Suunto heart rate sensor (not included). 3D compass shows a correct bearing, even if tilted up to 30deg off level. 2-way USB cable lets you charge the battery and transfer data to a computer; you can upload waypoints, logging and analysis to Movescount.com to keep an online data record. Standard watch functions include button lock, dual time, date and alarm; positive/negative display lets you switch from light to dark for optimal visibility or stealth mode. Rechargeable lithium ion battery with low-battery indicator features enhanced battery life: 30 days with watch functionality and 50 hours with GPS tracking. The Suunto Ambit2 S GPS multifunction watch features a built-to-last casing with tough mineral crystal lens that is water resistant to 100m (330 ft.).","short_description":"Perfect for outdoor athletes, the Suunto Ambit2 S GPS multifunction watch provides the key training data you need (speed, distance, bike power, swim stroke) to take your performance to the next level.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413471.png","image_url":"http://i1.avlws.com/115/l413471.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413471&tt=df","keywords":"waterproof,odometer","retail_price":"350.00","sale_price":"350.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413471\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413471.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857918&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579180001":{"sku":"8579180001","vendor_sku":"SS019210000","upc":"045235908578","color":"GRAPHITE","retail_price":"350.00","sale_price":"350.00"},"8579180002":{"sku":"8579180002","vendor_sku":"SS019211000","upc":"045235908585","color":"RED","retail_price":"350.00","sale_price":"350.00"},"8579180003":{"sku":"8579180003","vendor_sku":"SS020134000","upc":"045235909056","color":"LIME","retail_price":"350.00","sale_price":"350.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
