{"sku":"857972","manufacturer_id":"B130201001155","brand_name":"K2","product_name":" K2 Ultra Dream Snowboard - 2013/2014","long_description":"With a shape geared toward backcountry riding, the K2 Ultra Dream snowboard is built to ride what you crave: deep, light and fluffy pow. Tweekend baseline profile features a flat base between your feet and a rockered tip and tail for effortless float in the pow. BC shaping features a longer tip blend zone for more control; compact sidecut locks a turn at any speed; longer tail blend and shorter tail give you control in tight trees. Directional twin shape provides plenty of overall float and control, offering a balanced ride that's equally versatile ridden regular or switch. WH4 wood core, with generous Honeykomb material between the bindings and rails, provides a fine-tuned response; it's engineered to maintain durability with minimal weight. Bamboo is blended into the core for increased strength and added durability; carbon webs near binding area maximize ollie pop and control. Fiberglass laminated in directional layers adds torsional stiffness, improving edge hold and increasing stability during off-axis landings. ICG 20 support integrates carbon into the fiberglass, reducing overall weight and creating a super-smooth release of power. Sintered Base is an ultrathin, super-conductive base; lightweight with lower material usage, it's the highest quality sintered base offered by K2. .","short_description":"With a shape geared toward backcountry riding, the K2 Ultra Dream snowboard is built to ride what you crave: deep, light and fluffy pow.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Powder Snowboards","thumb_url":"http://i1.avlws.com/115/s441359.png","image_url":"http://i1.avlws.com/115/l441359.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=441359&tt=df","retail_price":"549.95","sale_price":"329.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=441359\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m441359.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=857972&amp;link=&amp;tabs=-Details\"></script>","variants":{"8579720002":{"sku":"8579720002","vendor_sku":"B130201001158","upc":"886745173724","size":"158 CM","retail_price":"329.83","sale_price":"329.83"}},"categories":["snow","snowboards","powder-snowboards"]}
