{"sku":"858131","manufacturer_id":"79997-0001","brand_name":"Levi's","product_name":" Levi's Commuter Series Hooded Trucker Jacket - Men's","long_description":"The Commuter Series Hooded Trucker jacket blends right in with the urban environment of an everyday bike commute. It includes lots of ride friendly features to keep you comfortable on the ride. Stretch denim fabric comfortably moves with you as you go about your day, whether you're riding or hanging out at your favorite spot. Water-resistant and dirt-repellent Schoeller NanoSphere(R) protective finish helps fend off light rain, mud and road grit. Thin, roll-away hood with brim resists moisture and fits smoothly under a helmet to retain heat during chilly rides. Odor-resistant finish helps keep funky odors from developing. Taking cues from bike jerseys, there are 2 rear pockets across lower back of jacket; top flaps help keep contents secure. Additional pockets include 2 hand pockets and 2 button-flap chest pockets to keep essentials handy; left-side chest pocket has an earphone port for your media player. Tail and sleeves of jacket are extended to offer good coverage when you're riding. Back vent encourages airflow so you won't overheat. Levi's Commuter Series Hooded Trucker jacket has a regular fit and a hem that hits just below the hip; 27.25 in. back length.","short_description":"The Commuter Series Hooded Trucker jacket blends right in with the urban environment of an everyday bike commute. It includes lots of ride friendly features to keep you comfortable on the ride.","category":"Cycling","subcategory":"Cycling Clothing","product_group":"Cycling Jackets","thumb_url":"http://i1.avlws.com/115/s442675.png","image_url":"http://i1.avlws.com/115/l442675.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442675&tt=df","retail_price":"148.00","sale_price":"99.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442675\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442675.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858131&amp;link=&amp;tabs=-Details\"></script>","variants":{"8581310003":{"sku":"8581310003","vendor_sku":"79997-0001","upc":"887035647079","size":"L","color":"PERFORMANCE FOREST NIGHT","retail_price":"99.93","sale_price":"99.93"}}}
