{"sku":"858238","manufacturer_id":"RACQI01","brand_name":"Rossignol","product_name":" Rossignol Soul 7 Skis - Men's -2013/2014","long_description":"Feel the rush of the newly designed Rossignol Soul 7 skis. Light like a pair of backcountry touring skis and responsive like big-mountain chargers, they dominate any terrain on the mountain. The Soul 7s are right at home lapping freshly fallen powder or blasting through crud, and they carve responsively on hardpack snow and groomed runs. Easy-to-turn honeycomb tip and tail are significantly lighter than previous models; you can actually see the light pass through the air-filled spaces in the honeycomb. You'll really appreciate the weight savings when the Soul 7s are strapped to your pack and you hike up the ridge to get first tracks. The responsive strength of the skis shines when dropping into steep terrain, negotiating a technical line, and straight-lining it back to the base. Float like a feather on top of deep snow thanks to the rockered tips and tails; redesigned Powder Turn rocker minimizes the tendency of tips to flap at high speeds. Standard camber underfoot offers tenacious edge-grip on hardpack; there's more than enough camber to enjoy carving on groomers. The Soul 7s feel extra smooth, especially at high speeds, thanks to the visco elastomer in the tip and tail that absorbs shock and resists chatter. The Rossignol Soul 7 skis require bindings with wide brakes. Base or topsheet color may vary from photo.","short_description":"Feel the rush of the newly designed Rossignol Soul 7 skis. Light like a pair of backcountry touring skis and responsive like big-mountain chargers, they dominate any terrain on the mountain.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s381975.png","image_url":"http://i1.avlws.com/115/l381975.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381975&tt=df","retail_price":"699.95","sale_price":"699.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381975\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381975.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858238&amp;link=&amp;tabs=-Details\"></script>","variants":{"8582380001":{"sku":"8582380001","vendor_sku":"RACQI01","size":"172 CM","retail_price":"699.95","sale_price":"699.95"},"8582380003":{"sku":"8582380003","vendor_sku":"RACQI01","size":"188 CM","retail_price":"699.95","sale_price":"699.95"}},"categories":["snow","skis","downhill-skis"]}
