{"sku":"858330","manufacturer_id":"1449531304","brand_name":"Mountain Hardwear","product_name":"Mountain Hardwear SuperMega UL 2 Tent","long_description":"The Mountain Hardwear SuperMega UL tent is designed for backcountry adventurers who travel fast and light. It's the lightest 2-person backpacking tent in the Mountain Hardwear lineup! At just over 2 lbs. the SuperMega UL 2 offers no-compromise weather protection and a generously sized vestibule. Conveniently-located wide end door makes access easy for both campers. Dry-entry vestibule design prevents water from dripping inside tent when vestibule is open, improving livability. Unique cinch cord on vestibule door allows quick tightening adjustments without the need to remove and restake the guyout; simply pull the cord to keep the fabric taut. Freestanding lightweight design provides a no-hassle setup. All fabrics used are designed to be as lightweight as possible while still delivering solid protection from the elements. DAC Featherlite(R) NSL poles utilize unique inserts to create strong, functional poles that save weight and reduce breakage. Lightweight power clips at all pole intersections increase structural strength. Welded zipper flap construction is lighter and drier than a sewn flap. Perimeter seams form waterproof tub-style floor that is up off the ground and under the rainfly for extra weather protection. Mountain Hardwear Watertight Construction: Thoughtful design, taping and welding technology combine to make this tent watertight off the shelf. No seam sealing is required. Mesh pockets help keep tent organized. Reflective guyout loops, starter points and zipper pulls enhance nighttime setup and visibility. As a convenient option, poles and rainfly can be set up with the footprint (sold separately) to create a lightweight shelter. Mountain Hardwear Super Mega UL 2 comes with stuff sacks, aluminum stakes/guyline and owner's manual.","short_description":"The Mountain Hardwear SuperMega UL tent is designed for backcountry adventurers who travel fast and light. It's the lightest 2-person backpacking tent in the Mountain Hardwear lineup!","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423987.png","image_url":"http://i1.avlws.com/115/l423987.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423987&tt=df","retail_price":"450.00","sale_price":"450.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423987\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423987.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858330&amp;link=&amp;tabs=-Details\"></script>","variants":{"8583300001":{"sku":"8583300001","vendor_sku":"1449531304","upc":"786559872625","color":"SMOKEY SAGE","retail_price":"450.00","sale_price":"450.00"}},"categories":["camping-hiking","tents","backpacking-tents"]}
