{"sku":"858310","manufacturer_id":"SW004-031","brand_name":"Smartwool","product_name":" SmartWool PhD Ski Racer Socks - Men's - 2012 Closeout","long_description":"The men's PhD Ski Racer socks feature innovative fabric, a comfortable fit and smart design details that enhance performance to keep your feet warm all day long on the ski slopes this winter. Merino wool provides excellent temperature control and moisture management; reinforced with stretchy nylon to maintain fit. Ski socks have multi-density cushion at the shins for extra protection and light cushion in the heels to keep socks in place and guard against abrasion. Four-degree banded fit system features elastic arches and ankle braces, along with contour flex zones to eliminate bunching, slipping and sagging. Reinforcement construction puts more wool in high wear/high impact areas to increase durability and comfort. SmartWool socks are guaranteed not to itch and can be repeatedly machine washed and dried without shrinking. Closeout.","short_description":"The men's PhD Ski Racer socks feature innovative fabric, a comfortable fit and smart design details that enhance performance to keep your feet warm all day long on the ski slopes this winter.","category":"Footwear","subcategory":"Socks","product_group":"Snowsports Socks","thumb_url":"http://i1.avlws.com/115/s378291.png","image_url":"http://i1.avlws.com/115/l378291.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378291&tt=df","retail_price":"22.95","sale_price":"8.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378291\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378291.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858310&amp;link=&amp;tabs=-Details\"></script>","variants":{"8583100001":{"sku":"8583100001","vendor_sku":"SW004-031","upc":"605284558614","size":"S","color":"LODEN","retail_price":"8.73","sale_price":"8.73"}}}
