{"sku":"858396","manufacturer_id":"U11002028","brand_name":"Atlas","product_name":" Atlas Aspect 28 Snowshoes - 2012 Closeout","long_description":"The Atlas Aspect 28 snowshoes seize winter adventure with an innovative, streamlined design in a lightweight, packable size that grant you confident access to the backcountry. Durable frames are crafted from sturdy aluminum to create a stiff yet lightweight chassis. Nose and tail shapes are optimized to provide a balanced platform for stable footing and to facilitate an easy, natural stride. Spring-Loaded(TM) Suspension (SLS) uses offset webbing straps to create a springy platform beneath your feet that absorbs impact and allows natural side-to-side foot flex. Heel-lift bar provides relief for tired calf muscles on steep ascents and match slope angle for better traction. Robust nylon decks are integrated inside frames in a unique, seamless design that maximizes surface area while resisting abrasion. Designed for backcountry adventuring, PackFlat(TM) bindings feature quick-lashing straps and accommodate large snowboard or mountaineering boots. Included Backcountry Utility strap can be used to secure your snowshoes to your pack, lash gear together or serve as an emergency replacement strap in your PackFlat bindings. Aggressive saw-toothed perimeter and stainless-steel toe crampons deliver high-end traction; shovel-shaped prongs with sharp ice tips bite well into frozen slopes. Atlas Aspect 28 snowshoes' recommended load specification is for weight of hiker with gear. Closeout.","short_description":"The Atlas Aspect 28 snowshoes seize winter adventure with an innovative, streamlined design in a lightweight, packable size that grant you confident access to the backcountry.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Men's Snowshoes","thumb_url":"http://i1.avlws.com/115/s432119.png","image_url":"http://i1.avlws.com/115/l432119.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432119&tt=df","retail_price":"279.95","sale_price":"203.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432119\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432119.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858396&amp;link=&amp;tabs=-Details\"></script>","variants":{"8583960001":{"sku":"8583960001","vendor_sku":"U11002028","upc":"485839600018","size":"28 IN","color":"BURNT ORANGE","retail_price":"203.73","sale_price":"203.73"}},"categories":["snow","snowshoes","mens-snowshoes"]}
