{"sku":"858334","manufacturer_id":"320191-BY0","brand_name":"Dc","product_name":" DC Travis Rice Boa Snowboard Boots - 2013/2014","long_description":"Designed by Travis Rice, the DC Travis Rice Boa snowboard boots are built to withstand the punishment delivered by hard-charging riders. These high-end boots are built for your all-mountain sessions. Boa(R) Focus lacing features two fit zones that tighten independently; it concentrates closure on the instep and holds the heel securely no matter how the upper is cranked. Boa H3 Coiler scoops up loose cable when entering and exiting the boot; put your foot in, pull back on the tongue, twist the reel a few times and you're off. Aerotech ventilation system integrates vents into the shells and liners to transfer heat and moisture away from your feet, keeping them comfortable all day long. Custom-moldable EVA liners feature anatomic J-bars for amazing support; power straps around the cuffs and elastic straps over the insteps enhance support. Cushioned, dual-density EVA footbeds feature impact heel cushions; internal ankle harnesses hold liners in place, locking your heels down for amazing control. Articulated tongues and molded backstays offer support, and help you control your edges during toe-side and heel-side turns. Unilite outsoles provide durability, damping and cushioning; snow-shedding traction tread ensures sure footing; soles feature a design created by Mike Parillo.","short_description":"Designed by Travis Rice, the DC Travis Rice Boa snowboard boots are built to withstand the punishment delivered by hard-charging riders. These high-end boots are built for your all-mountain sessions.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s448875.png","image_url":"http://i1.avlws.com/115/l448875.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448875&tt=df","retail_price":"399.95","sale_price":"279.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448875\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448875.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858334&amp;link=&amp;tabs=-Details\"></script>","variants":{"8583340001":{"sku":"8583340001","vendor_sku":"320191-BY0","upc":"886959599693","size":"9","color":"BLACK/YELLOW","retail_price":"279.93","sale_price":"279.93"},"8583340006":{"sku":"8583340006","vendor_sku":"320191-BY0","upc":"886959599747","size":"11.5","color":"BLACK/YELLOW","retail_price":"279.93","sale_price":"279.93"}}}
