{"sku":"858554","manufacturer_id":"10702100000","brand_name":"Burton","product_name":"Burton Social Snowboard - Women's - 2013/2014","long_description":"The Burton Social snowboard is the softest, most playful women's snowboard in the Burton lineup. It features a catch-free rocker design that can handle any feature in the park. V-Rocker-center rocker with additional rockers in front of your feet-ups edge control underfoot while disengaging tip and tail contact points for a catch-free feel. Burton designs women's boards to match the geometry and fitness of the female rider; True Flex improves stability and edge control, and energizes pop in the tip and tail. The Channel system offers unlimited, on-the-fly stance adjustability, enhances board feel and is compatible with EST(TM), Re:Flex(TM) and Disc(R) bindings. The Channel lets you fine-tune your stance width to the millimeter, and then dial in your toe-to-heel centering and rotate your angles in one fell swoop. True twin shape and flex are equally fun no matter which way you point it; and its dynamite pop ensures effortless ollieing for up-and-coming rippers. Dual-density fiberglass from tip to tail provides torsional forgiveness, board feel and edge hold, perfect for advancing to the next level. Carbon stringers radiate energy outward from underneath the bindings to the tip and tail for added snap and power, balancing the loose and playful feel of the Social snowboard. Exaggerated tip and tail scooping turns up the edges for a looser, more forgiving feel that adds catch-free fun when riding everything from a knee-high box to neck-deep pow. Edges extend out slightly beneath the bindings for tremendous edge hold in hard, icy conditions, yet they remain playful and forgiving in soft conditions. Easy-to-maintain extruded base enhances speed and durability to keep you moving fast in all snow conditions. .","short_description":"The Burton Social snowboard is the softest, most playful women's snowboard in the Burton lineup. It features a catch-free rocker design that can handle any feature in the park.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Freestyle Snowboards","thumb_url":"http://i1.avlws.com/115/s337767.png","image_url":"http://i1.avlws.com/115/l337767.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=337767&tt=df","retail_price":"369.95","sale_price":"258.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=337767\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m337767.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858554&amp;link=&amp;tabs=-Details\"></script>","variants":{"8585540002":{"sku":"8585540002","vendor_sku":"10702100000","upc":"886888426909","size":"147 CM","retail_price":"258.83","sale_price":"258.83"},"8585540003":{"sku":"8585540003","vendor_sku":"10702100000","upc":"886888426916","size":"151 CM","retail_price":"258.83","sale_price":"258.83"}},"categories":["snow","snowboards","freestyle-snowboards"]}
