{"sku":"858565","manufacturer_id":"10622100069","brand_name":"Burton","product_name":"Burton Imperial Snowboard Boots - 2013/2014","long_description":"The men's Burton Imperial snowboard boots help you reign over the entire mountain. Cushioned soles and liners outfit your feet for all-day sessions where comfort and performance are key. Shrinkage(TM) technology reduces boot's overall footprint by 1 full size, minimizing boot overhang, bulk and weight. Super lightweight and resilient shell panels evenly distribute strap pressure to maximize rebound and resist breakdown; their flex remains consistent, season after season. Imprint(TM) 3 liners move with you for increased agility and response; rip-and-stick liner closures. Liners provide a consistent flex over time and slide on and off feet easily; precurved ankle panels reduce lace pressure on front of legs. Medium-flexing, slim, 3D-molded tongues wrap the forefeet in comfort, offer a seamless flex and reduce performance-robbing shell/liner stack-up. Snowproof internal gussets on boot tongues completely seal lower boot zones to keep feet warm and dry. Streamlined Speed Zone(TM) shell lacing lets you fine-tune the upper and lower zones in seconds; this system offers powerful rebound, wrap and response with minimal effort. Molded EVA footbeds with supportive shanks lessen the blow of hardpack landings. Low-profile EST(TM) midsoles with a reduced ramp angle lower your center of gravity for improved boot feel; ultra-damping B3 gel inserts cushion without added weight. Vibram(R) EcoStep(TM) outsoles are made with recycled rubber and backed by nearly 70 years of mountaineering knowledge for superior traction, feel and light weight. Dual-density grippy rubber spikes dig into ice to help prevent slippage when off your board; durable toe material helps binding toe straps stay in place.","short_description":"The men's Burton Imperial snowboard boots help you reign over the entire mountain. Cushioned soles and liners outfit your feet for all-day sessions where comfort and performance are key.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s383147.png","image_url":"http://i1.avlws.com/115/l383147.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383147&tt=df","retail_price":"299.95","sale_price":"209.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383147\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383147.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858565&amp;link=&amp;tabs=-Details\"></script>","variants":{"8585650001":{"sku":"8585650001","vendor_sku":"10622100069","upc":"886888433075","size":"9","color":"GRAY/LIME","retail_price":"209.83","sale_price":"209.83"},"8585650002":{"sku":"8585650002","vendor_sku":"10622100069","upc":"886888433082","size":"9.5","color":"GRAY/LIME","retail_price":"209.83","sale_price":"209.83"},"8585650004":{"sku":"8585650004","vendor_sku":"10622100069","upc":"886888432962","size":"10.5","color":"GRAY/LIME","retail_price":"209.83","sale_price":"209.83"},"8585650005":{"sku":"8585650005","vendor_sku":"10622100069","upc":"886888432979","size":"11","color":"GRAY/LIME","retail_price":"209.83","sale_price":"209.83"},"8585650006":{"sku":"8585650006","vendor_sku":"10622100069","upc":"886888432986","size":"11.5","color":"GRAY/LIME","retail_price":"209.83","sale_price":"209.83"}},"categories":["snow","snowboard-boots","mens-snowboard-boots"]}
