{"sku":"858549","manufacturer_id":"11544100000","brand_name":"Burton","product_name":" Burton Barracuda Snowboard - 2013/2014","long_description":"Built for freeriders, the Burton Barracuda snowboard features a special rockered tip for enhanced board float on deep snow days, whether dropping pillow lines or traversing across the mountain. S-Rocker(TM) applies a unique contour to the Barracuda; entry rocker extends from the nose to under your front foot, and then transitions to camber between the feet. Slightly tapered shape and directional flex combine with S-Rocker to create a floater that goes up, over and through anything. Compressing the camber causes the entry rocker to naturally lift the nose, improving float while maintaining speed through deep-driving pow turns and variable conditions. Nug Raduction optimizes every element of the board, from flex profile to sidecut, letting you downsize up to 10cm from your normal board length. Nug Raduction boards ride the same as a traditional length board, but offer a surprisingly stable and responsive ride; Burton recommends sizing Barracuda down 2 - 3cm. The Channel system offers unlimited, on-the-fly stance adjustability, enhances board feel and is compatible with EST(TM), Re:Flex(TM) and Disc(R) bindings. The Channel lets you fine-tune your stance width to the millimeter, and then dial in your toe-to-heel centering and rotate your angles in one fell swoop. Wood core is snappy, powerful and durable; dual-zone wood grains, positioned along the toe and heel edges perpendicular to the core, enhance edge hold and add strength. Fiberglass in the topsheet provides versatile flex and response so you can shred your big mountain descents. Lightweight Carbon I-Beam(TM) riding up the board's spine adds to board's longitudinal snap. Tapered thickness in tip and tail reduces swing weight and improves powder flotation. Edges extend out slightly beneath the bindings for tremendous edge hold in hard, icy conditions, but they remain playful and forgiving in softer conditions.","short_description":"Built for freeriders, the Burton Barracuda snowboard features a special rockered tip for enhanced board float on deep snow days, whether dropping pillow lines or traversing across the mountain.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Freeride Snowboards","thumb_url":"http://i1.avlws.com/115/s337823.png","image_url":"http://i1.avlws.com/115/l337823.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=337823&tt=df","retail_price":"499.95","sale_price":"349.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=337823\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m337823.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858549&amp;link=&amp;tabs=-Details\"></script>","variants":{"8585490001":{"sku":"8585490001","vendor_sku":"11544100000","upc":"886888425957","size":"157 CM","retail_price":"349.83","sale_price":"349.83"},"8585490002":{"sku":"8585490002","vendor_sku":"11544100000","upc":"886888425964","size":"161 CM","retail_price":"349.83","sale_price":"349.83"}},"categories":["snow","snowboards","freeride-snowboards"]}
