{"sku":"858566","manufacturer_id":"10435100027","brand_name":"Burton","product_name":" Burton Ion Snowboard Boots - 2013/2014","long_description":"Burton Ion all-mountain snowboard boots feature top-of-the-line features: canted cushioning, firm tongues, and liners that conform to your feet. Pirelli rubber soles grip slick surfaces with ease. Shrinkage(TM) technology reduces boot's overall footprint by 1 full size, minimizing boot overhang, bulk and weight. Boots have outer shell pressure-relief panels; gel cushioning is fused to area where ankle straps rest on boots to evenly distribute pressure when bindings are cranked tight. Powerful, seamless backstay spines increase medial/lateral support, edge-to-edge response and durability. Imprint(TM) 4 liners feature DRYRIDE moisture-wicking technology to keep feet comfortable; Rad Pads add comfort. Snowproof internal gussets on boot tongues completely seal lower boot zones to keep feet warm and dry. Firm-flexing, thin-profile, 3D molded tongues wrap the shins, ankles and insteps in comfort, offer a seamless flex and reduce performance-robbing shell/liner stack-up. Streamlined Speed Zone(TM) shell lacing lets you fine-tune the upper and lower zones in seconds; this system offers powerful rebound, wrap and response with minimal effort. Low-profile EST(TM) midsoles with a reduced ramp angle lower your center of gravity for improved boot feel; ultra-damping B3 gel inserts cushion without weight. Molded EVA footbeds with a supportive shank and dual-density cushioning lessen the blow of hardpack landings; antimicrobial coating fights odors. Cushioned EVA platforms are fused to the liner's footprint; Pirelli(TM) rubber outsoles mimic snow tires to give you the ultimate grip on snow and ice.","short_description":"Burton Ion all-mountain snowboard boots feature top-of-the-line features: canted cushioning, firm tongues, and liners that conform to your feet. Pirelli rubber soles grip slick surfaces with ease.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s383151.png","image_url":"http://i1.avlws.com/115/l383151.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383151&tt=df","retail_price":"429.95","sale_price":"300.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383151\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383151.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858566&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
