{"sku":"858553","manufacturer_id":"10709100000","brand_name":"Burton","product_name":"Burton Feelgood Flying V Snowboard - Women's - 2013/2014","long_description":"From laid-back laps to high-speed attacks, if you demand performance, control and fun from your all-mountain board, choose the Burton Feelgood Flying V(TM) women's snowboard. Burton designs women's boards to correspond with the geometry of the female rider; torsional softness underfoot transitions to stabilizing zones between and outside the feet. Flying V is a premium blend of camber and rocker, and offers the best of both worlds in terms of performance. Rocker between and outside your feet enhances playfulness and float in powder; subtle camber zones underneath feet combine with edge-gripping tech to add pop, snap and power. Directional shape concentrates pop in the tail and offers plenty of overall float and control; twin flex makes riding regular or switch simple. The Channel system offers unlimited, on-the-fly stance adjustability and enhances board feel; compatible with EST(TM), Re:Flex(TM) and Disc(R) bindings. The Channel lets you fine-tune your stance width to the millimeter, and then dial in your toe-to-heel centering and rotate your angles in one fell swoop. Wood core is snappy, powerful and durable; dual-zone wood grains, positioned along the toe and heel edges perpendicular to the core, enhance edge hold and add strength. Fiberglass in the topsheet provides versatile flex and response so you can shred everything from big mountain descents to laps in the park. Lightweight Carbon I-Beam(TM) riding up the board's spine adds to board's longitudinal snap. Fiberglass energy strands radiate outward from the Channels to the board's edges, providing driving power and effortless response. Edges extend out slightly beneath the bindings for tremendous edge hold in hard, icy conditions, but they remain playful and forgiving in softer conditions. Tapered tip and tail thickness reduces swing weight and improves powder flotation.","short_description":"From laid-back laps to high-speed attacks, if you demand performance, control and fun from your all-mountain board, choose the Burton Feelgood Flying V(TM) women's snowboard.","category":"Snowboarding","subcategory":"Snowboards","product_group":"All-Mountain Snowboards","thumb_url":"http://i1.avlws.com/115/s382815.png","image_url":"http://i1.avlws.com/115/l382815.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382815&tt=df","retail_price":"549.95","sale_price":"384.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382815\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382815.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858553&amp;link=&amp;tabs=-Details\"></script>","variants":{"8585530003":{"sku":"8585530003","vendor_sku":"10709100000","upc":"886888427555","size":"155 CM","retail_price":"384.83","sale_price":"384.83"}},"categories":["snow","snowboards","allmountain-snowboards"]}
