{"sku":"858550","manufacturer_id":"10694100000","brand_name":"Burton","product_name":" Burton Blunt Snowboard - 2013/2014","long_description":"Loaded with pop, and featuring full rocker and a twin-tip shape, the Burton Blunt snowboard is the park-approved, trick-throwing, landing-stomping, fast-spinning fun ride you've been seeking. Burton Channel system offers unlimited, on-the-fly stance adjustability and enhances board feel; compatible with traditional Burton 3D bindings. The Channel lets you fine-tune your stance width to the millimeter, and then dial in your toe-to-heel centering and rotate your angles in one fell swoop. Flat Top profile features flat rocker between your feet and a rockered tip and tail for stability, balance and continuous edge control-perfect for the park. Twin shape and twin flex: this board is symmetrical from tip to tail for a balanced ride that's equally versatile whether ridden regular or switch. Classic tip-to-tail wood core offers a balanced, playful ride; carbon stringers radiate energy outward toward tip and tail for added snap and power. Fiberglass incorporated into the board provides torsional forgiveness and a park-friendly feel, perfect for helping you advance to the next level. Pro-Tip(TM) edges are tapered at tip and tail, reducing swing weight and improving float in powder; tip and tail feature an exaggerated scoop profile for a forgiving feel. Easy-to-maintain extruded base enhances speed and durability to keep you moving fast in all snow conditions. .","short_description":"Loaded with pop, and featuring full rocker and a twin-tip shape, the Burton Blunt snowboard is the park-approved, trick-throwing, landing-stomping, fast-spinning fun ride you've been seeking.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Freestyle Snowboards","thumb_url":"http://i1.avlws.com/115/s337763.png","image_url":"http://i1.avlws.com/115/l337763.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=337763&tt=df","retail_price":"399.95","sale_price":"279.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=337763\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m337763.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858550&amp;link=&amp;tabs=-Details\"></script>","variants":{"8585500002":{"sku":"8585500002","vendor_sku":"10694100000","upc":"886888426565","size":"157 CM","retail_price":"279.83","sale_price":"279.83"},"8585500003":{"sku":"8585500003","vendor_sku":"10694100000","upc":"886888426589","size":"159 CM Wide","retail_price":"279.83","sale_price":"279.83"},"8585500004":{"sku":"8585500004","vendor_sku":"10694100000","upc":"886888426596","size":"163 CM Wide","retail_price":"279.83","sale_price":"279.83"}}}
