{"sku":"858567","manufacturer_id":"10434100001","brand_name":"Burton","product_name":"Burton Driver-X Snowboard Boots - 2013/2014","long_description":"Are you addicted to speed-filled, big-mountain runs? With a stiff flex, quick lacing and cushioned liners, the Burton Driver-X boots provide superior response and comfort on your hard-charging days. Not stiff enough? Add torque to the tongues with Rider Adjustable Flex tongue inserts: they personalize forward flex, increasing both response and boot life. Firm-flexing, thin-profile, 3D molded tongues wrap the shins, ankles and insteps in comfort, offer a seamless flex and reduce performance-robbing shell/liner stack-up. Snowproof internal gussets on boot tongues completely seal lower boot zones to keep feet warm and dry. Streamlined Speed Zone(TM) shell lacing lets you fine-tune the upper and lower zones in seconds; this system offers powerful rebound, wrap and response with minimal effort. To make entry and exit easy, Burton added a pull loop on the tongue as well as a lace pull tab that releases both the upper and lower zones simultaneously. Imprint(TM) 3X liners with Focus Cuffs ride high on the ankles for increased agility and response; liners have rip-and-stick closures, ankle-hugging J-bars and lace locks. Liners provide a consistent flex over time and slide on and off feet easily; precurved ankle panels reduce lace pressure on front of legs. Molded EVA footbeds with a supportive shank lessen the blow of hardpack landings; antimicrobial coating fights odors. B3 gel heel inserts provide ultimate damping and are formulated to withstand repeated impacts without breaking down. Vibram(R) EcoStep(TM) outsoles are made with recycled rubber and backed by nearly 70 years of mountaineering knowledge for superior traction, feel and light weight. Dual-density grippy rubber spikes dig into ice to help prevent slippage when off your board; durable toe material helps binding toe straps stay in place. Shrinkage(TM) technology reduces boot's overall footprint by 1 full size, minimizing boot overhang, bulk and weight.","short_description":"Are you addicted to speed-filled, big-mountain runs? With a stiff flex, quick lacing and cushioned liners, the Burton Driver-X boots provide superior response and comfort on your hard-charging days.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s383155.png","image_url":"http://i1.avlws.com/115/l383155.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383155&tt=df","retail_price":"369.95","sale_price":"258.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383155\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383155.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858567&amp;link=&amp;tabs=-Details\"></script>","variants":{"8585670002":{"sku":"8585670002","vendor_sku":"10434100001","upc":"886888431538","size":"9","color":"BLACK","retail_price":"258.83","sale_price":"258.83"},"8585670006":{"sku":"8585670006","vendor_sku":"10434100001","upc":"886888431453","size":"11","color":"BLACK","retail_price":"258.83","sale_price":"258.83"},"8585670007":{"sku":"8585670007","vendor_sku":"10434100001","upc":"886888431460","size":"11.5","color":"BLACK","retail_price":"258.83","sale_price":"258.83"}},"categories":["snow","snowboard-boots","mens-snowboard-boots"]}
