{"sku":"858559","manufacturer_id":"10738100000","brand_name":"Burton","product_name":" Burton Custom Smalls Snowboard - Boys'","long_description":"The Burton Custom Smalls snowboard is built to help your young shredder improve his skills and progress all over the mountain, from carving on the slopes to hitting mini kickers. Flying V mixed camber combines rocker and camber to offer easy-riding, springloaded action. Rocker, overall and between and outside the feet, enhances catch-free playfulness and float through pow. Subtle camber zones underneath feet focus edge control for crisp snap, added pop and power through the turns. Twin shape concentrates pop in the tip and tail, and offers plenty of overall float and control; twin flex makes riding regular or switch simple. Tip-to-tail wood core is durable and provides a forgiving flex for edge control and solid turns. Biax(TM) React fiberglass construction provides torsional forgiveness, board feel and edge hold, perfect for advancing to the next level. Tapered tip and tail thickness reduces swing weight and improves powder flotation. Slantwall sidewalls offer a consistent edge hold that cuts like a knife. Easy-to-maintain extruded base combines speed and durability to keep you moving fast in all types of conditions. .","short_description":"The Burton Custom Smalls snowboard is built to help your young shredder improve his skills and progress all over the mountain, from carving on the slopes to hitting mini kickers.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Kids' Snowboards","thumb_url":"http://i1.avlws.com/115/s337811.png","image_url":"http://i1.avlws.com/115/l337811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=337811&tt=df","keywords":"jstp7615","retail_price":"259.95","sale_price":"181.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=337811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m337811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858559&amp;link=&amp;tabs=-Details\"></script>","variants":{"8585590003":{"sku":"8585590003","vendor_sku":"10738100000","upc":"886888429122","size":"140 CM","retail_price":"181.83","sale_price":"181.83"}},"categories":["snow","snowboards","kids-snowboards"]}
