{"sku":"858641","manufacturer_id":"48361-0922-176","brand_name":"Dynafit","product_name":" Dynafit Baltoro Telemark / Randonee Skis - 2013/2014","long_description":"The fun and forgiving Dynafit Baltoro telemark/randonee skis are suitable for everyone from beginner backcountry tourers to ambitious athletes who are climbing peaks and skiing back down. Combination of foam and ultralight paulownia wood is the key to the Baltoro skis' strength, lightness and dampness; skis offer precise edge hold and forgiving handling. Rockered tips allow smooth, predictable turns in all types of snow. ABS plastic sidewall placement under the bindings, under the tips and under the tails strikes an excellent balance between weight savings and durability. Dual radius sidecut, featuring a long turning radius toward the front and a short radius toward the rear, allows steady handling going into and coming out of turns. Patented SpeedSkinFix attachment system securely attaches Dynafit skins (sold separately) to skis. SpeedSkinFix system does not interfere with the attachment of other brands of skins that feature a tip loop and tail clip. Dynafit Baltoro skis have a sintered graphite coating on the bases that enhances glide and improves wax retention. Base or topsheet color may vary from online photo.","short_description":"The fun and forgiving Dynafit Baltoro telemark/randonee skis are suitable for everyone from beginner backcountry tourers to ambitious athletes who are climbing peaks and skiing back down.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s381787.png","image_url":"http://i1.avlws.com/115/l381787.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381787&tt=df","retail_price":"599.95","sale_price":"479.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381787\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381787.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858641&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","skis","backcountry-skis"]}
