{"sku":"858657","manufacturer_id":"C1314RL10010","brand_name":"Backcountry Access","product_name":"Backcountry Access BC Link Group Communication System","long_description":"Optimized for winter use, the Backcountry Access BC Link Group Communication system lets you stay in constant contact with your riding partners while exploring the backcountry. Consolidated user interface is located right at your fingertips, and is optimized to be used while wearing gloves; smart mic is designed to clip on any pack. Integrated with the Smart Mic unit, the user interface features a push-to-talk button, on/off switch, volume control, battery indicator, channel selection and an earphone jack. 38 FRS and GMRS channels and 83 sub-channels ensure minimal interference. The BC Link Group Communication system features a secure cord connection between the Smart Mic and the base unit battery pack. Base unit can be stashed inside your pack or clipped onto your belt; placing base unit in your pack insulates the battery from the cold. Rechargeable 3.7-Volt lithium ion battery provides long battery life; 110-Volt charger adaptor connects to the mini USB port on the base unit. The Backcountry Access BC Link Group Communication system is compatible with all standard FRS/GMRS radios.","short_description":"Optimized for winter use, the Backcountry Access BC Link Group Communication system lets you stay in constant contact with your riding partners while exploring the backcountry.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412839.png","image_url":"http://i1.avlws.com/115/l412839.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412839&tt=df","keywords":"walkie talkies","retail_price":"175.00","sale_price":"175.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412839\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412839.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858657&amp;link=&amp;tabs=-Details\"></script>","variants":{"8586570001":{"sku":"8586570001","vendor_sku":"C1314RL10010","upc":"857240002970","retail_price":"175.00","sale_price":"175.00"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
