{"sku":"858658","manufacturer_id":"48729-9180-UNI","brand_name":"Dynafit","product_name":" Dynafit TLT Radical FT Randonee Bindings with 110mm Brakes - 2013/2014","long_description":"Dynafit TLT Radical FT randonee bindings with 110mm brakes are the solution for mountaineers and freeriders who log lots of miles skinning up mountains to ski couloirs, drop cliffs and float powder. Carbon plates connect the toe and heel pieces for high torsional rigidity; switches located behind the toe pieces stiffen the carbon plates, altering the flex of your skis. Move the switches to the lock position to stiffen the flex of your skis; move the switch to unlock to maintain the natural flex of the skis. Aluminum toe plates feature side towers that align your boots with the binding pins to allow easy step-in entry. Length of the bindings can be adjusted plus or minus 12.5mm to fit a range of boot sizes. Climbing bars flip up and down, offering three heights for efficiency while touring; design eliminates the need to rotate heel pieces to adjust the climbing bar positions. Heel pieces are DIN adjustable (5 - 12) for forward and twisting falls. Gliding plates on the brakes allow good side release of the heels of the boots. Dynafit TLT Radical FT randonee bindings include 110mm-wide integrated ski brakes that fit most wide all-mountain skis.","short_description":"Dynafit TLT Radical FT randonee bindings with 110mm brakes are the solution for mountaineers and freeriders who log lots of miles skinning up mountains to ski couloirs, drop cliffs and float powder.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Randonee Ski Bindings","thumb_url":"http://i1.avlws.com/115/s451999.png","image_url":"http://i1.avlws.com/115/l451999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451999&tt=df","retail_price":"599.95","sale_price":"599.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858658&amp;link=&amp;tabs=-Details\"></script>","variants":{"8586580001":{"sku":"8586580001","vendor_sku":"48729-9180-UNI","color":"BLACK","retail_price":"599.95","sale_price":"599.95"}}}
