{"sku":"858675","manufacturer_id":"301583","brand_name":"Dalbello","product_name":" Dalbello KR 2 Chakra Ski Boots - Womens - 2013/2014","long_description":"The women's Dalbello KR Two Chakra ski boots are smooth-flexing divas ready for advanced skiing in any type of snow. Their narrow footbeds and anatomic boot mold precisely dial you into the terrain. 98mm lasts provide a responsive, precision fit designed for discriminating feet, but thanks to a new boot mold, the last doesn't squeeze your feet like a vice. Boot mold enhances power, precision and comfort by matching 4 critical fit points: the heels, ankles, 5th metatarsals near your toes and the naviculars near insteps. Women's fit is designed for your feet and calves, fabrics and insulation are selected for their softness and warmth and the structural materials are lighter and more flexible. Offering a precise foothold and a progressive forward flex, 3-piece shell optimizes responsiveness for today's relatively short, wide skis. Separate cuff, shell and tongue sections are joined together to create a smooth forward flex with rigid lateral support. Highly resilient nylon tongues enhance responsiveness, control and sensitivity to skis and snow surface; they are flex-adjusted for female skiers. Lady fit liners are shaped specifically for women's feet, with tapered heels, roomy forefeet, high insteps and low-profile cuffs. Lightweight, custom-formable liners also feature microfleece linings, performance insoles and a wrap design that optimizes control of rearfoot volume. Liners are engineered to fit correctly right out of the box, but they can be custom formed as well, a procedure best performed in an REI specialty ski shop. Twin canting adjusts the cuffs to fit the angles of your lower legs, levels the soles of the boots above the skis and offers a versatile range of adjustment. With a flex index of 95, Dalbello KR Two Chakra ski boots offer flex appropriate for advanced female skiers.","short_description":"The women's Dalbello KR Two Chakra ski boots are smooth-flexing divas ready for advanced skiing in any type of snow. Their narrow footbeds and anatomic boot mold precisely dial you into the terrain.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382527.png","image_url":"http://i1.avlws.com/115/l382527.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382527&tt=df","retail_price":"499.95","sale_price":"399.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382527\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382527.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858675&amp;link=&amp;tabs=-Details\"></script>","variants":{"8586750002":{"sku":"8586750002","vendor_sku":"301583","upc":"616438303837","size":"Mondo 23.5","color":"AVIO TRANSPARENT/WHITE","retail_price":"399.93","sale_price":"399.93"},"8586750003":{"sku":"8586750003","vendor_sku":"301583","upc":"616438303851","size":"Mondo 24.5","color":"AVIO TRANSPARENT/WHITE","retail_price":"399.93","sale_price":"399.93"},"8586750005":{"sku":"8586750005","vendor_sku":"301583","upc":"616438303899","size":"Mondo 26.5","color":"AVIO TRANSPARENT/WHITE","retail_price":"399.93","sale_price":"399.93"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
