{"sku":"858663","manufacturer_id":"48743-9185-UNI","brand_name":"Dynafit","product_name":"Dynafit Beast 16 Randonee Bindings with 135mm Brakes - 2013/2014","long_description":"Built for freeride skiers who want to reach the summit and top it off with an aggressive line down the face, Dynafit Beast 16 randonee bindings with 135mm brakes deliver top backcountry performance. Beast bindings are the lightest DIN 16 bindings on the market so you can tour the backcountry and have the performance needed to ski the most aggressive lines. Unlike other tech-style bindings, the toe pieces rotate to provide a consistent, reliable release; rotation combats premature release caused by sudden impacts. Bindings are easy to get into no matter what the DIN is set at-step into the toe pieces as you would with other tech bindings, then step down with the heels. New heel design for the rear pivot points allows extra vertical movement before release. Low forward-lean angle between the front of the foot and the heel provides an extremely stable and smooth ride. Excellent torsional rigidity is achieved through the four connection points between each boot and binding. Extra-wide binding base plates are specially made for skis with a minimum width of 80mm underfoot. Beast bindings come with special Dynafit boot heel inserts, called Power Inserts, that must be mounted on your tech-compatible boots. Power Inserts are made to fit DIN ISO 9523 boot shapes and standards, and are compatible with Dynafit ZZero series, Titan/ZZeus/Gaia series and Vulcan/Mercury/One series boots. If you are mounting the inserts to any other boot, please contact the boot manufacturer to ensure they meet DIN ISO 9523 standards.","short_description":"Built for freeride skiers who want to reach the summit and top it off with an aggressive line down the face, Dynafit Beast 16 randonee bindings with 135mm brakes deliver top backcountry performance.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Randonee Ski Bindings","thumb_url":"http://i1.avlws.com/115/s461351.png","image_url":"http://i1.avlws.com/115/l461351.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461351&tt=df","retail_price":"849.95","sale_price":"849.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461351\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461351.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858663&amp;link=&amp;tabs=-Details\"></script>","variants":{"8586630001":{"sku":"8586630001","vendor_sku":"48743-9185-UNI","color":"BLACK/GREEN","retail_price":"849.95","sale_price":"849.95"}},"categories":["snow","ski-bindings","randonee-ski-bindings"]}
