{"sku":"858791","manufacturer_id":"3222020","brand_name":"Lib Tech","product_name":" Lib Tech Darker Series C3 BTX Snowboard - 2013/2014","long_description":"Lib Tech Darker Series C3 BTX snowboard features integrated bamboo 3D binding platforms that transfer energy from your feet to your edges for amazing control and power when ripping through the park. Bamboo grain in binding platforms runs perpendicular to the core's grain for strength and effortless power transfer to your edges, giving your control and power in every turn. C3 BTX technology features a camber-dominant profile with mild Banana Tech rocker between the feet and maximum camber at the tip and tail for control, power and stability. Magne-Traction improves edge grip by adding seven contact points along the running length of the board, resulting in amazing control whether riding ice or pow. Columbian Gold wood core, built from farmed wood and combined with birch is ultra lightweight and strong, and features lively fibers for amazing pop. Basalt-reinforced fiberglass offers maximum board strength with minimum weight; these fibers damp board chatter and offer a lively ride. Birch internal sidewalls for added pop; external UHMW sidewalls stand up to wear and tear; bio-beans topsheet; sintered base is fast and low maintenance. .","short_description":"Lib Tech Darker Series C3 BTX snowboard features integrated bamboo 3D binding platforms that transfer energy from your feet to your edges for amazing control and power when ripping through the park.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Freestyle Snowboards","thumb_url":"http://i1.avlws.com/115/s344123.png","image_url":"http://i1.avlws.com/115/l344123.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=344123&tt=df","retail_price":"665.95","sale_price":"464.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=344123\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m344123.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858791&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboards","freestyle-snowboards"]}
