{"sku":"858789","manufacturer_id":"3221710","brand_name":"Lib Tech","product_name":"Lib Tech Skunk Apes C2 BTX Snowboard - Wide - 2013/2014","long_description":"Attention big riders: this is your board! The Lib Tech Skunk Apes C2 BTX snowboard is built for tall, big-footed riders needing a hard-charging board ready for big mountain rdiing. C2 BTX technology features Banana Tech rocker between the feet and camber at tip and tail, focusing pressure between feet and delivering amazing float riding regular or switch. Camber provides end-to-end stability and plenty of pop for boosting off natural terrain; Banana Traction technology offers carving performance and soft-snow float. Magne-Traction improves edge grip by adding seven contact points along the running length of the board, resulting in amazing control whether riding ice or pow. Columbian Gold wood core, built from farmed wood, is ultra lightweight and strong, and features lively fibers for amazing pop; fiberglass increases board stiffness and pop. Birch internal sidewalls for added pop; external UHMW sidewalls stand up to wear and tear; sintered Teflon Titanium base is fast and low maintenance. .","short_description":"Attention big riders: this is your board! The Lib Tech Skunk Apes C2 BTX snowboard is built for tall, big-footed riders needing a hard-charging board ready for big mountain rdiing.","category":"Snowboarding","subcategory":"Snowboards","product_group":"All-Mountain Snowboards","thumb_url":"http://i1.avlws.com/115/s442619.png","image_url":"http://i1.avlws.com/115/l442619.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442619&tt=df","retail_price":"559.95","sale_price":"391.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442619\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442619.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858789&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboards","allmountain-snowboards"]}
