{"sku":"858700","manufacturer_id":"12008/502","brand_name":"Scarpa","product_name":" Scarpa Freedom SL Randonee Boots - Women's - 2013/2014","long_description":"Designed in a women-specific last, the women's Scarpa Freedom SL randonee boots mix stiff progressive flex, light weight and a vast cuff motion for best-in-class all-mountain performance. Boots feature lightweight Pebax(R) Rnew plastic that is made from castor plant oil rather than petroleum as most plastics are. Pebax Rnew performs exceptionally well across a wide range of temperatures, ensuring consistent flex, strength and stability. Weighing in at only 3,040g (6 lbs. 11 oz.) per pair for a size mondo 25, the Freedom SL boots are remarkably light among the freeride boot category. Boots employ Scarpa's patented Carbon Core Technology, which molds the lower boot around a carbon fiber frame to stiffen the boot without adding cumbersome weight. 27deg of cuff range allows for efficient walking and touring; two-part design allows 7deg resistance-free back flex and 20deg of forward flex. Overlap closure with two upper cuff buckles and two lower cuff buckles, and a low-profile 101mm forefoot last contribute great power transfer. Intuition FR Speed liners put resilient, lightweight and warm custom moldable foam into a mutlidensity alpine-style liner that matches the power and tourability of the boot. Forward lean is 14deg, with plus or minus 4deg of adjustability. Vibram(R) injected rubber outsoles provide good grip when you're walking. Vibram Mountain Plus soles are compatible with all randonee bindings, including Dynafit-style tech bindings. Scarpa Freedoom SL randonee boots for women include adjustable spoilers and oversized power straps.","short_description":"Designed in a women-specific last, the women's Scarpa Freedom SL randonee boots mix stiff progressive flex, light weight and a vast cuff motion for best-in-class all-mountain performance.","category":"Skiing","subcategory":"Ski Boots","product_group":"Randonee Ski Boots","thumb_url":"http://i1.avlws.com/115/s443127.png","image_url":"http://i1.avlws.com/115/l443127.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=443127&tt=df","retail_price":"769.00","sale_price":"769.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=443127\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m443127.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858700&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
