{"sku":"858701","manufacturer_id":"12203/502.1","brand_name":"Scarpa","product_name":"Scarpa TX Pro Telemark Boots - Women's - 2013/2014","long_description":"Built for compatibility with Rottefella NTN Freedom touring bindings and Dynafit-style tech bindings, the Scarpa TX Pro women's boots have the power to drive modern backcountry skis down steep lines. Dynafit-style tech fittings allow you to ski telemark or randonee with the same pair of boots; be sure to read the owner's manual prior to using the boots with tech bindings. Triple-injection molding offers power for the descent; Pebax(R) plastic performs well across a wide range of temperatures, ensuring consistent flex, strength and stability. Scarpa Intuition(R) Speed Pro G Tele liners offer a women-specific fit and great warmth, comfort and resistance to packing out; liners can be remolded many times. Dual-injection edge guards protect the bellows from sharp ski edges. Pivoting tongues make getting in and out of the women's Scarpa TX Pro boots easier. Buckles are lightweight and easy to use; Q-Link midstrap buckles lock your heels in place; power straps snug the boots around your calves.","short_description":"Built for compatibility with Rottefella NTN Freedom touring bindings and Dynafit-style tech bindings, the Scarpa TX Pro women's boots have the power to drive modern backcountry skis down steep lines.","category":"Skiing","subcategory":"Ski Boots","product_group":"Telemark Ski Boots","thumb_url":"http://i1.avlws.com/115/s382783.png","image_url":"http://i1.avlws.com/115/l382783.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382783&tt=df","retail_price":"699.00","sale_price":"699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382783\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382783.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858701&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","telemark-ski-boots"]}
