{"sku":"858788","manufacturer_id":"3221925","brand_name":"Lib Tech","product_name":" Lib Tech Attack Banana EC2 BTX Snowboard - 2013/2014","long_description":"Freestyle riding isn't limited to the park. Lib Tech Attack Banana EC2 BTX snowboard is boss if you're an all-terrain freestyle maverick who also enjoys hitting big drops and floating on deep pow. C2 BTX technology features Banana Tech rocker between the feet and camber at tip and tail, focusing pressure between feet and delivering amazing float riding regular or switch. Camber provides end-to-end stability and plenty of pop for boosting off natural terrain; Banana Traction technology offers carving performance and soft-snow float. Magne-Traction improves edge grip by adding seven contact points along the running length of the board, resulting in amazing control whether riding ice or pow. Columbian Gold wood core, built from farmed wood, is ultra lightweight and strong, and features lively fibers for amazing pop. Basalt-reinforced fiberglass offers maximum board strength with minimum weight; these fibers damp board chatter and offer a lively ride. Birch internal sidewalls for added pop; external UHMW sidewalls stand up to wear and tear; sintered Teflon Titanium base is fast and low maintenance. .","short_description":"Freestyle riding isn't limited to the park. Lib Tech Attack Banana EC2 BTX snowboard is boss if you're an all-terrain freestyle maverick who also enjoys hitting big drops and floating on deep pow.","category":"Snowboarding","subcategory":"Snowboards","product_group":"All-Mountain Snowboards","thumb_url":"http://i1.avlws.com/115/s382827.png","image_url":"http://i1.avlws.com/115/l382827.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382827&tt=df","retail_price":"579.95","sale_price":"344.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382827\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382827.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858788&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
