{"sku":"858826","manufacturer_id":"59-340","brand_name":"Oakley","product_name":" Oakley A-Frame Snow Goggles - Women's","long_description":"The women's Oakley A-Frame snow goggles feature a versatile copper lens to deliver great contrast and depth perception in variable conditions, ensuring clear definition as you ride. VR28 lens has a copper tint with 28% visible light transmission (VLT), improving contrast and depth perception in a wide variety of conditions. Spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Antifog treatment along with frame and lens venting combat lens fogging, delivering clear vision in changing weather. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Durable frame is made of a conforming, flexibile plastic to ensure a comfortable fit all day long and in changing temperatures. Strap outriggers hinge to create a flush fit that minimizes gaps and distributes pressure evenly across your face. The helmet-compatible design of the women's Oakley A-Frame snow goggles fits small- to medium-size faces.","short_description":"The women's Oakley A-Frame snow goggles feature a versatile copper lens to deliver great contrast and depth perception in variable conditions, ensuring clear definition as you ride.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381087.png","image_url":"http://i1.avlws.com/115/l381087.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381087&tt=df","retail_price":"100.00","sale_price":"79.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381087\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381087.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858826&amp;link=&amp;tabs=-Details\"></script>","variants":{"8588260001":{"sku":"8588260001","vendor_sku":"59-340","upc":"700285703367","size":"VR28","color":"GRAPE WINE","retail_price":"79.93","sale_price":"79.93"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
