{"sku":"858821","manufacturer_id":"59-330","brand_name":"Oakley","product_name":"Oakley A-Frame Snow Goggles","long_description":"Featuring a gray-tinted lens for sunny days, the Oakley A-Frame snow goggles deliver clear optics and a comfortable fit so you can ride all day long. Emerald Iridium lens has a gray tint, 10% visible light transmission (VLT) and a glare-cutting mirror finish, offering neutral contrast and accurate color for sunny days. Spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Antifog treatment along with frame and lens venting combat lens fogging, delivering clear vision in changing weather. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Durable frame is made of a conforming, flexibile plastic to ensure a comfortable fit all day long and in changing temperatures. Strap outriggers hinge to create a flush fit that minimizes gaps and distributes pressure evenly across your face. The helmet-compatible design of the Oakley A-Frame snow goggles fits small- to medium-size faces.","short_description":"Featuring a gray-tinted lens for sunny days, the Oakley A-Frame snow goggles deliver clear optics and a comfortable fit so you can ride all day long.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380915.png","image_url":"http://i1.avlws.com/115/l380915.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380915&tt=df","retail_price":"130.00","sale_price":"103.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380915\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380915.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858821&amp;link=&amp;tabs=-Details\"></script>","variants":{"8588210001":{"sku":"8588210001","vendor_sku":"59-330","upc":"700285703251","size":"EMERALD IRIDIUM","color":"MATTE CARBON","retail_price":"103.93","sale_price":"103.93"}},"categories":["snow","ski-goggles","mens-ski-goggles"]}
