{"sku":"858825","manufacturer_id":"59-277","brand_name":"Oakley","product_name":"Oakley Gretchen Bleiler A-Frame Snow Goggles - Women's","long_description":"The signature series Oakley Gretchen Bleiler A-Frame snow goggles feature colors and designs chosen with input from the star snowboarder, offering distinct style and performance for the slopes. Dark Grey lens has a grey tint with 14% visible light transmission (VLT), offering neutral contrast and accurate color for sunny days in the park. Spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Antifog treatment along with frame and lens venting combat lens fogging, delivering clear vision in changing weather. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Durable frame is made of a conforming, flexibile plastic to ensure a comfortable fit all day long and in changing temperatures. Strap outriggers hinge to create a flush fit that minimizes gaps and distributes pressure evenly across your face. The helmet-compatible design of the Oakley Gretchen Bleiler A-Frame snow goggles fits small- to medium-size faces.","short_description":"The signature series Oakley Gretchen Bleiler A-Frame snow goggles feature colors and designs chosen with input from the star snowboarder, offering distinct style and performance for the slopes.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381083.png","image_url":"http://i1.avlws.com/115/l381083.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381083&tt=df","retail_price":"110.00","sale_price":"87.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381083\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381083.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858825&amp;link=&amp;tabs=-Details\"></script>","variants":{"8588250001":{"sku":"8588250001","vendor_sku":"59-277","upc":"700285674438","size":"DARK GREY","color":"HELGA","retail_price":"87.93","sale_price":"87.93"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
