{"sku":"858824","manufacturer_id":"59-084","brand_name":"Oakley","product_name":" Oakley O2 XL Snow Goggles","long_description":"Delivering a wide field of vision with a versatile lens for medium to bright light, the Oakley O2 XL snow goggles offer a large, comfortable fit, even with most prescription eyewear. Fire Iridium lens has an amber to orange tint, 12% visible light transmission (VLT) and a mirror finish, enhancing contrast and cutting glare in medium to bright light. Large cylindrical lens opens up your peripheral view for a wide field of vision. Antifog treatment along with frame and lens venting combat lens fogging, delivering clear vision in changing weather. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Durable frame is made of a flexibile plastic to ensure a comfortable fit all day long and in changing temperatures; frame has been streamlined to help expand peripheral view. Discreet frame notches at temples provide compatibility with most prescription eyewear without compromising fit. The helmet-compatible design of the Oakley O2 XL snow goggles fits medium- to large-size faces.","short_description":"Delivering a wide field of vision with a versatile lens for medium to bright light, the Oakley O2 XL snow goggles offer a large, comfortable fit, even with most prescription eyewear.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380927.png","image_url":"http://i1.avlws.com/115/l380927.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380927&tt=df","retail_price":"90.00","sale_price":"90.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380927\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380927.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858824&amp;link=&amp;tabs=-Details\"></script>","variants":{"8588240001":{"sku":"8588240001","vendor_sku":"59-084","upc":"700285654287","size":"FIRE IRIDIUM","color":"MATTE BLACK","retail_price":"90.00","sale_price":"90.00"}}}
