{"sku":"858894","manufacturer_id":"8200001","brand_name":"Dakine","product_name":"DAKINE Team Heli-Pro 18L Pack - Annie Boulanger Edition - Women's - 2013 Closeout","long_description":"Inspired by DAKINE team rider, Annie Boulanger, the Team Heli-Pro 18L snow pack carries a board or skis, goggles, hydration and a few essentials with a contoured harness designed for women. Trim design keeps the weight close to your body for balance on uneven terrain and for ease in riding chairlifts. Straps let you carry your snowboard vertically, and retractable cable carrying straps hold alpine or backcountry skis diagonally. Insulated compartment for hydration reservoir (not included) and insulated shoulder pads prevent frozen hose, ensuring convenient and reliable hydration. Fleece-lined goggles pocket protects your lenses from getting scratched; easily accessible water bottle pocket. Interior sleeve fits most 14 in. laptops for pack use off the slopes, and zippered organizer pocket offers individual sleeves to stash your phone, camera and pens. DAKINE Team Heli-Pro 18L Annie Boulanger pack features a padded hipbelt for carrying comfort; sternum strap doubles as a safety whistle. Integrated load compression straps streamline pack and keep bulkiness down. Tough fabric is lightweight, durable and water resistant. Closeout.","short_description":"Inspired by DAKINE team rider, Annie Boulanger, the Team Heli-Pro 18L snow pack carries a board or skis, goggles, hydration and a few essentials with a contoured harness designed for women.","category":"Skiing","subcategory":"Ski Packs And Bags","product_group":"Ski Packs","thumb_url":"http://i1.avlws.com/115/s376535.png","image_url":"http://i1.avlws.com/115/l376535.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376535&tt=df","keywords":"day packs","retail_price":"95.00","sale_price":"45.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376535\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376535.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858894&amp;link=&amp;tabs=-Details\"></script>","variants":{"8588940001":{"sku":"8588940001","vendor_sku":"8200001","upc":"610934675283","size":"18 LTR","color":"ANNIE BOULANGER","retail_price":"45.73","sale_price":"45.73"}},"categories":["snow","ski-packs-and-bags","ski-packs"]}
