{"sku":"858945","manufacturer_id":"1493977-6D2-822","brand_name":"Louis Garneau","product_name":" Louis Garneau Yeti 822 Snowshoes - Women's","long_description":"When steep ascents are your ticket to the summit, the Louis Garneau Yeti 822 women's snowshoes get you there. High-performance double Boa(R) closures provide a precise fit that's simple to adjust. Contact Pro harnesses with EVA padding and Boa closures wrap the feet for secure, all-around support; they accommodate any shoe, including climbing, ski and snowboard boots. Two lightweight Boa dial closures allow for quick, easy micro-adjustments for a perfect fit that eliminates pressure points and slippage. The Boa dial retention system weighs up to 80% less than traditional strapping systems; made of stainless steel, the system won't absorb water which also keeps weight low. Free-flexing pivot points help absorb shock and allow feet to rotate freely for an efficient stride with more control. Quick-release buckles at heels offer easy entry/exit. Lightweight, puncture-proof HyperDeck decking stays pliable in very cold temperatures and stands up to the elements for long-lasting use. Contoured frames have an an asymmetric shape to accommodate a women's narrow stride; 7076-T6 aircraft-grade aluminum sheds snow easily and won't rust. Decking fastening system enhances lateral traction. Lightweight V-rail stainless-steel crampons are extremely durable and ensure maximum traction uphill, downhill and traversing; heel risers reduce calf fatigue while climbing. Louis Garneau Yeti 822 women's snowshoes measure 8 x 22 in. and have a recommended load weight of 80-160 lbs.","short_description":"When steep ascents are your ticket to the summit, the Louis Garneau Yeti 822 women's snowshoes get you there. High-performance double Boa(R) closures provide a precise fit that's simple to adjust.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Women's Snowshoes","thumb_url":"http://i1.avlws.com/115/s432155.png","image_url":"http://i1.avlws.com/115/l432155.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432155&tt=df","retail_price":"250.00","sale_price":"199.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432155\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432155.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858945&amp;link=&amp;tabs=-Details\"></script>","variants":{"8589450001":{"sku":"8589450001","vendor_sku":"1493977-6D2-822","upc":"775504677422","size":"22 IN","color":"BLACK/WHITE","retail_price":"199.93","sale_price":"199.93"}}}
