{"sku":"858975","manufacturer_id":"BD120102MNGR285","brand_name":"Black Diamond","product_name":"Black Diamond Factor MX 130 Randonee Boots - Men's - 2013/2014","long_description":"The state-of-the-art freeride Black Diamond Factor MX 130 randonee boots have a patented swappable binding interface that allows the boots to be used with any randonee or alpine bindings. MX Direct Connect Alpine and AT sole blocks are included, allowing the boots to be used with all alpine and randonee bindings, including Dynafit-style bindings. MX Direct Connect technology increases lateral stiffness 70% over competitors' bolt-on sole systems, which means more precise power transmission. New Triax Pro Frame is lighter and has twice the resistance-free touring range of the previous generation Factor boots. Custom-moldable liners have articulated zones for touring comfort and smooth ankle flex; metalized foil in the strobel bases creates a reflective thermal barrier for warmth. Plastic liner tongues distribute stiffness for even forward flex; 100mm V-shaped last has a performance fit right out of the box. Four micro-adjustable buckles and a power strap on each boot close the boots securely around the feet and legs; buckles are 30% lower profile than previous version. Ski/walk switch is hassle free with a simple on/off toggle; walk mode provides a 40deg range of resistance-free motion for comfort while hiking. Black Diamond Factor MX 130 randonee boots have a flex index of 130, offering expert skiers a responsive transfer of power from boots to skis. See an REI ski shop professional to have the liners custom molded to your feet to maximize comfort and performance.","short_description":"The state-of-the-art freeride Black Diamond Factor MX 130 randonee boots have a patented swappable binding interface that allows the boots to be used with any randonee or alpine bindings.","category":"Skiing","subcategory":"Ski Boots","product_group":"Randonee Ski Boots","thumb_url":"http://i1.avlws.com/115/s461519.png","image_url":"http://i1.avlws.com/115/l461519.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461519&tt=df","retail_price":"699.00","sale_price":"699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461519\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461519.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858975&amp;link=&amp;tabs=-Details\"></script>","variants":{"8589750002":{"sku":"8589750002","vendor_sku":"BD120102MNGR275","upc":"793661190660","size":"Mondo 27.5","color":"MEAN GREEN","retail_price":"699.00","sale_price":"699.00"},"8589750003":{"sku":"8589750003","vendor_sku":"BD120102MNGR285","upc":"793661190677","size":"Mondo 28.5","color":"MEAN GREEN","retail_price":"699.00","sale_price":"699.00"}},"categories":["snow","ski-boots","randonee-ski-boots"]}
