{"sku":"858969","manufacturer_id":"BD1150680000185","brand_name":"Black Diamond","product_name":"Black Diamond AMPerage Telemark / Randonee Skis - 2013/2014","long_description":"The addition of sidewalls gives the Black Diamond AMPerage telemark/randonee skis new bite, and stiff tails make big landings easy. These skis love to drift turns in pow and lay trenches on groomers. Wide 115mm waists and camber underfoot let you transition from powder snow to hardpack; deep sidecut makes turning easy. Formula One Technology(TM) features three ribs that run the length of the skis to deliver liveliness and power for hard-charging skiing. Poplar wood core with pre-preg composite construction keeps the skis light while retaining strength and torsional stiffness. 8mm ABS sidewalls give the skis lots of acceleration out of turns and are able to withstand impacts when you launch off backcountry kickers. Full tip and tail rocker provides a playful feel for creative skiing on backcountry powder runs and lift-served groomers. Ollie Bar fiberglass layer stiffens the tails of the skis to help you land big jumps. ABS tail protectors add durability and include notches for climbing skin attachments. High-speed sintered bases on the Black Diamond AMPerage skis feature a cross-hatch stone grind for the best balance of durability, glide and maintenance. Base or topsheet color may vary from online photo.","short_description":"The addition of sidewalls gives the Black Diamond AMPerage telemark/randonee skis new bite, and stiff tails make big landings easy. These skis love to drift turns in pow and lay trenches on groomers.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s461355.png","image_url":"http://i1.avlws.com/115/l461355.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461355&tt=df","retail_price":"699.00","sale_price":"699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461355\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461355.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858969&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","skis","backcountry-skis"]}
