{"sku":"858999","manufacturer_id":"1410-148-1314","brand_name":"Voile","product_name":" Voile Artisan Splitboard - Women's - 2013/2014","long_description":"The Voile Artisan splitboard is optimized for women riders thanks to the narrow width and dialed flex pattern. This board will get you deep into the backcountry so you can find fresh, untracked lines. Unique board profile features a flat base at center for better grip while in touring mode. Camber under feet keeps you in control when turning, and the rocker from center to tip and tail gives you superior float and control in pow. Full aspen wood core is durable yet lightweight, and offers an even flex; interior and exterior sintered UHMW sidewalls offer incredible strength and durability. Sintered base is fast, durable and highly wax absorbent. Artisan splitboard offers quick conversion from uphill touring to downhill snowboarding without sacrificing performance. Hardware kit (sold separately) includes universal slider track, touring brackets, slider tracks, dual-height climbing wires and binding shims for improved uphill skinning. Universal Puck system and custom insert pattern (sold separately) let you dial in your stance width and angles. Skins sold separately. .","short_description":"The Voile Artisan splitboard is optimized for women riders thanks to the narrow width and dialed flex pattern. This board will get you deep into the backcountry so you can find fresh, untracked lines.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Splitboards","thumb_url":"http://i1.avlws.com/115/s343335.png","image_url":"http://i1.avlws.com/115/l343335.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=343335&tt=df","retail_price":"595.00","sale_price":"475.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=343335\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m343335.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858999&amp;link=&amp;tabs=-Details\"></script>","variants":{"8589990001":{"sku":"8589990001","vendor_sku":"1410-148-1314","upc":"759948908533","size":"148 CM","retail_price":"475.93","sale_price":"475.93"}}}
