{"sku":"858970","manufacturer_id":"BD1150740000188","brand_name":"Black Diamond","product_name":"Black Diamond Carbon Megawatt Telemark / Randonee Skis - 2013/2014","long_description":"Amazingly light, the Black Diamond Carbon Megawatt telemark/randonee ski is the ultimate high-performance powder touring ski, yet it will also shred inbound laps with ease on those midweek dumps. The lightweight, touring-specific version of Black Diamond's hallmark powder ski gains sidewall construction and loses another 1.1 lbs. per pair this year. Part of the FreeTour series, the Carbon Megawatt blends alpine-inspired performance with backcountry efficiency for use in deep powder. Rockered tips, semi-rockered tails and 120mm waists provide a stable feel as you float through the soft snow. Formula One Technology(TM) features three ribs that run the length of the ski to deliver liveliness and power for hard-charging skiing. 3D Sandwich Light construction layers fiberglass and carbon fiber above and below the light paulownia wood cores for excellent torsional stiffness with very little weight. 5mm beveled ABS sidewall construction with thick Power Edges keeps the skis stable at high speeds. Stainless-steel notches at the tails keep climbing skins (sold separately) securely attached and centered. High-speed sintered bases on the Black Diamond Carbon Megawatt skis feature a cross-hatch stone grind for the best balance of durability, glide and maintenance. Base or topsheet color may vary from online photo.","short_description":"Amazingly light, the Black Diamond Carbon Megawatt telemark/randonee ski is the ultimate high-performance powder touring ski, yet it will also shred inbound laps with ease on those midweek dumps.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s461359.png","image_url":"http://i1.avlws.com/115/l461359.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461359&tt=df","retail_price":"899.00","sale_price":"899.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461359\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461359.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858970&amp;link=&amp;tabs=-Details\"></script>","variants":{"8589700002":{"sku":"8589700002","vendor_sku":"BD1150740000188","upc":"793661189688","size":"188 CM","retail_price":"899.00","sale_price":"899.00"}},"categories":["snow","skis","backcountry-skis"]}
