{"sku":"858972","manufacturer_id":"BD1150670000178","brand_name":"Black Diamond","product_name":"Black Diamond Megawatt Telemark / Randonee Skis - 2013/2014","long_description":"The epic continues with the third generation of the legendary powder slayer from Black Diamond. Now with sidewalls, the Megawatt telemark/randonee skis are stable on firm snow and floaty in deep pow. The flagship ski of the Black Diamond deep-snow line, the Megawatt skis feature wide 125mm waists and supportive, crud-busting tips to make any turn at any speed. Rockered tips, semi-rockered tails and the 125mm waists provide a stable feel as you float through the soft snow. Formula One Technology(TM) features three ribs that run the length of the skis to deliver liveliness and power for hard-charging skiing. Poplar wood core with pre-preg composite construction keeps the skis light while retaining strength and torsional stiffness. 8mm ABS sidewalls give the skis lots of acceleration out of turns and are able to withstand impacts when you launch off backcountry kickers. High-speed sintered bases on the Black Diamond Megawatt skis feature a cross-hatch stone grind for the best balance of durability, glide and maintenance. ABS tail protectors add durability and include notches for climbing skin attachments. Base or topsheet color may vary from online photo.","short_description":"The epic continues with the third generation of the legendary powder slayer from Black Diamond. Now with sidewalls, the Megawatt telemark/randonee skis are stable on firm snow and floaty in deep pow.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s461399.png","image_url":"http://i1.avlws.com/115/l461399.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461399&tt=df","retail_price":"799.00","sale_price":"799.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461399\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461399.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=858972&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","skis","downhill-skis"]}
