{"sku":"859035","manufacturer_id":"L35206300","brand_name":"Salomon","product_name":"Salomon X-Tend 12 Small Snow Goggles - Women's","long_description":"Built to deliver a wide view and a comfortable fit for smaller faces, the women's Salomon X-Tend 12 Small snow goggles feature a large spherical, mirrored lens for use in bright sun. Blue lens has a 17% visible light transmission (VLT) and a multilayered mirror finish, which reduces glare and eye fatigue in bright, sunny conditions. Large spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion; minimalist frame helps extend peripheral vision. Antifog and antiscratch lens treatments help keep your vision clear and distortion-free. Strategically placed vents at sides of frame increase airflow next to lens to help reduce fogging. Dual-layer foam with moisture-wicking fleece supplies a comfortable, snug seal around your face. Secondary frame material between the frame and face foam is extremely soft and easily adapts to any face shape for improved comfort. Wide adjustable strap is backed with silicone ribbing so it stays in place, whether you're wearing a helmet or not. The helmet-compatible design of the Salomon X-Tend 12 Small snow goggles fits smaller-size faces.","short_description":"Built to deliver a wide view and a comfortable fit for smaller faces, the women's Salomon X-Tend 12 Small snow goggles feature a large spherical, mirrored lens for use in bright sun.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381091.png","image_url":"http://i1.avlws.com/115/l381091.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381091&tt=df","retail_price":"155.00","sale_price":"107.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381091\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381091.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859035&amp;link=&amp;tabs=-Details\"></script>","variants":{"8590350001":{"sku":"8590350001","vendor_sku":"L35206300","upc":"080694523863","size":"BLUE","color":"WHITE/SOLAR","retail_price":"107.83","sale_price":"107.83"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
