{"sku":"859034","manufacturer_id":"L35197400","brand_name":"Salomon","product_name":" Salomon X-Tend 10 Snow Goggles - Men's","long_description":"The Salomon X-Tend 10 snow goggles deliver a wide view, a comfortable fit and feature a spherical lens with a smudge- and scratch-minimizing mirror finish to deliver clear, crisp vision. Swamp/Lowlight frame has an orange lens with amber tint, 70% visible light transmission (VLT) and a subtle mirror finish for clear vision in low, overcast light. Black/Universal frame has an amber grey lens with an amber tint, 27% VLT and a subtle mirror finish for great vision in mixed, partly cloudy light. The highly scratch-resistant and subtle mirror treatment on the lens is easy to clean and virtually eliminates staining and smudges. Large spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion; minimalist frame helps extend peripheral vision. Antifog lens treatment helps keep your vision clear. Strategically placed vents at sides of frame increase airflow next to lens to help reduce fogging. Dual-layer foam with moisture-wicking fleece supplies a comfortable, snug seal around your face. Secondary frame material between the frame and face foam is extremely soft and easily adapts to any face shape for improved comfort. Wide adjustable strap is backed with silicone ribbing so it stays in place, whether you're wearing a helmet or not. The helmet-compatible design of the Salomon X-Tend 10 snow goggles fits medium- to large-size faces.","short_description":"The Salomon X-Tend 10 snow goggles deliver a wide view, a comfortable fit and feature a spherical lens with a smudge- and scratch-minimizing mirror finish to deliver clear, crisp vision.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380935.png","image_url":"http://i1.avlws.com/115/l380935.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380935&tt=df","retail_price":"135.00","sale_price":"93.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380935\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380935.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859034&amp;link=&amp;tabs=-Details\"></script>","variants":{"8590340001":{"sku":"8590340001","vendor_sku":"L35197400","upc":"080694319916","size":"ORANGE","color":"SWAMP/LOWLIGHT","retail_price":"93.83","sale_price":"93.83"}}}
