{"sku":"859000","manufacturer_id":"6886","brand_name":"Msr","product_name":"MSR Deploy TR-3 Snowshoe Poles - Pair","long_description":"The MSR Deploy TR-3 snowshoe poles deliver rock-solid performance to mountaineers, backcountry snowboarders and winter travelers who require compactness and quick adjustments for summit approaches. The Deploy TR-3 poles offer efficient, glove-friendly, 1-handed length adjustments at the grips; poles collapse into 3 short sections quickly and easily when not in use. The adjustment mechanisms are housed in the upper shafts creating a high center of gravity for an efficient, effortless swing. SureLock(TM) adjustment, with a positive-locking push-button mechanism, offers the confidence of absolute, nonslip performance in the field. Breakaway straps release from the grips if your pole becomes lodged; glove-friendly design lets you easily reset or adjust the straps in the field. Ergonomic dual-density polyurethane grips are highly durable and shaped to work with a broad range of hand sizes and deliver comfort on long treks. Ultralight 7000-series aluminum has an excellent strength-to-weight ratio along with durability for demanding use. MSR Deploy TR-3 grips feature a catch for raising heel lifts on your snowshoes so you don't have to bend over to do it.","short_description":"The MSR Deploy TR-3 snowshoe poles deliver rock-solid performance to mountaineers, backcountry snowboarders and winter travelers who require compactness and quick adjustments for summit approaches.","category":"Snowshoeing","subcategory":"Snowshoe Accessories","product_group":"Snowshoe Poles","thumb_url":"http://i1.avlws.com/115/s455023.png","image_url":"http://i1.avlws.com/115/l455023.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=455023&tt=df","retail_price":"159.95","sale_price":"119.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=455023\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m455023.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859000&amp;link=&amp;tabs=-Details\"></script>","variants":{"8590000002":{"sku":"8590000002","vendor_sku":"6885","upc":"040818068854","size":"Long","color":"WHITE","retail_price":"119.93","sale_price":"119.93"}},"categories":["snow","snowshoe-accessories","snowshoe-poles"]}
