{"sku":"859038","manufacturer_id":"302763","brand_name":"Dalbello","product_name":"Dalbello Kyra 85 Ski Boots - Women's - 2013/2014","long_description":"For those looking to ski again after a long hiatus and for those who are ready for their first turns, the novice-level Dalbello Kyra 85 women's ski boots welcome you to the slopes with warm liners. Women-specific fit is designed for your feet and calves; fabrics and extra insulation are selected for their softness and warmth. Soft shell material over insteps make it easy to get your feet in and out of the boots. Offering smooth flex as you turn, the 3-piece shell optimizes responsiveness; boot mold matches 4 critical fit points on your feet for precision and comfort. Lightweight, custom-moldable liners include warm insulation in the toes to boost warmth and keep your feet happy. Liners are engineered to fit correctly right out of the box, but they can be custom molded as well, a procedure best performed in an REI specialty ski shop. Plush faux fur collars add style and comfort, and cuffs can be expanded to personalize the fit in your calves. Cable instep buckle on each boot minimizes foot sliding, heel lift and shell distortion while flexing. Ski/Walk mechanisms soften the flex of the boots while you're headed toward the lift and increase the flex when you're carving turns down the hill. With a soft flex index of 85, Dalbello Kyra 85 ski boots offer light resistance against forward flex, appropriate for beginning female skiers.","short_description":"For those looking to ski again after a long hiatus and for those who are ready for their first turns, the novice-level Dalbello Kyra 85 women's ski boots welcome you to the slopes with warm liners.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382535.png","image_url":"http://i1.avlws.com/115/l382535.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382535&tt=df","retail_price":"379.95","sale_price":"303.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382535\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382535.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859038&amp;link=&amp;tabs=-Details\"></script>","variants":{"8590380005":{"sku":"8590380005","vendor_sku":"302763","size":"Mondo 26.5","color":"BLACK/ANTHRACITE","retail_price":"303.93","sale_price":"303.93"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
