{"sku":"859071","manufacturer_id":"9781594856662","product_name":" A Life On The Edge: Memories Of Everest And Beyond","long_description":"Pacific Northwest climbing legend Jim Whittaker recounts his life story in the pages of. Author: Jim Whittaker. Hardcover; 318 pages; color photographs. The Mountaineers Books; copyright: 2013. Updated edition celebrates the 50th anniversary of Whittaker's Everest ascent, includes a new foreword by Ed Viesturs, more than 100 color photos, and a new afterword. Read about his formative years climbing and guiding with his twin brother Lou in Washington, Colorado and Alaska. Join in the adventure as he becomes the first North American to reach the summit of Everest. Learn about his unexpected celebrity status upon returning home from Everest that led to an intimate relationship with the Kennedy family. Follow the growth of R.E.I. with Jim as the first employee, manager and ultimately the CEO through early years of record growth. Also tells of experiences later in life as a leader of expeditions to K2 and Everest and the historical first ascent of Mount Kennedy.","short_description":"Pacific Northwest climbing legend Jim Whittaker recounts his life story in the pages of A Life on the Edge: Memoirs of Everest and Beyond .","category":"Books And Maps","subcategory":"Adventure Books","product_group":"Biographies","thumb_url":"http://i1.avlws.com/115/s408759.png","image_url":"http://i1.avlws.com/115/l408759.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=408759&tt=df","retail_price":"24.95","sale_price":"24.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=408759\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m408759.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859071&amp;link=&amp;tabs=-Details\"></script>","variants":{"8590710001":{"sku":"8590710001","vendor_sku":"9781594856662","retail_price":"24.95","sale_price":"24.95"}},"categories":["books","adventure-books","biographies"]}
