{"sku":"859065","manufacturer_id":"L35201500","brand_name":"Salomon","product_name":"Salomon Hacker Custom Air Snow Helmet - Men's","long_description":"With super light construction, a customizable fit and fast-forward style, the Salomon Hacker Custom Air snow helmet helps protect your head on big mountain adventures and terrain park attacks. Hybrid construction combines an in-mold lower shell for reduced weight with an injected upper shell for durability and to accommodate mechanical ventilation devices. Custom Air(R) fit system easily adjusts to offer a precise, personalized fit for almost any head shape and size. Ventilation system promotes airflow to help keep you dry, cool and comfortable. Removable faux-fur liner is machine washable to help keep your helmet fresh. Removable ear pads help keep you comfortable and warm on cold days and can be left behind for warmer weather. Adjustable chin strap features padding to help eliminate chafing and improve comfort. The Salomon Hacker Custom Air snow helmet is compatible with optional audio systems (not included). This helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards.","short_description":"With super light construction, a customizable fit and fast-forward style, the Salomon Hacker Custom Air snow helmet helps protect your head on big mountain adventures and terrain park attacks.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Men's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381459.png","image_url":"http://i1.avlws.com/115/l381459.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381459&tt=df","retail_price":"120.00","sale_price":"95.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381459\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381459.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859065&amp;link=&amp;tabs=-Details\"></script>","variants":{"8590650002":{"sku":"8590650002","vendor_sku":"L35201500","upc":"080694805150","size":"M","color":"BLUE/WHITE","retail_price":"95.93","sale_price":"95.93"}},"categories":["snow","ski-helmets","mens-ski-helmets"]}
