{"sku":"859172","manufacturer_id":"722-4204","brand_name":"Dragon","product_name":" Dragon APX Snow Goggles","long_description":"With a rimless design and an oversized interchangeable lens, the Dragon APX snow goggles fit larger faces and maximize your peripheral vision so you can see all of the mountain below you. Each frame option comes with interchangeable lenses to accommodate a variety of light conditions from cloudy to sunny. Nike Grunge frame has a Red Ionized lens (bronze tint, 20-25% visible light transmission (VLT)) and a spare Yellow-Blue Ionized lens (yellow tint, 45-55% VLT). Nike Light Bone frame has a Jet Ionized lens (gray tint, 15-20% VLT) and a spare Pink Ionized lens (bronze tint, 45-60% VLT). Knight Rider frame comes with 3 lenses: Yellow-Blue Ionized lens (yellow tint, 45-55% VLT); Rose lens (rose tint, 35-40% VLT); Eclipse lens (gray tint, 5-10% VLT). Interchangeable lens design makes it easy to swap lenses to meet the conditions-simply pop the existing lens off of the frame and snap in the replacement lens. Oversized spherical lens tapers from the optical center toward the periphery for an extra-wide field of vision with minimal distortion. Double-layer lens creates a thermal barrier between the cold outside air and the warm air around your face, helping reduce fogging. Anti-fog coating on inner lens and vents in both the frame and lens further combat fogging; scratch-resistant coating protects the outer lens from getting marred. Rimless frame helps maxmize your peripheral vision; resilient polyurethane frame material stays flexible in all temperatures, ensuring your comfort when the mercury drops. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. The helmet-compatible Dragon APX snow goggles are designed to fit large-size faces.","short_description":"With a rimless design and an oversized interchangeable lens, the Dragon APX snow goggles fit larger faces and maximize your peripheral vision so you can see all of the mountain below you.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380939.png","image_url":"http://i1.avlws.com/115/l380939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380939&tt=df","retail_price":"220.00","sale_price":"153.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859172&amp;link=&amp;tabs=-Details\"></script>","variants":{"8591720001":{"sku":"8591720001","vendor_sku":"722-4219","upc":"485917200017","size":"RED IONIZED","color":"NIKE GRUNGE","retail_price":"153.83","sale_price":"153.83"},"8591720002":{"sku":"8591720002","vendor_sku":"722-4218","upc":"634741751077","size":"JET IONIZED","color":"NIKE LIGHT BONE","retail_price":"153.83","sale_price":"153.83"},"8591720003":{"sku":"8591720003","vendor_sku":"722-4204","upc":"634741750933","size":"YELLOW BLUE IONIZED","color":"KNIGHT RIDER","retail_price":"153.83","sale_price":"153.83"}}}
