{"sku":"859176","manufacturer_id":"722-4273","brand_name":"Dragon","product_name":"Dragon Rogue Snow Goggles - Women's","long_description":"Featuring a spherical lens for a wide view and a comfortable, helmet-compatible fit, the women's Dragon Rogue snow goggles are ready for your sessions on the slopes, in sun or clouds. Each frame option comes with a lens that accommodates a variety of light conditions from cloudy to sunny. Flamingos frame has a Pink Ionized lens with a bronze tint and 20-25% visible light transmission (VLT). Watercolor frame has a Jet Ionized lens with a bronze tint and 20-25% VLT. Spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Anti-fog coating on inside of lens and vents in both the frame and lens combat fogging; scratch-resistant coating protects the outside of the lens from getting marred. Resilient polyurethane frame material stays flexible in all temperatures, ensuring your comfort when the mercury drops. Strap outriggers hinge to create a flush fit that minimizes gaps and distributes pressure evenly across your face. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. The helmet-compatible Dragon Rogue women's snow goggles are designed to fit medium-size faces.","short_description":"Featuring a spherical lens for a wide view and a comfortable, helmet-compatible fit, the women's Dragon Rogue snow goggles are ready for your sessions on the slopes, in sun or clouds.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381111.png","image_url":"http://i1.avlws.com/115/l381111.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381111&tt=df","retail_price":"140.00","sale_price":"97.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381111\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381111.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859176&amp;link=&amp;tabs=-Details\"></script>","variants":{"8591760001":{"sku":"8591760001","vendor_sku":"722-4272","upc":"634741751565","size":"PINK IONIZED","color":"FLAMINGOS","retail_price":"97.83","sale_price":"97.83"},"8591760002":{"sku":"8591760002","vendor_sku":"722-4273","upc":"634741751572","size":"BLUE STEEL","color":"WATERCOLOR","retail_price":"97.83","sale_price":"97.83"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
