{"sku":"859177","manufacturer_id":"722-4255","brand_name":"Dragon","product_name":"Dragon NFX Snow Goggles - Women's","long_description":"The women's Dragon NFX snow goggles feature a rimless design and an oversized, interchangeable cylindrical lens to deliver excellent peripheral vision in a variety of light conditions. Interchangeable lenses accommodate a variety of light conditions from cloudy to sunny. Watercolor frame has a Blue Steel lens (bronze tint, 20-25% visible light transmission (VLT)) and a spare Yellow-Blue Ionized lens (yellow tint, 45-55% VLT). Interchangeable lens design makes it easy to swap lenses to meet the conditions-simply pop the existing lens off of the frame and snap in the replacement lens. Oversized cylindrical lens supplies an extra-wide field of vision. Double-layer lens creates a thermal barrier between the cold outside air and the warm air around your face, helping reduce fogging. Anti-fog coating on inner lens and vents in both the frame and lens further combat fogging; scratch-resistant coating protects the outer lens from getting marred. Rimless frame helps maxmize your peripheral vision; resilient polyurethane frame material stays flexible in all temperatures, ensuring your comfort when the mercury drops. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. The helmet-compatible Dragon NFX women's snow goggles are designed to fit large-size faces.","short_description":"The women's Dragon NFX snow goggles feature a rimless design and an oversized, interchangeable cylindrical lens to deliver excellent peripheral vision in a variety of light conditions.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381115.png","image_url":"http://i1.avlws.com/115/l381115.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381115&tt=df","retail_price":"160.00","sale_price":"111.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381115\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381115.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859177&amp;link=&amp;tabs=-Details\"></script>","variants":{"8591770001":{"sku":"8591770001","vendor_sku":"722-4255","upc":"634741751428","size":"BLUE STEEL","color":"WATERCOLOR","retail_price":"111.83","sale_price":"111.83"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
