{"sku":"859173","manufacturer_id":"722-4239","brand_name":"Dragon","product_name":" Dragon APXS Nike Edition Snow Goggles","long_description":"With a rimless design, oversized interchangeable lenses and a cool, collaborative design with Nike, the Dragon APXS Nike Edition snow goggles fit medium faces and maximize your peripheral vision. Each frame option comes with interchangeable lenses to accommodate a variety of light conditions from cloudy to sunny. Nike Splatter frame has a Gold Ionized lens (yellow tint, 20-25% visible light transmission (VLT)) and a spare Yellow-Blue Ionized lens (yellow tint, 45-55% VLT). Nike Anthracite frame has a Red Ionized lens (bronze tint, 20-25% VLT) and a spare Yellow-Blue Ionized lens (yellow tint, 45-55% VLT). Interchangeable lens design makes it easy to swap lenses to meet the conditions-simply pop the existing lens off of the frame and snap in the replacement lens. Oversized spherical lens tapers from the optical center toward the periphery for an extra-wide field of vision with minimal distortion. Double-layer lens creates a thermal barrier between the cold outside air and the warm air around your face, helping reduce fogging. Anti-fog coating on inner lens and vents in both the frame and lens further combat fogging; scratch-resistant coating protects the outer lens from getting marred. Rimless frame helps maxmize your peripheral vision; resilient polyurethane frame material stays flexible in all temperatures, ensuring your comfort when the mercury drops. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. The helmet-compatible Dragon APXS Nike Edition snow goggles are designed to fit medium-size faces.","short_description":"With a rimless design, oversized interchangeable lenses and a cool, collaborative design with Nike, the Dragon APXS Nike Edition snow goggles fit medium faces and maximize your peripheral vision.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380943.png","image_url":"http://i1.avlws.com/115/l380943.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380943&tt=df","retail_price":"220.00","sale_price":"153.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380943\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380943.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859173&amp;link=&amp;tabs=-Details\"></script>","variants":{"8591730001":{"sku":"8591730001","vendor_sku":"722-4238","upc":"634741751268","size":"GOLD IONIZED","color":"NIKE SPLATTER","retail_price":"153.83","sale_price":"153.83"}}}
