{"sku":"859251","manufacturer_id":"L36241600","brand_name":"Salomon","product_name":" Salomon X Pro 80 Ski Boots - Women's - 2103/2014","long_description":"Medium-flexing intermediate-level boots, the women's Salomon X Pro 80 ski boots offer excellent performance for steep terrain and fast turns and feature heat-moldable shells to personalize the fit. Heat-moldable shells adapt to your feet for a superior fit that eliminates pressure points and improves performance. Two-part \"Twinframe\" construction is composed of a rigid lower shell for power transmission and precision and a more supple upper shell for comfort. Rigid lower shell provides power transmission where it's needed in the heels, along the sides of the feet and in the binding contact areas. More supple upper shell offers appropriate rigidity above the instep, in the progressively flexing cuffs and in the supportive and flexing backbone of the shell. Oversize 25mm pivot between bottom shell and upper cuff results in greater transmission and power distributed throughout the sole of the boot compared to typical 8mm pivots. Pre-shaped liners grip ankles and heels without too much pressure, and custom-moldable foam conforms under feet, over insteps and along shins for superior foothold. Women-specific liners feature a wider forefoot area, low volume around the ankle and an upper cuff shaped for women's calf muscles. The women's Salomon X Pro 80 ski boots have a medium flex index, providing the responsive power transfer appropriate for intermediate skiers.","short_description":"Medium-flexing intermediate-level boots, the women's Salomon X Pro 80 ski boots offer excellent performance for steep terrain and fast turns and feature heat-moldable shells to personalize the fit.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382547.png","image_url":"http://i1.avlws.com/115/l382547.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382547&tt=df","retail_price":"399.00","sale_price":"318.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382547\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382547.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859251&amp;link=&amp;tabs=-Details\"></script>","variants":{"8592510004":{"sku":"8592510004","vendor_sku":"L36241600","upc":"887850024628","size":"Mondo 26.5","color":"PURPLE TRANSLUCENT/BLACK","retail_price":"318.93","sale_price":"318.93"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
