{"sku":"859237","manufacturer_id":"L35453300","brand_name":"Salomon","product_name":"Salomon Q-105 Skis - Men's - 2013/2014","long_description":"The Salomon Q-105 skis blend the high stability of 105mm waists with the deep-snow flotation of rockered tips and tails to create a pair of skis to slay powder and explore all off-piste terrain. Rockered profile excels in soft snow and delivers fluid performance on hardpack; when put on edge, 95% of edge length contacts the snow for precision on groomed runs. Designed for demanding skiers who require high performance, full wood core delivers direct transmission of power with precision and efficiency. Perfect for pulling off freeski maneuvers, a single-layer cap design provides precise edge grip and efficient energy transfer from skier to snow. Elastomer inserts placed over the edges absorb vibrations, resulting in a smooth ride that softens ski-to-snow contact. Tips feature a honeycomb structure that reduces weight to make the skis more maneuverable and playful. Tips are designed to slice through deep snow without hooking and decrease deflection at high speeds. Fiber reinforcements laid directly on the edges add torsional rigidity and improve edge durability, and wide metal edges withstand big impacts and improve shock resistance. The Salomon Q-105 skis require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"The Salomon Q-105 skis blend the high stability of 105mm waists with the deep-snow flotation of rockered tips and tails to create a pair of skis to slay powder and explore all off-piste terrain.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s381991.png","image_url":"http://i1.avlws.com/115/l381991.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381991&tt=df","retail_price":"599.00","sale_price":"478.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381991\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381991.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859237&amp;link=&amp;tabs=-Details\"></script>","variants":{"8592370001":{"sku":"8592370001","vendor_sku":"L35453300","upc":"080694030484","size":"174 CM","color":"BORDEAUX/BROWN","retail_price":"478.93","sale_price":"478.93"},"8592370002":{"sku":"8592370002","vendor_sku":"L35453300","upc":"080694030491","size":"181 CM","color":"BORDEAUX/BROWN","retail_price":"478.93","sale_price":"478.93"}},"categories":["snow","skis","downhill-skis"]}
