{"sku":"859274","manufacturer_id":"N276131,177","brand_name":"Fischer","product_name":" Fischer SC NIS Skate Skis","long_description":"Newcomers to skate skiing will find the Fischer SC NIS skate skis to be an able partner for developing skills and having fun. These durable skis offer a stable platform for learning and progressing. Durable wood core features air channels to lighten the skis and create a stable, yet responsive platform to develop skating technique. Volcanic basalt fibers are added to ensure a consistent flex in all temperatures. Reinforced lateral edges enhance the skis' durability over time and even out pressure distribution for uniform wax wear. Graphite bases retain wax well for good glide. Universal stone grinding glides well in all snow conditions. Movable bindings (sold separately) click securely into Nordic Integrated System (NIS) plates; quickly adjust binding position to adapt to snow conditions or terrain. NIS uses a factory-bonded plate, eliminating screws that can compromise flex.","short_description":"Newcomers to skate skiing will find the Fischer SC NIS skate skis to be an able partner for developing skills and having fun. These durable skis offer a stable platform for learning and progressing.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s381875.png","image_url":"http://i1.avlws.com/115/l381875.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381875&tt=df","retail_price":"169.95","sale_price":"135.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381875\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381875.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859274&amp;link=&amp;tabs=-Details\"></script>","variants":{"8592740001":{"sku":"8592740001","vendor_sku":"N276131,177","size":"177 CM","color":"GRAY","retail_price":"135.93","sale_price":"135.93"}}}
