{"sku":"859239","manufacturer_id":"L35526900","brand_name":"Salomon","product_name":" Salomon Bamboo Skis with Bindings - Women's - 2013/2014","long_description":"The women's advanced-level Salomon Bamboo skis with bindings fly down the frontside of the mountain with versatile 77mm waists, rockered tips and a lively construction of bamboo and titanium. 77mm waists attack groomed runs with speedy authority and perform well all over the mountain. All-terrain rockered tips excel in soft snow and deliver fluid performance on hardpack; when put on edge, 95% of edge length contacts the snow for precision on groomed runs. Designed for demanding skiers who require high performance, full wood core delivers direct transmission of power with precision and efficiency. Bamboo fibers add natural flex and pop, and single titanium laminate adds torsional rigidity and instant edge-to-edge responsiveness. Damping system enhances stability at high speeds. Elastomer inserts placed over the edges absorb vibrations. Sandwich sidewall construction offers extremely smooth ski-to-snow contact and adaptation to any terrain. Integrated bindings automatically adjust height and width at critical boot contact points, resulting in superior fit, snow feel and control. Lightweight bindings enhance energy transmission and ski responsiveness, and bindings are mounted slightly forward to accommodate a woman's center of gravity. 3 - 10 DIN range accommodates a wide range of skier abilities. Base or topsheet color may vary from online photo.","short_description":"The women's advanced-level Salomon Bamboo skis with bindings fly down the frontside of the mountain with versatile 77mm waists, rockered tips and a lively construction of bamboo and titanium.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s381999.png","image_url":"http://i1.avlws.com/115/l381999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381999&tt=df","retail_price":"599.00","sale_price":"478.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859239&amp;link=&amp;tabs=-Details\"></script>","variants":{"8592390002":{"sku":"8592390002","vendor_sku":"L35526900","upc":"080694802937","size":"162 CM","color":"WHITE/GREEN","retail_price":"478.93","sale_price":"478.93"}}}
