{"sku":"859238","manufacturer_id":"L35480300","brand_name":"Salomon","product_name":" Salomon Rocker 2 108 Skis - Men's - 2013/2014","long_description":"With 108mm waists to shred off-piste snow with stability and a rockered profile to get the most out of deep snow, the Salomon Rocker 2 108 skis are powder planks you can ski any day. 108mm waists offer more than enough flotation for epic days in bottomless powder, and they are stable enough to easily maneuver over rough, crusty, and windblown snow. Powder-rockered tips and tails deliver maximum flotation and excellent performance at high speeds. When put on edge, about 80% of the skis' edge length contacts the snow to make groomer skiing easy. Designed for demanding skiers who require high performance, full wood core delivers direct transmission of power with precision and efficiency. Perfect for pulling off freeski maneuvers, a single-layer cap design provides precise edge grip and efficient energy transfer from skier to snow. Elastomer inserts placed over the edges absorb vibrations, resulting in a smooth ride that softens ski-to-snow contact. Slightly raised tails let you ride backward and stick the occasional switch landing. Tips and tails feature a honeycomb structure that reduces weight to make the skis more maneuverable and playful. Tips are designed to slice through deep snow without hooking and decrease deflection at high speeds. Fiber reinforcements laid directly on the edges add torsional rigidity and improve edge durability, and wide metal edges withstand big impacts and improve shock resistance. Edge-free tips and tails pivot smoothly through turns and resist catching in deep snow. 108mm waists of the Salomon Rocker 2 108 skis require binding with wide brakes. Base or topsheet color may vary from online photo.","short_description":"With 108mm waists to shred off-piste snow with stability and a rockered profile to get the most out of deep snow, the Salomon Rocker 2 108 skis are powder planks you can ski any day.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s381995.png","image_url":"http://i1.avlws.com/115/l381995.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381995&tt=df","retail_price":"649.00","sale_price":"518.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381995\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381995.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859238&amp;link=&amp;tabs=-Details\"></script>","variants":{"8592380001":{"sku":"8592380001","vendor_sku":"L35480300","upc":"080694931583","size":"174 CM","color":"WHITE/BLUE/BLACK","retail_price":"518.93","sale_price":"518.93"},"8592380002":{"sku":"8592380002","vendor_sku":"L35480300","upc":"080694967445","size":"182 CM","color":"WHITE/BLUE/BLACK","retail_price":"518.93","sale_price":"518.93"}},"categories":["snow","skis","downhill-skis"]}
