{"sku":"859263","manufacturer_id":"AI5006620","brand_name":"Atomic","product_name":" Atomic Sport Skate Boots - Men's","long_description":"The Atomic Sport Skate boots provide lively response, a precise fit and exceptional comfort. A stiff flex channels energy to produce a dynamic kick. Easy-pull quick laces snugly enclose the forefeet in one easy motion, and lock down to optimize support; adjustable external heel straps provide personalized heel hold. Internal, memory-foam heel pads are shaped to ensure comfortable heel hold; external heel counters support and stabilize the heels, and counter pronation and supination. Water-resistant, non-bulky Thinsulate(R) insulation helps keep your feet warm, and does not pack out or compress like other insulation fibers can. Hinged cuffs with adjustable cuff straps lock feet in boots and offer solid lateral support while allowing uninhibited forward movement. Lace covers with center zipper protect quick laces from getting caked with snow. Atomic Sport Skate boots have a 104mm sport-last width which offers a precise fit with a high comfort factor. SNS Pilot Sport outsoles allow natural flex and securely cradle feet for reliable support.","short_description":"The Atomic Sport Skate boots provide lively response, a precise fit and exceptional comfort. A stiff flex channels energy to produce a dynamic kick.","category":"Skiing","subcategory":"Ski Boots","product_group":"Cross-Country Ski Boots","thumb_url":"http://i1.avlws.com/115/s456891.png","image_url":"http://i1.avlws.com/115/l456891.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456891&tt=df","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456891\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456891.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859263&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
