{"sku":"859240","manufacturer_id":"L35527100","brand_name":"Salomon","product_name":" Salomon Lava Skis with Bindings - Women's - 2013/2014","long_description":"Tip-rockered skis for intermediate skiers, the women's Salomon Lava skis with bindings offer sleek looks, a smooth ride and enough stability for you to take on the whole mountain. All-terrain rockered tips excel in soft snow and deliver fluid performance on hardpack. When put on edge, 95% of the skis' edge length contacts the snow for precision on groomed runs. Composite foam core damps vibrations to keep the ride smooth, and its responsive feel allows for precise control. Bamboo fibers add natural flex and pop, and single titanium laminate adds torsional rigidity and instant edge-to-edge responsiveness. Damping system enhances stability at high speeds. Elastomer inserts placed over the edges absorb vibrations, resulting in a smooth ride that softens ski-to-snow contact. Integrated bindings automatically adjust height and width at critical boot contact points, resulting in superior fit, snow feel and control. Lightweight bindings enhance energy transmission and ski responsiveness, and bindings are mounted slightly forward to accommodate a woman's center of gravity. 3 - 10 DIN range accommodates a wide range of skier abilities. Base or topsheet color may vary from online photo.","short_description":"Tip-rockered skis for intermediate skiers, the women's Salomon Lava skis with bindings offer sleek looks, a smooth ride and enough stability for you to take on the whole mountain.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382003.png","image_url":"http://i1.avlws.com/115/l382003.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382003&tt=df","retail_price":"499.00","sale_price":"398.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382003\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382003.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859240&amp;link=&amp;tabs=-Details\"></script>","variants":{"8592400002":{"sku":"8592400002","vendor_sku":"L35527100","upc":"080694803132","size":"159 CM","color":"BLACK/RED","retail_price":"398.93","sale_price":"398.93"}},"categories":["snow","skis","downhill-skis"]}
