{"sku":"859392","manufacturer_id":"RBC3030","brand_name":"Rossignol","product_name":" Rossignol Alltrack Pro 130 Ski Boots - Men's - 2013/2014","long_description":"Combining stellar downhill performance with a ski/hike mode to make climbing easy, the Rossignol Alltrack Pro 130 ski boots are stiff boots with snug lasts for advanced skiers hiking the backcountry. Ski/hike mode uses a specialized technology to create a large range of motion in shells for hiking uphill and walking to and from lifts. Snug 100mm footbeds balance comfort with performance. Grid pattern on shells improves fit, maintains powerful responsiveness and shaves off extra weight to make the boots lighter and easier to ski. An insert made of more flexible material is included at the instep, making it easier to pull the boot on and off. Newly designed liners comfortably wrap feet with excellent support and include Thinsulate(TM) insulation to boost warmth. The Rossignol Alltrack Pro 130 ski boots offer a stiff flex index of 130 that provides a responsive power transfer advanced skiers prefer. Optional rockered soles for AT bindings (sold separately) make walking and hiking more comfortable.","short_description":"Combining stellar downhill performance with a ski/hike mode to make climbing easy, the Rossignol Alltrack Pro 130 ski boots are stiff boots with snug lasts for advanced skiers hiking the backcountry.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s451495.png","image_url":"http://i1.avlws.com/115/l451495.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451495&tt=df","retail_price":"649.95","sale_price":"649.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451495\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451495.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859392&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
