{"sku":"859336","manufacturer_id":"S130304401159","brand_name":"K2","product_name":"K2 Empress Skis - Women's - 2013/2014","long_description":"Ready to learn how to ski the terrain park or half-pipe? The women's K2 Empress skis offer lively, lightweight durability and a flex designed for tricks. K2 women's skis reduce the bulk and weight of all components to create very lightweight skis suited to the specific needs of female skiers. Bioflex2 core combines aspen, paulownia and bamboo woods to deliver light weight, responsive performance and a smooth flex for tail presses and tricks in the park. A rockered profile designed to tame the terrain park features elevated tips and tails and zero camber underfoot for sliding rails and spinning in the air. A fiberglass weave around the wood core provides torsional stiffness for highly responsive turning. Cap construction contributes to light skis that are easy to maneuver. Directional twin tip heavily favors skiing forward but allows you to ski and land jumps backward if needed. Metal tip plates and tail rivets withstand hard landings. Base or topsheet color on the women's K2 Empress skis may vary from online photo.","short_description":"Ready to learn how to ski the terrain park or half-pipe? The women's K2 Empress skis offer lively, lightweight durability and a flex designed for tricks.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382067.png","image_url":"http://i1.avlws.com/115/l382067.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382067&tt=df","retail_price":"299.95","sale_price":"179.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382067\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382067.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859336&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593360002":{"sku":"8593360002","vendor_sku":"S130304401159","upc":"886745165279","size":"159 CM","retail_price":"179.93","sale_price":"179.93"}},"categories":["snow","skis","downhill-skis"]}
