{"sku":"859376","manufacturer_id":"RRC06EB","brand_name":"Rossignol","product_name":"Rossignol Temptation 76 Skis with Bindings - Women's - 2012/2013","long_description":"Charge down steep terrain on the intermediate-level Rossignol Temptation 76 women's skis with bindings. Nimble waists and easy-to-turn rockered tips and tails will put a perma-grin on your face. Subtle rocker in tips and tails offers easy steering in any snow conditions, and traditional camber underfoot provides reliable edge grip on groomed runs. Wood cores create light skis that transmit the feel of the snow and put you in touch with the terrain. Aramide laminates enhance stiffness and add a lively pop to the skis when you're coming out of turns. Extended sidecut works with the rockered tips and tails to provide full engagement of edges during turns at high speeds and easy maneuverability at low speeds. Integrated bindings are designed for ease of use and comfort; lightweight composite materials ease turn initiation for effortless skiing. Integrated bindings feature DIN 3.5 - 11 release settings, a range suited to intermediate or advanced skiers at medium to high speeds. Base or topsheet color may vary from online photo.","short_description":"Charge down steep terrain on the intermediate-level Rossignol Temptation 76 women's skis with bindings. Nimble waists and easy-to-turn rockered tips and tails will put a perma-grin on your face.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382127.png","image_url":"http://i1.avlws.com/115/l382127.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382127&tt=df","retail_price":"499.95","sale_price":"299.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382127\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382127.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859376&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593760001":{"sku":"8593760001","vendor_sku":"RRC06EB","size":"146 CM","retail_price":"299.93","sale_price":"299.93"}},"categories":["snow","skis","downhill-skis"]}
