{"sku":"859383","manufacturer_id":"RACQG02","brand_name":"Rossignol","product_name":" Rossignol Star 7 Skis - Women's - 2013/2014","long_description":"Fat planks for epic powder days, the newly designed Rossignol Star 7 women's skis feature lightweight construction combined with responsive powder-specific rocker to surf the sidecountry. Float like a feather on top of deep snow thanks to the rockered tips and tails; redesigned Powder Turn rocker minimizes the tendency of tips to flap at high speeds. Easy-to-turn honeycomb tip and tail are significantly lighter than previous models; you can actually see the light pass through the air-filled spaces in the honeycomb. You'll really appreciate the weight savings when the Star 7s are strapped to your pack and you hike up the ridge to get first tracks. The responsive strength of the skis shines when dropping into steep terrain, smearing a pillow line, and straight-lining it back to the base. Standard camber underfoot offers tenacious edge-grip on hardpack; there's more than enough camber to enjoy carving on groomers. The Star 7s feel extra smooth, especially at high speeds, thanks to the visco elastomer in the tip and tail that absorbs shock and resists chatter. 116mm waists require bindings with wide brakes. Base or topsheet color may vary from photo.","short_description":"Fat planks for epic powder days, the newly designed Rossignol Star 7 women's skis feature lightweight construction combined with responsive powder-specific rocker to surf the sidecountry.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382147.png","image_url":"http://i1.avlws.com/115/l382147.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382147&tt=df","retail_price":"749.95","sale_price":"449.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382147\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382147.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859383&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593830001":{"sku":"8593830001","vendor_sku":"RACQG02","size":"170 CM","retail_price":"449.93","sale_price":"449.93"},"8593830002":{"sku":"8593830002","vendor_sku":"RACQG02","size":"178 CM","retail_price":"449.93","sale_price":"449.93"}}}
