{"sku":"859329","manufacturer_id":"S120305601167","brand_name":"K2","product_name":" K2 BackDrop Telemark / Randonee Skis - 2013/2014","long_description":"Built with the lightweight construction of the K2 WayBack skis, the K2 BackDrop telemark/randonee skis have chubbier waists to conquer the deepest pow and leave you with energy for a second lap. All-terrain rocker features elevated tips that float through powder snow with ease; traditional camber underfoot ensures good power and edge hold on firm snow. Cores combine aspen, paulownia and maple woods to create skis that are stable and predictable underfoot and light and soft in the tips and tails. Located at the tips and tails, a weave of carbon improves responsiveness and edge grip without adding much weight. Triaxial braiding wraps an interlocking fiberglass weave around the wood core providing torsional stiffness, responsive turning and high sensitivity. Cap construction envelops the cores and internal materials with the top layers of the skis, keeping overall weight light and durability high. Powder tips place the widest point of the skis farther back than on other K2 skis, making the skis more stable and predictable in variable snow conditions. Top sheets feature a hydrophobic material similar to what is used on the bases to prevent snow from sticking and building up while you're skinning. Flat tails let you easily plunge your skis into firm snow when building anchors or staking out a tent. Low-profile tip grommets accommodate Z-Clip attachments on K2 climbing skins (sold separately). Concave notches in the tails of the K2 BackDrop skis keep non-K2-brand skins securely centered on the tails. Base or topsheet color may vary from online photo.","short_description":"Built with the lightweight construction of the K2 WayBack skis, the K2 BackDrop telemark/randonee skis have chubbier waists to conquer the deepest pow and leave you with energy for a second lap.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s381799.png","image_url":"http://i1.avlws.com/115/l381799.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381799&tt=df","retail_price":"699.95","sale_price":"489.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381799\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381799.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859329&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593290001":{"sku":"8593290001","vendor_sku":"S120305601167","upc":"886745213673","size":"167 CM","retail_price":"489.93","sale_price":"489.93"},"8593290002":{"sku":"8593290002","vendor_sku":"S120305601174","upc":"886745019138","size":"174 CM","retail_price":"489.93","sale_price":"489.93"},"8593290003":{"sku":"8593290003","vendor_sku":"S120305601181","upc":"886745019152","size":"181 CM","retail_price":"489.93","sale_price":"489.93"}},"categories":["snow","skis","backcountry-skis"]}
