{"sku":"859317","manufacturer_id":"S131900901235","brand_name":"K2","product_name":" K2 SpYre 100 Ski Boots - Women's - 2013/2014","long_description":"Ideal for strong intermediates, the women's K2 SpYre 100 ski boots use an innovative spine design, rivet-free technology and top-notch liners ideal for all-mountain skiing in varied conditions. Innovative rigid spine connects cuff to shell without traditional rivets to smooth out the flex of the boots and provide lateral stiffness for performance on uneven terrain. Rigid spines allow the use of soft plastic in the cuffs and shells to damp vibrations in rough terrain and make boots easier to put on when it's cold. LuxFit INTUITION(R) liners offer a precise fit out of the box, but can be custom molded using a heat treatment. Women-specific last features narrow heels, a lower cuff for a comfortable calf fit and overall lower volume to maximize comfort and performance. Asymmetric tongues enhance fit and offer a soft feel while you flex your knees into the turn, and adjustable spoilers allow you to personalize the angle of forward lean. Rubberized outsole pads between toes and heels increase traction when walking on rocks or riding on snowmobiles. The women's K2 SpYre 100 ski boots offer a medium flex suited to strong intermediate skiers.","short_description":"Ideal for strong intermediates, the women's K2 SpYre 100 ski boots use an innovative spine design, rivet-free technology and top-notch liners ideal for all-mountain skiing in varied conditions.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382563.png","image_url":"http://i1.avlws.com/115/l382563.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382563&tt=df","retail_price":"499.95","sale_price":"299.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382563\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382563.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859317&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593170004":{"sku":"8593170004","vendor_sku":"S131900901265","upc":"886745205241","size":"Mondo 26.5","color":"WHITE/PURPLE","retail_price":"299.93","sale_price":"299.93"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
