{"sku":"859373","manufacturer_id":"RACQG01","brand_name":"Rossignol","product_name":" Rossignol Super 7 Skis - Men's - 2013/2014","long_description":"Built with 114mm waists, the Rossignol Super 7 skis charge freshly fallen powder with surfy rockered tips and tails and a lightweight, honeycomb construction that makes them easy to turn. Please note that these skis do not include bindings. The Super 7 skis are right at home lapping freshly fallen powder or blasting through crud, but they also carve well on hardpack snow and groomed runs. Float like a feather on top of deep snow thanks to the rockered tips and tails; redesigned Powder Turn rocker minimizes the tendency of tips to flap at high speeds. Easy-to-turn honeycomb tip and tail are significantly lighter than previous models; you can actually see the light pass through the air-filled spaces in the honeycomb. You'll really appreciate the weight savings when the Super 7 skis are strapped to your pack and you hike up the ridge to get first tracks. The responsive strength of the skis shines when dropping into steep terrain, negotiating a technical line, and straight-lining it back to the base. Standard camber underfoot offers tenacious edge-grip on hardpack; there's more than enough camber to enjoy carving on groomers. The Super 7 skis feel extra smooth, especially at high speeds, thanks to the visco elastomer in the tip and tail that absorbs shock and resists chatter. 114mm waists require bindings with wide brakes. Base or topsheet color may vary from photo.","short_description":"Built with 114mm waists, the Rossignol Super 7 skis charge freshly fallen powder with surfy rockered tips and tails and a lightweight, honeycomb construction that makes them easy to turn.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s442611.png","image_url":"http://i1.avlws.com/115/l442611.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442611&tt=df","retail_price":"749.95","sale_price":"749.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442611\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442611.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859373&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593730001":{"sku":"8593730001","vendor_sku":"RACQG01","size":"180 CM","retail_price":"749.95","sale_price":"749.95"},"8593730002":{"sku":"8593730002","vendor_sku":"RACQG01","size":"188 CM","retail_price":"749.95","sale_price":"749.95"}},"categories":["snow","skis","downhill-skis"]}
