{"sku":"859328","manufacturer_id":"S130311801174","brand_name":"K2","product_name":" K2 COOMBAck Telemark / Randonee Skis - 2013/2014","long_description":"Doug Coombs' legendary spirit lives on in K2 COOMBAck telemark/randonee skis. The 102mm-wide waists strike the perfect balance for all-conditions backcountry skiiing. This second graphic in a series of three portrays Doug's days pioneering heliskiing in the Chugach Mountains of Alaska. Balanced flex pattern and generous 102mm waists create excellent flotation and easy handling on steep slopes and difficult snow conditions. All-terrain rocker features elevated tips that float through powder snow with ease; traditional camber underfoot ensures good power and edge hold on firm snow. Fir/aspen/maple wood cores produce a natural flex, allowing the skis to achieve full contact with the snow throughout the turn. Triaxial braiding wraps an interlocking fiberglass weave around the wood cores; results in torsional stiffness, responsive turning and sensitivity. Located at the tips and tails, a weave of carbon improves responsiveness and edge grip without adding much weight. Cap construction envelops the cores and internal materials with the top layers of the skis, keeping overall weight light and durability high. Powder tips place the widest point of the skis farther back than on other K2 skis, making the skis more stable and predictable in variable snow conditions. Top sheets feature a hydrophobic material similar to what is used on the bases to prevent snow from sticking and building up while you're skinning. Flat tails let you easily plunge your skis into firm snow when building anchors or staking out a tent. Low-profile tip grommets accommodate Z-Clip attachments on K2 climbing skins (sold separately); concave notches in the tails keep non-K2-brand skins centered on the tails. Holes drilled in the tips and tails facilitate building a rescue sled or constructing a ski anchor. Base or topsheet color may vary from online photo.","short_description":"Doug Coombs' legendary spirit lives on in K2 COOMBAck telemark/randonee skis. The 102mm-wide waists strike the perfect balance for all-conditions backcountry skiiing.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s381795.png","image_url":"http://i1.avlws.com/115/l381795.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381795&tt=df","retail_price":"649.95","sale_price":"454.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381795\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381795.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859328&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593280001":{"sku":"8593280001","vendor_sku":"S130311801167","upc":"886745206125","size":"167 CM","retail_price":"454.93","sale_price":"454.93"},"8593280002":{"sku":"8593280002","vendor_sku":"S130311801174","upc":"886745206149","size":"174 CM","retail_price":"454.93","sale_price":"454.93"},"8593280003":{"sku":"8593280003","vendor_sku":"S130311801181","upc":"886745206163","size":"181 CM","retail_price":"454.93","sale_price":"454.93"}}}
