{"sku":"859381","manufacturer_id":"RACEH03","brand_name":"Rossignol","product_name":" Rossignol Temptation 88 Skis - Women's - 2013/2014","long_description":"With stiff laminates in the core to smooth the ride, the advanced-level Rossignol Temptation 88 women's skis use tip and tail rocker to readily take an edge on groomers and shred through soft snow. Poplar wood core creates light and lively skis that transmit the feel of the snow and put you in touch with the terrain, and stiff basalt laminates reduce vibrations. Varying shapes of laminates reduce the weight of the tips, making them easier to control. Layered laminates in tips also smooth out turn initiation, improve edge contact during turns and increase side-to-side response. Subtle rocker in tips and tails offers easy steering in any snow conditions, and traditional camber underfoot provides tenacious edge grip. Extended sidecut continues beyond the rockered tips and tails, providing full engagement of ski edges during turns at high speeds and easy maneuverability at low speeds. Vertical sidewalls deliver excellent power transfer for superb grip on hardpack snow. Base or topsheet color may vary from online photo.","short_description":"With stiff laminates in the core to smooth the ride, the advanced-level Rossignol Temptation 88 women's skis use tip and tail rocker to readily take an edge on groomers and shred through soft snow.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382139.png","image_url":"http://i1.avlws.com/115/l382139.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382139&tt=df","retail_price":"599.95","sale_price":"359.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382139\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382139.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859381&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593810002":{"sku":"8593810002","vendor_sku":"RACEH03","size":"162 CM","retail_price":"359.93","sale_price":"359.93"}}}
