{"sku":"859344","manufacturer_id":"S130312101160","brand_name":"K2","product_name":" K2 TalkBack Telemark / Randonee Skis - Women's - 2013/2014","long_description":"With rockered tips and progressive sidecut, the K2 TalkBack randonee/telemark skis are as adept going up a hill as they are coming down through deep fresh snow in the backcountry. All-terrain rocker features elevated tips that float through powder snow with ease; traditional camber underfoot ensures good power and edge hold on firm snow. Cores combine aspen, paulownia and bamboo woods to create skis that are stable and predictable underfoot and light and soft in the tips and tails. Located at the tips and tails, a weave of carbon improves responsiveness and edge grip without adding much weight. Cap construction envelops the cores and internal materials, keeping overall weight light and durability high. Progressive sidecut produces different curve shapes along different parts of the skis-more aggressive in the tips, less aggressive in the tails. The progressive sidecut results in confident, quick turn initiation in hard snow and easy release in crud and powder. Top sheets feature a hydrophobic material similar to that used on the bases to prevent snow from sticking and building up while you're skinning. Low-profile tip grommets use a durable rubber coating to disguise slits designed to accommodate Z-Clip attachments on K2 climbing skins (sold separately). Flat tails let you easily plunge your skis into firm snow when building anchors or staking out a tent. Concave notches in the tails of the K2 TalkBack skis keep non-K2-brand skins securely centered on the tails. Base or topsheet color may vary from online photo.","short_description":"With rockered tips and progressive sidecut, the K2 TalkBack randonee/telemark skis are as adept going up a hill as they are coming down through deep fresh snow in the backcountry.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s381803.png","image_url":"http://i1.avlws.com/115/l381803.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381803&tt=df","retail_price":"599.95","sale_price":"359.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381803\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381803.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859344&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593440002":{"sku":"8593440002","vendor_sku":"S130312101160","upc":"886745206385","size":"160 CM","retail_price":"359.93","sale_price":"359.93"},"8593440003":{"sku":"8593440003","vendor_sku":"S130312101167","upc":"886745206408","size":"167 CM","retail_price":"359.93","sale_price":"359.93"}},"categories":["snow","skis","backcountry-skis"]}
