{"sku":"859380","manufacturer_id":"RACQJ02","brand_name":"Rossignol","product_name":" Rossignol Saffron 7 Skis - Women's - 2013/2014","long_description":"Light like a pair of backcountry touring skis but designed for the resort with rockered tips and tails, the women's Rossignol Saffron 7 skis take on any terrain on the mountain in any snow condition. The Saffron 7 skis are right at home lapping freshly fallen powder or blasting through crud, and they carve responsively on hardpack snow and groomed runs. Float like a feather on top of deep snow thanks to the rockered tips and tails; redesigned Powder Turn rocker minimizes the tendency of tips to flap at high speeds. Standard camber underfoot offers tenacious edge-grip on hardpack; there's more than enough camber to enjoy carving on groomers. Lightweight wood core strikes a balance between manueverability and strength. You'll really appreciate the weight savings when the Saffron 7 skis are strapped to your pack and you hike up the ridge to get first tracks. The responsive strength of the skis shines when dropping into steep terrain, negotiating a technical line, and straight-lining it back to the base. 98mm waists require bindings with wide brakes. Base or topsheet color may vary from photo.","short_description":"Light like a pair of backcountry touring skis but designed for the resort with rockered tips and tails, the women's Rossignol Saffron 7 skis take on any terrain on the mountain in any snow condition.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382135.png","image_url":"http://i1.avlws.com/115/l382135.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382135&tt=df","retail_price":"599.95","sale_price":"359.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382135\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382135.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859380&amp;link=&amp;tabs=-Details\"></script>","variants":{"8593800002":{"sku":"8593800002","vendor_sku":"RACQJ02","size":"170 CM","retail_price":"359.93","sale_price":"359.93"}}}
