{"sku":"859434","manufacturer_id":"1603801","brand_name":"Cateye","product_name":" CatEye Strada Slim Bike Computer","long_description":"The CatEye Strada Slim bike computer is a slimmed-down version of the popular Strada Wireless computer. It delivers all the same useful speed and distance data in a sleeker package. Slim computer unit is 35% thinner and lighter than the original Strada Wireless bike computer yet the screen size is 23% larger for easy viewing. Functions include current, average and maximum speed, trip distance, odometer, elapsed time, stop watch, clock and dual-tire size recognition. Additional features include average speed pacing, automatic start/stop, power-saving and sleep modes, and low battery alarm for both computer head and sensor. Slim speed sensor can be placed on the inside of the front fork of your bike so it's virtually out of sight. Large font size and customizable screen makes it easy to read trip details with a quick glance; display can be programmed to meet your preferences. Slim speed sensor requires the clearance between the front fork and spokes to be 12 - 17mm; Slim computer is also compatible with the SPD-01 sensor if your clearance is larger. CatEye Strada Slim bike computer comes with a CR1616 battery for the computer and a CR2032 battery for the speed sensor.","short_description":"The CatEye Strada Slim bike computer is a slimmed-down version of the popular Strada Wireless computer. It delivers all the same useful speed and distance data in a sleeker package.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375239.png","image_url":"http://i1.avlws.com/115/l375239.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375239&tt=df","retail_price":"70.00","sale_price":"70.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375239\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375239.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859434&amp;link=&amp;tabs=-Details\"></script>","variants":{"8594340001":{"sku":"8594340001","vendor_sku":"1603801","upc":"725012025093","color":"BLACK","retail_price":"70.00","sale_price":"70.00"}}}
