{"sku":"859427","manufacturer_id":"05081700 100","brand_name":"Nordica","product_name":" Nordica The Ace Junior Ski Boots - Boys' - 2013-2014","long_description":"Perfect for up-and-coming freestylers who spend their time in the terrain park, Nordica The Ace Junior ski boots offer the shock-absorbent features of adult boots in a smaller size. Nordica The Ace Junior ski boots feature a 3-piece shell construction that makes it easy to get feet into boots. Boots flex lightly at first, then as you put greater pressure on tongues during the turn, the resistance increases and enhances precision. After flexing, boots return to upright position, setting skis up for the next turn. Middle buckles clamp down on feet at a 45deg angle to keep heels securely seated and increase comfort in the forefeet. Shock-absorbent technology helps kids hone their park-and-pipe skills while staying comfortable. Additional padding in the tongues and cuffs absorbs shock and damps vibrations, making the ride smooth and easy. Kids' liners feature soft padding and warm fleecy linings. Loops on tongues aid in putting the boots on and taking them off. Flex index of 90 offers resistance appropriate for young skiers.","short_description":"Perfect for up-and-coming freestylers who spend their time in the terrain park, Nordica The Ace Junior ski boots offer the shock-absorbent features of adult boots in a smaller size.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s451499.png","image_url":"http://i1.avlws.com/115/l451499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451499&tt=df","keywords":"jstp7615","retail_price":"249.00","sale_price":"173.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859427&amp;link=&amp;tabs=-Details\"></script>","variants":{"8594270003":{"sku":"8594270003","vendor_sku":"05081700 100","upc":"885315607638","size":"Mondo 24.5","color":"BLACK","retail_price":"173.83","sale_price":"173.83"}}}
