{"sku":"859441","manufacturer_id":"LBC2100","brand_name":"Lange","product_name":" Lange RX 100 Ski Boots - Men's - 2013/2014","long_description":"The intermediate-level Lange RX 100 ski boots blend a medium flex with snug footbeds so you can comfortably ski hard all day on steep slopes without feeling like your feet are stuck in a vice. With a medium flex index, Lange RX 100 ski boots provide the responsive power transfer preferred by aggressive intermediate skiers. Shells, liners and snug, 100mm footbeds are based on a composite scan of thousands of skiers' feet for anatomic accuracy and comfort. Shells are designed to create a centered, balanced stance on rockered skis to increase efficiency of technique and reduce fatigue. Uniform-density plastic shells ensure highly efficient power transfer, smooth flex and finely-tuned responsiveness, even in frigid temperatures. Control Fit liners conform to your feet for a comfortable, high-performance fit; liners may be custom molded using a heat treatment. Specially designed insteps provide an excellent fit at the midfoot, resulting in increased circulation and greater warmth. 1-piece toe boxes and tongues eliminate seams and overlaps in the tongue-attachment area to reduce pressure points at the instep and top of the toes. Rubber soles offer excellent grip.","short_description":"The intermediate-level Lange RX 100 ski boots blend a medium flex with snug footbeds so you can comfortably ski hard all day on steep slopes without feeling like your feet are stuck in a vice.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382615.png","image_url":"http://i1.avlws.com/115/l382615.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382615&tt=df","retail_price":"499.95","sale_price":"499.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382615\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382615.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859441&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","downhill-ski-boots"]}
