{"sku":"859450","manufacturer_id":"FCCW107","brand_name":"Look","product_name":"Look XM 13 S C100 Randonee Bindings - 2013/2014","long_description":"With the feel of alpine bindings and the ability to tour the backcountry, the Look XM 13 S C100 randonee bindings let you go from the resort straight to the backcountry in search of fresh lines. Low binding height, a wide footprint and very high stiffness create the same performance as an alpine binding to give you the confidence to ski the most challenging terrain. Switching from touring mode to ski mode and back again is accomplished with a simple flick of your ski pole and can be done with the skis on your feet. Aggressive skiers who like to cruise at high speeds will appreciate the adjustable DIN that ranges from 5 to 13. Bindings have a low overall stand height for great stability while skiing. Bindings include 100mm wide brakes to fit your wide all-mountain skis. Flip the climbing bars up with a ski pole to take some stress off your legs when you're skinning uphill; two different positions let you choose the height that works for you. Look XM 13 S C100 randonee bindings fit boot sizes with sole lengths ranging from 265 - 320mm; bindings are only compatible with boots with alpine DIN soles or WTR soles.","short_description":"With the feel of alpine bindings and the ability to tour the backcountry, the Look XM 13 S C100 randonee bindings let you go from the resort straight to the backcountry in search of fresh lines.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Randonee Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381695.png","image_url":"http://i1.avlws.com/115/l381695.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381695&tt=df","retail_price":"379.95","sale_price":"379.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381695\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381695.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859450&amp;link=&amp;tabs=-Details\"></script>","variants":{"8594500001":{"sku":"8594500001","vendor_sku":"FCCW107","color":"BLACK/WHITE","retail_price":"379.95","sale_price":"379.95"}},"categories":["snow","ski-bindings","randonee-ski-bindings"]}
