{"sku":"859444","manufacturer_id":"LBC2010","brand_name":"Lange","product_name":"Lange RX 130 LV Ski Boots - Men's - 2013/2014","long_description":"Offering advanced skiers low-volume, narrow footbeds to enhance precision, the Lange RX 130 LV ski boots use uniform-density plastic shells to deliver powerful big-mountain performance. A stiff flex offers expert skiers a responsive transfer of power from boot to ski. Uniform-density plastic shells ensure highly efficient power transfer, smooth flex and finely-tuned responsiveness, even in frigid temperatures. Shells, liners and narrow 97mm footbeds are based on a composite scan of thousands of skiers' feet for anatomic accuracy and comfort. Shells are designed to create a centered, balanced stance on rockered skis to increase efficiency of technique and reduce fatigue. Control Fit liners conform to your feet for a comfortable, high-performance fit; liners may be custom molded using a heat treatment. Specially designed insteps provide an excellent fit at the midfoot, resulting in increased circulation and greater warmth. 1-piece toe boxes and tongues eliminate seams and overlaps in the tongue-attachment area to reduce pressure points at the instep and top of the toes. Elastic 40mm power straps; rubber soles offer excellent grip.","short_description":"Offering advanced skiers low-volume, narrow footbeds to enhance precision, the Lange RX 130 LV ski boots use uniform-density plastic shells to deliver powerful big-mountain performance.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382619.png","image_url":"http://i1.avlws.com/115/l382619.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382619&tt=df","retail_price":"649.95","sale_price":"649.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382619\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382619.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859444&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","downhill-ski-boots"]}
