{"sku":"859447","manufacturer_id":"LBC6200","brand_name":"Lange","product_name":" Lange SX 90 W Ski Boots - Women's - 2013/2014","long_description":"Combining a medium, intermediate-level flex with roomy footbeds, the Lange SX 90 W women's ski boots emphasize precision as you take on steeper terrain and faster turns. Roomy, 102mm footbeds offer a comfortable fit and can accommodate wide feet. Medium flex index provides a power transfer suited to aggressive intermediate skiers looking to expand their skills. Uniform-density plastic shells ensure highly efficient power transfer, smooth flex and finely-tuned responsiveness, even in frigid temperatures. Shells are designed to create a centered, balanced stance on rockered skis to increase efficiency of technique and reduce fatigue. Liners comfortably contour your feet and precisely match the internal shape of the shells to create instant responsiveness; they may be custom molded using a heat treatment. Women-specific fit with anatomically shaped liners and upper cuffs accommodates narrow heels and low calf muscles. 1-piece toe boxes and tongues eliminate seams and overlaps in the tongue-attachment areas to reduce pressure points at the insteps and tops of the toes. Specially designed insteps provide an excellent fit at the midfoot, resulting in increased circulation and greater warmth. The Lange SX 90 W women's ski boots feature saddle-stitched seams to help reduce hotspots.","short_description":"Combining a medium, intermediate-level flex with roomy footbeds, the Lange SX 90 W women's ski boots emphasize precision as you take on steeper terrain and faster turns.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s445879.png","image_url":"http://i1.avlws.com/115/l445879.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445879&tt=df","retail_price":"399.95","sale_price":"399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445879\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445879.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859447&amp;link=&amp;tabs=-Details\"></script>","variants":{"8594470001":{"sku":"8594470001","vendor_sku":"LBC6200","size":"Mondo 23.5","color":"GRAY/WHITE","retail_price":"399.95","sale_price":"399.95"},"8594470003":{"sku":"8594470003","vendor_sku":"LBC6200","size":"Mondo 25.5","color":"GRAY/WHITE","retail_price":"399.95","sale_price":"399.95"},"8594470004":{"sku":"8594470004","vendor_sku":"LBC6200","size":"Mondo 26.5","color":"GRAY/WHITE","retail_price":"399.95","sale_price":"399.95"}}}
