{"sku":"859424","manufacturer_id":"05006000 001","brand_name":"Nordica","product_name":" Nordica Hell and Back H1 Ski Boots - Men's - 2013/2014","long_description":"The Nordica Hell and Back H1 ski boots combine snug 100mm footbeds with shock-absorbing technology to let advanced skiers push their limits in comfort. Full Shock Eraser (FSE) liners feature extra padding under the feet, in the tongues and in the cuffs to absorb shock and damp vibrations. Built into the shells, FSE wedges provide superb shock absorption and vibration damping while stomping big-air landings. FSE toe boxes pad the front of your feet, reducing painful toe bang, and rear FSE spoilers offer rear support. Hand-stitched liners snugly wrap feet in cushioning foam and offer large toe boxes to improve circulation and warmth; closed-cell foam against the shells enhances warmth. Water-resistant wraparound shields protect feet from moisture seeping into the boots. High-traction soles offer grippy perfomance for walking and hiking. 110 - 120 flex index provides the highly responsive power transfer preferred by assertive/aggressive expert skiers. The Hell and Back H1 ski boots feature an adjustable flex that you can change on the fly from 110 to 120 to adjust to changing snow conditions.","short_description":"The Nordica Hell and Back H1 ski boots combine snug 100mm footbeds with shock-absorbing technology to let advanced skiers push their limits in comfort.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382599.png","image_url":"http://i1.avlws.com/115/l382599.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382599&tt=df","retail_price":"599.00","sale_price":"418.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382599\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382599.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859424&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
