{"sku":"859432","manufacturer_id":"20935","brand_name":"Bolle","product_name":"Bolle Emperor Snow Goggles","long_description":"Rule the mountain this season with the Bolle Emperor snow goggles, which boast an oversized lens with a wide field of vision so you can see all of the slope before you as you shred it. Vermillion Gun lens has a versatile rose tint with 22% visible light transmission, increasing contrast and color definition in clouds or sun; mirror coating cuts glare. Oversized spherical lens tapers from the optical center toward the periphery for an extra-wide field of vision with minimal distortion. Double-layer thermal lens features a microporous port that allows lens to breathe while preventing moisture entry, greatly reducing fogging. Anti-fog treatment helps prevent inner lens from fogging up; outer lens features a protective layer to defend lens from scratches. 3-layer face foam has a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Wide adjustable strap is backed with silicone grippers so it stays in place on your helmet. The Bolle Emperor snow goggles are designed for large-size faces.","short_description":"Rule the mountain this season with the Bolle Emperor snow goggles, which boast an oversized lens with a wide field of vision so you can see all of the slope before you as you shred it.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380959.png","image_url":"http://i1.avlws.com/115/l380959.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380959&tt=df","retail_price":"99.95","sale_price":"79.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380959\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380959.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859432&amp;link=&amp;tabs=-Details\"></script>","variants":{"8594320001":{"sku":"8594320001","vendor_sku":"20935","upc":"054917290542","size":"VERMILLON GUN","color":"BLUE AND GREEN WAVES","retail_price":"79.93","sale_price":"79.93"}},"categories":["snow","ski-goggles","mens-ski-goggles"]}
