{"sku":"859534","manufacturer_id":"A130300201190","brand_name":"Line","product_name":" Line Sir Francis Bacon Skis - Men's - 2013/2014","long_description":"A celebrated favorite for advanced freestyle tricks in fresh powder, the Line Sir Francis Bacon skis float in pow with rockered tips and tails and are stiff enough for big moves in the half pipe. Designed by skier, artist and filmmaker Eric Pollard, the Line Sir Francis Bacon skis are his personal choice for versatility and fun. Tip and tail rocker floats high in backcountry powder whether skiing forward or switch; relatively low rise planes through powder instead of plowing up and over. Core consists of light and strong maple wood stringers surrounded by aspen wood to provide snappy power for tricks and high stability at speed. Symmetrical flex pattern in tips and tails creates identical responsiveness whether skiing forward or switch. Widest points of the tips and tails are close to the center of the skis, reducing tail drag and hooking in powder. Thin cores and sidewalls in the tips reduce weight and make the skis easier to control. P-tex plastic sidewalls isolate vibrations, offering a smooth feel when charging at high speed. Extra-thick bases and edges add significant durability and impact resistance, and let you tune your skis many times throughout the season. The Line Sir Francis Bacon skis have 108mm waists that require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"A celebrated favorite for advanced freestyle tricks in fresh powder, the Line Sir Francis Bacon skis float in pow with rockered tips and tails and are stiff enough for big moves in the half pipe.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382183.png","image_url":"http://i1.avlws.com/115/l382183.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382183&tt=df","retail_price":"649.95","sale_price":"389.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382183\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382183.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859534&amp;link=&amp;tabs=-Details\"></script>","variants":{"8595340004":{"sku":"8595340004","vendor_sku":"A130300201190","upc":"886745209249","size":"190 CM","retail_price":"389.93","sale_price":"389.93"}},"categories":["snow","skis","downhill-skis"]}
