{"sku":"859549","manufacturer_id":"A130301801172","brand_name":"Line","product_name":" Line Soulmate 98 Skis - Women's - 2013/2014","long_description":"Ready for powder to packed and back again, the Line Soulmate 98 women's skis use a stable metal laminate in the core and nimble rockered tips to shred anywhere you choose to go. Rockered tips float effortlessly in deep powder and offer easy turn initiation on the hardpack. Die-cut metal laminate enhances edge-grip and increases torsional responsiveness in the tips. Aspen core consists of a blend of high-quality wood laminates that reduce weight and enhance overall strength. Cap construction on top of skis blends light responsiveness with the durability and solid feel of sidewalls. Directional twin-tip design slightly favors skiing forward but allows you to ski and land backward if desired. Extra-thick bases and edges add significant durability and impact resistance, and let you tune your skis many times throughout the season. Line Soulmate 98 women's skis feature 98mm waists that require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"Ready for powder to packed and back again, the Line Soulmate 98 women's skis use a stable metal laminate in the core and nimble rockered tips to shred anywhere you choose to go.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382203.png","image_url":"http://i1.avlws.com/115/l382203.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382203&tt=df","retail_price":"599.95","sale_price":"359.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382203\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382203.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859549&amp;link=&amp;tabs=-Details\"></script>","variants":{"8595490003":{"sku":"8595490003","vendor_sku":"A130301801172","upc":"886745208235","size":"172 CM","retail_price":"359.93","sale_price":"359.93"}},"categories":["snow","skis","downhill-skis"]}
