{"sku":"859535","manufacturer_id":"A130301101179","brand_name":"Line","product_name":" Line Sick Day 110 Skis - Men's - 2013/2014","long_description":"With rockered tips and tails for flotation on fresh snow and stable110mm waists to ski crusty snow weeks after the storm has passed, the Line Sick Day 110 skis are light, nimble and super fun. Tip and tail rocker floats high in powder whether skiing forward or switch; relatively low rise planes through powder instead of plowing up and over. Core consists of light and strong maple wood stringers surrounded by aspen wood to provide power, stability and long-lasting responsiveness. Widest points of the tip and tail are close to the center of the ski, reducing tail drag and hooking in powder. Cap construction on top of ski reduces weight and sidewalls over the edges enhance responsiveness. Softer tips float and initiate turns easily while stiffer tails provide powerful turn exits and stability. Geometry of skis incorporates 5 different turn radii to create effortless turn initiation with solid edge hold and responsive exits. Thin core in the tips reduces weight and makes the skis easier to control. Base or topsheet color may vary from online photo. Line Sick Day 110 skis feature 110mm waists that require bindings with wide brakes.","short_description":"With rockered tips and tails for flotation on fresh snow and stable110mm waists to ski crusty snow weeks after the storm has passed, the Line Sick Day 110 skis are light, nimble and super fun.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382187.png","image_url":"http://i1.avlws.com/115/l382187.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382187&tt=df","retail_price":"699.95","sale_price":"419.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382187\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382187.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859535&amp;link=&amp;tabs=-Details\"></script>","variants":{"8595350001":{"sku":"8595350001","vendor_sku":"A130301101179","upc":"886745207757","size":"179 CM","retail_price":"419.93","sale_price":"419.93"},"8595350002":{"sku":"8595350002","vendor_sku":"A130301101186","upc":"886745220749","size":"186 CM","retail_price":"419.93","sale_price":"419.93"}}}
