{"sku":"859563","manufacturer_id":"WM2137","brand_name":"Columbia","product_name":" Columbia Triple Trail II Shell Rain Jacket - Men's - 2012 Closeout","long_description":"Lightweight, comfortable and perfect for sudden weather changes, the Triple Trail II Shell rain jacket from Columbia is a great addition to any pack. Rugged yet supple, waterproof, breathable Omni-Tech(R)/nylon laminate construction keeps you dry in all conditions; factory-sealed seams. Omni-Heat(R) thermal reflective lining boosts heat retention by an average of 20% over regular lining to keep you cozy on long days out in the cold. Fabric also employs 2-way stretch for a comfortable fit during active endeavors. Helmet-compatible, adjustable storm hood offers excellent protection from the elements and unhindered peripheral vision when cinched down. Water-resistant, 2-way zipper has an internal stormflap; abrasion-resistant chin guard protects delicate skin. Columbia Triple Trail II jacket features underarm vents with 2-way zippers provide on-demand ventilation. Drawcord adjustable hem and adjustable cuffs seal in warmth or let you ventilate depending on weather and activity level. Droptail hem; stretch-mesh-lined, zip hand pockets; internal security pocket; stretch-mesh drop-in pocket. Closeout.","short_description":"Lightweight, comfortable and perfect for sudden weather changes, the Triple Trail II Shell rain jacket from Columbia is a great addition to any pack.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Rain Jackets","thumb_url":"http://i1.avlws.com/115/s402047.png","image_url":"http://i1.avlws.com/115/l402047.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=402047&tt=df","keywords":"hardshell","retail_price":"325.00","sale_price":"138.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=402047\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m402047.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859563&amp;link=&amp;tabs=-Details\"></script>","variants":{"8595630010":{"sku":"8595630010","vendor_sku":"WM2137","upc":"886535734807","size":"XXL","color":"LIGHT GRAPE","retail_price":"138.73","sale_price":"138.73"}},"categories":["mens","mens-jackets","mens-rain-jackets"]}
