{"sku":"859690","manufacturer_id":"2033884","brand_name":"Giro","product_name":"Giro Sheer Snow Helmet - Women's - 2013 Closeout","long_description":"Equipped for topnotch comfort and protection, the women's Giro Sheer(TM) snow helmet is styled specifically for your wintertime adventures in the white stuff. In-mold technology bonds the helmet's tough outer microshell to the internal expanded polystyrene (EPS) liner, creating a light, cool and strong helmet. 12 vents move cool, fresh air through the helmet while radiating heat and stale air out. Fine-tune the airflow using two low-profile Thermostat(TM) control buttons located on the outside of the helmet; buttons open and close vents. Vent placed over the center vent of goggles reduces internal fogging and maintains an integrated fit. Fit system features outrigger arms and an adjustment dial to fine-tune the fit; dial is easily operated, even with gloves on. Flexible pad at the base of the fit system conforms to head shape for a plush, personalized fit. Internal height adjustment compensates for different head shapes and goggles sizes. Giro Sheer snow helmet accommodates TuneUps audio systems, not included. This snow helmet complies with ASTM F 2040 and/or CE EN 1077 alpine ski and snowboard helmet safety standards. Closeout.","short_description":"Equipped for topnotch comfort and protection, the women's Giro Sheer(TM) snow helmet is styled specifically for your wintertime adventures in the white stuff.","category":"Skiing","subcategory":"Ski Helmets","product_group":"Women's Ski Helmets","thumb_url":"http://i1.avlws.com/115/s381491.png","image_url":"http://i1.avlws.com/115/l381491.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381491&tt=df","retail_price":"160.00","sale_price":"93.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381491\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381491.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859690&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-helmets","womens-ski-helmets"]}
