{"sku":"859661","manufacturer_id":"13344","brand_name":"Rei","product_name":" REI Polar Pod Sleeping Bag - Long - 2013 Closeout","long_description":"A great value for campers and backpackers alike, the synthetic-fill, long REI Polar Pod Sleeping Bag is priced for your budget, yet it's still feature-packed and built to last. EN comfort rating of 31degF delivers comfort for mild-weather 3-season adventures. Synthetic hollow-fiber insulation retains heat while providing loft and some compressibility; construction eliminates cold spots. Equally distributed insulation all the way around the bag accommodates the multiposition sleeper. Relaxed fit from the shoulders to the hips increases comfort by providing ample space to move around. Ripstop nylon shell resists water and abrasion; smooth nylon taffeta lining is comfortable against your skin. Shell fabric is treated with a durable water repellent finish to fend off moisture and stains. Contoured hood, insulated full-face muffler, full draft collar and full-length draft tube with ground-level seams keep body heat in and cold air out. Pillow pocket keeps camp pillow in place; stuff clothing inside pocket if you don't have a pillow. Differentiated drawcords (1 round, 1 flat) let you adjust hood and neck easily in the dark. Full-length zipper is backed by wide, antisnag binding tape. Any REI backpacking bag can be zipped to any other REI backpacking bag because of the consistent 63 in., No. 5, YKK zipper; women's bags zip on the right, men's on the left. Pad loops provide attachment points to keep your sleeping bag and pad together to avoid rolling off onto the cold ground (straps and sleeping pad sold separately). Includes stuff sack and storage bag. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags. The long REI Polar Pod Sleeping Bag has an external chest pocket that stows your watch, glasses or other small essentials. Overstock.","short_description":"A great value for campers and backpackers alike, the synthetic-fill, long REI Polar Pod Sleeping Bag is priced for your budget, yet it's still feature-packed and built to last.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421499.png","image_url":"http://i1.avlws.com/115/l421499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421499&tt=df","keywords":"compact","retail_price":"99.50","sale_price":"72.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859661&amp;link=&amp;tabs=-Details\"></script>","variants":{"8596610001":{"sku":"8596610001","vendor_sku":"13344","upc":"485966100016","size":"Long","color":"DEEP SEA/BLACK","retail_price":"72.73","sale_price":"72.73"}}}
