{"sku":"859872","manufacturer_id":"RICW300","brand_name":"Rossignol","product_name":" Rossignol X10 Skate Boots","long_description":"The high-performance Rossignol X10 skate boots are designed for experienced skate athletes. They lock feet down down for control and comfort, and allow a natural foot roll to maximize kick amplitude. Lightweight Xcelerator outsoles are designed to neutralize and balance foot and body position for greater power transmission and higher forward speed with less effort expended. Lightweight, anatomically-shaped ankle cuffs with ratcheting powerstraps deliver lateral and fore/aft stability, optimize power transfer and let you fine-tune the fit. Lightweight, yet durable PVC lace covers help keep feet dry and warm; asymmetric zippers wrap feet and lock in heels and insteps to maximize support and control. Medial and lateral webbing reinforcements integrated into the boots' lacing system securely wrap the feet and lock down heels and insteps, maximizing support and control. Heat-moldable foam linings provide a customized fit for increased warmth and comfort. Nylon shanks in the midsoles of the Rossignol X10 skate boots provide increased support, stability and durability and help prevent foot fatigue. Skate-specific flex encourages powerful energy transmission.","short_description":"The high-performance Rossignol X10 skate boots are designed for experienced skate athletes. They lock feet down down for control and comfort, and allow a natural foot roll to maximize kick amplitude.","category":"Skiing","subcategory":"Ski Boots","product_group":"Cross-Country Ski Boots","thumb_url":"http://i1.avlws.com/115/s382415.png","image_url":"http://i1.avlws.com/115/l382415.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382415&tt=df","retail_price":"229.95","sale_price":"183.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382415\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382415.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859872&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","crosscountry-ski-boots"]}
