{"sku":"859865","manufacturer_id":"RTCN001","brand_name":"Rossignol","product_name":"Rossignol Evo Tour Cross-Country Skis with NIS Bindings","long_description":"The Rossignol Evo Tour cross-country skis with NIS bindings are easy-to-use, waxless touring skis designed for recreational skiers who want lots of surface grip. Waxless Positrack bases have a positive (raised pattern) kick surface for maximum grip and deliver the best compromise between grip and glide in all snow conditions. SKis include NIS T4 Auto bindings: easy hands-free click-in/click-out design provides fast, user-friendly entry and exit; wide heel pieces increase stability. Thin core profile lightens the skis and delivers a soft, user-friendly flex at the tip and tail. Durable Active Cap construction, with slightly widened edges, increases torsional stability and offers a supple longitudinal flex. Shorter-than-traditional ski length increases maneuverability, predictability and control while climbing, descending and cruising the flats. Stone finished bases on the Rossignol Evo Tour skis optimize the glide phase.","short_description":"The Rossignol Evo Tour cross-country skis with NIS bindings are easy-to-use, waxless touring skis designed for recreational skiers who want lots of surface grip.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s454007.png","image_url":"http://i1.avlws.com/115/l454007.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454007&tt=df","retail_price":"288.95","sale_price":"259.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454007\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454007.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859865&amp;link=&amp;tabs=-Details\"></script>","variants":{"8598650001":{"sku":"8598650001","vendor_sku":"RTCN001","size":"166 CM","color":"WHITE/ BLUE","retail_price":"259.93","sale_price":"259.93"}},"categories":["snow","skis","crosscountry-skis"]}
