{"sku":"859867","manufacturer_id":"RTCN001","brand_name":"Rossignol","product_name":" Rossignol Evo Action JR Cross-Country Skis with NNN Bindings - Juniors'","long_description":"Rossignol Evo Action JR cross-country skis with NNN bindings are easy-to-use, lightweight touring skis for junior skiers. Waxless bases offer easy kicking and gliding on-trail in all snow conditions. Shorter-than-traditional ski length is perfect for smaller people and increases maneuverability, predictability and control while climbing, descending and cruising the flats. Skis include traditional NNN screw-mounted bindings with wide, stable heel plates and manual open/close mechanisms with large, user-friendly grips that are easy to operate. Rossignol Evo Action JR cross-country skis have two base grooves that aid in tracking and add stability during skiing for improved directional control. Wood cores with large air channels provides lightweight, durable performance. Durable Active Cap construction, with slightly widened edges, increases torsional stability and offers a supple longitudinal flex. Stone finished bases optimize the glide phase.","short_description":"Rossignol Evo Action JR cross-country skis with NNN bindings are easy-to-use, lightweight touring skis for junior skiers. Waxless bases offer easy kicking and gliding on-trail in all snow conditions.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s381883.png","image_url":"http://i1.avlws.com/115/l381883.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381883&tt=df","keywords":"jstp7615","retail_price":"129.95","sale_price":"103.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381883\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381883.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859867&amp;link=&amp;tabs=-Details\"></script>","variants":{"8598670001":{"sku":"8598670001","vendor_sku":"RTCN002","upc":"485986700012","size":"110 CM","color":"WHITE/RED","retail_price":"103.93","sale_price":"103.93"}},"categories":["snow","skis","crosscountry-skis"]}
