{"sku":"859866","manufacturer_id":"RTCN004","brand_name":"Rossignol","product_name":" Rossignol Evo OT Cross-Country Skis with NIS Bindings","long_description":"The Rossignol Evo OT (Off Trail) cross-country skis with NIS bindings feature wide dimensions and partial metal edges to increase off-trail versatility. They're lightweight and maneuverable, too. Waxless Positrack bases have a positive (raised pattern) kick surface for maximum grip and deliver the best compromise between grip and glide in all snow conditions. Skis include NIS T4 Auto bindings: easy hands-free click-in/click-out design provides fast, user-friendly entry and exit; wide heel pieces increase stability. Wood cores with large air channels provides lightweight, durable performance; partial metal edges dig in for easier turning and control. Durable Active Cap construction, with slightly widened edges, increases torsional stability and offers a supple longitudinal flex. Shorter-than-tradtional ski length increases maneuverability, predictability and control while climbing, descending and cruising the flats. Stone finished bases on the Rossignol Evo OT skis optimize the glide phase.","short_description":"The Rossignol Evo OT (Off Trail) cross-country skis with NIS bindings feature wide dimensions and partial metal edges to increase off-trail versatility. They're lightweight and maneuverable, too.","category":"Skiing","subcategory":"Skis","product_group":"Cross-Country Skis","thumb_url":"http://i1.avlws.com/115/s451479.png","image_url":"http://i1.avlws.com/115/l451479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451479&tt=df","retail_price":"319.95","sale_price":"287.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859866&amp;link=&amp;tabs=-Details\"></script>","variants":{"8598660001":{"sku":"8598660001","vendor_sku":"RTCN004","size":"165 CM","color":"WHITE/BLACK","retail_price":"287.93","sale_price":"287.93"}}}
