{"sku":"859878","manufacturer_id":"5602-176-1314","brand_name":"Voile","product_name":" Voile V8 Telemark / Randonee Skis - 2013/2014","long_description":"The Voile V8 backcountry skis have wide tips and narrow tails for lots of float in powder, while the tight sidecut radius and short running length keep them playful and easy to control when carving. Lightweight construction makes the V8 skis a good choice for long tours; aspen wood cores are wrapped in fiberglass that is woven with carbon for a light, snappy feel. Wide 146mm tips and 115mm waists (186cm ski) provide ample flotation in soft snow, while the large sidecut and short turning radius keep them fun on harder snow. Early-rise tips help you float through the deep powder on the descent and ease trail breaking in deep snow during the ascent. Tails of the skis turn up just a touch and are compatible with the tail attachments of most climbing skins (sold separately). Traditional sidecut underfoot lets you carve turns on firm snow as you make your way out of the woods. Voile V8 skis have sintered bases that retain wax well and provide good glide. Base or topsheet color may vary from online photo.","short_description":"The Voile V8 backcountry skis have wide tips and narrow tails for lots of float in powder, while the tight sidecut radius and short running length keep them playful and easy to control when carving.","category":"Skiing","subcategory":"Skis","product_group":"Backcountry Skis","thumb_url":"http://i1.avlws.com/115/s381811.png","image_url":"http://i1.avlws.com/115/l381811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381811&tt=df","retail_price":"625.00","sale_price":"499.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859878&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
