{"sku":"859984","manufacturer_id":"7025335","brand_name":"Giro","product_name":"Giro Basis Snow Goggles","long_description":"Make clear vision the foundation of your season with the Giro Basis snow goggles, which feature a high-quality spherical lens to ensure your sight lines are unhindered as you carve up the mountain. Persimmon Blaze lens has a bronze tint with 50% visible light transmission (VLT) and a fiery scarlet mirror to heighten detail and contrast in overcast, low-light conditions. Made by Carl Zeiss Vision, the spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion and excellent clarity. Double-layer lens helps reduce fogging by creating a thermal barrier between the cold outside air and warm, moist air around your face. Anti-fog coating and lens vents also help prevent inner lens from fogging up and obstructing your view. 3-layer face foam is designed to ensure a tight seal, good moisture management and maximum comfort. Frame is engineered to offer an optimal, ergonomic fit around the face, resulting in excellent comfort and helmet compatibility. The Giro Basis snow goggles are designed to fit medium-size adult faces.","short_description":"Make clear vision the foundation of your season with the Giro Basis snow goggles, which feature a high-quality spherical lens to ensure your sight lines are unhindered as you carve up the mountain.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380967.png","image_url":"http://i1.avlws.com/115/l380967.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380967&tt=df","retail_price":"120.00","sale_price":"83.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380967\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380967.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859984&amp;link=&amp;tabs=-Details\"></script>","variants":{"8599840001":{"sku":"8599840001","vendor_sku":"7025335","upc":"768686943874","size":"PERSIMMON BLAZE","color":"BLACK LASER TAG","retail_price":"83.93","sale_price":"83.93"}},"categories":["snow","ski-goggles","mens-ski-goggles"]}
