{"sku":"859985","manufacturer_id":"7025323","brand_name":"Giro","product_name":" Giro Onset Snow Goggles","long_description":"With an oversized lens and a minimalist frame design, the Giro Onset snow goggles open up your view of the mountain as you carve your way through the season. Reduced frame depth and rimless sections increase the overall vieweable area to maximize your field of vision. Black Playoff frame has a bronze-tint Persimmon Blaze lens with 50% visible light transmission (VLT) and a red mirror flash, improving detail and contrast in cloudy, low light. Yellow Color Block frame has a green-tint Loden Yellow lens with 20% VLT and a yellow mirror finish for crisp, clear definition in full sun. Oversized spherical lens, made by Carl Zeiss Vision, tapers from the optical center toward the periphery for an extra-wide field of vision with minimal distortion. Double-layer lens helps reduce fogging by creating a thermal barrier between the cold outside air and warm, moist air around your face. Frame is engineered to offer an optimal, ergonomic fit around the face, resulting in excellent comfort and helmet compatibility. Anti-fog coating helps prevent inner lens from fogging up and obstructing your view. 3-layer face foam is designed to ensure a tight seal, good moisture management and maximum comfort. The Giro Onset snow goggles are designed to fit large-size adult faces.","short_description":"With an oversized lens and a minimalist frame design, the Giro Onset snow goggles open up your view of the mountain as you carve your way through the season.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380971.png","image_url":"http://i1.avlws.com/115/l380971.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380971&tt=df","retail_price":"150.00","sale_price":"104.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380971\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380971.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859985&amp;link=&amp;tabs=-Details\"></script>","variants":{"8599850001":{"sku":"8599850001","vendor_sku":"7025303","upc":"768686943799","size":"PERSIMMON BLAZE","color":"BLACK PLAYOFF","retail_price":"104.93","sale_price":"104.93"},"8599850002":{"sku":"8599850002","vendor_sku":"7025323","upc":"768686943744","size":"LODEN YELLOW","color":"YELLOW COLOR BLOCK","retail_price":"104.93","sale_price":"104.93"}}}
