{"sku":"859910","manufacturer_id":"835","brand_name":"La Sportiva","product_name":" La Sportiva Baruntse Mountaineering Boots - Men's","long_description":"Ideal for harsh winter conditions on high-altitude peaks, the La Sportiva Baruntse Mountaineering boots feature an inner boot with lacing for a secure fit, and an insulated outer boot for warmth. Insulated, abrasion-resistant Cordura(R) nylon and synthetic microfiber uppers feature anti-abrasion polyurethane film for protection. Uppers feature high-density expanded polyethylene insulating netting and expanded polyethylene for warmth. Removable liner boots are constructed of 7mm thermo-formable high-density EVA foam and Cordura(R) nylon; liners feature a speed lacing system for a dialed fit. 6mm insoles feature an insulating fibrous material that offers superb insulation and a reflective aluminum facing for excellent thermal performance. Thermoplastic urethane midsoles feature honeycomb heel grids that flex upon impact for lightweight cushioning; nylon plates provide support when wearing crampons. High-rise sticky Vibram(R) rubber rands stand up to rock abrasion and crampon wear. La Sportiva Baruntse Mountaineering boots have durable Vibram Montagna rubber outsoles for amazing traction; boots are compatible with step-in crampons.","short_description":"Ideal for harsh winter conditions on high-altitude peaks, the La Sportiva Baruntse Mountaineering boots feature an inner boot with lacing for a secure fit, and an insulated outer boot for warmth.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385287.png","image_url":"http://i1.avlws.com/115/l385287.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385287&tt=df","retail_price":"625.00","sale_price":"625.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385287\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385287.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859910&amp;link=&amp;tabs=-Details\"></script>","variants":{"8599100004":{"sku":"8599100004","vendor_sku":"835","upc":"801216097958","size":"43.5","color":"SILVER","retail_price":"625.00","sale_price":"625.00"}}}
