{"sku":"859982","manufacturer_id":"7025401","brand_name":"Giro","product_name":" Giro The Blok Snow Goggles","long_description":"Combining retro style with modern optics and a maximized field of vision, The Blok snow goggles from Giro will keep you looking fresh as you get your freshies on. Reduced frame depth and rimless sections increase the overall vieweable area to maximize your field of vision. Camo Trademark frame has a bronze-tint Persimmon Blaze lens with 50% visible light transmission (VLT) and red mirror finish, improving detail and contrast in cloudy, low light. Black Static frame has an Amber Scarlet lens with 40% VLT, versatile amber tint and multilayer mirror finish, increasing detail and depth perception in variable light. Cylindrical lens, made by Carl Zeiss Vision, is created using an injection-molding process that helps minimize lens distortion so you can see clearly. Frame is engineered to offer an optimal, ergonomic fit around the face, resulting in excellent comfort and helmet compatibility. Anti-fog coating and optimized vents help prevent lens from fogging up and obstructing your view. 3-layer face foam is designed to ensure a tight seal, good moisture management and maximum comfort. The Blok snow goggles by Giro are designed to fit large-size adult faces.","short_description":"Combining retro style with modern optics and a maximized field of vision, The Blok snow goggles from Giro will keep you looking fresh as you get your freshies on.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380963.png","image_url":"http://i1.avlws.com/115/l380963.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380963&tt=df","retail_price":"90.00","sale_price":"62.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380963\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380963.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=859982&amp;link=&amp;tabs=-Details\"></script>","variants":{"8599820001":{"sku":"8599820001","vendor_sku":"7025401","upc":"768686944260","size":"PERSIMMON BLAZE","color":"CAMO TRADEMARK","retail_price":"62.93","sale_price":"62.93"}},"categories":["snow","ski-goggles","mens-ski-goggles"]}
