{"sku":"860054","manufacturer_id":"EG01013752-BRDC","brand_name":"Electric","product_name":" Electric EGB2 Snow Goggles - James Haunt Frame","long_description":"With a design that helps maximize your peripheral vision, the Electric EGB2 James Haunt snow goggles give you widescreen access to the slopes and come with a spare lens for all-conditions versatility. Comes with a Bronze/Red Chrome lens with a bronze tint, 20% visible light transmission (VLT) and mirror finish for great definition in sunny to partly cloudy conditions. Spare Yellow lens is included and offers 70% VLT for clear definition when it's cloudy, snowing or when you're getting in some nighttime runs. Large cylindrical lens is designed to deliver wide peripheral vision so you can see more of the mountain. Double-layer lens helps create a thermal barrier to reduce fogging; directional pressure valve allows lens to adapt to altitude changes without distorting the lens. Antifog lens treatment and full-perimeter venting combat lens fogging, delivering clear vision in changing weather. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Tough thermoplastic urethane frame offers consistent flexibility in changing temperatures for a comfortable, secure fit. The helmet-compatible design of the Electric EGB2 James Haunt snow goggles fits medium- to large-size faces; goggles come with a microfiber storage bag. Please note: though the EGB2 goggles come with a spare lens, the frame is not optimized for fast lens changes; some caution and effort will be necessary to change lenses.","short_description":"With a design that helps maximize your peripheral vision, the Electric EGB2 James Haunt snow goggles give you widescreen access to the slopes and come with a spare lens for all-conditions versatility.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380999.png","image_url":"http://i1.avlws.com/115/l380999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380999&tt=df","retail_price":"149.95","sale_price":"104.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860054&amp;link=&amp;tabs=-Details\"></script>","variants":{"8600540001":{"sku":"8600540001","vendor_sku":"EG01013752-BRDC","upc":"884932215714","size":"BRONZE/RED CHROME","color":"JAMES HAUNT","retail_price":"104.83","sale_price":"104.83"}},"categories":["snow","ski-goggles","mens-ski-goggles"]}
