{"sku":"860095","manufacturer_id":"10763100034","brand_name":"Anon","product_name":"Anon Majestic Premium Snow Goggles - Women's","long_description":"When you're ready to hit the slopes, the women's Anon Majestic Premium snow goggles deliver clear optics and a comfortable fit at a great value for your days on the snow. Black Emblem frame has a Silver Amber lens with a versatile amber tint and 35% visible light transmission (VLT) for good depth perception in low, flat to partly cloudy light. Faultline frame has a Green Solex lens with a dark bronze tint, 18% VLT and a multilayer green mirror finish to cut glare and reduce eye fatigue in very sunny conditions. Antifog treatment and full-perimeter venting combat lens fogging. Dual-layer foam with moisture-wicking fleece supplies a comfortable, snug seal around your face. Tough thermoplastic polyurethane frame offers consistent flexibility in changing temperatures for a comfortable, secure fit. Strap hinges ensure a flush fit that minimizes gaps and comfortably distributes pressure evenly across your face. The helmet-compatible design of the snow goggles fits small-size faces; goggles come with a microfiber storage bag. As part of the Anon Premium series, the women's Anon Majestic Premium goggles feature the latest in high-resolution graphics and detailed frame and strap finishes.","short_description":"When you're ready to hit the slopes, the women's Anon Majestic Premium snow goggles deliver clear optics and a comfortable fit at a great value for your days on the snow.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381135.png","image_url":"http://i1.avlws.com/115/l381135.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381135&tt=df","retail_price":"94.95","sale_price":"65.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381135\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381135.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860095&amp;link=&amp;tabs=-Details\"></script>","variants":{"8600950001":{"sku":"8600950001","vendor_sku":"10763100034","upc":"886888503037","size":"SILVER AMBER","color":"BLACK EMBLEM","retail_price":"65.83","sale_price":"65.83"},"8600950002":{"sku":"8600950002","vendor_sku":"10763100304","upc":"886888503099","size":"GREEN SOLX","color":"FAULTINE","retail_price":"65.83","sale_price":"65.83"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
