{"sku":"860027","manufacturer_id":"313013894843","brand_name":"Spy","product_name":" Spy Marshall Snow Goggles - Women's","long_description":"The mid-sized Spy Marshall women's snow goggles feature a spherical lens with a versatile tint and a fog-combatting design to keep your sight lines clear when you're on the mountain. Pink lens has 23.4% visible light transmission (VLT) and a multilayer pink mirror finish to enhance definition and reduce eye fatigue on bright, sunny days. Spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Double-layer thermal lens creates a thermal barrier between the cold outside air and the warm air next to your face, helping reduce fogging. Antifog and antiscratch lens treatments help keep your vision clear and distortion-free. Strategically placed frame vents increase airflow to reduce fogging; flexible polyurethane frame ensures a comfortable fit. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Wide adjustable strap is backed with silicone ribbing so it stays in place, whether you're wearing a helmet or not. The Spy Marshall snow goggles are designed to fit medium-sized faces.","short_description":"The mid-sized Spy Marshall women's snow goggles feature a spherical lens with a versatile tint and a fog-combatting design to keep your sight lines clear when you're on the mountain.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381127.png","image_url":"http://i1.avlws.com/115/l381127.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381127&tt=df","retail_price":"109.95","sale_price":"76.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381127\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381127.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860027&amp;link=&amp;tabs=-Details\"></script>","variants":{"8600270001":{"sku":"8600270001","vendor_sku":"313013894843","upc":"648478736368","size":"PINK/PINK SPECTRA","color":"MOON FLOWER","retail_price":"76.83","sale_price":"76.83"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
