{"sku":"860025","manufacturer_id":"312012538966","brand_name":"Spy","product_name":" Spy Platoon Snow Goggles","long_description":"The oversized Spy Platoon snow goggles deliver a wide field of vision and feature special frame vents to maximize fog protection. Plus, they come with a spare lens for all-conditions versatility. Bronze lens has a bronze tint with 21% visible light transmission (VLT) and a multilayer red mirror finish to cut glare and offer excellent definition in bright, sunny light. Spare Persimmon lens has a bronze tint with 53% VLT, delivering increased contrast in overcast, flat light conditions. Large spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Double-layer thermal lens creates a thermal barrier between the cold outside air and the warm air next to your face, helping reduce fogging. Antifog and antiscratch lens treatments help keep your vision clear and distortion-free. Strategically placed frame vents increase airflow to reduce fogging; flexible polyurethane frame ensures a comfortable fit. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Wide adjustable strap is backed with silicone ribbing so it stays in place, whether you're wearing a helmet or not. Please note: though the Platoon goggles come with a spare lens, the frame is not optimized for fast lens changes; some caution and effort will be necessary to change lenses.","short_description":"The oversized Spy Platoon snow goggles deliver a wide field of vision and feature special frame vents to maximize fog protection. Plus, they come with a spare lens for all-conditions versatility.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380991.png","image_url":"http://i1.avlws.com/115/l380991.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380991&tt=df","retail_price":"149.95","sale_price":"104.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380991\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380991.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860025&amp;link=&amp;tabs=-Details\"></script>","variants":{"8600250001":{"sku":"8600250001","vendor_sku":"312012538966","upc":"648478736474","size":"BRONZE/RED SPECTRA","color":"SPY+TSL+RIME","retail_price":"104.83","sale_price":"104.83"}},"categories":["snow","ski-goggles","mens-ski-goggles"]}
