{"sku":"860098","manufacturer_id":"10773100117","brand_name":"Anon","product_name":"Anon M1 Painted Snow Goggles - Women's","long_description":"The women's Anon M1 Painted snow goggles boast a magnet-based interchangeable lens system so that you can easily change up your lenses to meet the conditions of the day. Pink SQ lens has a rose tint and 35% visible light transmission (VLT) to reduce eye fatigue while enhancing contrast and depth perception in flat light. Green Solex lens has a dark bronze tint, 18% VLT and a multilayer green mirror finish to cut glare and reduce eye fatigue in very sunny conditions. Both options include a spare Blue Lagoon lens, which has a high-contrast yellow tint, 68% VLT and a mirror finish to enhance definition and contrast in low light. Interchangeable lens design embeds magnets in the frame and lens, making it a simple process to swap lenses without taking the goggle frame off your face. To swap lenses, simply pull the lens out, switch it and snap the new one in-the magnets automatically guide and hold lens in position. Large spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Antifog treatment and full-perimeter venting combat lens fogging. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Tough thermoplastic polyurethane frame offers consistent flexibility in changing temperatures for a comfortable, secure fit. Strap outriggers hinge to create a flush fit that minimizes gaps and distributes pressure evenly across your face. The helmet-compatible design of the women's Anon M1 Painted goggles fits medium-size faces; goggles come with a protective nylon case and microfiber storage bag.","short_description":"The women's Anon M1 Painted snow goggles boast a magnet-based interchangeable lens system so that you can easily change up your lenses to meet the conditions of the day.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381143.png","image_url":"http://i1.avlws.com/115/l381143.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381143&tt=df","retail_price":"199.95","sale_price":"139.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381143\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381143.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860098&amp;link=&amp;tabs=-Details\"></script>","variants":{"8600980001":{"sku":"8600980001","vendor_sku":"10773100116","upc":"886888504102","size":"GREEN SOLEX","color":"WOMEN'S WHITE","retail_price":"139.83","sale_price":"139.83"},"8600980002":{"sku":"8600980002","vendor_sku":"10773100117","upc":"886888504119","size":"PINK SQ","color":"WOMEN'S WHITE","retail_price":"139.83","sale_price":"139.83"}},"categories":["snow","ski-goggles","womens-ski-goggles"]}
