{"sku":"860029","manufacturer_id":"311020732069","brand_name":"Spy","product_name":" Spy Targa Mini Snow Goggles - Girls'","long_description":"Boasting the same features found in adult models, the girls' Spy Targa Mini snow goggles deliver clear optics and a comfortable fit for your little grom's days on the mountain. Bronze lens has a blue tint with 24% visible light transmission (VLT) for good all-around performance in changing light conditions. Cylindrical lens is designed to deliver wide peripheral vision; minimalist frame helps expand the viewable area. Double-layer thermal lens creates a thermal barrier between the cold outside air and the warm air next to the face, helping reduce fogging. Antifog and antiscratch lens treatments help keep vision clear and distortion-free. Strategically placed frame vents increase airflow to reduce fogging; flexible polyurethane frame ensures a comfortable fit. Dual-layer foam with moisture-wicking fleece supplies a comfortable, snug seal around the face. The wide adjustable strap of the girls' Spy Targa Mini snow goggles is backed with silicone ribbing so it stays in place.","short_description":"Boasting the same features found in adult models, the girls' Spy Targa Mini snow goggles deliver clear optics and a comfortable fit for your little grom's days on the mountain.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Kids' Ski Goggles","thumb_url":"http://i1.avlws.com/115/s376711.png","image_url":"http://i1.avlws.com/115/l376711.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376711&tt=df","retail_price":"39.95","sale_price":"27.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376711\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376711.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860029&amp;link=&amp;tabs=-Details\"></script>","variants":{"8600290001":{"sku":"8600290001","vendor_sku":"311020732069","upc":"648478736702","size":"BRONZE","color":"STARSTRUCK","retail_price":"27.83","sale_price":"27.83"}},"categories":["snow","ski-goggles","kids-ski-goggles"]}
