{"sku":"860020","manufacturer_id":"313074570829","brand_name":"Spy","product_name":" Spy Raider Snow Goggles - Spy+POW Frame","long_description":"With a large, view-maximizing cylindrical lens, the Spy Raider Spy+POW goggles deliver clear vision and come with a spare lens. As a bonus, each goggle sold contributes to Protect Our Winters (POW). $3 from each goggle sold goes towards POW environmental protection programs, which work to reduce climate change's effects on winter sports and local economies. Blue Contact lens has a blue tint with 45% visible light transmission (VLT) for good all-around performance in changing light conditions. Spare Bronze lens has a bronze tint with 24% VLT, delivering increased contrast in overcast, flat light conditions. Oversized cylindrical lens is designed to deliver wide peripheral vision so you can see more of the mountain; minimalist frame helps expand your viewable area. Double-layer thermal lens creates a thermal barrier between the cold outside air and the warm air next to your face, helping reduce fogging. Antifog and antiscratch lens treatments help keep your vision clear and distortion-free. Strategically placed frame vents increase airflow to reduce fogging; flexible polyurethane frame ensures a comfortable fit. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Wide adjustable strap is backed with silicone ribbing so it stays in place, whether you're wearing a helmet or not. Please note: though the Raider goggles come with a spare lens, the frame is not optimized for fast lens changes; some caution and effort will be necessary to change lenses.","short_description":"With a large, view-maximizing cylindrical lens, the Spy Raider Spy+POW goggles deliver clear vision and come with a spare lens. As a bonus, each goggle sold contributes to Protect Our Winters (POW).","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s380975.png","image_url":"http://i1.avlws.com/115/l380975.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=380975&tt=df","retail_price":"119.95","sale_price":"83.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=380975\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m380975.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860020&amp;link=&amp;tabs=-Details\"></script>","variants":{"8600200001":{"sku":"8600200001","vendor_sku":"313074570829","upc":"648478736597","size":"BLUE CONTACT","color":"SPY+POW","retail_price":"83.83","sale_price":"83.83"}}}
