{"sku":"860034","manufacturer_id":"LSPHF017-R","brand_name":"Lifestraw","product_name":"LifeStraw Water Filter","long_description":"Filtering water on ultralight adventures just got a whole lot easier. The LifeStraw water filter lets you safely sip straight from the stream or lake without any pumping, squeezing or filling. Weighing only 2 oz., the easy-to-use LifeStraw water filter is one of the lightest filters available, and it takes up very little space in your backpack. Hollow-fiber filter membrane offers a high flow rate; sip on the straw and it filters the water while it's on the way to your mouth. Get down close to the stream or lake and use the LifeStraw to drink straight from the source, or fill your water bottle and insert the filter to start sipping. 0.2-micron filter physically removes 99.9999% of all bacteria, such as salmonella, cholera and E.coli; removes 99.9% of all protozoa, such as giardia and cryptosporidium. Effectively filters up to 264 gal. (1,000 liters). Regularly blowing through the LifeStraw water filter after drinking helps keep the filter clean and prevents clogging. Includes a removable lanyard.","short_description":"Filtering water on ultralight adventures just got a whole lot easier. The LifeStraw water filter lets you safely sip straight from the stream or lake without any pumping, squeezing or filling.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426431.png","image_url":"http://i1.avlws.com/115/l426431.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426431&tt=df","retail_price":"21.95","sale_price":"21.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426431\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426431.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860034&amp;link=&amp;tabs=-Details\"></script>","variants":{"8600340001":{"sku":"8600340001","vendor_sku":"LSPHF017-R","retail_price":"21.95","sale_price":"21.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
