{"sku":"860105","manufacturer_id":"E92 RT","brand_name":"Petzl","product_name":" Petzl Tikka R+ Headlamp","long_description":"Whether you're reading a map or searching for a trail, the built-in light sensor in the Petzl Tikka(R) R+ headlamp automatically adjusts beam pattern and light output, leaving your hands free. When you're looking at an object at very close range, such as a map or piece of equipment, the Reactive sensor adjusts the light to a very wide beam with low output. As you make your way down the trail, the beam widens and adjusts to a medium light output in order to illuminate objects in the path. If you raise your head to see something in the distance, such as a trail marker or rappel anchor, the beam becomes focused and the light intensity increases. Reactive lighting keeps your hands free longer because you don't need to press a button to adjust light output; it also extends battery life by efficiently using power. Download OS by Petzl software to modify the functionality of your R+ headlamp; you can adjust light intensity, burn time and distance according to an activity. Create custom activity profiles or select from pre-configured profiles such as trail running, mountaineering and hiking; load these onto the R+ and you're ready to go. OS by Petzl software is available for download from Petzl at www.petzl.com/OS. Headlamp can also be operated in constant mode, which disables the sensor and gives you standard high, medium and low output settings. LED shines light 2 - 65m and outputs 7 - 170 lumens on high Reactive mode, 2 - 55m and 7 - 130 lumens on medium Reactive and 2 - 40m and 7 - 70 lumens on low Reactive mode. In constant mode, LED throws light 50m and outputs 120 lumens on high, 40m and 80 lumens on medium and 30m and 40 lumens on low. Red LED positioned to the side of the white LED helps preserve your night vision; use the headlamp as a blinking light to increase your chance of being seen in urban environs.","short_description":"Whether you're reading a map or searching for a trail, the built-in light sensor in the Petzl Tikka(R) R+ headlamp automatically adjusts beam pattern and light output, leaving your hands free.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417159.png","image_url":"http://i1.avlws.com/115/l417159.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417159&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417159\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417159.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860105&amp;link=&amp;tabs=-Details\"></script>","variants":{"8601050001":{"sku":"8601050001","vendor_sku":"E92 RB","color":"BLUE","retail_price":"79.95","sale_price":"79.95"},"8601050002":{"sku":"8601050002","vendor_sku":"E92 RC","color":"CORAL","retail_price":"79.95","sale_price":"79.95"},"8601050003":{"sku":"8601050003","vendor_sku":"E92 RT","color":"TEAL","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
