{"sku":"860106","manufacturer_id":"E95 RC","brand_name":"Petzl","product_name":" Petzl Tikka RXP Headlamp","long_description":"With a built-in sensor that automatically adjusts light output from 7 - 215 lumens without a single button press, the Petzl Tikka(R) RXP is ultimate lighting solution for runs, hikes and climbs. When you're looking at an object at very close range, such as a map or piece of equipment, the Reactive sensor adjusts the light to a very wide beam with low output. As you make your way down the trail, the beam widens and adjusts to a medium light output in order to illuminate objects in the path. If you raise your head to see something in the distance, such as a trail marker or rappel anchor, the beam becomes focused and the light intensity increases. Reactive lighting keeps your hands free longer because you don't need to press a button to adjust light output; it also extends battery life by efficiently using power. Download OS by Petzl software to modify the functionality of your RXP headlamp; you can adjust light intensity, burn time and distance according to an activity. Create custom activity profiles or select from pre-configured profiles such as trail running, mountaineering and hiking; load these onto the RXP and you're ready to go. OS by Petzl software is available for download from Petzl at www.petzl.com/OS. Headlamp can also be operated in constant mode, which disables the sensor and gives you standard high, medium and low output settings. LEDs shine light 2 - 110m and outputs 7 - 215 lumens on high Reactive mode, 2 - 90m and 7 - 160 lumens on medium Reactive and 2 - 70m and 7 - 80 lumens on low Reactive mode. In constant mode, LED throws light 100m and outputs 215 lumens on high, 75m and 100 lumens on medium and 25m and 45 lumens on low. Red LED positioned to the side of the white LEDs lets you preserve your night vision or use the headlamp as a blinking light to increase your visibility in urban environments.","short_description":"With a built-in sensor that automatically adjusts light output from 7 - 215 lumens without a single button press, the Petzl Tikka(R) RXP is ultimate lighting solution for runs, hikes and climbs.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417163.png","image_url":"http://i1.avlws.com/115/l417163.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417163&tt=df","retail_price":"94.95","sale_price":"94.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417163\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417163.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860106&amp;link=&amp;tabs=-Details\"></script>","variants":{"8601060001":{"sku":"8601060001","vendor_sku":"E95 RN","color":"BLACK","retail_price":"94.95","sale_price":"94.95"},"8601060002":{"sku":"8601060002","vendor_sku":"E95 RC","color":"CORAL","retail_price":"94.95","sale_price":"94.95"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
