{"sku":"860240","manufacturer_id":"14-81250-65","brand_name":"Mountainsmith","product_name":" Mountainsmith Descent Camera Chest Pack","long_description":"Access your camera quickly while you're on the go with the Mountainsmith Descent camera chest pack. It comes with its own shoulder harness system for all-day comfort and convenience. Compatible with a wide array of Mountainsmith camera pack shoulder strap systems (sold separately)-simply unclip the harness to switch it out. Movable dividers in the padded main compartment allow custom storage options; yellow-lined interior provides increased visibility to contents. Molded back panel and mesh back harness with 4 attachment points offer comfort when carrying against your chest. Removable storm cover and 840-denier ballistic nylon reinforcements provide protection and durability. Reverse clamshell opening to main compartment makes it easy to access your camera when you're on the move. Front accessory pocket with key clip and side mesh pocket accommodate small essentials and a water bottle. Hypalon(TM) lens case attachment system lets you add an optional lens case, not included. 450-denier ReDura(TM) PET polyester body fabric is 100% recycled. The Mountainsmith Descent camera chest pack has internal measurements of 14.25 x 10.75 x 5 in.","short_description":"Access your camera quickly while you're on the go with the Mountainsmith Descent camera chest pack. It comes with its own shoulder harness system for all-day comfort and convenience.","category":"Electronics","subcategory":"Photography","product_group":"Camera Bags","thumb_url":"http://i1.avlws.com/115/s440815.png","image_url":"http://i1.avlws.com/115/l440815.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440815&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440815\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440815.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860240&amp;link=&amp;tabs=-Details\"></script>","variants":{"8602400001":{"sku":"8602400001","vendor_sku":"14-81250-65","upc":"757894322953","color":"ANVIL GREY","retail_price":"99.95","sale_price":"99.95"}},"categories":["electronics","photography","camera-bags"]}
