{"sku":"860221","manufacturer_id":"EG)713751-BBLC","brand_name":"Electric","product_name":" Electric EG2.5 Snow Goggles","long_description":"Offering a great fit for small- to medium-sized faces, the Electric EG2.5 snow goggles deliver a wide field of vision thanks to a minimalist frame and large spherical lens. Jimbo Phillips frame comes with a Bronze/Blue Chrome lens with 18-22% visible light transmission (VLT) to deliver excellent definition in sunny to partly cloudy conditions. Neon Zebra frame comes with a bronze-tint Bronze/Pink Chrome lens with 24% VLT to deliver excellent definition in sunny to partly cloudy conditions. Scratch-resistant spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Double-layer lens helps create a thermal barrier to reduce fogging; directional pressure valve allows lens to adapt to altitude changes without distorting the lens. Antiglare coating on inside of lens and light-absorbent paint on frame panels below eyes work to minimize the effects of glare and reflected light, reducing eye strain. Antifog lens treatment and full-perimeter venting combat lens fogging, delivering clear vision in changing weather. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Tough, minimalist thermoplastic urethane frame offers consistent flexibility in changing temperatures for a comfortable, secure fit. The helmet-compatible design of the Electric EG2.5 snow goggles fits small- to medium-size faces; goggles come with a microfiber storage bag.","short_description":"Offering a great fit for small- to medium-sized faces, the Electric EG2.5 snow goggles deliver a wide field of vision thanks to a minimalist frame and large spherical lens.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381023.png","image_url":"http://i1.avlws.com/115/l381023.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381023&tt=df","retail_price":"132.83","sale_price":"132.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381023\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381023.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860221&amp;link=&amp;tabs=-Details\"></script>","variants":{"8602210001":{"sku":"8602210001","vendor_sku":"EGO713351-BPKC","upc":"884932215356","size":"BRONZE/PINK CHROME","color":"NEON ZEBRA","retail_price":"125.83","sale_price":"125.83"},"8602210002":{"sku":"8602210002","vendor_sku":"EG)713751-BBLC","upc":"884932215394","size":"BRONZE/BLUE CHROME","color":"JIMBO PHILLIPS","retail_price":"132.83","sale_price":"132.83"}}}
