{"sku":"860242","manufacturer_id":"14-81230-65","brand_name":"Mountainsmith","product_name":"Mountainsmith Borealis Camera Pack","long_description":"The Mountainsmith Borealis camera pack transports your cameras, lenses, laptop and accessories in protective comfort while you roam the globe in search of the ultimate photo. Padded hipbelt, contoured shoulder straps and an adjustable sternum strap offer all-day packing comfort; hipbelt can be tucked out of the way when not in use. Bottom clamshell pocket is heavily padded to protect your cameras and lenses; adjustable dividers allow you to customize the layout for storing your photo gear. Top-access, padded laptop compartment is sized to fit up to a 16 in. screen. Organize your small items in the interior laminated pocket, easy-access front pocket with key clip and handy hipbelt pockets. Compression straps convert to carry a snowboard, skis or snowshoes. Removable storm cover provides additional protection from the elements. Easy-access tripod mount allows you to quickly pack and unpack your tripod. Total volume measures 1,500 cu. in.; internal dimensions measure 21.25 x 12.25 x 8.75 in. Mountainsmith Borealis camera pack is built tough with 100% recycled ReDura PET fabric, YKK zippers and ballistic nylon reinforcements.","short_description":"The Mountainsmith Borealis camera pack transports your cameras, lenses, laptop and accessories in protective comfort while you roam the globe in search of the ultimate photo.","category":"Electronics","subcategory":"Photography","product_group":"Camera Bags","thumb_url":"http://i1.avlws.com/115/s426903.png","image_url":"http://i1.avlws.com/115/l426903.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426903&tt=df","retail_price":"209.95","sale_price":"209.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426903\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426903.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860242&amp;link=&amp;tabs=-Details\"></script>","variants":{"8602420001":{"sku":"8602420001","vendor_sku":"14-81230-65","upc":"757894322939","color":"ANVIL GREY","retail_price":"209.95","sale_price":"209.95"}},"categories":["electronics","photography","camera-bags"]}
