{"sku":"860266","manufacturer_id":"113181.D21.166","brand_name":"Volkl","product_name":" Volkl RTM 75 iS Skis with Bindings - Men's - 2013/2014","long_description":"Suited to intermediate skiers pushing their skills on groomed runs, the Volkl RTM 75 iS skis with bindings inspire speedy confidence thanks to a lively core and easy-to-turn rockered tips. You'll notice a snappy feel when linking turns thanks to the dual wood core-it's what makes the Volkl RTM 75 iS skis a touch more nimble than the RTM 75 skis. Very stable and responsive at speed, the dual wood core offers a forgiving feel that won't punish you for small mistakes in technique. Raised reinforcement channels along the top edges of the skis, a distinct feature on all Volkl carvers, also make the skis feel more stable at higher speeds. Slightly rockered tips make it easy to start turning at a moment's notice and offer forgiving stability in soft snow and crud. Soft flexing tail makes it easy to release skis out of turns and avoid oncoming obstacles, a welcome feature if you are tackling tough slopes. Bindings attach to skis via integrated rails, eliminating screws and promoting superb edge hold and natural flex. Integrated bindings features DIN 3 - 10 release settings, a range suited to beginning and intermediate skiers at low to medium speeds. Base or topsheet color may vary from online photo.","short_description":"Suited to intermediate skiers pushing their skills on groomed runs, the Volkl RTM 75 iS skis with bindings inspire speedy confidence thanks to a lively core and easy-to-turn rockered tips.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382231.png","image_url":"http://i1.avlws.com/115/l382231.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382231&tt=df","retail_price":"649.00","sale_price":"449.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382231\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382231.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860266&amp;link=&amp;tabs=-Details\"></script>","variants":{"8602660002":{"sku":"8602660002","vendor_sku":"113181.D21.166","upc":"821264547748","size":"166 CM","retail_price":"449.83","sale_price":"449.83"}},"categories":["snow","skis","downhill-skis"]}
