{"sku":"860217","manufacturer_id":"154608","brand_name":"Isis","product_name":" Isis Diva Pants - Women's - 2012 Closeout","long_description":"Built to keep you dry during long days on the mountain, the Isis Diva pants with suspenders provide waterproof protection and a fit that lets you show off your moves on the halfpipe. Polyester fabric features a 3-layer Cocona(R) Xcelereator waterproof, breathable membrane that blocks rain and wind while still letting body heat escape. Fabric also features added spandex so it stretches with you, allowing total freedom of motion; taped seams ensure complete protection. Diva pants feature a drop seat with removable, adjustable suspenders, enhancing comfort and keeping pants from falling while you're moving. Adjustable internal waistband ensures a secure, comfortable fit; full-length side zip allows easy on/off; zipper is watertight. Internal gaiters fit snugly over ski and mountaineering boots; artculated seat and knees allow full range of motion. Thigh pocket features a watertight zipper and a removable ski pass sleeve and bungee key hook. Isis Diva pants feature scuff guards on the inner legs to protect against abrasion. Closeout.","short_description":"Built to keep you dry during long days on the mountain, the Isis Diva pants with suspenders provide waterproof protection and a fit that lets you show off your moves on the halfpipe.","category":"Women's Clothing","subcategory":"Women's Pants","product_group":"Women's Snow Pants","thumb_url":"http://i1.avlws.com/115/s395575.png","image_url":"http://i1.avlws.com/115/l395575.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=395575&tt=df","keywords":"hardshell","retail_price":"299.00","sale_price":"130.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=395575\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m395575.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860217&amp;link=&amp;tabs=-Details\"></script>","variants":{"8602170005":{"sku":"8602170005","vendor_sku":"154608","upc":"844085264267","size":"10","color":"BLACK","retail_price":"130.73","sale_price":"130.73"}},"categories":["womens","womens-pants","womens-snow-pants"]}
