{"sku":"860313","manufacturer_id":"113328.163","brand_name":"Volkl","product_name":" Volkl Bridge Skis - Men's - 2013/2014","long_description":"With a subtle, fully rockered profile, the advanced-level Volkl Bridge skis are ready to shred big mountain lines and spend the rest of the day hucking in the half pipe. When tipped over and put on edge, the smooth, gradual rocker from tip to tail creates uninterrupted edge contact during the turn, ripping graceful arcs into groomed terrain. Full rocker also increases maneuverability in soft snow, so you can play on the backside of the mountain or hunt down overlooked stashes of pow. The full rocker profile of the Bridge skis is subtle compared to that of powder-specific Volkl skis and is well suited to the hard snow of the half pipe. Quick and responsive across all terrain and in all conditions, the 95mm waists turn easily on hardpack and offer enough flotation to enjoy powder. With a vertically laminated poplar and beech core and vertical sidewalls, Bridge skis turn easily from edge to edge and are responsive to aggressive turns at high speed. Tough Box construction sheathes the wood core in composite and fiberglass to remain durable during high speed landings and to snap back quickly from butters and ollies. Carbon laminate in the bottom layer of the core stabilizes the ride and further enhances durability. Directional twin tip heavily favors skiing forward but allows you to ski and land jumps backward if needed. Base or topsheet color may vary from online photo.","short_description":"With a subtle, fully rockered profile, the advanced-level Volkl Bridge skis are ready to shred big mountain lines and spend the rest of the day hucking in the half pipe.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382251.png","image_url":"http://i1.avlws.com/115/l382251.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382251&tt=df","retail_price":"599.00","sale_price":"399.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382251\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382251.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860313&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603130001":{"sku":"8603130001","vendor_sku":"113328.163","upc":"821264527788","size":"163 CM","retail_price":"399.83","sale_price":"399.83"}}}
