{"sku":"860334","manufacturer_id":"L35323700","brand_name":"Salomon","product_name":"Salomon District Snowboard Bindings - 2013/2014","long_description":"The cushioned baseplates of the Salomon District snowboard bindings ease the impact of your landings when you're dropping huge features in the park. Comfy straps lock your feet in for a secure fit. ShadowFit baseplates have an anatomic fit and flexible heel loop to provide mobility, performance and comfort; Kevlar(R) Quickwire supports around heels provide strength. Adjustable toe ramps offer you the best possible control and power on your toe edge; integrated mounting system keeps all your hardware in place when adjusting bindings. Full EVA baseplate padding damps vibrations and cushion landings. District highbacks feature a unique flex pattern and asymmetric shape designed for comfort; integrated foward lean; highbacks can be rotated to match your riding angles. 3D, asymmetric ankle straps prevent pressure points while offering a secure fit; toe straps grip boots to lock your feet in. Micro adjustments on straps let you lengthen or shorten straps for an optimal fit. Powerglide aluminum buckles are lightweight and easy to operate. Universal discs are compatible with all existing mounting systems including the Burton Channel system.","short_description":"The cushioned baseplates of the Salomon District snowboard bindings ease the impact of your landings when you're dropping huge features in the park. Comfy straps lock your feet in for a secure fit.","category":"Snowboarding","subcategory":"Snowboard Bindings","product_group":"Strap Snowboard Bindings","thumb_url":"http://i1.avlws.com/115/s461563.png","image_url":"http://i1.avlws.com/115/l461563.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461563&tt=df","retail_price":"239.95","sale_price":"141.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461563\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461563.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860334&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603340001":{"sku":"8603340001","vendor_sku":"L35323700","upc":"080694123988","size":"M","color":"BLACK/ORANGE","retail_price":"141.83","sale_price":"141.83"}},"categories":["snow","snowboard-bindings","strap-snowboard-bindings"]}
