{"sku":"860318","manufacturer_id":"113322.195","brand_name":"Volkl","product_name":" Volkl Kuro Skis - Men's - 2013/2014","long_description":"Made for the fluffiest of the fluffy, the Volkl Kuro skis feature super-wide 132mm waists, a stabilizing titanium laminate in the core and a deeply rockered profile to take on the deepest powder. Full rocker increases maneuverability in deep snow, making turns in powder effortless and giving the skis a surflike, floaty feel. The smooth, gradual rocker from tip to tail also creates uninterrupted edge contact on groomed runs so you can maneuver these jumbo powder skis back to the lifts. Low tip reduces chatter on groomed runs and resists diving in soft snow. Multilayer wooden core uses dense ash under the bindings to ensure screws won't come loose during harsh landings; soft poplar elsewhere makes the skis snappy and responsive. Tough Box construction sheathes the wood core in composite and fiberglass to remain durable during high speed landings and to snap back quickly from aggressive turns. Titanium laminate in the core stabilizes the ride and further, enhances stability and allows advanced skiers to ski as aggressively as they want. Stiff flex zone in front adds stability, and medium flex underfoot transitions to the soft tail that aids in turning on groomers and maneuvering in pow. Directional twin tip heavily favors skiing forward but allows you to ski and land jumps backward if needed. Volkl Kuro skis require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"Made for the fluffiest of the fluffy, the Volkl Kuro skis feature super-wide 132mm waists, a stabilizing titanium laminate in the core and a deeply rockered profile to take on the deepest powder.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382263.png","image_url":"http://i1.avlws.com/115/l382263.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382263&tt=df","retail_price":"899.00","sale_price":"599.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382263\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382263.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860318&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603180001":{"sku":"8603180001","vendor_sku":"113322.185","upc":"821264528471","size":"185 CM","retail_price":"599.83","sale_price":"599.83"},"8603180002":{"sku":"8603180002","vendor_sku":"113322.195","upc":"821264528488","size":"195 CM","retail_price":"599.83","sale_price":"599.83"}},"categories":["snow","skis","downhill-skis"]}
