{"sku":"860323","manufacturer_id":"113261.D32.147","brand_name":"Volkl","product_name":" Volkl Adora Skis with Bindings - Women's - 2013/2014","long_description":"Friendly to new skiers thanks to easy-to-turn rockered tips, the women's Volkl Adora skis with bindings use quality construction to keep up with your skills once you've left the bunny slopes. Day one on the slopes will be easy and fun thanks to the slight rocker in the tips that makes it easy to start turning. As you venture away from the beginner area, you'll find the rockered tips offer a stable feel in cruddy or soft snow. The composite core creates a soft, easy-to-turn flex that gives progressing skiers the confidence they need to improve their skills. Raised reinforcement channels along the top edges of the skis enhance stability and make it easier to turn once you're ready for fast runs-these skis grow with you. Soft flexing tail makes it easy to release skis out of turns and avoid oncoming obstacles, a welcome feature if you are tackling tough slopes. Not just a smaller pair of men's skis, the Adora skis feature sidecuts and bindings that are designed specifically for the performance and comfort of women skiers. Integrated bindings features DIN 3 - 10 release settings, a range suited to beginning and intermediate skiers at low to medium speeds. Base or topsheet color may vary from online photo.","short_description":"Friendly to new skiers thanks to easy-to-turn rockered tips, the women's Volkl Adora skis with bindings use quality construction to keep up with your skills once you've left the bunny slopes.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s439831.png","image_url":"http://i1.avlws.com/115/l439831.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=439831&tt=df","retail_price":"499.00","sale_price":"299.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=439831\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m439831.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860323&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603230001":{"sku":"8603230001","vendor_sku":"113261.D32.147","upc":"821264548066","size":"147 CM","retail_price":"299.83","sale_price":"299.83"},"8603230002":{"sku":"8603230002","vendor_sku":"113261.D32.153","upc":"821264548073","size":"153 CM","retail_price":"299.83","sale_price":"299.83"}}}
