{"sku":"860329","manufacturer_id":"113376.156","brand_name":"Volkl","product_name":" Volkl Kenja Skis - Women's - 2013/2014","long_description":"From hardpack and crud to powdery backside bowls, the advanced-level Volkl Kenja skis for women gracefully carve up the mountain thanks to their 87mm waists and lightweight construction. Skis are quick and responsive across all terrain and in all conditions, and 87mm waists offer enough flotation to enjoy the occasional powder stash. Wood core uses lightweight and structurally sound balsa wood along with poplar, for a core that's lighter and more flexible than comparable unisex skis. With a vertically laminated core and vertical sidewalls, the Kenja skis turn easily from edge to edge and are responsive to aggressive turns at high speed. Tough Box construction sheathes the wood core in composite and fiberglass to remain durable during high speed landings and to snap back quickly from aggressive turns. You'll appreciate the smooth, powerful snap of these skis thanks to 2 full-length titanium laminates that absorb vibration and increase the feel of the terrain. Slight rise in the tips makes it easy to start turning and offers forgiving stability in crud, and standard camber underfoot enhances maneuverability on groomed runs. Low tip reduces chatter on groomed runs and resists diving in soft snow. Stiff flex zone in front adds stability, and medium flex underfoot transitions to the soft tail that aids in turning on groomers and maneuvering in pow. Directional twin tip heavily favors skiing forward but allows you to ski and land jumps backward if needed. Base or topsheet color may vary from online photo.","short_description":"From hardpack and crud to powdery backside bowls, the advanced-level Volkl Kenja skis for women gracefully carve up the mountain thanks to their 87mm waists and lightweight construction.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382279.png","image_url":"http://i1.avlws.com/115/l382279.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382279&tt=df","retail_price":"649.00","sale_price":"449.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382279\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382279.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860329&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603290001":{"sku":"8603290001","vendor_sku":"113376.156","upc":"821264528105","size":"156 CM","retail_price":"449.83","sale_price":"449.83"},"8603290002":{"sku":"8603290002","vendor_sku":"113376.163","upc":"821264528112","size":"163 CM","retail_price":"449.83","sale_price":"449.83"}},"categories":["snow","skis","downhill-skis"]}
