{"sku":"860340","manufacturer_id":"11370 00006","brand_name":"Ortovox","product_name":"Ortovox 3+ RECCO Avalanche Transceiver","long_description":"The Ortovox 3+ RECCO(R) avalanche transceiver not only makes searching simple but it also makes it easier for rescuers to find you. And, it includes a RECCO reflector inside for backup protection. 3+ RECCO has the ability to analyze its vertical orientation when buried and transmit its signal on the transmitting antenna best positioned for searchers to pick up a signal. Most transceivers can only transmit on one antenna; by being able to transmit on two antennas, the 3+ has a consistent 40m range no matter what position it is buried in. The third antenna in the 3+ allows excellent precision and pinpoint search capabilities when you're zeroing in on a buried victim. Upon reaching a victim, the searcher can press the single button to mark the found victim and immediately set out for other burials by simply following the visual data. Marking a victim forces the transceiver to stop receiving the marked signal and focus on the next strongest signal; mark up to three victims. LCD screen features a circular display with a directional arrow and distance readout to guide you to the victim. Pinpoint search features semicircles around the edge of the screen that indicate whether you are getting closer to or farther away from the signal. Loud, intuitive acoustics help guide you to the buried transceiver when you're getting close. If the transceiver registers no movement for more than 2 min. while searching, it automatically switches back to transmit mode in case a second avalanche has struck. Internal RECCO reflector brings peace of mind by offering a backup means for finding a buried victim; more than 700 ski areas and rescue teams around the world use RECCO. RECCO reflector enhances radio signals from search-and-rescue RECCO detectors, helping speed up the search for a buried avalanche victim. Compatible with all standardized avalanche beacons operating on the 457 kHz frequency.","short_description":"The Ortovox 3+ RECCO(R) avalanche transceiver not only makes searching simple but it also makes it easier for rescuers to find you. And, it includes a RECCO reflector inside for backup protection.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Avalanche Safety Gear","thumb_url":"http://i1.avlws.com/115/s407423.png","image_url":"http://i1.avlws.com/115/l407423.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407423&tt=df","retail_price":"369.00","sale_price":"369.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407423\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407423.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860340&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603400001":{"sku":"8603400001","vendor_sku":"11370 00006","color":"BLUE","retail_price":"369.00","sale_price":"369.00"}},"categories":["climbing","mountaineering-gear","avalanche-safety-gear"]}
