{"sku":"860314","manufacturer_id":"113326.186","brand_name":"Volkl","product_name":"Volkl Gotama Skis - Men's - 2013/2014","long_description":"Built for aggressive descents, the Volkl Gotama skis surf the powder, bust through crud and take an edge on groomers without hesitation thanks to a fully rockered design. Full rocker increases maneuverability in deep snow, making turns in powder effortless and adding a surflike, floaty feel. The smooth, gradual rocker from tip to tail also creates uninterrupted edge contact on groomed runs, ripping graceful arcs in corduroy on your way back to the lifts. Low tip reduces chatter on groomed runs and resists diving in soft snow. Multilayer wooden core uses dense ash under the bindings to ensure screws won't come loose during harsh landings. Soft poplar in the remainder of the skis makes them snappy and responsive. Tough Box construction sheathes the wood core in composite and fiberglass to remain durable during high speed landings and to snap back quickly from aggressive turns. Carbon laminate in the bottom layer of the core stabilizes the ride and further enhances durability. Stiff flex zone in front adds stability, and medium flex underfoot transitions to the soft tail that aids in turning on groomers and maneuvering in pow. Directional twin tip heavily favors skiing forward but allows you to ski and land jumps backward if needed. Volkl Gotama skis with 107mm waists require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"Built for aggressive descents, the Volkl Gotama skis surf the powder, bust through crud and take an edge on groomers without hesitation thanks to a fully rockered design.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382255.png","image_url":"http://i1.avlws.com/115/l382255.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382255&tt=df","retail_price":"699.00","sale_price":"499.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382255\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382255.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860314&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603140002":{"sku":"8603140002","vendor_sku":"113326.186","upc":"821264527764","size":"186 CM","retail_price":"499.83","sale_price":"499.83"}},"categories":["snow","skis","downhill-skis"]}
