{"sku":"860315","manufacturer_id":"113332.176","brand_name":"Volkl","product_name":" Volkl One Skis - Men's - 2013/2014","long_description":"Rockered powder skis you can use in chopped-up crud, wind-blown snow and even crust, the Volkl One skis feature 116mm waists and a tapered sidecut at tips and tails for maneuverability. Full rocker increases maneuverability in deep snow, making turns in powder effortless and adding a surflike, floaty feel. The smooth, gradual rocker from tip to tail also creates uninterrupted edge contact on groomed runs so you can deftly maneuver these wide-waisted powder skis back to the lifts. Early taper in the tip and tail allows the ski to transition easily from turn to turn instead of the automatic turn initiation and hooking that happens with a standard sidecut. Multilayer wooden core uses dense ash under the bindings to ensure screws won't come loose during harsh landings. Soft poplar in the remainder of the skis makes them snappy and responsive. Tough Box construction sheathes the wood core in composite and fiberglass to remain durable during high speed landings and to snap back quickly from aggressive turns. Carbon laminate in the bottom layer of the core stabilizes the ride and further enhances durability. Stiff flex zone in front adds stability, and medium flex underfoot transitions to the soft tail that aids in turning on groomers and maneuvering in pow. Directional twin tip heavily favors skiing forward but allows you to ski and land jumps backward if needed. Volkl One skis feature 116mm waists that require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"Rockered powder skis you can use in chopped-up crud, wind-blown snow and even crust, the Volkl One skis feature 116mm waists and a tapered sidecut at tips and tails for maneuverability.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s442439.png","image_url":"http://i1.avlws.com/115/l442439.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442439&tt=df","retail_price":"649.00","sale_price":"549.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442439\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442439.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860315&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603150001":{"sku":"8603150001","vendor_sku":"113332.176","upc":"821264528358","size":"176 CM","retail_price":"549.93","sale_price":"549.93"},"8603150002":{"sku":"8603150002","vendor_sku":"113332.186","upc":"821264528341","size":"186 CM","retail_price":"549.93","sale_price":"549.93"}},"categories":["snow","skis","downhill-skis"]}
