{"sku":"860317","manufacturer_id":"113330.186","brand_name":"Volkl","product_name":"Volkl Two Skis - Men's - 2013/2014","long_description":"Built large for epic days of deep powder, the Volkl Two skis feature huge 124mm waists, full rocker and a tapered sidecut at tips and tails for excellent manueverability atop deep snow. Full rocker increases maneuverability in deep snow, making turns in powder effortless and giving the skis a surflike, floaty feel. The smooth, gradual rocker from tip to tail also creates uninterrupted edge contact on groomed runs so you can maneuver these jumbo powder skis back to the lifts. Early taper in the tip and tail allows the ski to drift easily from turn to turn instead of the automatic turn initiation and hooking that happens with a standard sidecut. Low tip reduces chatter on groomed runs and resists diving in soft snow. Multilayer wooden core uses dense ash under the bindings to ensure screws won't come loose during harsh landings; soft poplar elsewhere makes the skis snappy and responsive. Tough Box construction sheathes the wood core in composite and fiberglass to remain durable during high speed landings and to snap back quickly from aggressive turns. Carbon laminate in the bottom layer of the core stabilizes the ride and further enhances durability. Stiff flex zone in front adds stability, and medium flex underfoot transitions to the soft tail that aids in turning on groomers and maneuvering in pow. Directional twin tip heavily favors skiing forward but allows you to ski and land jumps backward if needed. Volkl Two skis feature 124mm waists that require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"Built large for epic days of deep powder, the Volkl Two skis feature huge 124mm waists, full rocker and a tapered sidecut at tips and tails for excellent manueverability atop deep snow.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s442443.png","image_url":"http://i1.avlws.com/115/l442443.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442443&tt=df","retail_price":"749.00","sale_price":"599.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442443\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442443.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860317&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603170001":{"sku":"8603170001","vendor_sku":"113330.186","upc":"821264528310","size":"186 CM","retail_price":"599.93","sale_price":"599.93"},"8603170002":{"sku":"8603170002","vendor_sku":"113330.195","upc":"821264528327","size":"196 CM","retail_price":"599.93","sale_price":"599.93"}},"categories":["snow","skis","downhill-skis"]}
