{"sku":"860310","manufacturer_id":"113171.D20.176","brand_name":"Volkl","product_name":" Volkl RTM 77 Skis with Bindings - Men's - 2013/2014","long_description":"The advanced-level Volkl RTM 77 skis with bindings tear up the groomers with mellow rocker and offer enough waist width to float on soft snow when conditions are right. When tipped over and put on edge, the smooth, gradual rocker from tip to tail creates uninterrupted edge contact during the turn, ripping graceful arcs into groomed terrain. Full rocker also increases maneuverability in soft snow, so you can play on the backside of the mountain or hunt down overlooked stashes of pow. Raised reinforcement channels along the top edges of the skis, a distinct feature on all Volkl carvers, make the skis feel extra stable at high speeds. You'll also notice a lively, snappy feel when powering through turns thanks to the steel laminate built into the dual wood core. Bindings attach to skis via integrated rails, eliminating screws and promoting superb edge hold and natural flex. Integrated bindings feature DIN 3 - 11 release settings, a range suited to intermediate or advanced skiers at medium to high speeds. Base or topsheet color may vary from online photo.","short_description":"The advanced-level Volkl RTM 77 skis with bindings tear up the groomers with mellow rocker and offer enough waist width to float on soft snow when conditions are right.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382243.png","image_url":"http://i1.avlws.com/115/l382243.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382243&tt=df","retail_price":"699.00","sale_price":"479.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382243\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382243.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860310&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603100002":{"sku":"8603100002","vendor_sku":"113171.D20.171","upc":"821264547700","size":"171 CM","retail_price":"479.83","sale_price":"479.83"}}}
