{"sku":"860324","manufacturer_id":"113251.D26.159","brand_name":"Volkl","product_name":"Volkl Aurena Skis with Bindings - Women's 2013/2014","long_description":"Set off for exploration on the women's Volkl Aurena skis with bindings. They keep up with intermediate-level skills on groomed runs thanks to their rockered tips and silky smooth construction. Slightly rockered tips make it easy to start turning at a moment's notice and offer forgiving stability in soft snow and crud. Very stable and easy to handle, the wood core of the Volkl Aurena skis offers a forgiving feel that won't punish you for small mistakes in technique. Raised reinforcement channels along the top edges of the skis, a distinct feature on all Volkl carvers, make the skis feel more stable at high speeds. Soft flexing tail makes it easy to release skis out of turns and avoid oncoming obstacles, a welcome feature if you are tackling tough slopes. Not just a smaller pair of men's skis, the Aurena skis feature sidecuts and bindings that are designed specifically for the performance and comfort of women skiers. Bindings attach to skis via integrated rails, eliminating screws and promoting superb edge hold and natural flex. Integrated bindings features DIN 3 - 10 release settings, a range suited to beginning and intermediate skiers at low to medium speeds. Base or topsheet color may vary from online photo.","short_description":"Set off for exploration on the women's Volkl Aurena skis with bindings. They keep up with intermediate-level skills on groomed runs thanks to their rockered tips and silky smooth construction.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s439835.png","image_url":"http://i1.avlws.com/115/l439835.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=439835&tt=df","retail_price":"599.00","sale_price":"399.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=439835\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m439835.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860324&amp;link=&amp;tabs=-Details\"></script>","variants":{"8603240002":{"sku":"8603240002","vendor_sku":"113251.D26.153","upc":"821264548028","size":"153 CM","retail_price":"399.83","sale_price":"399.83"},"8603240003":{"sku":"8603240003","vendor_sku":"113251.D26.159","upc":"821264548035","size":"159 CM","retail_price":"399.83","sale_price":"399.83"}},"categories":["snow","skis","downhill-skis"]}
