{"sku":"860409","manufacturer_id":"U130100301350","brand_name":"Atlas","product_name":" Atlas 1235 Snowshoes","long_description":"With aggressive traction, the Atlas 1235 snowshoes can handle anything you find between the trailhead and summit. Long-lasting durability and a secure fit make these snowshoes that you can depend on. Tenacious, stainless-steel toe crampons deeply penetrate the firmest snow and bite into icy slopes. Stainless-steel serrated heel cleats and side traction rails provide sure footing while traversing and descending the most technical terrain. Wrapp(TM) Pro bindings feature silicone straps that glide through low-friction buckles with a smooth buckle release for easy on/off use. 7075 V-shaped aluminum frames are the lightest and strongest Atlas offers, and have a stiff, responsive flex for smooth, easy striding. Spring-Loaded(TM) suspension uses offset webbing straps to create a springy platform beneath the feet that absorbs impact and allows natural side-to-side flex. Lightweight Duratek(TM) nylon decks are tough and built to withstand harsh, cold conditions; textured surfaces resist abrasion. Heel lift bars on the Atlas 1225 snowshoes relieve calf muscle fatigue while climbing; bars store flat when disengaged. Snowshoes measure 9.25 x 35 in. and have a recommended load weight of 180 to 300 lbs.","short_description":"With aggressive traction, the Atlas 1235 snowshoes can handle anything you find between the trailhead and summit. Long-lasting durability and a secure fit make these snowshoes that you can depend on.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Men's Snowshoes","thumb_url":"http://i1.avlws.com/115/s432139.png","image_url":"http://i1.avlws.com/115/l432139.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432139&tt=df","retail_price":"289.95","sale_price":"231.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432139\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432139.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860409&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604090001":{"sku":"8604090001","vendor_sku":"U130100301350","upc":"886745195405","size":"35 IN","color":"MARINE BLUE/ORANGE","retail_price":"231.93","sale_price":"231.93"}}}
