{"sku":"860473","manufacturer_id":"7525N1.GB","brand_name":"Marker","product_name":"Marker Griffon Schizo Downhill Ski Bindings","long_description":"Designed for young and lightweight advanced skiers, the Marker Griffon Schizo downhill ski bindings cater to the type of skiing you choose: move them forward for the park or backward for all-mountain. Griffon Schizo bindings are built to accommodate skiers starting at 80 lbs., and they offer an advanced DIN range of 4 - 13. Each binding moves 3cm forward or 3cm back using a simple screw adjustment on the toe piece. Position the binding in the forward position to maximize the skis' responsiveness when spending time in the park or riding swtich. Or, move the binding to the rear position and enjoy fresh snow on the rest of the mountain. Composite toe and heel cups keep binding weight to a minimum yet are still designed with a wide footprint for excellent performance on fat skis. Triple Pivot Elite toes have high energy absorption to prevent prerelease. Lightweight Inter-Pivot heels focus power in the direction of the boot soles and offer superior holding power and energy transfer. Freeride brakes ensure adequate clearance when skiing backward. Stainless-steel antifriction devices allow essential lateral boot movement despite dirty or worn soles or negative sliding friction. 110mm brakes fit many powder skis; mounting configuration of the Marker Griffon Schizo downhill ski bindings requires a 76mm minimum ski width.","short_description":"Designed for young and lightweight advanced skiers, the Marker Griffon Schizo downhill ski bindings cater to the type of skiing you choose: move them forward for the park or backward for all-mountain.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Downhill Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381611.png","image_url":"http://i1.avlws.com/115/l381611.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381611&tt=df","retail_price":"339.00","sale_price":"339.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381611\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381611.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860473&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604730001":{"sku":"8604730001","vendor_sku":"7525N1.GB","upc":"883295104130","size":"110 MM","color":"BLACK/WHITE/TEAL","retail_price":"339.00","sale_price":"339.00"}},"categories":["snow","ski-bindings","downhill-ski-bindings"]}
