{"sku":"860472","manufacturer_id":"7924N1.JT","brand_name":"Marker","product_name":" Marker Jester Pro Downhill Ski Bindings","long_description":"High-caliber bindings for the most aggressive big-mountain or park-and-pipe skiers, the Marker Jester Pro downhill ski bindings are made to perform on steep slopes when hesitation is not an option. Burly DIN settings from 8 - 18 let hard-charging skiers stomp huge landings and hit mach speeds. Lightweight and strong magnesium parts and wide toe baseplates increase durability and control of wide-waisted skis. Level height creates a neutral stance with a consistent balance point for doing tricks either forward or backward, and freeride brakes ensure clearance when skiing backward. Triple Pivot Elite toes absorb high levels of energy to help prevent prerelease, and updated horizontal torsion bar reinforcements enhance power and lateral precision. Lightweight Inter-Pivot heels focus power in the direction of the boot soles and offer superior holding power and energy transfer. Stainless-steel antifriction devices allow essential lateral boot movement despite dirty or worn soles or negative sliding friction. The Marker Jester Pro bindings feature fixed antifriction devices to increase boot retention and power transmission. 110mm brakes fit all-mountain wide skis and some powder skis; mounting configuration of the Marker Jester Pro downhill ski bindings requires a 78mm minimum ski width.","short_description":"High-caliber bindings for the most aggressive big-mountain or park-and-pipe skiers, the Marker Jester Pro downhill ski bindings are made to perform on steep slopes when hesitation is not an option.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Downhill Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381607.png","image_url":"http://i1.avlws.com/115/l381607.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381607&tt=df","retail_price":"399.00","sale_price":"279.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381607\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381607.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860472&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604720001":{"sku":"8604720001","vendor_sku":"7924N1.JT","upc":"883295103621","size":"110 MM","color":"MINT/ORANGE","retail_price":"279.83","sale_price":"279.83"}},"categories":["snow","ski-bindings","downhill-ski-bindings"]}
