{"sku":"860475","manufacturer_id":"7516N1.LA","brand_name":"Marker","product_name":" Marker Baron 13 EPF Randonee Bindings - 2013/2014","long_description":"As the lighter, more nimble cousin to the Marker Duke bindings, the Marker Baron EPF randonee bindings have earned their stripes as a favorite among big-mountain backcountry skiers. New for this season, Extended Power Frame (EPF) design is 28% wider than the previous version of the Baron to increase power transmission to your fat powder skis. Switch between downhill and touring mode using the levers located under your boots; lever position eliminates the chance of accidentally switching to touring mode while skiing. DIN 4 - 13 adjustment lets hard-charging skiers stomp huge landings and hit high speeds without worrying about prereleasing. Climbing heel design offers 3 positions-flat, 7deg and 13deg; positions can be easily adjusted using a ski pole. Gliding antifriction devices at the toes of the bindings are height adjustable to accommodate randonee and alpine boots. Low 36mm stand height creates a solid and secure connection to the ski. Included 110mm brakes fit wide skis and effectively stop runaway skis; brakes can be easily removed if desired. Heel design focuses power in direction of boot sole for superior holding power and energy transfer. Wide contact points efficiently transfer power to the skis. Marker Baron EPF randonee binding mounting configuration requires a minimum ski width of 89mm. Small size fits boot sole length of 265 - 325mm; large size fits boot sole length of 305 - 365mm.","short_description":"As the lighter, more nimble cousin to the Marker Duke bindings, the Marker Baron EPF randonee bindings have earned their stripes as a favorite among big-mountain backcountry skiers.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Randonee Ski Bindings","thumb_url":"http://i1.avlws.com/115/s453539.png","image_url":"http://i1.avlws.com/115/l453539.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=453539&tt=df","retail_price":"379.00","sale_price":"379.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=453539\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m453539.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860475&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604750001":{"sku":"8604750001","vendor_sku":"7516N1.LA","upc":"883295103980","size":"L","color":"BLACK/WHITE/RED","retail_price":"379.00","sale_price":"379.00"}},"categories":["snow","ski-bindings","randonee-ski-bindings"]}
