{"sku":"860431","manufacturer_id":"MTI-705B-0GN56","brand_name":"Mti","product_name":"MTI PFDiva F Spec PFD - Women's - 2012 Closeout","long_description":"Fully equipped for anglers and designed with women-specific comfort features, the PFDiva F Spec PFD by MTI is a smart mix between a fishing vest and life vest. Soft Adjust-a-Bust(TM) memory foam pads conform to the shape of your chest, providing support that's similar to an underwire bra. They also fill the gap under the bust, evening out pressure and reducing discomfort when the PFD is cinched up; foam pads can be removed to personalize the fit. Short torso cut and racerback allow maximum mobility, minimal ride-up and great fit. Cordura(R) nylon and closed-cell foam offer lasting performance. Adjustable shoulder, waist and Z-adjust side straps make it easy to fine-tune the fit; 4-way lash tab provides lashing options. Gusseted, zippered pocket opens to form a small shelf for tying on lures or flies, and 2 elastic loops store tools (not included) on the inside of the pocket. Includes a clear 8-compartment organizer box that measures approximately 4.5 x 3 in.; box fits into an elastic holder that can also house other accessories of your choice. A zippered cargo pocket features a spot for a pin-on retractor (not included) to keep your small tools within reach. Closeout.","short_description":"Fully equipped for anglers and designed with women-specific comfort features, the PFDiva F Spec PFD by MTI is a smart mix between a fishing vest and life vest.","category":"Paddling","subcategory":"Pfds","product_group":"Women's Pfds","thumb_url":"http://i1.avlws.com/115/s432023.png","image_url":"http://i1.avlws.com/115/l432023.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432023&tt=df","retail_price":"130.00","sale_price":"96.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432023\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432023.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860431&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604310002":{"sku":"8604310002","vendor_sku":"MTI-705B-0GN56","upc":"486043100028","size":"L/XL","color":"FERN/KHAKI","retail_price":"96.73","sale_price":"96.73"}},"categories":["paddling","pfds","womens-pfds"]}
