{"sku":"860468","manufacturer_id":"SPOT-PHONE-B-25","brand_name":"Spot","product_name":" SPOT Global Phone","long_description":"When you wander off the grid, the SPOT Global Phone keeps you connected to the people and data that matter most. Using satellite technology, it works almost anywhere in the world. Stay in touch with the office, let your friends know you're safe, or check your email. Enjoy great voice quality, competitive airtime prices and fast data speeds; choose from five monthly (one-year commitment) or five (prepaid) service plans to fit any budget. Light and compact design weighs only 7 oz. and packs easily for your travels. Long-life lithium ion rechargeable battery offers up to 4 hrs. of talk time and 36 hrs. in standby mode; included AC adapter recharges the battery from a wall outlet. Backlit color display with 4-line, 12-character LCD is easy to read; illuminated keypad makes the phone easy to operate in the dark. The SPOT Global phone comes with a standard U.S. phone number (254 area code)-no additional charges for calls between the United States, Canada and the Carribean. Phone features simple emergency calling, automatic international roaming and easy access to voice mail and inbound SMS messages. The SPOT Global Phone features a standard 2.5mm jack that lets you use a headset (not included).","short_description":"When you wander off the grid, the SPOT Global Phone keeps you connected to the people and data that matter most. Using satellite technology, it works almost anywhere in the world.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Plbs And Satellite Messengers","thumb_url":"http://i1.avlws.com/115/s412675.png","image_url":"http://i1.avlws.com/115/l412675.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412675&tt=df","retail_price":"499.95","sale_price":"499.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412675\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412675.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860468&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604680001":{"sku":"8604680001","vendor_sku":"SPOT-PHONE-B-25","upc":"893049001479","color":"BLACK","retail_price":"499.95","sale_price":"499.95"}}}
