{"sku":"860446","manufacturer_id":"GM74496","brand_name":"Gregory","product_name":"Gregory Maya 16 Pack - Women's","long_description":"The updated Gregory Maya 16 pack features a women-specific fit and a sculpted design that reduces seams, increases durability and creates a cleaner overall aesthetic for your done-in-a day trail fun. Inspired by the bio-dynamics of the human body, the shoulder and waistbelt suspension attach with BioSync(TM) artificial tendons for added stability. These artificial tendons act as attachment points allowing the harness to stretch into an ideal fit, moving with the body while in motion. Back panel, shoulder straps and hipbelt are sized and shaped for a woman's body; they feature air-mesh to vent and wick away moisture. Die-cut foam on the harness and back panel adds breathability while also decreasing weight. Internal compression system allows you to keep pack compressed and snug against your back; you can reach the compression straps easily while the pack is on. Compared to the prior version of the pack, the Maya 16 features improved access to the external hydration pocket with a rip-and-stick closure. Drink tube routing also includes an enhanced keeper clip on the shoulder harness (reservoir sold separately). Expandable, stretch-mesh front pocket with 3-point compression lets you stash bulky gear and keep it easily accessible. Zippered top pocket provides storage for often-used essentials; front harness includes a convenient sunglasses holder. Larger hipbelt pockets are ideal for stashing electronics or snacks; internal cargo stabilizer loop holds valuable electronics in place when pocket is open. Hideaway side pockets with integrated winged compression add to a streamlined design and additional stability. Adjustable sternum strap and webbing loop for lashing on light gear round out pack features. The Gregory Maya 16 pack is constructed from 70-denier ultra-tear-strength coated nylon for water repellency and durability.","short_description":"The updated Gregory Maya 16 pack features a women-specific fit and a sculpted design that reduces seams, increases durability and creates a cleaner overall aesthetic for your done-in-a day trail fun.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411299.png","image_url":"http://i1.avlws.com/115/l411299.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411299&tt=df","retail_price":"99.00","sale_price":"99.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411299\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411299.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860446&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604460001":{"sku":"8604460001","vendor_sku":"GM74496","upc":"844930080240","color":"FOG GRAY","retail_price":"99.00","sale_price":"99.00"},"8604460002":{"sku":"8604460002","vendor_sku":"GM74495","upc":"844930080233","color":"BREEZE BLUE","retail_price":"99.00","sale_price":"99.00"},"8604460003":{"sku":"8604460003","vendor_sku":"GM74497","upc":"844930080257","color":"FRESH PINK","retail_price":"99.00","sale_price":"99.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
