{"sku":"860471","manufacturer_id":"SS019182000","brand_name":"Suunto","product_name":"Suunto Ambit2 Sapphire GPS Multifunction Watch","long_description":"Strap the Suunto Ambit2 Sapphire GPS multifunction watch to your wrist and enjoy GPS navigation, weather info and Suunto apps at your fingertips while exploring, mountaineering or training. Whether you're mountaineering, running, biking, or swimming, enjoy navigation, speed, distance, altitude and weather along with access to 1,000+ apps for personalization. Compatible with optional Suunto ANT wireless heart rate monitor chest strap (not included) for peak training effect, recovery time, real-time heart rate and heart rate limits. Full-featured GPS with multiple coordinate systems features a SiRF IV chip and offers waypoint creation, navigation and storage along with 1- or 60-second tracking intervals. Accelerometer-integrated GPS offers highly responsive tracking of pace/speed and distance; other training features include a chronograph and manual or automatic laps. 3D compass shows a correct bearing, even if tilted up to 30deg off level; barometric altimeter tracks your your ascent and descent. Barometric sensor helps you predict changes in the weather; thermometer keeps you apprised of the current temperature. 2-way USB cable lets you charge the battery and transfer data to a computer; upload waypoints, logging and analysis to Movescount.com to keep an online record of your data. Standard watch functions include dual time, date and alarm; positive/negative display lets you switch from light to dark for optimal visibility or stealth mode. Rechargeable lithium-ion battery with low-battery indicator features enhanced battery life: 30 days with watch functionality and 50 hours with GPS tracking. The Suunto Ambit2 Sapphire GPS multifunction watch features a built-to-last casing with tough mineral crystal lens that is water resistant to 100m (330 ft.).","short_description":"Strap the Suunto Ambit2 Sapphire GPS multifunction watch to your wrist and enjoy GPS navigation, weather info and Suunto apps at your fingertips while exploring, mountaineering or training.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413511.png","image_url":"http://i1.avlws.com/115/l413511.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413511&tt=df","keywords":"odometer,waterproof","retail_price":"600.00","sale_price":"600.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413511\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413511.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860471&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604710001":{"sku":"8604710001","vendor_sku":"SS019182000","upc":"045235908479","color":"GRAY","retail_price":"600.00","sale_price":"600.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
