{"sku":"860428","manufacturer_id":"MTI-409K-0PW67","brand_name":"Mti","product_name":"MTI Maya PFD - Women's - 2012 Closeout","long_description":"Take to the water in the MTI Maya PFD for your next canoe, kayak or rafting trip. It offers up snug comfort via its neoprene back panel and an attractive look with its curvy lines. Stretchy neoprene panel in lumbar region is integrated into the fabric of the PFD, and 2 adjustment straps on either side tighten this panel over the small of the back. Because of the elasticity of the neoprene, you retain mobility without restricting movement when the panel is taut. The fit of this innovative panel offers comfort that's not easily matched by traditional PFDs, which sacrifice mobility for a tight fit. Adjustable shoulder straps offer a versatile fit; either tighten up the shoulder area for a snug fit or loosen for more chest room. Shoulder adjustments are covered to add protection and provide a smooth, finished look to the vest. Zippered front with an adjustable waist strap offers a comfortable fit; 2 zippered cargo pockets with mesh drainage securely store essentials. Durable, 420-denier nylon shell and closed-cell foam flotation offer lasting service; reflective piping along the front and back of MTI Maya PFD increases visibility. Closeout.","short_description":"Take to the water in the MTI Maya PFD for your next canoe, kayak or rafting trip. It offers up snug comfort via its neoprene back panel and an attractive look with its curvy lines.","category":"Paddling","subcategory":"Pfds","product_group":"Women's Pfds","thumb_url":"http://i1.avlws.com/115/s432019.png","image_url":"http://i1.avlws.com/115/l432019.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432019&tt=df","retail_price":"89.99","sale_price":"64.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432019\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432019.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860428&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604280005":{"sku":"8604280005","vendor_sku":"MTI-409K-0PW67","upc":"486042800059","size":"XL/XXL","color":"PERIWINKLE/WHITE","retail_price":"64.73","sale_price":"64.73"}},"categories":["paddling","pfds","womens-pfds"]}
