{"sku":"860469","manufacturer_id":"SPOT-3 ORANGE","brand_name":"Spot","product_name":" SPOT Gen3 Satellite GPS Messenger","long_description":"The SPOT Gen3 Satellite GPS Messenger keeps you connected and in touch during your far-flung adventures. Using satellite technology, SPOT maintains communication almost anywhere on the globe. Free SPOT app lets you view messages, see track points and even keep an eye on SPOT Trace monitored assets on your smartphone or tablet. Check in with your professional and social networks, send custom text messages and let others track your real-time location via Google Maps. In an emergency, transmit an SOS with your exact location to GEOS Emergency Response Coordination Center to activate a rescue. Optional unlimited tracking lets you choose a capture rate that suits your needs: 5-, 10-, 30- or 60-min. increments; optional extreme tracking enables a 2.5-min. capture rate. With optional unlimited or extreme tracking, Motion Activated Tracking knows when you're moving and when you stop; it stops sending tracking info until you start moving again. Weighing only 4 oz. with batteries, the compact SPOT Gen3 packs easily for traveling fast and light. Contoured shape with dual attachment points makes it easy to fasten the SPOT Gen3 Satellite GPS Messenger to your pack, bag, boat or vehicle. Power options include single-use AAA lithium batteries (included), rechargeable batteries (sold separately), or line-in power via the unit's USB port. Comes with 4 AAA lithium batteries, USB cord, carrying strap and carabiner clip.","short_description":"The SPOT Gen3 Satellite GPS Messenger keeps you connected and in touch during your far-flung adventures. Using satellite technology, SPOT maintains communication almost anywhere on the globe.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Plbs And Satellite Messengers","thumb_url":"http://i1.avlws.com/115/s412679.png","image_url":"http://i1.avlws.com/115/l412679.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412679&tt=df","keywords":"personal locator beacons,beacon,locator,plb","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412679\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412679.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860469&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604690001":{"sku":"8604690001","vendor_sku":"SPOT-3 ORANGE","upc":"893049001493","color":"ORANGE","retail_price":"149.95","sale_price":"149.95"}}}
