{"sku":"860415","manufacturer_id":"U130100101270","brand_name":"Atlas","product_name":" Atlas 1227 Elektra Snowshoes - Women's","long_description":"Stride with confidence on snowy trails with the Atlas Electra 1227 women's snowshoes. The frames are shaped to accommodate a women's natural gait and the bindings are built to fit women's boots. Women-specific V-shaped frames are made from 7075 aluminum; they are the lightest and strongest Atlas offers, and have a stiff, responsive flex for smooth, easy striding. Nose and tail shapes are optimized to provide a balanced platform for stable footing and to facilitate easy, natural striding for women. Wrapp(TM) Pro bindings use low-friction ratcheting buckles, silicone straps and free-floating, padded tongues to supply a precise, comfortable and supportive fit. Tenacious, stainless-steel toe crampons deeply penetrate the firmest snow and bite into icy slopes. Stainless-steel serrated heel cleats and side traction rails provide sure footing while traversing and descending the most technical terrain. Spring-Loaded(TM) suspension uses offset webbing straps to create a springy platform beneath the feet that absorbs impact and allows natural side-to-side flex. Lightweight Duratek(TM) nylon decks are tough and built to withstand harsh, cold conditions; textured surface resists abrasion. Heel lift bars on the Atlas Elektra 1227 snowshoes relieve calf muscle fatigue during the climbs; bars store flat when disengaged. Snowshoes measure 8.5 x 27 in. and have a recommended load weight of 120 to 200+ lbs.; recommended load specification includes weight of hiker with gear.","short_description":"Stride with confidence on snowy trails with the Atlas Electra 1227 women's snowshoes. The frames are shaped to accommodate a women's natural gait and the bindings are built to fit women's boots.","category":"Snowshoeing","subcategory":"Snowshoes","product_group":"Women's Snowshoes","thumb_url":"http://i1.avlws.com/115/s432159.png","image_url":"http://i1.avlws.com/115/l432159.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432159&tt=df","retail_price":"289.95","sale_price":"231.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432159\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432159.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860415&amp;link=&amp;tabs=-Details\"></script>","variants":{"8604150001":{"sku":"8604150001","vendor_sku":"U130100101270","upc":"886745195375","size":"27 IN","color":"EMERALD/LIME","retail_price":"231.93","sale_price":"231.93"}}}
