{"sku":"860564","manufacturer_id":"13-MILAN-01-06-","brand_name":"Sherpani","product_name":" Sherpani Milana LE Tote Bag - Women's","long_description":"This is no flimsy bag. You'll carry the Sherpani Milana LE tote in confidence, knowing this one stands up to the rigors of travel and looks sophisticated at the same time. And, it has pockets galore. Versatile dual-handle system lets you carry by the grab handles or wear over your shoulder by the longer straps, which snap together. Top zips closed for security; expandable sides zip open to increase the capacity. Front pockets: 2 deep, padded pockets let you drop in a large wallet, phone or small e-reader; 1 small front zippered pocket. Rear pocket: 1 large open pocket holds magazines or umbrella; zipper along bottom lets you transform the pocket into an open panel to slide over the handle of wheeled luggage. Internal pockets: 1 zippered wallet-size pocket; 2 drop-in organizer-style pockets (1 is padded for a cellphone), plus pen slots. Durable nylon front pockets feature an attractive embroidered print; fabric has a silicone coating to shed moisture. Light-colored lining in the Sherpani Milana LE tote helps you find items easily.","short_description":"This is no flimsy bag. You'll carry the Sherpani Milana LE tote in confidence, knowing this one stands up to the rigors of travel and looks sophisticated at the same time. And, it has pockets galore.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s432643.png","image_url":"http://i1.avlws.com/115/l432643.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432643&tt=df","keywords":"purses,courier,sling","retail_price":"59.95","sale_price":"41.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432643\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432643.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860564&amp;link=&amp;tabs=-Details\"></script>","variants":{"8605640001":{"sku":"8605640001","vendor_sku":"13-MILAN-01-06-","upc":"877293023760","color":"PEWTER","retail_price":"41.93","sale_price":"41.93"}},"categories":["travel","day-bags-and-packs","shoulder-bags"]}
