{"sku":"860539","manufacturer_id":"500213","brand_name":"Miir","product_name":" MiiR High 5 Mixte Bike - 2014","long_description":"Buy a MiiR High 5 Mixte bike and you'll get more than a comfortable, reliable everyday riding bike with a touch of mid-century Dutch bike style; you'll also help MiiR give a bike to someone in need. With your purchase, MiiR will help a person in Africa or the U.S. to earn a bike through a work- or study-to-own program. The High 5 Mixte uses butted chromoly steel throughout the frame and fork to ensure a smooth, resilient ride; step-through frame design makes for easy mounts and dismounts. A Sturmey Archer 5-speed internally geared rear hub offers 5 different gears for your pedaling ease, plus easier maintenance compared to cassette and derailleur systems. Puncture-resistant tires roll smoothly. Included front basket makes it easy to stash your essentials or carry home the bounties of a farmer's market. The MiiR High 5 Mixte bike has attachment points for fenders and a rear rack (fenders and rack sold separately). Includes a stainless steel water bottle and cage. Sizing: Small fits riders 5' 1\" - 5' 4\"; Medium fits riders 5' 4\" - 5' 7\"; Large fits riders 5' 7\" - 5' 10\"; size up if between sizes. What makes this bike different? Your purchase supports MiiR to empower one person in need with 2-wheeled transportation. US giving is targeted towards refugees, homeless, those getting out of prison, kids whose parents unable to afford a bicycle and other vulnerable populations. In Africa 70% of recipients are school children, the remaining 30% are aid workers, entrepreneurs and field mechanics.","short_description":"Buy a MiiR High 5 Mixte bike and you'll get more than a comfortable, reliable everyday riding bike with a touch of mid-century Dutch bike style; you'll also help MiiR give a bike to someone in need.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378475.png","image_url":"http://i1.avlws.com/115/l378475.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378475&tt=df","retail_price":"849.00","sale_price":"849.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378475\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378475.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860539&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","hybrid-bikes"]}
