{"sku":"860527","manufacturer_id":"500216","brand_name":"Miir","product_name":"MiiR Wave Single Speed Bike - 2014","long_description":"Buy a MiiR Wave Single Speed bike and you'll get more than a straightforward and dependable everyday riding bike, you'll also help MiiR give a bike to someone in need. With your purchase, MiiR will help a person in Africa or the U.S. to earn a bike through a work- or study-to-own program. The Wave Single Speed uses butted chromoly steel throughout the frame and fork to ensure a smooth, resilient ride. Single-speed design is simple and reliable; flip-flop rear hub lets you ride the Wave either as a freewheel or as a fixed-gear bike. Puncture-resistant tires roll smoothly. The MiiR Wave Single Speed bike has attachment points for fenders and a rear rack (fenders and rack sold separately). Includes a stainless steel water bottle and cage. Sizing: 49cm fits riders 4' 11\" - 5' 4\"; 52cm fits riders 5' 4\" - 5' 7\"; 55cm fits riders 5' 7\" - 6' 0\"; 58cm fits riders 6' 0\" and up; size up if between sizes. What makes this bike different? Your purchase supports MiiR to empower one person in need with 2-wheeled transportation. US giving is targeted towards refugees, homeless, those getting out of prison, kids whose parents unable to afford a bicycle and other vulnerable populations. In Africa 70% of recipients are school children, the remaining 30% are aid workers, entrepreneurs and field mechanics.","short_description":"Buy a MiiR Wave Single Speed bike and you'll get more than a straightforward and dependable everyday riding bike, you'll also help MiiR give a bike to someone in need.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378467.png","image_url":"http://i1.avlws.com/115/l378467.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378467&tt=df","retail_price":"699.00","sale_price":"485.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378467\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378467.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860527&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","hybrid-bikes"]}
