{"sku":"860677","manufacturer_id":"KN4IBK12","brand_name":"Smith","product_name":" Smith Knowledge OTG Snow Goggles","long_description":"The eyeglass-compatible Smith Knowledge OTG snow goggles let you comfortably wear your corrective eyewear under the goggles, so you can clearly see the mountain before you shred it. OTG (over the glasses) design features an enlarged chamber that fits easily over most eyeglasses; foam membrane inside goggles reduces pressure from eyeglasses at the temples. Ignitor Mirror lens features a bronze tint and 35% visible light transmission (VLT) to reduce eye fatigue while enhancing contrast and depth perception in all conditions. Cylindrical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Sliding bar on the top of the lens controls airflow to help combat fogging. Dual-layer face foam uses a plush base layer with a soft fleece top layer to offer a good, comfortable seal against your face. Extra-wide adjustable strap is backed with a silicone bead so it stays in place on your helmet; clip buckle makes for easy on and off over a helmet or hat. The Smith Knowledge OTG snow goggles have a large-volume design that fits large-size faces and come with a microfiber storage bag.","short_description":"The eyeglass-compatible Smith Knowledge OTG snow goggles let you comfortably wear your corrective eyewear under the goggles, so you can clearly see the mountain before you shred it.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381039.png","image_url":"http://i1.avlws.com/115/l381039.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381039&tt=df","retail_price":"85.00","sale_price":"58.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381039\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381039.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860677&amp;link=&amp;tabs=-Details\"></script>","variants":{"8606770001":{"sku":"8606770001","vendor_sku":"KN4IBK12","upc":"715757386153","size":"IGNITOR MIRROR","color":"BLACK","retail_price":"58.83","sale_price":"58.83"}}}
