{"sku":"860676","manufacturer_id":"PH6BKOW13","brand_name":"Smith","product_name":" Smith Phenom Snow Goggles","long_description":"For those sunny, phenomenal days on the slopes, the Smith Phenom snow goggles deliver excellent clarity and adjustable ventilation so you can clearly pick your lines and charge down the mountain. Blackout lens features a dark gray tint and 10% visible light transission (VLT) to cut glare and reduce eye fatigue in bright, sunny conditions. Cylindrical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Double-layer thermal lens features a microporous port that allows lens to breathe while preventing moisture entry, greatly reducing fogging. Sliding bar on the top of the lens controls airflow to help combat fogging. Dual-layer face foam uses a plush base layer with a soft fleece top layer to offer a good, comfortable seal against your face. Extra-wide adjustable strap is backed with a silicone bead so it stays in place on your helmet; clip buckle makes for easy on and off over a helmet or hat. The Smith Phenom snow goggles fit medium-size faces and come with a microfiber storage bag.","short_description":"For those sunny, phenomenal days on the slopes, the Smith Phenom snow goggles deliver excellent clarity and adjustable ventilation so you can clearly pick your lines and charge down the mountain.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381035.png","image_url":"http://i1.avlws.com/115/l381035.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381035&tt=df","retail_price":"110.00","sale_price":"76.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381035\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381035.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860676&amp;link=&amp;tabs=-Details\"></script>","variants":{"8606760001":{"sku":"8606760001","vendor_sku":"PH6BKOW13","upc":"715757422318","size":"BLACKOUT","color":"ORANGE W3","retail_price":"76.83","sale_price":"76.83"}},"categories":["snow","ski-goggles","mens-ski-goggles"]}
