{"sku":"860798","manufacturer_id":"AA0024892193","brand_name":"Atomic","product_name":"Atomic Automatic Skis - Men's - 2013/2014","long_description":"Ready to charge the steepest powder-covered slopes with stable, reinforced rockered tips and tails, the Atomic Automatic skis sit at the pinnacle of the brand's freeski powder category. Wood core provides smooth handling at high speeds and in deep powder; titanium reinforcements in tips and tails increase stability and reduce chatter on hard snow. Early rise in the tips and tails enhances powder skiing forward or switch; traditional camber underfoot enhances edge grip on firm snow. The Automatic skis prefer skiing forward thanks to a long cambered section underfoot with mellow tail rocker, but they will allow skiing backwards if you desire. Sidewall construction ensures maximum torsional rigidity, uncanny edge grip and controlled tip-to-tail flex; sidewalls are reinforced in binding areas with 3 layers. Half cap construction in tips and tails reduces swing weight and chipping when your skis bang together. Directional twin-tip design offers increased performance in varied snow conditions and during backcountry freestyle maneuvers. Atomic Automatic skis feature 117mm waists that require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"Ready to charge the steepest powder-covered slopes with stable, reinforced rockered tips and tails, the Atomic Automatic skis sit at the pinnacle of the brand's freeski powder category.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382315.png","image_url":"http://i1.avlws.com/115/l382315.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382315&tt=df","retail_price":"749.00","sale_price":"599.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382315\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382315.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860798&amp;link=&amp;tabs=-Details\"></script>","variants":{"8607980001":{"sku":"8607980001","vendor_sku":"AA0024892186","upc":"884397740776","size":"186 CM","retail_price":"599.93","sale_price":"599.93"},"8607980002":{"sku":"8607980002","vendor_sku":"AA0024892193","upc":"884397740783","size":"193 CM","retail_price":"599.93","sale_price":"599.93"}},"categories":["snow","skis","downhill-skis"]}
