{"sku":"860799","manufacturer_id":"AA0024894183","brand_name":"Atomic","product_name":" Atomic Bent Chetler Skis - Men's - 2013/2014","long_description":"The perfect tools for backcountry freestylers in search of powder, the Atomic Bent Chetler skis ride high on their jumbo waists and rockered tips, launch off a lip and stick the switch landing. Jumbo 123mm waists float effortlessly in the bottomless fluff, and early rise in the tips and tails enhances powder skiing forward or switch. Wood core provides smooth handling at high speeds and in deep powder. Carbon fiber stringers in tips and tails increase stability of rockered sections at speed, and they also make skis snappier during rebound. Sidewall construction ensures maximum torsional rigidity, uncanny edge grip and controlled tip-to-tail flex; sidewalls are reinforced in binding areas with 3 layers. Half cap construction in tips and tails reduces swing weight and chipping when your skis bang together. Directional twin-tip design offers increased performance in varied snow conditions and during backcountry freestyle maneuvers. Atomic Bent Chetler skis feature 123mm waists that require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"The perfect tools for backcountry freestylers in search of powder, the Atomic Bent Chetler skis ride high on their jumbo waists and rockered tips, launch off a lip and stick the switch landing.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382319.png","image_url":"http://i1.avlws.com/115/l382319.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382319&tt=df","retail_price":"699.00","sale_price":"559.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382319\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382319.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860799&amp;link=&amp;tabs=-Details\"></script>","variants":{"8607990001":{"sku":"8607990001","vendor_sku":"AA0024894183","upc":"884397740820","size":"183 CM","retail_price":"559.93","sale_price":"559.93"},"8607990002":{"sku":"8607990002","vendor_sku":"AA0024894192","upc":"884397740837","size":"192 CM","retail_price":"559.93","sale_price":"559.93"}}}
