{"sku":"860737","manufacturer_id":"IR7NXBK12","brand_name":"Smith","product_name":" Smith I/O Recon Snow Goggles","long_description":"The tech-packed Smith I/O Recon snow goggles show GPS-based data in-goggles, offer Bluetooth(R) smartphone interface capability and boast a fast and easy lens interchange system. Boom. Shred time. Recon MOD Live technology pairs with GPS to display navigation and performance-based information within the goggles in real time. Recon MOD tracks speed, jump analytics, vertical, altitude, distance, location and temperature data; also tracks averages, maximums, chrono/tracking and runs. MOD Live also offers navigation info, resort points of interest and buddy tracking; wireless remote lets you control the MOD Live technology and in-goggle adjustable screen. MOD Live bridges with Bluetooth technology and smartphone platforms for text messaging, caller ID and music playlist control-all through the goggles. In addition to the tech features, the helmet-compatible Smith I/O Recon goggles' lens can be swapped out quickly and easily via two clips at the top of the frame. Green Sol-X Mirror lens has a brown tint with 15% visible light transmission (VLT) and multilayer green mirror to cut glare and reduce eye fatigue in bright, sunny conditions. Included Blue Sensor lens features a light rose tint and 70% VLT to maximize color definition and increase depth perception in flat light. Spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Double-layer thermal lens features an anti-fog treatment and a microporous port that allows lens to breathe while preventing moisture entry, greatly reducing fogging. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Extra-wide adjustable strap is backed with a silicone bead so it stays in place on your helmet; clip buckle makes for easy on and off over a helmet or hat.","short_description":"The tech-packed Smith I/O Recon snow goggles show GPS-based data in-goggles, offer Bluetooth(R) smartphone interface capability and boast a fast and easy lens interchange system. Boom. Shred time.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381071.png","image_url":"http://i1.avlws.com/115/l381071.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381071&tt=df","retail_price":"650.00","sale_price":"451.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381071\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381071.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860737&amp;link=&amp;tabs=-Details\"></script>","variants":{"8607370001":{"sku":"8607370001","vendor_sku":"IR7NXBK12","upc":"715757410124","size":"GREEN SOL X MIRROR","color":"BLACK","retail_price":"451.83","sale_price":"451.83"}},"categories":["snow","ski-goggles","mens-ski-goggles"]}
