{"sku":"860786","manufacturer_id":"AA0024888181","brand_name":"Atomic","product_name":" Atomic Access Skis - Men's - 2013/2014","long_description":"With wide waists to supply ample flotation for any powder day and enough stability to negotiate less-than-ideal conditions, the Atomic Access skis are ready to carve some fresh lines on steep terrain. Portly 100mm waists and lightweight design mean the skis float and turn with ease in powder. Early rise in the tip and tail enhances powder skiing forward or switch; traditional camber underfoot enhances edge grip on firm snow. Traditional camber of the Access extends back farther toward the tail to enhance power at the end of the turn and increase control on groomed runs. Wood core provides smooth handling at high speeds and in deep powder snow. Sidewall construction ensures maximum torsional rigidity, uncanny edge grip and controlled tip-to-tail flex; sidewall is reinforced in binding area with 2 layers of material. Half cap construction in tip and tail reduces swing weight and chipping when your skis bang together. Atomic Access skis feature 100mm waists that require bindings with wide brakes. Base or topsheet color may vary from online photo.","short_description":"With wide waists to supply ample flotation for any powder day and enough stability to negotiate less-than-ideal conditions, the Atomic Access skis are ready to carve some fresh lines on steep terrain.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s382311.png","image_url":"http://i1.avlws.com/115/l382311.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382311&tt=df","retail_price":"499.00","sale_price":"399.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382311\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382311.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860786&amp;link=&amp;tabs=-Details\"></script>","variants":{"8607860001":{"sku":"8607860001","vendor_sku":"AA0024888171","upc":"884397743319","size":"171 CM","retail_price":"399.93","sale_price":"399.93"},"8607860002":{"sku":"8607860002","vendor_sku":"AA0024888181","upc":"884397743326","size":"181 CM","retail_price":"399.93","sale_price":"399.93"}}}
