{"sku":"860727","manufacturer_id":"IO7BKVR13","brand_name":"Smith","product_name":" Smith I/O Snow Goggles - Violet Ombre Frame - Blackout Lens","long_description":"The Smith I/O Violet Ombre snow goggles give you a wide, distortion-free view and let you adjust for different conditions by swapping between the interchangeable Blackout and Blue Sensor lenses. Blackout lens features a dark gray tint and 10% visible light transission (VLT) to cut glare and reduce eye fatigue in bright, sunny conditions. Blue Sensor Mirror lens features a light rose tint and 70% VLT to maximize color definition and increase depth perception in flat light. To quickly adjust for different lighting or terrain, simply flip the two clips at the top of the frame, pop out the first lens and replace it with the new one. Spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Double-layer thermal lens features a microporous port that allows lens to breathe while preventing moisture entry, greatly reducing fogging. Lenses also feature a Smith 5X Anti-Fog treatment to withstand fogging longer than standard anti-fog lenses. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Extra-wide adjustable strap is backed with a silicone bead so it stays in place on your helmet; clip buckle makes for easy on and off over a helmet or hat. The Smith I/O snow goggles are designed for medium-size faces and come with a microfiber storage bag with replacement lens sleeve.","short_description":"The Smith I/O Violet Ombre snow goggles give you a wide, distortion-free view and let you adjust for different conditions by swapping between the interchangeable Blackout and Blue Sensor lenses.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Men's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381059.png","image_url":"http://i1.avlws.com/115/l381059.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381059&tt=df","retail_price":"175.00","sale_price":"120.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381059\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381059.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860727&amp;link=&amp;tabs=-Details\"></script>","variants":{"8607270001":{"sku":"8607270001","vendor_sku":"IO7BKVR13","upc":"715757418953","size":"BLACKOUT","color":"VIOLET OMBRE","retail_price":"120.83","sale_price":"120.83"}}}
