{"sku":"860770","manufacturer_id":"VR6RZVR13","brand_name":"Smith","product_name":" Smith Virtue Snow Goggles - Women's","long_description":"The Smith Virtue women's goggles boast a semi-rimless design to help increase the field of vision, letting you see more of the mountain below you as you carve line after line. Mist Motif frame has bronze tint Ignitor Mirror lens with 35% visible light transmission (VLT) to reduce eye strain and enhance contrast and depth perception in all conditions. Violet Ombre frame comes with a Red Sensor Mirror lens, which has a light rose tint with 60% VLT to maximize color definition and increase depth perception in flat light. Spherical lens tapers from the optical center toward the periphery for a wide field of vision with minimal distortion. Double-layer thermal lens features a microporous port that allows lens to breathe while preventing moisture entry, greatly reducing fogging. Lens also features a Smith 5X Anti-Fog treatment to withstand fogging longer than standard anti-fog lenses. 3-layer face foam is constructed of a dense base, a plush mid layer and a soft fleece top layer; design ensures a tight seal, good moisture management and maximum comfort. Adjustable strap is backed with a silicone bead so it stays in place on your helmet; clip buckle makes for easy on and off over a helmet or hat. The Smith Virtue women's snow goggles are designed for small-size faces and come with a microfiber storage bag.","short_description":"The Smith Virtue women's goggles boast a semi-rimless design to help increase the field of vision, letting you see more of the mountain below you as you carve line after line.","category":"Skiing","subcategory":"Ski Goggles","product_group":"Women's Ski Goggles","thumb_url":"http://i1.avlws.com/115/s381163.png","image_url":"http://i1.avlws.com/115/l381163.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381163&tt=df","retail_price":"140.00","sale_price":"96.83","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381163\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381163.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860770&amp;link=&amp;tabs=-Details\"></script>","variants":{"8607700001":{"sku":"8607700001","vendor_sku":"VR6ITM13","upc":"715757419233","size":"IGNITOR MIRROR","color":"MIST MOTIF","retail_price":"96.83","sale_price":"96.83"},"8607700002":{"sku":"8607700002","vendor_sku":"VR6RZVR13","upc":"715757419288","size":"RED SENSOR MIRROR","color":"VIOLET OMBRE","retail_price":"96.83","sale_price":"96.83"}}}
