{"sku":"860810","manufacturer_id":"AE5008780295","brand_name":"Atomic","product_name":"Atomic Live Fit 90 Ski Boots - Men's - 2013/2014","long_description":"Conforming to the shape of your foot with a soft flex zone in the shell, the men's novice-level Atomic Live Fit 90 ski boots increase your comfort when cruising down fun runs or headed to the lodge. Bi-component shells feature specialized flex zones that complement the natural motions of your feet. Located between the first buckle and the toe, flexible shell zones made of soft plastic improve balance, circulation, warmth and sensitivity. Foot-wrapping, 2-buckle design makes it simple to get your feet into boots, and a 35mm powerstrap acts as a third buckle. Each boot liner features differing materials on the left and right; firm material helps you feel the terrain on the inside of the turn and soft material cushions recovery. Custom-moldable liners feature very warm, soft interiors to enhance comfort. Toe boxes reduce hot spots and increase comfort with 4-way stretch, and cushioning footbeds offer warmth and softness. Medium flex index of 90 offers the comfortable performance preferred by beginning skiers looking to progress. The Atomic Live Fit 80 ski boots feature roomy 102mm footbeds for maximum comfort.","short_description":"Conforming to the shape of your foot with a soft flex zone in the shell, the men's novice-level Atomic Live Fit 90 ski boots increase your comfort when cruising down fun runs or headed to the lodge.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382659.png","image_url":"http://i1.avlws.com/115/l382659.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382659&tt=df","retail_price":"299.00","sale_price":"239.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382659\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382659.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860810&amp;link=&amp;tabs=-Details\"></script>","variants":{"8608100004":{"sku":"8608100004","vendor_sku":"AE5008780295","upc":"887445013105","size":"Mondo 29.5","color":"RED","retail_price":"239.93","sale_price":"239.93"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
