{"sku":"860820","manufacturer_id":"AE5009680265","brand_name":"Atomic","product_name":" Atomic Waymaker Carbon 100 W Ski Boots - Women's - 2103/2014","long_description":"Built with hike/ski levers, the advanced-level women's Atomic Waymaker Carbon 100 W ski boots hike above the stashes and shred hard on the descents thanks to powerful carbon reinforcements. Hike/ski levers release cuffs from lower shells to increase range of motion when hiking; return levers to ski position to lock down cuffs during the descent. Carbon-reinforced areas of the cuff and shell offers direct power transmission and excellent responsiveness while maintaining an easy feel and sensitivity on the front of boot. Single-component shell moves as a single piece to maximize power transfer and ensure high performance, and pliable plastic flex zones adapt instantly to the shape of foot. Located between the first buckle and the toe, flexible shell zones made of soft plastic improve balance, circulation, warmth and sensitivity. Each boot liner features differing materials on the left and right; firm material helps you feel the terrain on the inside of the turn and soft material cushions recovery. Women-specific liners feature cushioning insoles and very warm faux fur to enhance comfort. Custom-moldable liners mold to forefeet and ankles to increase heel hold. Stiff flex index of 100 offers the responsiveness preferred by advanced skiers. The Atomic Waymaker Carbon 100 W ski boots for women feature 101mm footbeds to provide a comfortable fit.","short_description":"Built with hike/ski levers, the advanced-level women's Atomic Waymaker Carbon 100 W ski boots hike above the stashes and shred hard on the descents thanks to powerful carbon reinforcements.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382683.png","image_url":"http://i1.avlws.com/115/l382683.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382683&tt=df","retail_price":"599.00","sale_price":"479.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382683\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382683.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860820&amp;link=&amp;tabs=-Details\"></script>","variants":{"8608200002":{"sku":"8608200002","vendor_sku":"AE5009680245","upc":"887445008262","size":"Mondo 24.5","color":"PURPLE","retail_price":"479.93","sale_price":"479.93"},"8608200003":{"sku":"8608200003","vendor_sku":"AE5009680255","upc":"887445008286","size":"Mondo 25.5","color":"PURPLE","retail_price":"479.93","sale_price":"479.93"}},"categories":["snow","ski-boots","downhill-ski-boots"]}
