{"sku":"860817","manufacturer_id":"AE5008860265","brand_name":"Atomic","product_name":" Atomic Live Fit 80 W Ski Boots - Women's - 2013/2014","long_description":"Featuring innovative, flexible shells that adapt to the shape of your feet, the novice-level women's Atomic Live Fit 80 W ski boots ensure roomy comfort and good circulation to keep feet warm. Bi-component shells feature specialized flex zones that complement the natural motions of your feet. Located between the first buckle and the toe, flexible shell zones made of soft plastic improve balance, circulation, warmth and sensitivity. Foot-wrapping, 2-buckle design makes it simple to get your feet into boots. Each boot liner features differing materials on the left and right; firm material helps you feel the terrain on the inside of the turn and soft material cushions recovery. Designed to prevent the dreaded \"calf pinch\" that happens often with women's ski boots, stretchy collars provide 10mm of space for the lower calf. Still feeling the pinch? Cuff can be lowered by an additional 10mm and the circumference can be increased by 8mm. Custom-moldable liners form to ankles to enhance foot hold in boots and increase comfort and precision, and liners feature very warm faux fur for comfort. Soft flex index of 80 offers the comfortable performance preferred by beginning skiers. The Atomic Live Fit 80 W ski boots for women feature roomy 102mm wide footbeds.","short_description":"Featuring innovative, flexible shells that adapt to the shape of your feet, the novice-level women's Atomic Live Fit 80 W ski boots ensure roomy comfort and good circulation to keep feet warm.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s446723.png","image_url":"http://i1.avlws.com/115/l446723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=446723&tt=df","retail_price":"299.00","sale_price":"239.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=446723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m446723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860817&amp;link=&amp;tabs=-Details\"></script>","variants":{"8608170001":{"sku":"8608170001","vendor_sku":"AE5008860235","upc":"887445013785","size":"Mondo 23.5","color":"BLACK","retail_price":"239.93","sale_price":"239.93"}}}
