{"sku":"860816","manufacturer_id":"AE5009800295","brand_name":"Atomic","product_name":" Atomic Waymaker Tour 90 Randonee Boots - Men's - 2013/2014","long_description":"The Atomic Waymaker Tour 90 randonee boots have the softest flex in the Waymaker Tour line and are the ideal boots for intermediate skiers or those who prefer a softer flexing boot for long tours. Hike/ski levers release cuffs from lower shells to increase range of motion when hiking; return levers to ski position to lock down cuffs during the descent. Cuffs allow 35deg of forward and back motion for excellent comfort when you're skinning and hiking; boots lock into a 15deg forward lean angle in ski position. Carbon-reinforced areas of the cuff and shell offer direct power transmission and excellent responsiveness while maintaining sensitivity on the front of boot. Single-component shell moves as a single piece to maximize power transfer and ensure high performance, and pliable plastic flex zones adapt instantly to the shape of foot. Located between the first buckle and the toe, flexible shell zones made of soft plastic improve balance, circulation, warmth and sensitivity. Intuition liners can be custom molded to your feet for an accurate fit that holds your heels and ankles in place when you're skiing. Lugged soles provide good traction when you're hiking on trails and scrambling on rock; soles are compatible with all randonee bindings, including Dynafit-style tech bindings. Soles can be switched out for DIN alpine soles (sold separately) for compatibility with all alpine bindings. Medium flex index of 90 offers the responsiveness preferred by intermediate skiers or those who prefer a softer flex for long tours. The Atomic Waymaker Tour 90 ski boots feature 101mm footbeds to provide a comfortable fit.","short_description":"The Atomic Waymaker Tour 90 randonee boots have the softest flex in the Waymaker Tour line and are the ideal boots for intermediate skiers or those who prefer a softer flexing boot for long tours.","category":"Skiing","subcategory":"Ski Boots","product_group":"Randonee Ski Boots","thumb_url":"http://i1.avlws.com/115/s382751.png","image_url":"http://i1.avlws.com/115/l382751.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382751&tt=df","retail_price":"499.00","sale_price":"399.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382751\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382751.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=860816&amp;link=&amp;tabs=-Details\"></script>","variants":{"8608160001":{"sku":"8608160001","vendor_sku":"AE5009800265","upc":"887445009344","size":"Mondo 26.5","color":"WHITE","retail_price":"399.93","sale_price":"399.93"},"8608160002":{"sku":"8608160002","vendor_sku":"AE5009800275","upc":"887445009368","size":"Mondo 27.5","color":"WHITE","retail_price":"399.93","sale_price":"399.93"},"8608160003":{"sku":"8608160003","vendor_sku":"AE5009800285","upc":"887445009382","size":"Mondo 28.5","color":"WHITE","retail_price":"399.93","sale_price":"399.93"}},"categories":["snow","ski-boots","randonee-ski-boots"]}
