{"sku":"861194","manufacturer_id":"010-01162-00","brand_name":"Garmin","product_name":"Garmin Edge Touring Bike Computer","long_description":"Similar to a car GPS but specifically designed to help you find your way by bike, the Garmin Edge Touring GPS bike figures out the best rides for fun, training and everyday routines on 2 wheels. Bike-specific maps preloaded in Edge Touring make it easy to get from point A to point B and back again; simply search for points of interest for turn-by-turn directions. Choose between cycling, touring and mountain biking modes to calculate the most appropriate route, taking you on paved roads, unpaved roads or on paths and trails. With round-trip routing, you can tell Edge Touring how far you'd like to ride and then choose from up to 3 ride options that will bring you back to where you started. User-friendly interface makes it easy to plan rest stops or stop at cyclist-specific points of interest like bathrooms, cafes or full-service bike shops. Don't have a specific destination in mind? Search for rides others have completed on Garmin Connect(TM) or Garmin Adventures and download them to follow on your next ride. Edge Touring also records where you ride so you can upload your activities to Garmin Connect or Garmin Adventures and relive them whenever you want or share with friends. Large 2.6 in. color touch screen displays info in an easily accessible and navigable format; touchscreen is resistive, so you can still use it with gloves or in wet conditions. Unit measures 3.7 x 2.0 x 1.0 in.; display area is 2.6 in. diag. (2.2 x 1.4 in.), and 220 x 176 pixels; screen is readable in daylight. Low-profile, tool-free bike mount attaches easily to your stem or handlebar and can be removed or switched to another bike easily. Rechargeable internal lithium ion battery lasts up to 17 hrs. with typical use; recharge with included USB cable. Water resistant to IPX7 standards (one meter of water for 30 min.).","short_description":"Similar to a car GPS but specifically designed to help you find your way by bike, the Garmin Edge Touring GPS bike figures out the best rides for fun, training and everyday routines on 2 wheels.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375247.png","image_url":"http://i1.avlws.com/115/l375247.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375247&tt=df","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375247\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375247.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861194&amp;link=&amp;tabs=-Details\"></script>","variants":{"8611940001":{"sku":"8611940001","vendor_sku":"010-01162-00","upc":"753759108465","color":"WHITE","retail_price":"250.00","sale_price":"250.00"}},"categories":["cycling","bike-accessories","bike-computers"]}
