{"sku":"861222","manufacturer_id":"TM15","brand_name":"Nitecore","product_name":" Nitecore TM15 Flashlight","long_description":"With a stunning output of 2,450 lumens and measuring only 2.4 x 6.2 in., the Nitecore TM15 flashlight is one of the smallest and brightest rechargeable searchlights available. Uses three Cree XM-L U2 LEDs to output 2,450 lumens on turbo, 1,300 lumens on high, 570 lumens on mid, 300 lumens on low and 95 lumens on lowest. Throws a beam up to 363m (1,191 ft.) on turbo to light up the darkest trails and streets. Flashlight is compatible with rechargeable 18650 lithium-ion batteries or non-rechargeable CR123 lithium batteries (sold separately). Four 18650 batteries provide 52 hrs. of use on lowest and 1 hr. on turbo; eight CR123 batteries provide 36 hrs. of use on lowest and 1 hr. 10 min. on turbo. Includes a power adapter for recharging the 18650 batteries while they are inside the flashlight; recharge from a household outlet. Built-in camera-type thread mounting point lets you mount the TM15 flashlight on a tripod for fixed illumination. Flat tail cap lets you stand the light up on end for use as a candle. On/off switch illuminates to indicate battery power status so you know when you need to recharge. Aerospace-grade aluminum alloy and a stainless-steel retaining ring protect the core components from damage. The Nitecore TM15 flashlight has an IPX8 water resistance rating and is impact resistant to 1.5m. Includes a charger, holster, lanyard and spare O-ring.","short_description":"With a stunning output of 2,450 lumens and measuring only 2.4 x 6.2 in., the Nitecore TM15 flashlight is one of the smallest and brightest rechargeable searchlights available.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416891.png","image_url":"http://i1.avlws.com/115/l416891.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416891&tt=df","retail_price":"329.95","sale_price":"246.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416891\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416891.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861222&amp;link=&amp;tabs=-Details\"></script>","variants":{"8612220001":{"sku":"8612220001","vendor_sku":"TM15","color":"BLACK","retail_price":"246.93","sale_price":"246.93"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
