{"sku":"861224","manufacturer_id":"EA4","brand_name":"Nitecore","product_name":" Nitecore EA4 Flashlight","long_description":"The Nitecore EA4 flashlight fits in the palm of your hand and weighs only 8.8 oz., yet blasts a stunning 860-lumen beam, making it the perfect companion on hiking trips and search-and-rescue missions. Cree XM-L U2 LED has a maximum output of 860 lumens on turbo mode to light up the darkest trails and street corners; throws a bright beam up to 283m (928 ft.). Outputs 550 lumens on high, 300 lumens on mid, 135 lumens on low and 65 lumens on the lowest setting. Rapidly switch between eight lighting modes (five brightness settings and three strobes) with the two-stage button. Includes a standard strobe mode and an SOS strobe mode; leave the flashlight in location beacon strobe mode to find it easily at night. Power-indicator light lets you know when the batteries are low and serves as an another locator beacon by flashing once every three seconds when the light is in standby mode. 4 AA batteries provide 22 hrs. of use on lowest setting and 1 hr. 45 min. on turbo; power-indicator light lets you know when the batteries are low. Aerospace-grade aluminum alloy and a stainless-steel retaining ring protect the core components from damage. Nitecore EA4 flashlight has an IPX8 water-resistance rating; impact resistant to 1.5m. Includes a holster, lanyard and spare O-ring.","short_description":"The Nitecore EA4 flashlight fits in the palm of your hand and weighs only 8.8 oz., yet blasts a stunning 860-lumen beam, making it the perfect companion on hiking trips and search-and-rescue missions.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416899.png","image_url":"http://i1.avlws.com/115/l416899.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416899&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416899\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416899.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861224&amp;link=&amp;tabs=-Details\"></script>","variants":{"8612240001":{"sku":"8612240001","vendor_sku":"EA4","color":"BLACK","retail_price":"79.95","sale_price":"79.95"}}}
