{"sku":"861238","manufacturer_id":"275268","brand_name":"Burton","product_name":" Burton Rampant Snowboard Boots - 2013 Closeout","long_description":"Burton Rampant men's snowboard boots make you feel like there's almost nothing on your feet. Perfect for skate-inspired riding, they feature a soft flex, cushioning, support and optimized board feel. Shrinkage(TM) technology reduces boot's overall footprint by one full size, minimizing boot overhang, bulk and weight. No need to sacrifice support thanks to Crossbone upper cuffs: power up your board's tip and tail with less effort and while enjoying tweak-friendly freedom. Crossbone cuffs balance the free-flexing mobility of articulating cuffs with the lateral support needed for ollie pops and powerful presses. Flexible backstay spines increase medial/lateral support, edge-to-edge response and durability. Medium flexing, slim, 3D-molded tongues wrap the forefeet in comfort, offer a seamless flex and reduce performance-robbing shell/liner stack-up. Snowproof internal gussets on boot tongues completely seal lower boot zones to keep feet warm and dry. Super-lightweight DynoLite EST midsoles offer superior cushioning, improved board feel and support throughout; ultra-damping B3 gel inserts cushion without extra weight. DynoLite EST midsoles are made of a compound specially formulated to withstand repeated impact and freezing temperatures for long-lasting shock absorption. Flex liners balance a buttery flex with strategically placed support where it matters most; rip-and-stick liner closures. Flex inner cuffs offer a mobility-oriented park and street fit; precurved ankle panels reduce lace pressure on front of the legs. Ultra-cush, molded EVA footbeds with antimicrobial coating fight odors. Closeout.","short_description":"Burton Rampant men's snowboard boots make you feel like there's almost nothing on your feet. Perfect for skate-inspired riding, they feature a soft flex, cushioning, support and optimized board feel.","category":"Snowboarding","subcategory":"Snowboard Boots","product_group":"Men's Snowboard Boots","thumb_url":"http://i1.avlws.com/115/s383159.png","image_url":"http://i1.avlws.com/115/l383159.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=383159&tt=df","retail_price":"199.95","sale_price":"88.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=383159\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m383159.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861238&amp;link=&amp;tabs=-Details\"></script>","variants":{"8612380003":{"sku":"8612380003","vendor_sku":"275268","upc":"886057787602","size":"8.5","color":"BLACK/BONE","retail_price":"88.73","sale_price":"88.73"}},"categories":["snow","snowboard-boots","mens-snowboard-boots"]}
