{"sku":"861233","manufacturer_id":"276065","brand_name":"Burton","product_name":" Burton Chopper Toy Story Snowboard - Boys' - 2013 Closeout","long_description":"The Burton Chopper Toy Story(TM) snowboard for boys features an exclusive graphic he'll love, and is built to help him improve and progress on the hill. Easy Rider(TM) edge tune features beveled, catch-free edges that encourage progression; Flat Top profile features a flat profile between feet for stability and balance. Compared to many other snowboards, the Chopper features a less dramatic sidecut and a mellow camber and edge tune to make it more forgiving and less grabby. With twin shape and twin flex, this board is symmetrical from tip to tail for a balanced ride that's equally versatile whether ridden regular or switch. Tip-to-tail wood core is durable and provides a forgiving flex for edge control and solid turns. Fiberglass construction provides torsional forgiveness, board feel and edge hold, perfect for advancing to the next level. Burton Chopper Toy Story snowboard has an easy-to-maintain extruded base to keep kids moving fast in all conditions. . Closeout.","short_description":"The Burton Chopper Toy Story(TM) snowboard for boys features an exclusive graphic he'll love, and is built to help him improve and progress on the hill.","category":"Snowboarding","subcategory":"Snowboards","product_group":"Kids' Snowboards","thumb_url":"http://i1.avlws.com/115/s376603.png","image_url":"http://i1.avlws.com/115/l376603.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376603&tt=df","keywords":"jstp7615","retail_price":"199.95","sale_price":"88.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376603\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376603.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861233&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","snowboards","kids-snowboards"]}
