{"sku":"861220","manufacturer_id":"MH25","brand_name":"Nitecore","product_name":" Nitecore MH25 Flashlight","long_description":"With four brightness settings, two strobes and the ability to set the mode you want the light to turn on in, the rechargeable Nitecore MH25 flashlight is the go-to light for your outdoor adventures. High-quality Cree XM-L U2 LED has a maximum output of 860 lumens on turbo mode to light up the darkest trails and street corners; throws a bright beam up to 236m (774 ft.). Access turbo mode by lightly tightening flashlight head; outputs 320 lumens on high, 130 lumens on mid and 40 lumens on low; also includes strobe and SOS modes for signaling. Give the tail cap switch a hard press to turn the light on and off; use fast and light presses to switch between high, mid, low, strobe and SOS. You can save any of the standard output modes (high, mid, low, strobe, SOS) so the next time you turn the flashlight on it starts up in that mode. Includes a rechargeable 18650 lithium-ion battery and a micro-USB cable so you can recharge from any USB port. You can also recharge from any household outlet or vehicle power source with the appropriate adapters (not included). Battery provides 28 hrs. of use on low, 8 hrs. 30 min. on mid, 3 hrs. 15. min. on high and 1 hr. 45 min. on low. MH25 can also operate on two non-rechargeable CR123 batteries (not included) for 22 hrs. on low, 7 hrs. 30 min. on mid, 3 hrs. on high and 1 hr. 30 min. on turbo. Aerospace-grade aluminum alloy and a stainless-steel retaining ring protect the core components from damage; anti-roll design keeps the light from rolling away from you. Nitecore MH25 flashlight has an IPX8 water-resistance rating and is impact resistant to 1.5m. Includes an 18650 lithium-ion battery, tactical ring, lanyard, USB cable, stainless-steel clip, holster, spare switch cap and spare O-ring.","short_description":"With four brightness settings, two strobes and the ability to set the mode you want the light to turn on in, the rechargeable Nitecore MH25 flashlight is the go-to light for your outdoor adventures.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416883.png","image_url":"http://i1.avlws.com/115/l416883.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416883&tt=df","retail_price":"84.95","sale_price":"84.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416883\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416883.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861220&amp;link=&amp;tabs=-Details\"></script>","variants":{"8612200001":{"sku":"8612200001","vendor_sku":"MH25","color":"BLACK","retail_price":"84.95","sale_price":"84.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
