{"sku":"861223","manufacturer_id":"P25","brand_name":"Nitecore","product_name":" Nitecore P25 Flashlight","long_description":"Nitecore P25 flashlight has eight settings-five brightness levels and three strobes-to meet your lighting needs. It can recharge from a USB port so you don't have to keep buying batteries. Cree XM-L U2 LED has a maximum output of 860 lumens on turbo mode to light up the darkest trails and street corners; throws a bright beam up to 283m (928 ft.). Outputs 550 lumens on high, 180 lumens on mid, 50 lumens on low and 2 lumens on lowest setting. Includes a standard strobe mode and an SOS strobe mode; leave the flashlight in location beacon strobe mode to find it easily at night. Power-indicator light lets you know when the batteries are low and serves as an another locator beacon by flashing once every three seconds when the light is in standby mode. Use the two-stage button on the side of the flashlight to access turbo mode and strobe mode directly with a half press and hold or a full press and hold, respectively. Flashlight can also be turned on and off using the tail cap switch, giving you options for how you hold the light. Operates on either one 18650 or two CR123 batteries (sold separately); 18650 battery provides up to 325 hrs. of runtime on the lowest output level and 1 hr. 45 min. on turbo. Non-rechargeable CR123 lithium batteries provide 200 hrs. of runtime on lowest and 1 hr. 15 min. on turbo. Recharge the 18650 lithium-ion battery while it is in the flashlight using any USB port with the included micro-USB cable. Charge from a wall outlet or vehicle power port using adapters (not included). Integrated dual Picatinny connectors/rails provide many options for mounting the light on other equipment. Aerospace-grade aluminum alloy and a stainless-steel retaining ring protect the core components from damage. Includes a titanium-plated, stainless-steel clip for attaching the light to a belt or pant pocket; anti-roll design of the flashlight head keeps the light from rolling away.","short_description":"Nitecore P25 flashlight has eight settings-five brightness levels and three strobes-to meet your lighting needs. It can recharge from a USB port so you don't have to keep buying batteries.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416895.png","image_url":"http://i1.avlws.com/115/l416895.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416895&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416895\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416895.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861223&amp;link=&amp;tabs=-Details\"></script>","variants":{"8612230001":{"sku":"8612230001","vendor_sku":"P25","color":"BLACK","retail_price":"99.95","sale_price":"99.95"}}}
