{"sku":"861314","manufacturer_id":"S02313,39","brand_name":"Fischer","product_name":" Fischer RC Skate / Combi My Style Boots - Women's","long_description":"The Fischer RC Skate / Combi My Style boots offer stability, control and easy entry for race newcomers who want the flexibility of a boot that can be used for both classic and skate skiing. Hinged stabilizing cuffs provide side-to-side support while allowing good freedom of movement front to back. Rip-and-stick ankle straps allow you to personalize and secure the fit around the cuffs and help hold feet in place. External heel cups support and stabilize the heels and counter pronation and supination; slippery fabric inside the heels reduces friction on entry. Quick-lace system secures and locks forefeet inside boots; lace covers with sealed zippers ensure moisture is kept out. Thinsulate(R) insulation plus EVA foam cushioning provide outstanding warmth and comfort; after several days of skiing, the linings conform to your feet and remain that way. NNN outsoles have a torsional rigidity optimized for comfortable skate skiing; medium-flex platforms are built wider than race models for greater stability and walking comfort. Entry loops and wide openings on the Fishcer RC Skate / Combi My Style boots make the boots easy to put on/take off, slippery fabric inside the heels reduces friction on entry.","short_description":"The Fischer RC Skate / Combi My Style boots offer stability, control and easy entry for race newcomers who want the flexibility of a boot that can be used for both classic and skate skiing.","category":"Skiing","subcategory":"Ski Boots","product_group":"Cross-Country Ski Boots","thumb_url":"http://i1.avlws.com/115/s450623.png","image_url":"http://i1.avlws.com/115/l450623.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450623&tt=df","retail_price":"179.95","sale_price":"161.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450623\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450623.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861314&amp;link=&amp;tabs=-Details\"></script>","variants":{"8613140006":{"sku":"8613140006","vendor_sku":"S02313,42","size":"42 EU","color":"WHITE","retail_price":"161.93","sale_price":"161.93"}}}
