{"sku":"861472","manufacturer_id":"A14-652-2-19W","brand_name":"Marin","product_name":" Marin Kentfield CS2 Step-Through Women's Bike - 2014","long_description":"Great for casual, everyday riding, the Marin Kentfield CS2 step-through women's bike offers a comfortable, upright ride, a bump-absorbent seat and a design that makes mounts and dismounts a breeze. Bike's overall geometry and flat handlebar provide a comfortable upright ride, minimizing body strains and optimizing visibility. Step-through frame makes it easy to get on and off your bike. Marin Women's Sport Plush saddle provides ergonomic support and cushioning, and a shock-absorbent seat post takes the jarring bumps out of uneven roads. 6061 aluminum frame features hydroformed top and down tubes to increase strength without adding weight. Triple crankset and 7-speed cassette combine to provide 21 gears for fun, swift cruising and efficient hill climbing. Intuitive Shimano EF51 EZ-FIRE Plus shifters and Shimano derailleurs provide responsive, smooth shifting. Linear-pull brakes slow you down in a controlled manner for easy speed maintenance. Schwalbe Road Cruise tires offer puncture protection to deter mood-deflating flats. Marin Kentfield CS2 step-through women's bike specs are subject to change.","short_description":"Great for casual, everyday riding, the Marin Kentfield CS2 step-through women's bike offers a comfortable, upright ride, a bump-absorbent seat and a design that makes mounts and dismounts a breeze.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378487.png","image_url":"http://i1.avlws.com/115/l378487.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378487&tt=df","retail_price":"499.00","sale_price":"499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378487\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378487.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861472&amp;link=&amp;tabs=-Details\"></script>","variants":{"8614720003":{"sku":"8614720003","vendor_sku":"A14-652-2-19W","upc":"841323001547","size":"19 IN","color":"GLOSS WHITE","retail_price":"499.00","sale_price":"499.00"}}}
