{"sku":"861481","manufacturer_id":"A14-692-1-22","brand_name":"Marin","product_name":"Marin Fairfax SC2 Bike - 2014","long_description":"Offering versatility at a great value, the Marin Fairfax SC2 bike is a speedy, sporty ride with an upright position for increased comfort and visibility when riding. Upright positioning increases the rider's field of view and reduces strain on the hands, wrists and shoulders. Triple-butted, hydroformed aluminum frame is designed to optimize efficiency and ensure a comfortable, stable ride. Triple crankset and 8-speed cassette provide 24 gears for handling whatever grades you may encounter on the ride. Shimano shifters and derailleurs move you smoothly from gear to gear; trigger shifters operate intuitively for simple shifts. Linear-pull brakes are forged for strength and modulated for controlled response. Stable, smooth-rolling 700x32c tires feature puncture protection to deter flats. Platform pedals accommodate most shoes, and feature aluminum cages for efficient power transfer to pedals. Marin Fairfax SC2 bike specs are subject to change.","short_description":"Offering versatility at a great value, the Marin Fairfax SC2 bike is a speedy, sporty ride with an upright position for increased comfort and visibility when riding.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374583.png","image_url":"http://i1.avlws.com/115/l374583.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374583&tt=df","retail_price":"549.00","sale_price":"549.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374583\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374583.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861481&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
