{"sku":"861478","manufacturer_id":"A14-480-1-52","brand_name":"Marin","product_name":"Marin Lombard Bike - 2014","long_description":"If you're looking for a cyclocross bike that's also a great commuter, the Marin Lombard bike is it. With Shimano components, 20 speeds and puncture-resistant tires, it's ready for pavement and trails. Triple-butted, hydroformed aluminum frame and carbon fiber fork work to optimize efficiency and ensure a comfortable, stable ride. Shimano 50/34 crankset turns a 10-speed cassette for 20 gears. Shimano Tiagra front and 105 rear derailleurs provide responsive shifting; shifters are ergonomically shaped and intuitive to use. Avid BB5 mechanical disc brakes supply commanding stopping power no matter the terrain or weather. Clement X'Plor tires feature stout puncture protection to deter flats and keep you rolling along. Eyelets let you attach fenders or a rack (not included). Reflective graphics; durable frame finish. Specs on the Marin Lombard are subject to change.","short_description":"If you're looking for a cyclocross bike that's also a great commuter, the Marin Lombard bike is it. With Shimano components, 20 speeds and puncture-resistant tires, it's ready for pavement and trails.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374571.png","image_url":"http://i1.avlws.com/115/l374571.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374571&tt=df","retail_price":"1199.00","sale_price":"1199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374571\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374571.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861478&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
