{"sku":"861464","manufacturer_id":"A14-290-1-17","brand_name":"Marin","product_name":" Marin Coast Trail Woman's Bike - 2014","long_description":"The Marin Coast Trail women's hardtail mountain bike features a women-specific geometry for enhanced handling and fit, plus a full array of reliable parts for exploring your first trails. Enjoy a ride dialed to your measurements; Marin Coast Trail frame accommodates a woman's inseam and torso lengths. Butted 6061 aluminum frame delivers a stiff, responsive ride; shaped top and down tubes maintain strength while reducing overall weight. Suntour XCT suspension fork provides 100mm of travel to smooth out rough trails; springs are optimized for women. Shimano triple crankset and 8-speed cassette are paired to offer 24 gear combinations for easy spinning up hills and down descents. Shimano trigger shifters and derailleurs provide easy, dependable shifting. Linear-pull brakes make it easy to finesse your speed. Schwalbe Black Jack tires supply good all-around traction. Specs on the Marin Coast Trail women's hardtail mountain bike are subject to change.","short_description":"The Marin Coast Trail women's hardtail mountain bike features a women-specific geometry for enhanced handling and fit, plus a full array of reliable parts for exploring your first trails.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374807.png","image_url":"http://i1.avlws.com/115/l374807.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374807&tt=df","retail_price":"499.00","sale_price":"499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374807\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374807.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861464&amp;link=&amp;tabs=-Details\"></script>","variants":{"8614640004":{"sku":"8614640004","vendor_sku":"A14-290-1-19","upc":"841323004975","size":"19 IN","color":"MATTE GRAPHITE GRAY","retail_price":"499.00","sale_price":"499.00"}}}
