{"sku":"861438","manufacturer_id":"SRT7","brand_name":"Nitecore","product_name":"Nitecore SRT7 Flashlight","long_description":"The Nitecore SRT7 flashlight features a premium Cree XM-L LED for a maximum output of 960 lumens and a selector ring that lets you rapidly choose any level of light output down to 0.1 lumen. Cree XM-L LED throws a beam a distance of 308m (1,011 ft.) to illuminate the darkest trails and back alleyways. Rotate the selector ring to rapidly choose any level of light output from 0.1 lumen to 960 lumens, and to select strobe modes, turbo mode and different colored LEDs. Operates on either one 18650 lithium-ion battery or two CR123 lithium batteries (sold separately) to provide up to 200 hrs. of runtime on the lowest output level. Equipped with red, green and blue LEDs; red light is useful for general outdoor use when you don't want to ruin your night vision; green light is good for analyzing maps. Use blue light in fishing and hunting applications, and to look for blood and stains. Includes a standard strobe mode and a police warning light that alternates red and blue light; leave the flashlight in location beacon strobe mode to find it easily at night. Power-indicator light lets you know when the batteries are low and serves as an another locator beacon by flashing once every three seconds when the light is in standby mode. Aerospace-grade aluminum alloy and a stainless-steel retaining ring protect the core components from damage. Includes a titanium-plated stainless-steel clip for attaching the light to a belt or pant pocket. The Nitecore SRT7 flashlight has an IPX8 water resistance rating and impact resistant to 1.5m. Includes a holster, removable clip, tactical ring, lanyard, spare tail-cap button and spare O-ring.","short_description":"The Nitecore SRT7 flashlight features a premium Cree XM-L LED for a maximum output of 960 lumens and a selector ring that lets you rapidly choose any level of light output down to 0.1 lumen.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416907.png","image_url":"http://i1.avlws.com/115/l416907.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416907&tt=df","retail_price":"119.95","sale_price":"119.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416907\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416907.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861438&amp;link=&amp;tabs=-Details\"></script>","variants":{"8614380001":{"sku":"8614380001","vendor_sku":"SRT7","color":"BLACK","retail_price":"119.95","sale_price":"119.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
