{"sku":"861415","manufacturer_id":"30002BO","brand_name":"Disc-O-Bed","product_name":" Disc-O-Bed Cam-O-Bunk Cots with Organizers - X Large","long_description":"You've seen bunk beds for home, but how about for camping? The X Large-size Disc-O-Bed Cam-O-Bunk cots help you get the whole family in one tent and come with organizers for books, bottles and more. More than 6 in. wider than the large-size Cam-O-Bunk, the X Large-size cots give two campers plenty of space to stretch out and get comfortable. The versatile Cam-O-Bunk cot is more than just a bunk bed-it can be turned into a bench or two single cots depending on your needs. When bunked, the top cot sits 32 in. off the ground to fit in most large family camping tents. 600-denier polyester sleeping surface stays taut and supportive from head to toe for great comfort. Each powder-coated, rust-resistant steel frame supports up to 500 lbs. Organizer pockets hang from each cot to give you plenty of space for storing your books, headlamps, pens and water bottles. Rounded legs on the bottom bunk are shaped to limit sinking into the ground and prevent damage to the floor of your tent. Disc-O-Bed Cam-O-Bunk cot with organizers assembles easily without the use of tools; each cot disassembles and fits compactly in its own carry bag for easy transport.","short_description":"You've seen bunk beds for home, but how about for camping? The X Large-size Disc-O-Bed Cam-O-Bunk cots help you get the whole family in one tent and come with organizers for books, bottles and more.","category":"Camping And Hiking","subcategory":"Camp Furniture","product_group":"Cots","thumb_url":"http://i1.avlws.com/115/s413947.png","image_url":"http://i1.avlws.com/115/l413947.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413947&tt=df","retail_price":"349.95","sale_price":"349.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413947\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413947.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861415&amp;link=&amp;tabs=-Details\"></script>","variants":{"8614150001":{"sku":"8614150001","vendor_sku":"30002BO","upc":"854720004004","color":"GREEN","retail_price":"349.95","sale_price":"349.95"}}}
