{"sku":"861484","manufacturer_id":"A14-634-1-15","brand_name":"Marin","product_name":" Marin Terra Linda SC4 Women's Bike - 2014","long_description":"The Marin Terra Linda SC4 women's bike features comfortable positioning, a smooth carbon fork, all-weather disc brakes and Shimano components for smooth commutes and speedy joy rides. Hydroformed, triple-butted 6061 aluminum frame features sporty road bike geometry that's designed specifically for women. Upright positioning reduces strain on the hands, wrists and shoulders, and increases the rider's field of vision. Carbon fiber fork lightens the bike while also reducing high-frequency road vibrations. Shimano Acera triple crankset and a 9-speed cassette provide 27 gears for handling everything from climbs to flat-land cruising. Shimano shifters and derailleurs move you smoothly from gear to gear. Tektro hydraulic disc brakes offer powerful stopping no matter the weather. Double-wall rims and Continental Contact II 700x32c road tires provide a sporty ride while withstanding the usual hard-surface abuse. Marin speed saddle is contoured for all-day comfort and anatomic support. Platform pedals accommodate most casual shoes. The Marin Terra Linda SC4 women's bike specs are subject to change.","short_description":"The Marin Terra Linda SC4 women's bike features comfortable positioning, a smooth carbon fork, all-weather disc brakes and Shimano components for smooth commutes and speedy joy rides.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374595.png","image_url":"http://i1.avlws.com/115/l374595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374595&tt=df","retail_price":"899.00","sale_price":"899.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861484&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
