{"sku":"861466","manufacturer_id":"A14-296-1-15","brand_name":"Marin","product_name":" Marin Marin Bear Valley 27.5 Women's Bike - 2014","long_description":"Built with 27.5 in. wheels for quick acceleration and excellent control, the Marin Bear Valley 27.5 women's hardtail mountain bike offers a comfortable, easy-handling platform for singletrack forays. Marin Bear Valley 27.5 women's mountain bike is smaller, quicker and lighter than full-size 29ers, but offers the same benefits-more speed and better traction. Larger-diameter wheels also roll over obstacles more easily so you won't stall going up hill over roots and loose soil. Enjoy a ride dialed to your measurements; Marin Bear Valley frame accommodates a woman's inseam and torso length. 6061 aluminum frame delivers a stiff, responsive ride; hydroformed, double-butted top and down tubes maintain strength and reduce overall weight. SR Suntour XCR 27.5 LO-R Air suspension fork provides 100mm of travel to smooth out rough trails; preload adjustment and lockout let you customize the ride. Shimano Acera triple crankset and Shimano 9-speed 11-34 cassette provide 27 gear combinations to handle hilly terrain and fast descents. Shimano Acera trigger shifters and Deore rear derailleur provide intuitive, responsive shifting. Tektro hydraulic disc brakes supply powerful, controlled deceleration in mixed conditions. Stout double-walled Alex rims stand up to trail abuse; Schwalbe Racing Ralph tires provide traction. Handlebar is double-butted for strength and tapered to fit a woman's reach; shims facilitate easy adjustment of both shift and brake levers for a tailored cockpit. Specs on the Marin Bear Valley 27.5 women's hardtail mountain bike are subject to change.","short_description":"Built with 27.5 in. wheels for quick acceleration and excellent control, the Marin Bear Valley 27.5 women's hardtail mountain bike offers a comfortable, easy-handling platform for singletrack forays.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374815.png","image_url":"http://i1.avlws.com/115/l374815.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374815&tt=df","retail_price":"999.00","sale_price":"999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374815\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374815.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861466&amp;link=&amp;tabs=-Details\"></script>","variants":{"8614660003":{"sku":"8614660003","vendor_sku":"A14-296-1-17","upc":"841323000922","size":"17 IN","color":"GLOSS WHITE","retail_price":"999.00","sale_price":"999.00"}}}
