{"sku":"861469","manufacturer_id":"A14-106-1-20","brand_name":"Marin","product_name":" Marin Rift Zone 29er XC7 Bike - 2014","long_description":"Ready to rip down your favorite trails with fast-rolling 29er wheels, the Marin Rift Zone 29er XC7 full-suspension mountain bike offers a cushy, shock-absorbent platform for excellent performance. 6061 aluminum frame offers a geometry optimized for high-performance XC/trail riding. Quad-Link 3.0 rear suspension design offers a firm pedaling platform that won't easily bottom out to ensure efficient pedaling and high performance. RockShox Reba RL fork features a tapered alloy steerer for weight savings; offers 100mm travel with lockout. Tapered steerer and head tube combine with a 15mm Maxle Light front thru axle to stiffen up the front end for enhanced strength and handling precision. RockShox Monarch RL shock floats through bumps with excellent adjustability, external rebound and lockout, turning rugged trails into tire-gripping velvet. Shimano drivetrain features SLX shifters and front derailleur along with an XT Shadow Plus rear derailleur for fast, precise shifts through the 30 gear combinations. Shimano hydraulic brakes offer all-conditions braking power with a 180mm rotor up front and a 160mm rotor in the back. Schwalbe Rapid Rob tires offer good all-around traction and fast-rolling performance. Specs on the Marin Rift Zone 29er XC7 full-suspension mountain bike are subject to change.","short_description":"Ready to rip down your favorite trails with fast-rolling 29er wheels, the Marin Rift Zone 29er XC7 full-suspension mountain bike offers a cushy, shock-absorbent platform for excellent performance.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374823.png","image_url":"http://i1.avlws.com/115/l374823.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374823&tt=df","retail_price":"2699.00","sale_price":"2699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374823\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374823.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861469&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
