{"sku":"861532","brand_name":"The North Face","product_name":"The North Face ThermoBall Vest - Men's","long_description":"The North Face ThermoBall(TM) vest for men puts revolutionary new ThermoBall(TM) synthetic insulation to work. Warm and light, it mimics the best of down, yet still insulates even when wet. Functioning like down feathers, the tiny round clusters of ThermoBall spun polyester trap warm air, while softly conforming to your body's shape. ThermoBall retains 80% of its insulating power even when dampened by rain, humidity or sweat, so you'll continue to stay warm. Small baffles in shell fabric allow insulation to fully expand to retain body heat; highly compressible ThermoBall insulation offers warmth equal to 600-fill-power goose down. Tightly-woven nylon shell features square stitching that helps hold insulation in place to keep it evenly distributed; Durable Water Repellent finish repels light moisture. Nylon lining wicks sweat off the skin for quick evaporation, helping you stay dry and comfortable. Quickly stuff the vest into its own space-saving, left-hand stow pocket for compact storage. Zippered hand pockets; full-length front zipper with internal windflap; stretch-bound arm-holes, low-profile drawcord hem. The North Face ThermoBall vest has a standard fit and is machine washable. ThermoBall technology was thoroughly tested by The North Face athletes, including Conrad Anker and Jimmy Chin, during summit trips on Denali and Mount Meru.","short_description":"The North Face ThermoBall(TM) vest for men puts revolutionary new ThermoBall(TM) synthetic insulation to work. Warm and light, it mimics the best of down, yet still insulates even when wet.","category":"Men's","subcategory":"Men's Vests","product_group":"Men's Insulated Vests","thumb_url":"http://i1.avlws.com/115/s329821.png","image_url":"http://i1.avlws.com/115/l329821.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=329821&tt=df","keywords":"outer-layer,layer,warm,mid,vest","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=329821\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m329821.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861532&amp;link=&amp;tabs=-Details\"></script>","variants":{"8615320010":{"sku":"8615320010","vendor_sku":"A7ZKJK3","upc":"808390907516","size":"XXL","color":"TNF BLACK","retail_price":"149.00","sale_price":"149.00"}}}
