{"sku":"861537","brand_name":"The North Face","product_name":"The North Face Himalayan Down Pants - Men's","long_description":"On high-altitude expeditions to the world's coldest environments, you need the ultimate in warmth and protection. The North Face Himalayan down pants deliver the innovation and technology you need. The North Face Himalayan Collection was designed with direct input from legendary mountaineer and The North Face athlete Conrad Anker. Upper body is insulated wtih 800-fill-power Hungarian goose down; 700-fill-power in lower body for compression resistance. Welded baffle construction eliminates cold spots and weak points that accompany convetional needle holes. Stretch upper bib has low-profile adjustable suspenders and a zippered Napoleon pocket. Lower leg is insulated with Climashield(R) synthetic insulation for warmth when compressed by your over-boot gaiters. Large drop-seat zipper with draft tube construction keeps the cold out. The North Face Himalayan down pants offer abundant reflectivity for visibility on alpine starts and in vicious weather.","short_description":"On high-altitude expeditions to the world's coldest environments, you need the ultimate in warmth and protection. The North Face Himalayan down pants deliver the innovation and technology you need.","category":"Men's","subcategory":"Men's Pants","product_group":"Men's Climbing Pants","thumb_url":"http://i1.avlws.com/115/s339175.png","image_url":"http://i1.avlws.com/115/l339175.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=339175&tt=df","keywords":"pants,clothing,pant,climbing pants,clothes","retail_price":"549.00","sale_price":"549.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=339175\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m339175.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861537&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
