{"sku":"861592","manufacturer_id":"00.5018.021.001","brand_name":"Avid","product_name":" Avid Elixir 7 Trail Disc Brake - Caliper and Brake Lever","long_description":"Whether you're bombing rowdy descents or flowing through technical rock gardens, the Avid Elixir 7 Disc Brake offers awesome stopping power with a svelte profile. Please note, this item only includes the brake lever and caliper, rotor is sold separately. Taperbore Technology(TM) supplies excellent power and control, and offers enhanced lever feedback for great feel; integrated reservoir provides a clean, sleek look. Get more forceful braking with less effort with the Power Reserve Geometry design, which places the lever pivot point closer to your fingers' natural motion. The Avid Elixir 7 disc brake uses DOT 5.1 brake fluid to increase heat resistance on the large, powerful pistons for consistent power that doesn't fade away as things heat up. Ambidextrous mounting and tooled reach adjustment of lever provides easy removal, flopping and tuning for a custom setup; compatible with MatchMakerX clamps. Sintered compound brake pads load from the top so changing them is about as easy as it gets. Elixir 7 hydraulic disc brake includes 1 lever, 1 caliper, pre-bled hydraulic line (rotor sold separately); choose from front or rear.","short_description":"Whether you're bombing rowdy descents or flowing through technical rock gardens, the Avid Elixir 7 Disc Brake offers awesome stopping power with a svelte profile.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Brakes","thumb_url":"http://i1.avlws.com/115/s447323.png","image_url":"http://i1.avlws.com/115/l447323.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=447323&tt=df","retail_price":"126.00","sale_price":"126.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=447323\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m447323.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861592&amp;link=&amp;tabs=-Details\"></script>","variants":{"8615920001":{"sku":"8615920001","vendor_sku":"00.5018.021.000","upc":"710845725357","size":"FRONT","color":"GREY","retail_price":"126.00","sale_price":"126.00"},"8615920002":{"sku":"8615920002","vendor_sku":"00.5018.021.001","upc":"710845725364","size":"REAR","color":"GREY","retail_price":"126.00","sale_price":"126.00"}},"categories":["cycling","bike-components","bike-brakes"]}
