{"sku":"861591","manufacturer_id":"00.5018.015.008","brand_name":"Avid","product_name":"Avid XO Trail Disc Brake With Carbon Brake Lever - Front / Rear","long_description":"Supplying huge stopping power without bulk, the Avid XO Trail Disc brake with carbon brake lever offers more control with less weight thanks to its carbon lever. Please note, this item only includes the brake lever and caliper, rotor not included. Taperbore Technology(TM) supplies excellent power and control, and offers enhanced lever feedback for great feel; integrated reservoir provides a clean, sleek look. Get more forceful braking with less effort with the Power Reserve Geometry design, which places the lever pivot point closer to your fingers' natural motion. The Avid XO Trail Disc brake uses DOT 5.1 brake fluid to increase heat resistance on the large, powerful pistons for consistent power that doesn't fade away as things heat up. Ambidextrous mounting and tooled reach adjustment of lever provides easy removal and tuning for a custom setup; compatible with MatchMakerX clamps. Brake pads load from the top so changing them is about as easy as it gets. The Avid XO Trail Disc brake includes 1 carbon lever, 1 caliper, pre-bled hydraulic line, 6-bolt 160mm HS1 rotor and mounting hardware; choose from front or rear.","short_description":"Supplying huge stopping power without bulk, the Avid XO Trail Disc brake with carbon brake lever offers more control with less weight thanks to its carbon lever.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Brakes","thumb_url":"http://i1.avlws.com/115/s462167.png","image_url":"http://i1.avlws.com/115/l462167.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=462167&tt=df","retail_price":"234.00","sale_price":"234.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=462167\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m462167.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861591&amp;link=&amp;tabs=-Details\"></script>","variants":{"8615910001":{"sku":"8615910001","vendor_sku":"00.5018.015.008","upc":"710845725296","size":"FRONT","color":"BLACK","retail_price":"234.00","sale_price":"234.00"},"8615910002":{"sku":"8615910002","vendor_sku":"00.5018.015.009","upc":"710845725302","size":"REAR","color":"BLACK","retail_price":"234.00","sale_price":"234.00"}},"categories":["cycling","bike-components","bike-brakes"]}
