{"sku":"861530","manufacturer_id":"A0QLJK3","brand_name":"The North Face","product_name":"The North Face Valkyrie Jacket - Men's","long_description":"The North Face Valkyrie soft-shell jacket for men is windproof to protect against the chill of summit winds, but its active fit and breathability make it a good choice for most any aerobic activity. GORE(R) WINDSTOPPER(R) is 100% windproof; water repellent and breathable; and makes less noise than a hardshell. WINDSTOPPER is tightly woven for abrasion resistance and stretchy comfort; microfleece lining offers soft, warm comfort and manages moisture. Pit zips vent excess heat. Helmet-compatible hood with hidden cord locks and laminated wire brim is fully adjustable for a close fit that provides unhindered peripheral vision. Soft, lined collar shields neck from the cold, and the interior draft flap rolls over zipper to protect chin from abrasion. Features a drawcord hem and adjustable cuffs. The North Face Valkyrie jacket has zippered handwarmer pockets placed so they won't interfere with pack straps or a climbing harness.","short_description":"The North Face Valkyrie soft-shell jacket for men is windproof to protect against the chill of summit winds, but its active fit and breathability make it a good choice for most any aerobic activity.","category":"Men's","subcategory":"Men's Jackets","product_group":"Men's Soft Shell Jackets","thumb_url":"http://i1.avlws.com/115/s333419.png","image_url":"http://i1.avlws.com/115/l333419.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=333419&tt=df","keywords":"coat,men,jacket,men's soft shell jackets","retail_price":"280.00","sale_price":"280.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=333419\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m333419.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861530&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
