{"sku":"861656","manufacturer_id":"010-01088-10","brand_name":"Garmin","product_name":" Garmin VIRB Elite Action Camera","long_description":"The Wi-Fi-enabled Garmin VIRB Elite action camera harnesses the power of GPS allowing video recordings that automatically start and stop with GPS-enabled triggers you set, such as speed or altitude. High-sensitivity GPS, accelerometer and altimeter capture key data, including location, speed and altitude. With the on-board GPS and use-specific profiles such as ski mode, you can automatically start and stop recording with triggers such as minimum/maximum speed or altitude. Has Wi-Fi and ANT+ connectivity to use the Garmin VIRB Elite with your iPhone or Android via free mobile apps. High-quality glass lens accommodates wide, medium and narrow shooting modes; high-resolution, color LCD display offers preview, playback and easy control of camera settings. 16MP sensor processes four HD video modes (1080p at 30fps, 960p at 30/48fps, 720p at 30/60fps and 848x480 at 120fps) and still images (16MP at 4:3, 12MP at 16:9 and 8MP at 4:3. Achieve clear, true-to-life imagery with HDR (High Dynamic Range), ANR (Advanced Noise Reduction) and LDC (Lens Distortion Correction) capabilities. Easily record photo bursts (16 per second at 6fps, 12 per second at 10fps and 8 per second at 15fps) and time lapses (0.5, 1, 2, 5, 10, 30 and 60 seconds). ANT+ wireless enables remote control and data transfer with other compatible Garmin products; edit and share your footage with free Garmin BaseCamp software. Enjoy an easy slider switch for instant recording and on/off power, an internal stereo mic, external USB jack, composite A/V adapter and microHDMI output for video playback. Removable, rechargeable 2000mAh lithium-ion battery offers up to 3.5 hrs. at 1080p; microSD card socket accepts cards up to 64GB for memory storage (cards sold separately). Compact, unobtrusive and rugged design stands up to the bumps and drops that come with outdoor fun; it's also waterproof down to 1m for up to 30 min.","short_description":"The Wi-Fi-enabled Garmin VIRB Elite action camera harnesses the power of GPS allowing video recordings that automatically start and stop with GPS-enabled triggers you set, such as speed or altitude.","category":"Electronics","subcategory":"Helmet Cameras","product_group":"Helmet Cams","thumb_url":"http://i1.avlws.com/115/s426799.png","image_url":"http://i1.avlws.com/115/l426799.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426799&tt=df","keywords":"hd,pov","retail_price":"400.00","sale_price":"400.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426799\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426799.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861656&amp;link=&amp;tabs=-Details\"></script>","variants":{"8616560001":{"sku":"8616560001","vendor_sku":"010-01088-10","upc":"753759993382","color":"WHITE","retail_price":"400.00","sale_price":"400.00"}},"categories":["electronics","helmet-cameras","helmet-cams"]}
