{"sku":"861827","manufacturer_id":"J95441","brand_name":"Merrell","product_name":" Merrell Moab Ventilator Hiking Shoes - Kids' - 2012 Closeout","long_description":"For hiking and exploring on warm summer days, the exceptionally breathable kids' Merrell Moab Ventilator hiking shoes provide top-notch comfort to young adventurers. Suede leather and nylon mesh uppers offer ample breathability, flexibility and support for long-lasting performance. Protective toe bumpers ensure durability and abrasion resistance. Z-Rap(TM) wide elastic band with rip-and-stick closure provides a snug and secure fit; heel loops aid entry. Mesh padded tongues protect insteps against lace pressure without inhibiting breathability. Nylon mesh linings absorb and disperse excess moisture for comfort in hot conditions. Removable, perforated footbeds add cushioning for improved comfort. The Merrell Moab Ventilator hiking shoes have compression-molded EVA midsoles with Air Cushion heel pockets for shock absorption and cushioning for all-day play. Nonmarking Merrell Pulse rubber outsoles feature a tread design inspired by mountain bike tires, delivering reliable traction on wet and dry surfaces. Closeout.","short_description":"For hiking and exploring on warm summer days, the exceptionally breathable kids' Merrell Moab Ventilator hiking shoes provide top-notch comfort to young adventurers.","category":"Footwear","subcategory":"Kids' Footwear","product_group":"Kids' Shoes","thumb_url":"http://i1.avlws.com/115/s377483.png","image_url":"http://i1.avlws.com/115/l377483.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=377483&tt=df","keywords":"trail","retail_price":"60.00","sale_price":"41.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=377483\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m377483.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861827&amp;link=&amp;tabs=-Details\"></script>","variants":{"8618270006":{"sku":"8618270006","vendor_sku":"J95441","upc":"486182700066","size":"5","color":"WALNUT","retail_price":"41.73","sale_price":"41.73"}}}
