{"sku":"861975","manufacturer_id":"S130600101172","brand_name":"K2","product_name":"K2 AMP Bolt Skis with Bindings - Men's - 2013/2014","long_description":"Built for precision on groomed runs, the advanced-level K2 AMP Bolt skis with bindings combine slight rocker with burly construction to produce unshakeble hold during sweeping, GS-style turns. Combination of a strong core, shock-absorbent secondary core and X-shaped carbon support creates skis with tenacious grip on hardpack and instant side-to-side response. Metal laminate construction alternates layers of fiberglass and titanium above and below the fir core to provide vibration damping and powerful responsiveness. Typically a super-beefy ski like the Bolt would be unforgiving and tough to turn, but K2 has added a very slight rise in the tips to aid in turning. Rocker designed for speed initiates turns easily and offers agile performance, and normal camber underfoot offers responsive power and strong edge hold on firm snow. Lightweight integrated binding system acts on a wide surface area, transferring power directly to the skis' edges for excellent carving and control during aggressive descents. K2 AMP Bolt skis with bindings feature DIN 5 - 14 release settings, a range suited to advanced skiers at high speeds. Base or topsheet color may vary from online photo.","short_description":"Built for precision on groomed runs, the advanced-level K2 AMP Bolt skis with bindings combine slight rocker with burly construction to produce unshakeble hold during sweeping, GS-style turns.","category":"Skiing","subcategory":"Skis","product_group":"Downhill Skis","thumb_url":"http://i1.avlws.com/115/s461411.png","image_url":"http://i1.avlws.com/115/l461411.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=461411&tt=df","retail_price":"1099.95","sale_price":"659.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=461411\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m461411.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861975&amp;link=&amp;tabs=-Details\"></script>","variants":{"8619750002":{"sku":"8619750002","vendor_sku":"S130600101179","upc":"886745157588","size":"179 CM","retail_price":"659.93","sale_price":"659.93"}},"categories":["snow","skis","downhill-skis"]}
