{"sku":"861911","manufacturer_id":"A.8832.MI","brand_name":"Luminox","product_name":"Luminox Recon Series NAV SPC Watch","long_description":"Unleash your inner pathfinder with the Luminox Recon Series NAV SPC watch. Military-grade brawn and robust features come together in a watch that embraces virtually any outdoor adventure. Precise Swiss quartz movement drives the analog display, second time zone indicator and date window; tritium gas tubes on hands and markers glow steadily for up to 25 yrs. Removable, liquid-filled compass on the strap provides effective, at-a-glance navigation. Walking-speed scale allows you to measure your pace in miles per hour, calculated using the number of steps it takes you to walk 50m (164 ft.). Measure how many steps it takes you to cover 50m beforehand, and then start counting your steps when the second hand is on 12 o'clock. Upon your last counted step, check the number the second hand is pointing to on the walking scale; this is your current walking speed. Counter-clockwise rotating bezel with timer markings allows you to use the minute hand as a 60-min. countdown timer. Carbon-reinforced polycarbonate case and a highly scratch-resistant sapphire crystal with an anti-reflective coating stand up to years of rigorous outdoor use. The Luminox Recon Series NAV SPC watch resists water to 200m (650 ft.). Durable and comfortable rubber strap sports three common scales for measuring distances on a map, imprinted into the straps' exterior surface.","short_description":"Unleash your inner pathfinder with the Luminox Recon Series NAV SPC watch. Military-grade brawn and robust features come together in a watch that embraces virtually any outdoor adventure.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413543.png","image_url":"http://i1.avlws.com/115/l413543.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413543&tt=df","keywords":"waterproof","retail_price":"495.00","sale_price":"495.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413543\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413543.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861911&amp;link=&amp;tabs=-Details\"></script>","variants":{"8619110001":{"sku":"8619110001","vendor_sku":"A.8832.MI","upc":"746469883210","color":"BLACK/GREEN","retail_price":"495.00","sale_price":"495.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
