{"sku":"861968","manufacturer_id":"J95437","brand_name":"Merrell","product_name":" Merrell Moab Ventilator Mid Hiking Boots - Kids' - 2012 Closeout","long_description":"For hiking and exploring on warm summer days, the exceptionally breathable Merrell Moab Ventilator Mid hiking boots provide top-notch comfort and support to young adventurers. Mid-height suede leather and nylon mesh uppers offer ample breathability, flexibility and support for long-lasting performance. Protective toe bumpers ensure durability and abrasion resistance. Traditional lacing with integrated lace lock closure offers a secure fit; heel loops aid entry. Mesh padded tongues protect insteps against lace pressure without inhibiting breathability. Nylon mesh linings absorb and disperse excess moisture for comfort in hot conditions. Removable, perforated footbeds add cushioning for improved comfort. Compression-molded EVA midsoles with Air Cushion(R) heel pockets supply shock absorption and cushioning for all-day play. The Merrell Moab Ventilator Mid hiking boots have nylon arch shanks to provide rigid support to stabilize young feet. Nonmarking Merrell Pulse rubber outsoles feature a tread design inspired by mountain bike tires, delivering reliable traction on wet and dry surfaces. Closeout.","short_description":"For hiking and exploring on warm summer days, the exceptionally breathable Merrell Moab Ventilator Mid hiking boots provide top-notch comfort and support to young adventurers.","category":"Footwear","subcategory":"Kids' Footwear","product_group":"Kids' Boots","thumb_url":"http://i1.avlws.com/115/s377019.png","image_url":"http://i1.avlws.com/115/l377019.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=377019&tt=df","retail_price":"65.00","sale_price":"44.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=377019\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m377019.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=861968&amp;link=&amp;tabs=-Details\"></script>","variants":{"8619680011":{"sku":"8619680011","vendor_sku":"J95437","upc":"486196800110","size":"10","color":"WALNUT","retail_price":"44.73","sale_price":"44.73"}},"categories":["footwear","kids-footwear","kids-boots"]}
