{"sku":"862049","manufacturer_id":"PP1127710000ALL","brand_name":"Pieps","product_name":" Pieps DSP Pro Avalanche Transceiver","long_description":"Built for skiers who explore serious terrain, the Pieps DSP Pro avalanche transceiver is packed with features: a 60m range, a high-tech transmitter and a marking function for multiple burials. Three-antenna system pinpoints the location of burials within a 60m range regardless of antenna orientation and burial depth. In a multiple-burial scenario, the unit works to transmit a signal without overlapping other signals. Eliminating signal overlap allows the searcher to quickly interpret the audible and visual information with increased accuracy and less confusion. Digital Signal Processing (DSP) technology displays the number of buried victims as stick figures on an easy-to-view LCD screen. When signals are detected, the approximate distance and direction to the burials are displayed-simply follow the arrows to reach a burial. Upon locating the position of the first victim, the searcher can mark and mask the found signal and immediately begin searching for other burials; marks up to four signals. Includes an inclinometer so you can accurately measure slope angles, helping you navigate through potential avalanche terrain. Pieps DSP Pro can measure frequency deviation of all transceivers, a great pre-ski tour test to conduct. Scan function quickly gives an overview of all buried devices within the detectable range. Self-check tests all major functions as the transceiver is powering on, including transmitting frequency and operation of antennas, amplifiers, processors and batteries. Adjustable, nylon harness with pouch keeps the unit secure and accessible. Compatible with all transceivers operating on the 457 kHz frequency. Can be used with Pieps iProbe (sold separately); iProbe can temporarily suppress the signal of a transmitting Pieps transceiver to make searching for multiple burials easier.","short_description":"Built for skiers who explore serious terrain, the Pieps DSP Pro avalanche transceiver is packed with features: a 60m range, a high-tech transmitter and a marking function for multiple burials.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Avalanche Safety Gear","thumb_url":"http://i1.avlws.com/115/s407435.png","image_url":"http://i1.avlws.com/115/l407435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=407435&tt=df","retail_price":"374.95","sale_price":"317.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=407435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m407435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862049&amp;link=&amp;tabs=-Details\"></script>","variants":{"8620490001":{"sku":"8620490001","vendor_sku":"PP1127710000ALL","retail_price":"317.93","sale_price":"317.93"}}}
