{"sku":"862050","manufacturer_id":"PP1128040000ALL","brand_name":"Pieps","product_name":"Pieps DSP Sport Avalanche Transceiver","long_description":"Simplified and streamlined, yet outfitted with all the features needed for fast, accurate searches, the Pieps DSP Sport avalanche transceiver is as easy to use as it is powerful. Three-antenna system pinpoints the location of burials within a 50m range regardless of antenna orientation and burial depth. In a multiple-burial scenario, the unit works to transmit a signal without overlapping other signals. Eliminating signal overlap allows the searcher to quickly interpret the audible and visual information with increased accuracy and less confusion. Digital Signal Processing (DSP) technology displays the number of buried victims as stick figures on an easy-to-view LCD screen. When signals are detected, the approximate distance and direction to the burials are immediately displayed-simply follow the arrows to reach a burial. Upon locating the position of the first victim, the searcher can mark and mask the found signal and immediately begin searching for other burials; DSP Sport marks one signal. Self-check tests all major functions as the transceiver is powering on, including transmitting frequency and operation of antennas, amplifiers, processors and batteries. Adjustable, nylon harness with pouch keeps the unit secure and accessible. Compatible with all transceivers operating on the 457 kHz frequency. Can be used with Pieps iProbe (sold separately); iProbe can temporarily suppress the signal of a transmitting Pieps transceiver to make searching for multiple burials easier. Pieps DSP Sport avalanche transceiver operates on 3 AAA batteries, included. Software can be updated via USB (cable not included).","short_description":"Simplified and streamlined, yet outfitted with all the features needed for fast, accurate searches, the Pieps DSP Sport avalanche transceiver is as easy to use as it is powerful.","category":"Climbing","subcategory":"Mountaineering Gear","product_group":"Avalanche Safety Gear","thumb_url":"http://i1.avlws.com/115/s463171.png","image_url":"http://i1.avlws.com/115/l463171.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463171&tt=df","retail_price":"274.95","sale_price":"274.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463171\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463171.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862050&amp;link=&amp;tabs=-Details\"></script>","variants":{"8620500001":{"sku":"8620500001","vendor_sku":"PP1128040000ALL","retail_price":"274.95","sale_price":"274.95"}},"categories":["climbing","mountaineering-gear","avalanche-safety-gear"]}
