{"sku":"862066","manufacturer_id":"19111-0001","brand_name":"Levi's","product_name":" Levi's 511 Slim-Fit Bike Commuter Jeans - Men's - 2013 Overstock","long_description":"Ride, live and work in the same pair of pants. Sleek style and all-day, everyday performance are at the core of the Levi's 511 Slim-Fit Bike Commuter denim jeans. Stretch denim fabric comfortably moves with you as you go about your day, whether you're biking or strolling through the city. Water-resistant and dirt-repellent Schoeller NanoSphere(R) protective finish helps fend off light rain, mud and road grit. Odor-resistant finish helps keep funky odors from developing. Reinforced stitching in key locations enhances durability for long-lasting use. U-lock holster is integrated into the back of the waistband, making it easy to carry your bike lock as you ride. Rolling up pant cuffs exposes 3M(TM) Scotchlite(TM) reflective tape, which helps boost your visibility to motorists. Two front hand pockets, single coin pocket and two back drop-in pockets make up the classic five-pocket style and utility. Levi's 511 Slim-Fit Bike Commuter jeans have slightly tapered legs and a slim fit that sits below the waist; higher rise at back supplies increased coverage while riding. Overstock.","short_description":"Ride, live and work in the same pair of pants. Sleek style and all-day, everyday performance are at the core of the Levi's 511 Slim-Fit Bike Commuter denim jeans.","category":"Cycling","subcategory":"Cycling Clothing","product_group":"Cycling Tights And Pants","thumb_url":"http://i1.avlws.com/115/s392427.png","image_url":"http://i1.avlws.com/115/l392427.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=392427&tt=df","retail_price":"78.00","sale_price":"49.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=392427\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m392427.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862066&amp;link=&amp;tabs=-Details\"></script>","variants":{"8620660004":{"sku":"8620660004","vendor_sku":"19111-0001","upc":"052176088672","size":"38 Waist X 32 Inseam","color":"CHINCHILLA","retail_price":"49.73","sale_price":"49.73"}},"categories":["cycling","cycling-clothing","cycling-tights-and-pants"]}
