{"sku":"862081","manufacturer_id":"3212341110","brand_name":"Deuter","product_name":" Deuter Race X Hydration Pack - 100 fl. oz.","long_description":"Light, comfy and capable of carrying 3 liters of water on your next ride, the Deuter Race X Bike Hydration pack also boasts a helmet carrier, rain cover and plenty of space for extra gear. Includes the BPA-free Streamer 3-liter (100 fl. oz). hydration reservoir with drink tube for on-the-go hydration. Adjustable, highly breathable and anatomically shaped mesh shoulder straps have anti-chafe pads for comfort. Airstripes back panel has contoured, mesh-covered pads designed to cover no more than 5-10% of your back to ensure maximum air circulation and stability. Attached mesh waistbelt stabilizers help keep the pack secure when riding over uneven surfaces. Stowaway helmet holder secures your helmet to the pack for easy off-bike carrying. Raincover can deploy at a moment's notice to help keep your gear dry; when not in use, it can be detached or stowed away in bottom zippered pocket. The Deuter Race X Bike Hydration pack features a small zip front pocket and side mesh drop-in pockets. 3M Scotchlite(TM) reflective details on the front, sides and back of pack increase your visibility in low light.","short_description":"Light, comfy and capable of carrying 3 liters of water on your next ride, the Deuter Race X Bike Hydration pack also boasts a helmet carrier, rain cover and plenty of space for extra gear.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411883.png","image_url":"http://i1.avlws.com/115/l411883.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411883&tt=df","keywords":"day packs","retail_price":"89.00","sale_price":"89.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411883\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411883.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862081&amp;link=&amp;tabs=-Details\"></script>","variants":{"8620810001":{"sku":"8620810001","vendor_sku":"3212341110","color":"GRANITE/WHITE","retail_price":"89.00","sale_price":"89.00"}},"categories":["camping-hiking","backpacks","hydration-packs"]}
