{"sku":"862080","manufacturer_id":"3211371300","brand_name":"Deuter","product_name":" Deuter Race Bike Hydration Pack - 100 fl. oz.","long_description":"Offering stay-put, comfortable performance for any sort of ride, the Deuter Race Bike Hydration pack carries 3 liters of water and includes a rain cover for protecting the pack's contents. Includes BPA-free Streamer 3 liter (100 fl. oz). hydration reservoir with drink tube for on-the-go hydration. Adjustable, highly breathable and anatomically shaped mesh shoulder straps have anti-chafe pads for comfort. Airstripes back panel has contoured, mesh-covered pads designed to cover no more than 5-10% of your back to ensure maximum air circulation and stability. Attached mesh waistbelt stabilizers help keep the pack secure when riding over uneven surfaces. Raincover can deploy at a moment's notice to help keep your gear dry; when not in use, it can be detached or stowed away in bottom zippered pocket. The Deuter Race Bike Hydration pack features a small zip front pocket and a side mesh drop-in pocket. 3M Scotchlite(TM) reflective details on the front, sides and back of pack increase your visibility in low light.","short_description":"Offering stay-put, comfortable performance for any sort of ride, the Deuter Race Bike Hydration pack carries 3 liters of water and includes a rain cover for protecting the pack's contents.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Hydration Packs","thumb_url":"http://i1.avlws.com/115/s411879.png","image_url":"http://i1.avlws.com/115/l411879.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411879&tt=df","keywords":"day packs","retail_price":"79.00","sale_price":"79.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411879\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411879.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862080&amp;link=&amp;tabs=-Details\"></script>","variants":{"8620800001":{"sku":"8620800001","vendor_sku":"3211371300","color":"BLACK/WHITE","retail_price":"79.00","sale_price":"79.00"}}}
