{"sku":"862123","manufacturer_id":"CS1107","brand_name":"Bob","product_name":" BOB Duallie Infant Car Seat Adapter - Fits Peg Perego Seats","long_description":"Use the BOB Duallie Infant car seat adapter to securely install a Peg Perego car seat in your BOB Duallie stroller and get rolling. Seat adapter is easily installed or removed, and folds with the stroller for convenience; restraint belt secures infant car seat in place. Works with the Primo Viaggio SIP(TM) and Primo Viaggio SIP 30/30(TM) infant car seats (not included). Adapter allows use of 1 infant car seat at a time; a snack tray is included with the system for an older child in the second seat. Compatible with 2011 and newer BOB Duallie strollers, including the Revolution SE Duallie, Strides Duallie, Sport Utility Duallie and Ironman Duallie strollers. Because of the higher center of gravity it creates, the BOB Duallie Infant car seat adapter is intended for walking use only. BOB recommends that you consult with your pediatrician regarding the suitability of stroller use with your child as each child develops at a different rate.","short_description":"Use the BOB Duallie Infant car seat adapter to securely install a Peg Perego car seat in your BOB Duallie stroller and get rolling.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s451719.png","image_url":"http://i1.avlws.com/115/l451719.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451719&tt=df","retail_price":"85.00","sale_price":"85.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451719\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451719.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862123&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621230001":{"sku":"8621230001","vendor_sku":"CS1107","upc":"652182706166","size":"DUAL","retail_price":"85.00","sale_price":"85.00"}},"categories":["fitness","running","strollers"]}
