{"sku":"862164","manufacturer_id":"CM21595801","brand_name":"Cannondale","product_name":" Cannondale Synapse Carbon 5 Compact Bike - 2014","long_description":"Combining ultralight carbon construction with a Shimano 105 drivetrain, the Cannondale Synapse Carbon 5 Compact road bike emphasizes comfort with relaxed positioning for demanding endurance rides. Synapse carbon frame features optimized tube shaping to promote efficiency and comfort; frame geometry gives a more upright position than more race-oriented road frames. The rear part of the frame and the all-carbon fork feature the Cannondale Synapse Active Vibration Elimination (S.A.V.E.) technology for damping road vibration. FSA Gossamer Pro compact crankset is paired with an 11-28 tooth cassette for a capable gear range; BB30 bottom bracket enhances stiffness for efficient power transfer. Shimano 105 levers and derailleurs supply precise, dependable shifts throughout the 20 gear combinations. Shimano RS-11 wheelset is decked out with fast Prolongo Kappa Evo folding tires for excellent handling and speed. Pedals not included. Specs on the Cannondale Synapse Carbon 5 Compact road bike are subject to change.","short_description":"Combining ultralight carbon construction with a Shimano 105 drivetrain, the Cannondale Synapse Carbon 5 Compact road bike emphasizes comfort with relaxed positioning for demanding endurance rides.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s444075.png","image_url":"http://i1.avlws.com/115/l444075.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=444075&tt=df","retail_price":"2099.00","sale_price":"2099.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=444075\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m444075.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862164&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
