{"sku":"862166","manufacturer_id":"CM21396002","brand_name":"Cannondale","product_name":" Cannondale SuperSix EVO 3 Compact Bike - 2014","long_description":"Decked out with efficient Ultegra components, the Cannondale SuperSix EVO 3 Compact bike uses an ultralight, competition-ready carbon frame to offer featherweight efficiency to serious racers. Full-carbon SuperSix EVO frame features a geometry and tube construction that translates any motion you make into forward momentum and all-out speed. Slim, small-diameter tubes on the EVO frame shave off weight, maintain strength and slice through air with aerodynamic efficiency. Transferring your power to the wheel, the oversized bottom bracket area and large, asymmetric chainstays ensure your watts aren't wasted in unnecessary flex. The 1-1/8 - 1.5 in. tapered, full-carbon steerer tube and head tube enhance precision. Shaped seatstays and chainstays help reduce side-to-side flex for energy efficiency while also helping make bumps and road vibrations less jarring. Climb with ease and fly on the descents with the compact FSA SL-K Light Carbon crankset, which benefits from a stiff and light BB30 bottom bracket design. The compact crank is paired with an 11-25 cassette for 22 gear combinations, all controlled by smooth and efficient Shimano Ultegra shifters and derailleurs. Lightweight and smooth Mavic Aksium S WTS wheels are outfitted with fast and grippy Mavic Aksium S tires. Specs on the Cannondale SuperSix EVO 3 Compact bike are subject to change.","short_description":"Decked out with efficient Ultegra components, the Cannondale SuperSix EVO 3 Compact bike uses an ultralight, competition-ready carbon frame to offer featherweight efficiency to serious racers.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s444079.png","image_url":"http://i1.avlws.com/115/l444079.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=444079&tt=df","retail_price":"2999.00","sale_price":"2999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=444079\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m444079.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862166&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
