{"sku":"862168","manufacturer_id":"CM20206001","brand_name":"Cannondale","product_name":"Cannondale CAAD10 Black Inc. Bike - 2014","long_description":"Exquisitely crafted for racing and high-performance training, the Cannondale CAAD10 Black Inc. road bike features thoroughbred SRAM Red 22 components and a Mavic Ksyrium Elite wheelset. 6069 aluminum CAAD10 frame offers responsive stiffness with impressive weight savings that rivals some carbon frames. Butted and shaped seatstays and chainstays help reduce side-to-side flex for energy efficiency while also helping make bumps and road vibrations less jarring. Lightweight all-carbon fork supplies great road performance, slicing through corners and damping road vibrations; tapered steerer enhances stiffness and responsiveness. Lightweight SRAM Red 22 derailleurs and shifters offer precise, dependable shifts throughout the 22 gear combinations. Cannondale Hollowgram Si crankset is paired with an 11-25 tooth cassette for a capable gear range; BB30 bottom bracket enhances stiffness for more efficient power transfer. Mavic Ksyrium Elite wheelset is decked out with fast Mavic Yksion tires for excellent handling and speed. Pedals sold separately. Cannondale CAAD10 Black Inc. road bike specs are subject to change.","short_description":"Exquisitely crafted for racing and high-performance training, the Cannondale CAAD10 Black Inc. road bike features thoroughbred SRAM Red 22 components and a Mavic Ksyrium Elite wheelset.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374631.png","image_url":"http://i1.avlws.com/115/l374631.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374631&tt=df","retail_price":"3799.00","sale_price":"3799.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374631\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374631.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862168&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
