{"sku":"862176","manufacturer_id":"CM20255802","brand_name":"Cannondale","product_name":"Cannondale CAAD8 5 Compact Bike - 2014","long_description":"Offering great all-around performance with a comfortable riding position for new road cyclists, the Cannondale CAAD8 5 Compact road bike features a lightweight frame and dependable Shimano 105 parts. Lightweight double-butted aluminum frame supplies excellent power transfer; design offers a slightly more relaxed position compared to other road bikes. Ultra carbon fiber fork serves up great handling so you can carve through corners; carbon fiber also helps damp high frequency road vibrations. FSA Gossamer Pro crankset powers the 20-gear drivetrain, which features reliable and responsive Shimano 105 levers and derailleurs. Tektro dual-pivot caliper brakes offer up dependable braking performance. Strong Maddux rims with Schwalbe Lugano tires keep you rolling smoothly. Cannondale CAAD8 5 Compact road bike specs are subject to change.","short_description":"Offering great all-around performance with a comfortable riding position for new road cyclists, the Cannondale CAAD8 5 Compact road bike features a lightweight frame and dependable Shimano 105 parts.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374655.png","image_url":"http://i1.avlws.com/115/l374655.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374655&tt=df","retail_price":"1299.00","sale_price":"1299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374655\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374655.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862176&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
