{"sku":"862195","manufacturer_id":"CM2077XL01","brand_name":"Cannondale","product_name":" Cannondale Quick CX 2 Bike - 2014","long_description":"The rugged Cannondale Quick CX 2 bike offers an upright, comfortable ride with a suspension fork and powerful hydraulic disc brakes for off-road shortcuts though town and all-weather commuting. Aluminum frame design is mountain-bike inspired and offers an upright riding position that better enables you to scan the road ahead. Oversize 1.5 in. headtube and oversize top and down tubes offer increased strength and stiffness for improved handling precision. Frame also uses Cannondale Synapse Active Vibration Elimination (S.A.V.E.) technology to damp road vibration for a smooth ride. RST Neon Pro suspension fork supplies 50mm of travel and convenient lockout access to take the jolts out of a ride. 27-speed drivetrain with Shimano components offers up plenty of smooth-shifting gear combinations to power you up, over and down any terrain you may encounter. Sure-stopping and low-maintenance Shimano hydraulic disc brakes work effectively in all weather conditions. Kenda Happy Medium tires have a fast-rolling center with aggressive outside lugs for enhanced traction when cornering. Platform pedals mean no special shoes are required. Eyelets accept fenders or a rear rack (sold separately). Specs on the Cannondale Quick CX 2 bike are subject to change.","short_description":"The rugged Cannondale Quick CX 2 bike offers an upright, comfortable ride with a suspension fork and powerful hydraulic disc brakes for off-road shortcuts though town and all-weather commuting.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378543.png","image_url":"http://i1.avlws.com/115/l378543.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378543&tt=df","retail_price":"1059.00","sale_price":"1059.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378543\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378543.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862195&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621950002":{"sku":"8621950002","vendor_sku":"CM2077MD01","upc":"884603521960","size":"M","color":"WHITE GLOSS","retail_price":"1059.00","sale_price":"1059.00"},"8621950003":{"sku":"8621950003","vendor_sku":"CM2077LG01","upc":"884603521977","size":"L","color":"WHITE GLOSS","retail_price":"1059.00","sale_price":"1059.00"},"8621950004":{"sku":"8621950004","vendor_sku":"CM2077XL01","upc":"884603521984","size":"XL","color":"WHITE GLOSS","retail_price":"1059.00","sale_price":"1059.00"}}}
