{"sku":"862188","manufacturer_id":"CM2075MD01","brand_name":"Cannondale","product_name":"Cannondale Quick Carbon 2 Bike - 2014","long_description":"The Cannondale Quick Carbon 2 bike blends the featherlight performance of an all-carbon frame with the easy handling of an upright, flat-bar bike for urban rides, commutes and tours. Carbon frame is lightweight and responsive for excellent efficiency and handling; shaped chainstays and seatstays help reduce road vibrations, enhancing comfort. Flat handlebar design offers an upright riding position for improved comfort and visibility. BB30 bottom bracket shell design increases stiffness for improved power transfer. FSA Omega compact crankset paired with a wide-ranging 12-32 cassette for the versatility of a triple crankset without the weight or finicky shifting. Shimano Tiagra shifters and front derailleur, and 105 rear derailleur, offer dependable shifts through the 20 gears. Powerful hydraulic disc brakes offer effective stopping in any weather. Fast-rolling 700c wheels are outfitted with Kenda Kwick Roller Sport tires for all-around riding. Carbon seat post is topped with Cannondale Quick Ergo Performance saddle. Specs on the Cannondale Quick Carbon 2 bike are subject to change.","short_description":"The Cannondale Quick Carbon 2 bike blends the featherlight performance of an all-carbon frame with the easy handling of an upright, flat-bar bike for urban rides, commutes and tours.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s448199.png","image_url":"http://i1.avlws.com/115/l448199.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448199&tt=df","retail_price":"1999.00","sale_price":"1999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448199\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448199.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862188&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621880004":{"sku":"8621880004","vendor_sku":"CM2075XL01","upc":"884603521441","size":"XL","color":"JET BLACK MATTE","retail_price":"1999.00","sale_price":"1999.00"}},"categories":["cycling","bikes","road-bikes"]}
