{"sku":"862165","manufacturer_id":"CM21326002","brand_name":"Cannondale","product_name":" Cannondale SuperSix EVO 2 Compact Bike - 2014","long_description":"An outstanding racing machine made with an ultralight carbon frame and light and precise SRAM Red components, the Cannondale SuperSix Evo 2 Compact road bike is destined for podium-chasing glory. Full-carbon SuperSix EVO frame features a geometry and tube construction that translates any motion you make into forward momentum and all-out speed. Slim, small-diameter tubes on the EVO frame shave off weight, maintain strength and slice through air with aerodynamic efficiency. The oversized bottom bracket area and large, asymmetric chainstays ensure your watts aren't wasted in unnecessary flex when transferring your power to the wheel. The 1-1/8 - 1.5 in. tapered, full-carbon steerer tube and head tube enhance precision; hourglass seatstays offer vertical deflection for comfort and stability. Climb with ease and fly on the descents with the compact, light Cannondale Hollowgram Si crankset, which benefits from a stiff and light BB30 bottom bracket design. The compact crank is paired with an 11-26 cassette for 22 gear combinations, all controlled by smooth and efficient SRAM Red 22 shifters and derailleurs. Lightweight and smooth Mavic Ksyruim Equipe S WTS wheels are outfitted with fast and grippy Mavic WTX tires. Specs on the Cannondale SuperSix EVO 3 Compact bike are subject to change.","short_description":"An outstanding racing machine made with an ultralight carbon frame and light and precise SRAM Red components, the Cannondale SuperSix Evo 2 Compact road bike is destined for podium-chasing glory.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374623.png","image_url":"http://i1.avlws.com/115/l374623.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374623&tt=df","retail_price":"4099.00","sale_price":"4099.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374623\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374623.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862165&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
