{"sku":"862172","manufacturer_id":"CM23885101","brand_name":"Cannondale","product_name":"Cannondale Synapse Alloy Disc 3 Compact Bike - 2014","long_description":"The sleek Cannondale Synapse Alloy Disc 3 road bike delivers a speedy-yet-comfortable design for long rides thanks to a stiff, responsive frame decked out with a precise Shimano Ultegra drivetrain. Synapse aluminum frame is built to give riders great handling, stability and steering precision in a more comfortable, upright position than race-oriented road frames. The rear part of the frame and the carbon-bladed fork feature the Cannondale Synapse Active Vibration Elimination (S.A.V.E.) technology for damping road vibration. Lightweight Shimano Ultegra derailleurs and shifters offer precise, dependable shifts throughout the 20 gear combinations. FSA Gossamer crankset is paired with a 12-30 tooth cassette for a capable gear range; BB30 bottom bracket enhances stiffness for efficient power transfer. Cannondale MB700T disc brakes offer powerful braking with nuanced control for excellent performance in any conditions. FSA Gossamer compact crankset and a wide-ranging 12-30 tooth cassette deliver a wide range of gears for easy spinning no matter the gradient. Maddux RD3.0 wheels are wrapped with Schwalbe Lugano tires for low rolling resistance and grippy handling. Specs on the Cannondale Synapse Alloy Disc 3 road bike are subject to change.","short_description":"The sleek Cannondale Synapse Alloy Disc 3 road bike delivers a speedy-yet-comfortable design for long rides thanks to a stiff, responsive frame decked out with a precise Shimano Ultegra drivetrain.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s443055.png","image_url":"http://i1.avlws.com/115/l443055.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=443055&tt=df","retail_price":"1999.00","sale_price":"1999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=443055\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m443055.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862172&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621720003":{"sku":"8621720003","vendor_sku":"CM23885601","upc":"884603507346","size":"56 CM","color":"BLACK ANODIZED MATTE","retail_price":"1999.00","sale_price":"1999.00"},"8621720004":{"sku":"8621720004","vendor_sku":"CM23885801","upc":"884603507353","size":"58 CM","color":"BLACK ANODIZED MATTE","retail_price":"1999.00","sale_price":"1999.00"}},"categories":["cycling","bikes","road-bikes"]}
