{"sku":"862144","manufacturer_id":"CM2415LG01","brand_name":"Cannondale","product_name":" Cannondale Rush 29 1 Bike - 2014","long_description":"A trail-proven, race-ready bike for any terrain, the Cannondale Rush 29 1 full-suspension mountain bike uses a RockShox 30 Gold front shock with a RockShox Monarch PL rear shock for high performance. Rush aluminum frame with sloping top tube creates a generous stand-over height and saves weight by using less material and fewer weld joints. RockShox 30 Gold suspension fork with lockout offers 100mm of bump-busting travel; you'll be ready to take on highly technical trails. RockShox Monarch RL rear shock is designed with performance and durability in mind; staged travel improves efficiency and bump control. Shimano Deore and XT Shadow derailleurs give you easy mastery of the 30-speed drivetrain as you travel through changing terrain. Shimano cranks dish out tough, easy-spinning power. Shimano M446 hydraulic disc brakes feature a 180mm rotor up front and 160mm rotor in the back to ensure powerful, responsive and progressive braking. Maddux Disc rims are laced up to Formula hubs and outfitted with WTB NineLine tires for sure traction. Platform pedals mean no special bike shoes are required. Specs of the Cannondale Rush 29 1 full-suspension mountain bike are subject to change.","short_description":"A trail-proven, race-ready bike for any terrain, the Cannondale Rush 29 1 full-suspension mountain bike uses a RockShox 30 Gold front shock with a RockShox Monarch PL rear shock for high performance.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374899.png","image_url":"http://i1.avlws.com/115/l374899.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374899&tt=df","retail_price":"1999.00","sale_price":"1999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374899\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374899.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862144&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
