{"sku":"862181","manufacturer_id":"CF22264801","brand_name":"Cannondale","product_name":" Cannondale Synapse Carbon 5 Compact Women's Bike - 2014","long_description":"With trusty Shimano 105 parts and an ultralight carbon frame designed for all-day comfort, the Cannondale Synapse Carbon 5 Compact women's bike delivers speedy performance on your long rides. Women-specific carbon frame features optimized tube shaping to promote efficiency and comfort; frame geometry gives a more upright position than more race-oriented road frames. The rear part of the frame and the all-carbon fork feature the Cannondale Synapse Active Vibration Elimination (S.A.V.E.) technology for damping road vibration. Large diameter BB30 bottom bracket design improves stiffness and increases power efficiency through the drivetrain. FSA Gossamer compact crankset and a wide-ranging 12-30 tooth cassette deliver a wide spread of gearing options for easy spinning no matter the gradient. Shimano 105 levers and derailleurs supply precise, dependable shifts throughout the the 20 gears. Shimano wheels are wrapped with Schwalbe Lugano tires to deliver a good balance between sturdiness, quick acceleration and fast-rolling performance. Please note: pedals are not included. Specs on the Cannondale Synapse Carbon 5 Compact women's bike are subject to change.","short_description":"With trusty Shimano 105 parts and an ultralight carbon frame designed for all-day comfort, the Cannondale Synapse Carbon 5 Compact women's bike delivers speedy performance on your long rides.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374671.png","image_url":"http://i1.avlws.com/115/l374671.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374671&tt=df","retail_price":"2099.00","sale_price":"2099.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374671\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374671.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862181&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
