{"sku":"862148","manufacturer_id":"CF2071MD01","brand_name":"Cannondale","product_name":"Cannondale Lexi 2 Women's Bike - 2014","long_description":"A high-performance, full-suspension ride for all-out fun on your favorite trails, the Cannondale Lexi 2 women's mountain bike delivers responsive, plush RockShox suspension and nimble handling. Light, sturdy aluminum frame is optimized to deliver stiffness and strength where it counts while remaining agile and responsive for great handling as you rip down the trail. Oversize 1.5 in. head tube enhances strength, rigidity and steering precision. RockShox Recon Gold TK Solo Air fork delivers 120mm of smooth suspension with both lockout and rebound adjustment. RockShox Monarch RL rear shock and optimized pivot design combine for a surprisingly responsive and plush rear suspension. SRAM 2x10 drivetrain features X7 shifters and X9 rear derailleur for precise, snappy shifts; SRAM cranks drive power through the 20 gear combinations. Avid Elixir 3 hydraulic disc brakes supply easy speed management with a 180mm rotor up front, 160mm in the back. Schwalbe Racing Ralph Performance tires supply excellent traction and fast-rolling, all-around performance. Specs on the Cannondale Lexi 2 women's full-suspension mountain bike are subject to change.","short_description":"A high-performance, full-suspension ride for all-out fun on your favorite trails, the Cannondale Lexi 2 women's mountain bike delivers responsive, plush RockShox suspension and nimble handling.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374911.png","image_url":"http://i1.avlws.com/115/l374911.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374911&tt=df","retail_price":"2299.00","sale_price":"2299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374911\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374911.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862148&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621480002":{"sku":"8621480002","vendor_sku":"CF2071SM01","upc":"884603520413","size":"S","color":"DUSTY LILAC/WHITE MATTE","retail_price":"2299.00","sale_price":"2299.00"}},"categories":["cycling","bikes","mountain-bikes"]}
