{"sku":"862178","manufacturer_id":"CM20305601","brand_name":"Cannondale","product_name":" Cannondale CAADX Disc 105 Bike - 2014","long_description":"A quality cyclocross bike you can use for commutes, the Cannondale CAADX Disc 105 bike pairs the all-weather stopping power of disc brakes with a Shimano 105 drivetrain for all-around performance. ProMax Render R disc brakes offer powerful braking even in the water, mud and slop of a typical 'cross course. Lightweight Shimano 105 derailleurs and shifters offer precise, dependable shifts throughout the 20 gear combinations. Sturdy 6061 aluminum frame seats you in an upright position for stable handling and a comfortable ride. Rear stays are shaped to help make bumps and vibrations less jarring for improved tracking. BB30 bottom bracket shell design increases stiffness for improved power transfer. Ultra X fork with carbon blades helps reduce weight and road vibration, enhancing the ride quality. Geared for easy-spinning versatility, the FSA Gossamer 46/36 crankset is paired with a 12-28 cassette to give you a \"just right\" gear for tough gradients and boggy mud. Schwalbe Sammy Slick tires feature fast-rolling center tread with ample grip and puncture resistance to handle dirt and gravel. Frame eyelets make it easy to attach fenders or a rear rack for enhanced utility (not included); pedals not included. Cannondale CAADX Disc 105 bike specs are subject to change.","short_description":"A quality cyclocross bike you can use for commutes, the Cannondale CAADX Disc 105 bike pairs the all-weather stopping power of disc brakes with a Shimano 105 drivetrain for all-around performance.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374659.png","image_url":"http://i1.avlws.com/115/l374659.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374659&tt=df","retail_price":"1459.00","sale_price":"1459.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374659\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374659.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862178&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621780003":{"sku":"8621780003","vendor_sku":"CM20305601","upc":"884603507063","size":"56 CM","color":"JET BLACK GLOSS","retail_price":"1459.00","sale_price":"1459.00"}},"categories":["cycling","bikes","road-bikes"]}
