{"sku":"862161","manufacturer_id":"CM21225401","brand_name":"Cannondale","product_name":"Cannondale Slice 5 Bike - 2014","long_description":"The aerodynamic Cannondale Slice 5 bike features an ultralight carbon frame, trusty Shimano 105 parts and stable handling to offer excellent speed during triathlons and time trials. Slice carbon frame features aerodynamic tube shapes and AERO SAVE micro-suspension, which enables the rear chainstays and seatstays to damp road vibrations while staying stiff. All-carbon fork slices through the air and helps keep weight low. Overall geometry of the Slice 5 has been tuned to offer stable, comfortable handling while tucked in the aero position. BB30 bottom bracket design increases stiffness for improved power transfer. FSA Gossamer Pro crankset delivers your pedaling power through the drivetrain; Shimano 105 derailleurs and microSHIFT bar-end shifters dependably shift through the 20 gears. Offering excellent support for extended arms when tucked in the aero position, the base bar and FSA clip-ons adjust to suit your comfort and offer confident handling. Lightweight Shimano wheels are wrapped with fast 700c Schwalbe Lugano tires for excellent handling and speed. Seatpost can adjust from 73 - 78deg to comply with the guidelines for UCI time-trail and triathlon competitions. Pedals are not included. Specs on the Cannondale Slice 5 bike are subject to change.","short_description":"The aerodynamic Cannondale Slice 5 bike features an ultralight carbon frame, trusty Shimano 105 parts and stable handling to offer excellent speed during triathlons and time trials.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374615.png","image_url":"http://i1.avlws.com/115/l374615.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374615&tt=df","retail_price":"2099.00","sale_price":"2099.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374615\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374615.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862161&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
