{"sku":"862102","manufacturer_id":"165302526","brand_name":"Native Eyewear","product_name":" Native Eyewear Highline Reflex Polarized Sunglasses - Men's","long_description":"Style meets function in the Native Eyewear Highline Reflex Polarized sunglasses. They have the optical quality to back up their great looks and feature a specialized Reflex coating for clarity. Asphalt frames come with polarized blue (gray-tinted) Reflex lenses that are ideal for bright conditions. Stout Fade frames come with polarized bronze (brown-tinted) Reflex lenses for very bright conditions. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity, and block 100% of harmful UVA and UVB light. Reflex lenses block 40% of infrared light to decrease eye fatigue, offer blue light filtering and 100% UV protection to minimize haze and enhance clarity. Lenses and lightweight, yet durable frames are built to withstand a high-velocity impact. Frames endure extreme highs and lows in temperature. Self-adjusting nosepads and ear stems create a nonslip grip that keeps sunglasses in place. Temple ends hug your ears to keep sunglasses in place. Cam-action spring hinges quickly lock temples into position. Native Eyewear Highline Reflex Polarized sunglasses include a protective case and a soft pouch that doubles as a cleaning cloth. Frames best fit medium to large profiles.","short_description":"Style meets function in the Native Eyewear Highline Reflex Polarized sunglasses. They have the optical quality to back up their great looks and feature a specialized Reflex coating for clarity.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Casual Sunglasses","thumb_url":"http://i1.avlws.com/115/s422471.png","image_url":"http://i1.avlws.com/115/l422471.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=422471&tt=df","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=422471\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m422471.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862102&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621020001":{"sku":"8621020001","vendor_sku":"165302526","upc":"764824012518","size":"BLUE REFLEX","color":"ASPHALT","retail_price":"129.00","sale_price":"129.00"},"8621020003":{"sku":"8621020003","vendor_sku":"165383527","upc":"764824012792","size":"BRONZE REFLEX","color":"STOUT FADE","retail_price":"129.00","sale_price":"129.00"}}}
