{"sku":"862179","manufacturer_id":"CM20315801","brand_name":"Cannondale","product_name":" Cannondale CAADX Disc Tiagra Bike - 2014","long_description":"Built to get muddy on cyclocross courses or speed through daily commutes, the versatile Cannondale CAADX Disc Tiagra bike pairs the all-weather stopping power of disc brakes with solid Tiagra parts. ProMax Render R disc brakes offer powerful braking even in the water, mud and slop of a typical 'cross course. Shimano Tiagra shifters and derailleurs reliably move through the 20 gear combinations. Sturdy 6061 aluminum frame seats you in an upright position for stable handling and a comfortable ride. Rear stays are shaped to help make bumps and vibrations less jarring for improved tracking. BB30 bottom bracket shell design increases stiffness for improved power transfer. Ultra X fork with carbon blades helps reduce weight and road vibration, enhancing the ride quality. Geared for easy-spinning versatility, the FSA Omega 46/36 crankset is paired with a 12-28 cassette to give you a \"just right\" gear for tough gradients and boggy mud. Schwalbe Sammy Slick tires feature fast-rolling center tread with ample grip and puncture resistance to handle dirt and gravel. Frame eyelets make it easy to attach fenders or a rear rack for enhanced utility (not included); pedals not included. Cannondale CAADX Tiagra bike specs are subject to change.","short_description":"Built to get muddy on cyclocross courses or speed through daily commutes, the versatile Cannondale CAADX Disc Tiagra bike pairs the all-weather stopping power of disc brakes with solid Tiagra parts.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374663.png","image_url":"http://i1.avlws.com/115/l374663.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374663&tt=df","retail_price":"1259.00","sale_price":"1259.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374663\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374663.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862179&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621790003":{"sku":"8621790003","vendor_sku":"CM20315601","upc":"884603507131","size":"56 CM","color":"MARINER BLUE GLOSS","retail_price":"1259.00","sale_price":"1259.00"},"8621790004":{"sku":"8621790004","vendor_sku":"CM20315801","upc":"884603507148","size":"58 CM","color":"MARINER BLUE GLOSS","retail_price":"1259.00","sale_price":"1259.00"}}}
