{"sku":"862173","manufacturer_id":"CM21615602","brand_name":"Cannondale","product_name":"Cannondale Synapse Alloy Disc 5 Compact Bike - 2014","long_description":"If you love long rides, the comfort-oriented Cannondale Synapse Alloy Disc 5 Compact road bike is the bike for you, featuring a speedy-yet-comfortable design and trusty Shimano 105 components. Synapse aluminum frame is built to give riders great handling, stability and steering precision in a more comfortable, upright position than race-oriented road frames. The rear part of the frame and the carbon-bladed fork feature the Cannondale Synapse Active Vibration Elimination (S.A.V.E.) technology for damping road vibration. BB30 bottom bracket enhances stiffness for efficient power transfer. Shimano 105 levers and derailleurs supply precise, dependable shifts throughout the 20 gears. Promax Render R disc brakes offer powerful braking with nuanced control for excellent performance in any condition. FSA Gossamer compact crankset and a wide-ranging 12-30 tooth cassette deliver a wide spread of gearing options for easy spinning no matter the gradient. Maddux RD3.0 wheels are wrapped with Schwalbe Lugano tires for low rolling resistance and grippy handling. Specs on the Cannondale Synapse Alloy 5 Compact road bike are subject to change.","short_description":"If you love long rides, the comfort-oriented Cannondale Synapse Alloy Disc 5 Compact road bike is the bike for you, featuring a speedy-yet-comfortable design and trusty Shimano 105 components.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374643.png","image_url":"http://i1.avlws.com/115/l374643.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374643&tt=df","retail_price":"1459.00","sale_price":"1459.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374643\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374643.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862173&amp;link=&amp;tabs=-Details\"></script>","variants":{"8621730004":{"sku":"8621730004","vendor_sku":"CM21615802","upc":"884603507476","size":"58 CM","color":"JET BLACK GLOSS","retail_price":"1459.00","sale_price":"1459.00"}},"categories":["cycling","bikes","road-bikes"]}
