{"sku":"862212","manufacturer_id":"162110013OY05.0","brand_name":"Pearl Izumi","product_name":"Pearl Izumi Streak II Road-Running Shoes - Women's - 2012 Closeout","long_description":"Lightweight with seamless uppers and comfy cushioning, the Pearl Izumi Streak II women's road-running shoes feature a sleek, low-profile fit while being supportive enough for for your distance days. Seamless woven polyester mesh uppers offer a fantastic, flexible fit with excellent breathability; thermoplastic urethane overlays offer support and structure. Washable, removable OrthoLite(R) foam insoles supply amazing step-in comfort and long-lasting cushioning. EVA midsoles use Energy Foam for shock absorption and energy return; thermoplastic urethane medial shanks provide support and stability. Outsoles use a combination of EVA and blown rubber in the forefoot and heel for durable, reliable traction. The Pearl Izumi Streak II women's road-running shoes are built on the Pearl Izumi racing-shoe last for a snug fit. All-synthetic construction makes these vegan-friendly. Closeout.","short_description":"Lightweight with seamless uppers and comfy cushioning, the Pearl Izumi Streak II women's road-running shoes feature a sleek, low-profile fit while being supportive enough for for your distance days.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s387787.png","image_url":"http://i1.avlws.com/115/l387787.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=387787&tt=df","retail_price":"115.00","sale_price":"42.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=387787\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m387787.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862212&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","womens-footwear","womens-shoes"]}
