{"sku":"862339","manufacturer_id":"010-01065-00","brand_name":"Garmin","product_name":"Garmin Monterra GPS","long_description":"The Garmin Monterra GPS combines powerful GPS navigation with the versatility of Android OS. Enjoy state-of-the-art routefindiing along with all your favorite Android apps from Google Play. Get all your favorite recreational apps on Google Play, as well as a wide range of professional apps that extend your office to the field. High-sensitivity, WAAS- and GLONASS-enabled GPS receiver locates your position with precision and maintains its GPS location, even under heavy cover and in deep canyons. 4-in. color multi-touch display uses sunlight and other light along with the LED backlight to increase brightness; conserve power by leaving the backlight turned off. Load maps such as BirdsEye (subscription required) or TOPO and millions of geocaches with 8GB of internal memory; microSD card slot lets you add 64 GB of additional memory. 3D MapMerge combines maps and lets you view them in rich 3D with textures such as hills, valleys, lakes and forests; zoom in, pan out and rotate using the multi-touch screen. 8 megapixel autofocus digital camera with LED flash takes vivid, geo-tagged photos for easy return navigation; 1080p HD video camera captures sharp and clear footage. 3-axis electronic compass with accelerometer and gyro shows where you're heading, even when you're standing still or not holding the Monterra level. Barometric altimeter tracks changes in pressure to pinpoint your altitude; you can even use it to plot barometric pressure over time to keep an eye on changing weather. FM and NOAA weather radio with SAME alerts let you tune in to location-specific watches and warnings; listen with headphones (sold separately) or through the built-in speaker. UV sensor lets you know your exposure level to sunlight so you can avoid sun damage, especially at higher elevations and on bright or reflective surfaces such as snow or water.","short_description":"The Garmin Monterra GPS combines powerful GPS navigation with the versatility of Android OS. Enjoy state-of-the-art routefindiing along with all your favorite Android apps from Google Play.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412615.png","image_url":"http://i1.avlws.com/115/l412615.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412615&tt=df","keywords":"hiking","retail_price":"650.00","sale_price":"650.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412615\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412615.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862339&amp;link=&amp;tabs=-Details\"></script>","variants":{"8623390001":{"sku":"8623390001","vendor_sku":"010-01065-00","upc":"753759994747","color":"BLACK/GREY","retail_price":"650.00","sale_price":"650.00"}},"categories":["camping-hiking","camp-electronics","gps"]}
