{"sku":"862475","manufacturer_id":"16295","brand_name":"Rei","product_name":" REI Habanera Sleeping Bag - Women's","long_description":"The all-conditions, cold-weather women's REI Habanera Sleeping Bag features water-repellent down, a women-specific design and lots of comfortable touches. With a European Norm (EN) comfort rating of 13degF, this bag is suitable for 3-season use and some winter outings. Designed to fit a woman's body, this bag offers increased room at hips, decreased room at shoulders and extra insulation in critical heat-loss areas. Water-repellent 600-fill-power duck down offers excellent loft and warmth in damp conditions. Ripstop nylon shell also features a durable water repellent finish to further protect the down fill. Relaxed shoulder-to-hip cut works well for multi-position sleepers. Contoured hood, insulated face muffler and full-length draft tube all work to keep warmth in. Differentiated hood and neck drawcords simplify adjustments; antisnag zipper works smoothly. Pad loops let you strap the bag to your sleeping pad (straps and pad not included). Any REI backpacking bag can be zipped to any other REI backpacking bag; women's bags zip on the right, unisex on the left. The women's REI Habanera Sleeping Bag includes a nylon stuff sack and a large cotton storage bag. EN is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The all-conditions, cold-weather women's REI Habanera Sleeping Bag features water-repellent down, a women-specific design and lots of comfortable touches.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421515.png","image_url":"http://i1.avlws.com/115/l421515.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421515&tt=df","keywords":"compact","retail_price":"289.00","sale_price":"289.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421515\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421515.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862475&amp;link=&amp;tabs=-Details\"></script>","variants":{"8624750001":{"sku":"8624750001","vendor_sku":"16295","upc":"486247500013","size":"Regular Right","color":"BLACKBERRY","retail_price":"279.00","sale_price":"279.00"},"8624750002":{"sku":"8624750002","vendor_sku":"16295","upc":"486247500020","size":"Long Right","color":"BLACKBERRY","retail_price":"289.00","sale_price":"289.00"}}}
