{"sku":"862419","manufacturer_id":"16388","brand_name":"Rei","product_name":"REI Dash 2 Tent","long_description":"The lightest 2-person tent REI has ever made, the REI Dash 2 Tent provides a comfortable amount of living space that includes a door and a vestibule for each hiker. REI's new 15-denier ripstop nylon in the tent, fly and floor minimizes weight, yet retains strength. Large areas of mesh also cut weight while providing plenty of ventilation. Unlike many minimalist tents, the Dash 2 has 2 doors and 2 vestibules to provide easy access and covered storage for each person. REI-exclusive tension-truss architecture creates stable vertical sidewalls and generous headroom while minimizing pole weight. Pole angles and asymmetrical tent shape also enhance living space, allowing both people to sit up. A single hubbed pole assembly allows quick, easy setup. Pockets and hang loops help organize the interior. The REI Dash 2 Tent comes with a tent stuff sack, stakes, guylines and tighteners, as well as a pole-repair tube, a pole bag and a stake bag. The REI Dash 2 Footprint is sold separately.","short_description":"The lightest 2-person tent REI has ever made, the REI Dash 2 Tent provides a comfortable amount of living space that includes a door and a vestibule for each hiker.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s423999.png","image_url":"http://i1.avlws.com/115/l423999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423999&tt=df","retail_price":"349.00","sale_price":"349.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862419&amp;link=&amp;tabs=-Details\"></script>","variants":{"8624190001":{"sku":"8624190001","vendor_sku":"16388","upc":"486241900017","color":"BEACHSTONE/CACTUS","retail_price":"349.00","sale_price":"349.00"}}}
