{"sku":"862425","brand_name":"Rei","product_name":"REI Quarter Dome 3 Tent","long_description":"The REI Quarter Dome 3 Tent uses new ultralight materials and a unique pole design to create a lightweight 3-person, 3-season backpacking tent that's roomy, well ventilated and strong. Our new 15-denier ripstop nylon in the tent and fly minimizes weight, yet retains strength; floor uses a lightweight yet robust 30-denier ripstop nylon. REI-exclusive tension-truss architecture creates stable vertical sidewalls and generous headroom while minimizing pole weight. Pole angles and asymmetrical tent shape also enhance living space, allowing you to sit up comfortably. 2 vestibules provide covered storage on each side; doors on fly and tent are aligned for easy entry and exit. Third vestibule at the head of the tent provides easily accessed covered storage for the center sleeper. A single hubbed pole assembly allows quick, easy setup. A large zippered roof vent helps control condensation. Pockets and hang loops help organize the interior. The REI Quarter Dome 3 Tent comes with a compression stuff sack, stakes, guylines and tighteners, as well as a pole-repair tube, a pole bag and a stake bag. Fly/footprint minimalist pitch option lets you leave the tent at home and use the fly, poles and footprint (sold separately) as a lightweight shelter. The REI Quarter Dome 3 Footprint is sold separately.","short_description":"The REI Quarter Dome 3 Tent uses new ultralight materials and a unique pole design to create a lightweight 3-person, 3-season backpacking tent that's roomy, well ventilated and strong.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s357451.png","image_url":"http://i1.avlws.com/115/l357451.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=357451&tt=df","keywords":"tent,backpacktent","retail_price":"379.00","sale_price":"379.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=357451\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m357451.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862425&amp;link=&amp;tabs=-Details\"></script>","variants":{"8624250001":{"sku":"8624250001","vendor_sku":"16396","upc":"486242500018","color":"ZINC/ORANGE SPICE","retail_price":"379.00","sale_price":"379.00"}}}
