{"sku":"862499","manufacturer_id":"BD120106ENGR240","brand_name":"Black Diamond","product_name":" Black Diamond Factor 110 Randonee Boots - Men's - 2012 Closeout","long_description":"The Black Diamond Factor 110 randonee boots sport a moderate flex to give freeride skiers a comfortable ride, both inbounds and out. Torsionally stiff Triax Pro Pebax(R) frames provide maximum lateral power transfer to drive fat skis and progressive alpinelike flex for downhills. Pebax plastic maintains a consistent flex in all temperatures so your boots won't feel stiff on a frigid day. Medium-stiff, custom-moldable liners allow for a long-lasting, accurate fit and use Black Diamond's proprietary foam to maintain longevity and warmth. Boa Freeride Series lacing system provides a precise and personalized fit that is simple to adjust with the turn of a dial; Boa holds laces tight and secure. Liners have articulating zones, insulated bases and a 102mm last width for comfort and performance. Ski/walk switch is hassle free with a simple on/off toggle; ski mode locks you into a forward lean position that can be set at 14deg, 18deg or 22deg. Boots are built with an overlapping cuff design, which produces a natural progressive flex and ankle articulation to drive and steer skis as well as absorb terrain. Four micro-adjustable buckles and a power strap on each boot close the Black Diamond Factor 110 randonee boots comfortably and securely around the feet and legs. Boots are equipped with Black Diamond Alpine Sole Blocks, making them compatible with all alpine bindings. Black Diamond Alpine Touring Sole Blocks are sold separately and make the boots compatible with all randonee bindings, including tech-style bindings such as Dynafit. Closeout.","short_description":"The Black Diamond Factor 110 randonee boots sport a moderate flex to give freeride skiers a comfortable ride, both inbounds and out.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s382695.png","image_url":"http://i1.avlws.com/115/l382695.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=382695&tt=df","retail_price":"699.00","sale_price":"316.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=382695\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m382695.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862499&amp;link=&amp;tabs=-Details\"></script>","variants":{"8624990001":{"sku":"8624990001","vendor_sku":"BD120106ENGR240","upc":"793661155355","size":"Mondo 24","color":"ENVY GREEN/BLACK","retail_price":"316.73","sale_price":"316.73"},"8624990002":{"sku":"8624990002","vendor_sku":"BD120106ENGR240","upc":"793661155379","size":"Mondo 25","color":"ENVY GREEN/BLACK","retail_price":"316.73","sale_price":"316.73"},"8624990003":{"sku":"8624990003","vendor_sku":"BD120106ENGR240","upc":"793661155393","size":"Mondo 26","color":"ENVY GREEN/BLACK","retail_price":"316.73","sale_price":"316.73"}}}
