{"sku":"862456","manufacturer_id":"9780762781676","brand_name":"Falconguides","product_name":"FalconGuides Hiking Guide and Trail Map Bundle: Glacier and Waterton Lakes National Parks","long_description":"The Hiking Guide and Trail Map Bundle: Glacier and Waterton National Parks includes. . Author: Erik Molvar. Softcover; 104 pages; black-and-white maps. The Globe Pequot Press; copyright 2013. Guidebook includes half-hour strolls to full-day adventures. Hikes for everyone, including families; hikes are ranked from easiest to most challenging. GPS-compatible trail maps; includes a map that will help you plan trips and explore the area in and around Glacier and Waterton Lakes National Parks. Map includes brief descriptions of the best hiking, skiing trails, paddling routes, fishing spots, snowmobiliing areas, points of interest as well as information area wildlife. Morris Book Publishing, LLC.; copyright 2007. Printed on durable, tear-resistant, waterproof material, the map can go virtually anywhere you go; guidebook measures 7 x 4.25 in.; map measures 9 x 4 in. (folded).","short_description":"The Hiking Guide and Trail Map Bundle: Glacier and Waterton National Parks includes Best Easy Day Hikes: Glacier And Waterton Lakes National Parks and a corresponding map.","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Camping And Hiking Guidebooks","thumb_url":"http://i1.avlws.com/115/s409159.png","image_url":"http://i1.avlws.com/115/l409159.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=409159&tt=df","retail_price":"18.95","sale_price":"18.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=409159\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m409159.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862456&amp;link=&amp;tabs=-Details\"></script>","variants":{"8624560001":{"sku":"8624560001","vendor_sku":"9780762781676","retail_price":"18.95","sale_price":"18.95"}},"categories":["books","guidebooks","camping-and-hiking-guidebooks"]}
