{"sku":"862530","brand_name":"Rei","product_name":"REI Flash Sleeping Bag - Women's","long_description":"The ultralight women's REI Flash Sleeping Bag uses a clever hybrid of water-repellent insulations and waterproof/breathable fabric panels in its double-protection design. With a European Norm (EN) comfort rating of 32degF, this bag is suitable for 3-season use. REI double-protection design combines water-repellent fills with waterproof/breathable fabric at the hood, sides and footbox, the areas most likely to touch a damp tent wall. Designed to fit a woman's body, this bag offers increased room at hips, decreased room at shoulders and extra insulation in critical heat-loss areas. On top of the bag, where superior loft and warmth are key, is water-repellent 700-fill-power duck down. On the bottom is resilient Primaloft(R) Sport insulation, which performs well in a compressed under-bag space. Ripstop nylon shell also features a durable water repellent (DWR) finish to further protect the bag's insulations. Performance fit keeps weight low and thermal efficiency high. REI in-the-round design puts vertical baffles in side walls to wrap you in warmth and create a better fit than bags that use only horizontal baffles. Contoured hood, insulated face muffler and full-length draft tube all work to keep warmth in. Differentiated hood and neck drawcords simplify adjustments; antisnag zipper works smoothly. Any REI backpacking bag can be zipped to any other REI backpacking bag; women's bags zip on the right, men's on the left. The women's REI Flash Sleeping Bag includes a nylon stuff sack and a large cotton storage bag. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The ultralight women's REI Flash Sleeping Bag uses a clever hybrid of water-repellent insulations and waterproof/breathable fabric panels in its double-protection design.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"Adult Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s358695.png","image_url":"http://i1.avlws.com/115/l358695.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=358695&tt=df","keywords":"insulated,bag,sleeping,cold,winter","retail_price":"279.00","sale_price":"279.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=358695\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m358695.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862530&amp;link=&amp;tabs=-Details\"></script>","variants":{"8625300001":{"sku":"8625300001","vendor_sku":"16294","upc":"486253000019","size":"Regular Right","color":"SWEDISH BLUE","retail_price":"269.00","sale_price":"269.00"},"8625300002":{"sku":"8625300002","vendor_sku":"16294","upc":"486253000026","size":"Long Right","color":"SWEDISH BLUE","retail_price":"279.00","sale_price":"279.00"}}}
