{"sku":"862521","manufacturer_id":"13269","brand_name":"Rei","product_name":"REI Pinnacle Classic 35 Pack - 2012 Special Buy","long_description":"The REI Pinnacle 35 pack comfortably hauls your gear on single-day climbs and other mountain activities. Take it on scrambles, multipitch crags and backcountry approaches. Climbing Magazine praises, \"With just enough straps and pockets to serve your needs, but with nothing extraneous, the Pinnacle is built for any sport that involves ascent.\". Compact stature belies its beefy suspension and solid materials-this little guy is a true mountain pack designed for heavy loads. Removable hipbelt and framesheet let you strip down the pack to save weight and match the needs of your adventure. Perforated shoulder strap foam allows body vapor to pass through and evaporate; molded foam back panel handles abuse and delivers comfort. Roll-top closure and internal compression collar offer great weather resistance and easy closure; side-zip access allows easy retrieval of items buried deep in the pack. Internal gear loops make it easy to rack and sort climbing gear; lash points let you secure bulky gear to the pack's exterior. Hydration sleeve accommodates a reservoir (sold separately); tube port lets you route the bite valve over either shoulder. Burly front pocket stores crampons and a jacket. Wand pocket is generously sized to also store small items like gloves and hats; exterior zippered pocket also keeps small items handy. Removable rope straps provide a stable attachment point for ropes; dedicated ski-tail loops and cam-lock buckles securely hold skis. Snow-specific buckles work well with gloves and help prevent snow from clogging. Special Buy.","short_description":"The REI Pinnacle 35 pack comfortably hauls your gear on single-day climbs and other mountain activities. Take it on scrambles, multipitch crags and backcountry approaches.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411307.png","image_url":"http://i1.avlws.com/115/l411307.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411307&tt=df","retail_price":"129.00","sale_price":"95.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411307\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411307.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862521&amp;link=&amp;tabs=-Details\"></script>","variants":{"8625210002":{"sku":"8625210002","vendor_sku":"13269","upc":"486252100024","size":"L","color":"GRECIAN NAVY","retail_price":"95.73","sale_price":"95.73"}},"categories":["camping-hiking","backpacks","day-packs"]}
