{"sku":"862539","manufacturer_id":"40017","brand_name":"Vapur","product_name":"Vapur MicroFilter Water Bottle Filter","long_description":"One of the lightest, most compact filter systems around, the Vapur MicroFilter water bottle filter uses a hollow-fiber filter that fits in the included flexible bottle to purify your drinking water. Vapur MicroFilter water bottle is easy to use: fill the bottle with clear water, insert the MicroFilter and screw the cap on and then drink by sucking water through the spout. Or, get down close to the stream or lake and use the straw MicroFilter without the flexible bottle to drink straight from the source. Hollow-fiber filter membrane has a high flow rate so you can sip on the straw and it filters water as it's on the way to your mouth; no pumping, no batteries and no chemicals. 0.2-micron filter physically removes 99.9999% of all bacteria, such as salmonella, cholera and E.coli; removes 99.9% of all protozoa, such as giardia and cryptosporidium. Effectively filters more than 132 gal. (500 liters). Weighing only 1.4 oz., the flexible 32 fl. oz. bottle is about 1/4 the weight of a 32 fl. oz. hard-plastic water bottle. Patented flexible design of the bottle is lighter and easier to hold than a rigid plastic bottle, and it folds flat when empty to fit compactly in your backpack. Durable three-ply construction allows the bottle to be folded and frozen without damaging it. Polyethylene/nylon bottle construction with antimicrobial lining won't impart tastes or odors to your water. Water-tight cap has a flip-top opening for easy sipping; unscrew the cap and remove the filter from the bottle when you need to refill. Comes with a plastic accessory carabiner so you can clip the bottle to a backpack strap; carabiner easily attaches to and removes from the cap. Vapur MicroFilter water bottle filter is 100% BPA free; water bottle is dishwasher safe.","short_description":"One of the lightest, most compact filter systems around, the Vapur MicroFilter water bottle filter uses a hollow-fiber filter that fits in the included flexible bottle to purify your drinking water.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s426435.png","image_url":"http://i1.avlws.com/115/l426435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426435&tt=df","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862539&amp;link=&amp;tabs=-Details\"></script>","variants":{"8625390001":{"sku":"8625390001","vendor_sku":"40018","upc":"819792010285","color":"NIGHT BLUE","retail_price":"69.95","sale_price":"69.95"},"8625390002":{"sku":"8625390002","vendor_sku":"40017","upc":"819792010278","color":"OLIVE GREEN","retail_price":"69.95","sale_price":"69.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
