{"sku":"862518","manufacturer_id":"23000","brand_name":"Goal Zero","product_name":"Goal Zero Yeti 400 Solar Generator","long_description":"Offering quiet, portable power, the Goal Zero Yeti 400 solar generator lets you live off the grid, camp in luxury, or power through an outage without the noise and fumes of a gas-powered generator. Plug the Yeti 400 into a solar panel and place in the sun; it takes about 30 - 60 hrs. to charge with the Nomad 27 solar panel (not included). Two other ways to charge Yeti 400: from the wall with included wall charger (takes about 5 hrs.) or from your car using 12V car charger, not included (takes about 13 hrs.). Common devices that Yeti 400 powers include laptops, tablets, lights, C-PAP machines, smartphones, cameras, e-readers, MP3 players and TVs. Portable wall outlet powers laptops, lights and smartphones anywhere. Easy to carry with the convenient pop-up handle. Lead acid battery features 396 watt-hours (12V, 33Ah) capacity, hundreds of cycles, three-month shelf life, no fuses and built-in charging/low-battery protection. Chain multiple generators together for increased output; generator operates in temperatures ranging from 32deg to 104deg F (0deg to 40deg C). The Goal Zero Yeti 400 offers the following approximate power: 12V light (100+ hrs.); smartphone (30+ recharges); laptop or tablet (5 recharges); TV (3 hrs.).","short_description":"Offering quiet, portable power, the Goal Zero Yeti 400 solar generator lets you live off the grid, camp in luxury, or power through an outage without the noise and fumes of a gas-powered generator.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Solar And Portable Power","thumb_url":"http://i1.avlws.com/115/s451647.png","image_url":"http://i1.avlws.com/115/l451647.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451647&tt=df","keywords":"rechargeable batteries,charger","retail_price":"459.95","sale_price":"459.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451647\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451647.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862518&amp;link=&amp;tabs=-Details\"></script>","variants":{"8625180001":{"sku":"8625180001","vendor_sku":"23000","upc":"847974002285","retail_price":"459.95","sale_price":"459.95"}},"categories":["camping-hiking","camp-electronics","solar-and-portable-power"]}
