{"sku":"862520","manufacturer_id":"13543","brand_name":"Rei","product_name":"REI Crestrail 48 Pack - Women's - 2013 Special Buy","long_description":"The women's REI Crestrail 48 pack balances comfort with performance and durability for weekend or multiday trips. It boasts a gender-specific design with light, compact materials and components. Sculpted FreeFlow back panel has multiple peaks and valleys to reduce sweaty contact areas and allow warm vapor to escape; soft foam conforms to your back for a stable fit. ActivMotion(R) hipbelt pivots to follow the natural motion of your hips, helping keep the pack balanced and stable on your back when hiking on uneven terrain. Hipbelt webbing tightens with a forward pull for easy adjustment; 2 zippered pockets provide handy access to snacks. Tubular aluminum perimeter frame is lighter weight than HDPE/stay framesheets; it transfers weight to your hips and stabilizes pack, helping prevent unwanted side-to-side sway. Top-loading main compartment also features a large zippered opening to the bottom for easy access; floating top lid extends, allowing the pack to handle large loads. Large front pocket with double-zipper access, stretch stash pocket and lightweight lash points provide storage and organization for often-used gear and clothing. Side bottle-locking pockets secure bottles or other items, helping prevent them from falling out when bushwacking or taking your pack off. Quick Clip ice axe attachments are strategically positioned to avoid interference with pockets and access zippers. Over-the-top and dual side compression straps pull the load closer to your back, minimize bulk and provide external attachment points for gear. Ripstop nylon with Durable Water Resistant finish resists abrasion, tears and moisture; water-repellent zippers help keep your contents dry. Route your reservoir's drink tube over either shoulder (hydration reservoir not included). Special buy.","short_description":"The women's REI Crestrail 48 pack balances comfort with performance and durability for weekend or multiday trips. It boasts a gender-specific design with light, compact materials and components.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Internal Frame Packs","thumb_url":"http://i1.avlws.com/115/s352759.png","image_url":"http://i1.avlws.com/115/l352759.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=352759&tt=df","keywords":"BACKPACK FOR backpacking,frame,Internal","retail_price":"159.00","sale_price":"118.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=352759\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m352759.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862520&amp;link=&amp;tabs=-Details\"></script>","variants":{"8625200001":{"sku":"8625200001","vendor_sku":"13543","upc":"486252000010","size":"S","color":"SAND/BROWN SUGAR","retail_price":"118.73","sale_price":"118.73"}}}
