{"sku":"862872","manufacturer_id":"16411","brand_name":"Rei","product_name":"REI Crestrail 48 Pack - Women's","long_description":"The women's REI Crestrail 48 Pack nicely balances comfort, organization and durability in a backpack designed for weekend trips. REI ActivMotion(R) suspension features a pivoting hipbelt that helps maintain load balance over uneven terrain. Tubular aluminum frame cuts weight, transfers load to hips and lets the pack conform to your back shape. REI's Freeflow Comfort back has generously padded sections, plus sculpted ventilation channels and a central breezeway to help keep you cool. Adjustable torso length lets you fine-tune the fit; hipbelt and shoulder straps are contoured to fit women. Over-the-top compression strap pulls loads closer to your back; side compression straps also help snug down the load. Hydration pocket is accessible from outside, for quick access to a reservoir (sold separately); fits up to 3-liter reservoirs and you can run the sip tube over either shoulder. Top lid has multiple pockets; 2 have soft tricot linings for scratch-free storage of phones or sunglasses. Side zip offers access to deep-down gear. Stretch mesh front pocket is handy for bulky items. Up to a 32-oz. bottle can be twist-locked inside each side pocket; a drawcord adjusts the pocket opening. Smooth, moisture-wicking fabric covers body contact areas to help you stay drier and more comfortable when your exertion level picks up. Tip grips are paired with speed hooks to securely hold trekking poles; pack also has multiple lash loops. Bottom compression straps can be used to attach a sleeping pad. The women's REI Crestrail 48 Pack also includes hipbelt pockets that are handy for stashing trail essentials.","short_description":"The women's REI Crestrail 48 Pack nicely balances comfort, organization and durability in a backpack designed for weekend trips.","category":"Camping & Hiking","subcategory":"Backpacking Packs","product_group":"Multi-Day Backpacks","thumb_url":"http://i1.avlws.com/115/s356399.png","image_url":"http://i1.avlws.com/115/l356399.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=356399&tt=df","keywords":"lightweight,adult","retail_price":"169.00","sale_price":"169.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=356399\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m356399.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862872&amp;link=&amp;tabs=-Details\"></script>","variants":{"8628720001":{"sku":"8628720001","vendor_sku":"16411","upc":"486287200010","size":"S","color":"EGGPLANT/TITANIUM","retail_price":"169.00","sale_price":"169.00"},"8628720002":{"sku":"8628720002","vendor_sku":"16411","upc":"486287200027","size":"M","color":"EGGPLANT/TITANIUM","retail_price":"169.00","sale_price":"169.00"}}}
