{"sku":"862870","manufacturer_id":"16420","brand_name":"Rei","product_name":"REI Yosemite 75 Pack","long_description":"Built to fit both body and budget, the multiday REI Yosemite 75 Pack features the REI Flex-Fit suspension, which maximizes comfort by letting you adjust the fit multiple ways. REI Flex-Fit suspension lets you adjust both the hipbelt length and pad placement to maximize comfort; it also has a simple torso-length adjustment system. Forward-pull hipbelt can be easily tightened as you hike; over-the-top compression strap snugs loads close. Bottom compartment's access zipper is extra wide to accommodate bulky items; buckle-close flaps help compress the load; inner divider separates bottom section from main pack. Water bottles can be twist-locked in place in the side pockets; angled pocket openings offer easy access. Large mesh stash pocket in front is roomy enough to accommodate a jacket or other bulky gear. Hydration-compatible design accepts most popular types of reservoirs (sold separately); you can route the sip tube over either shoulder. Quick-clip tool loops and multiple lash loops make it easy to haul additional gear. Hipbelt pockets are handy for trail essentials. Sternum strap includes a built-in safety whistle. For added durability, the Yosemite 75 Pack has waterproof and abrasion-resistant fabric on the bottom.","short_description":"Built to fit both body and budget, the multiday REI Yosemite 75 Pack features the REI Flex-Fit suspension, which maximizes comfort by letting you adjust the fit multiple ways.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410775.png","image_url":"http://i1.avlws.com/115/l410775.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410775&tt=df","keywords":"multiday","retail_price":"179.00","sale_price":"179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410775\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410775.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862870&amp;link=&amp;tabs=-Details\"></script>","variants":{"8628700001":{"sku":"8628700001","vendor_sku":"16420","upc":"486287000016","size":"M","color":"REDPLUM/PICANTE","retail_price":"179.00","sale_price":"179.00"},"8628700002":{"sku":"8628700002","vendor_sku":"16420","upc":"486287000023","size":"L","color":"REDPLUM/PICANTE","retail_price":"179.00","sale_price":"179.00"}}}
