{"sku":"862858","manufacturer_id":"02-14-5060","brand_name":"Diamondback","product_name":" Diamondback Octane 20\" Boys' Bike - 2014","long_description":"A do-it-all ride for kids ready to go off pavement, the Diamondback Octane 20 in. kids' bike features a shock-absorbent fork and tough aluminum frame to handle any terrain. Sturdy frame is constructed out of heat-treated aluminum for durable performance; sloped top tube accommodates a short stand-over height. Trail XC suspension fork offers 30mm of travel to smooth out rough roads and take the jolts out of bumps and roots on the trail. 6-speed setup keeps it simple while offering a range of gears to tackle varying terrain; chain ring guard helps protect clothes from getting greasy or caught in the crankset. Shimano Revo twist shifter is easy to use-all a rider has to do is twist the grip-integrated shifter to change gears with a flick of the wrist. Linear-pull brakes supply sure stopping power and speed management; brake levers are sized for small hands. The rear derailleur hanger, a part that is particularly vulnerable to breakage from young riders, can be easily replaced and extends the usable life of the frame. Specs are subject to change.","short_description":"A do-it-all ride for kids ready to go off pavement, the Diamondback Octane 20 in. kids' bike features a shock-absorbent fork and tough aluminum frame to handle any terrain.","category":"Cycling","subcategory":"Bikes","product_group":"Kids' Bikes","thumb_url":"http://i1.avlws.com/115/s376423.png","image_url":"http://i1.avlws.com/115/l376423.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376423&tt=df","retail_price":"269.00","sale_price":"269.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376423\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376423.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862858&amp;link=&amp;tabs=-Details\"></script>","variants":{"8628580001":{"sku":"8628580001","vendor_sku":"02-14-5060","upc":"791964420613","size":"20 IN","color":"BLUE","retail_price":"269.00","sale_price":"269.00"}},"categories":["cycling","bikes","kids-bikes"]}
