{"sku":"862883","brand_name":"Rei","product_name":"REI Flash 58 Pack - Women's","long_description":"The ultralight women's REI Flash 58 Pack is a multiday backpack built on an agile Activflex frame that comfortably handles your load while also allowing you to twist and turn as you hike. Activflex LT perimeter aluminum frame allows torso rotation, yet efficiently transfers the load to the hipbelt. Structured hipbelt provides a robust level of support for an ultralight pack; hipbelt and shoulder straps are contoured to fit women. Freeflow LT back conforms to your back and has ventilation channels and a central breezeway to keep you cool. Ultralight 100-denier high-tenacity ripstop nylon cuts weight, while 210-denier high-tenacity oxford nylon offers abrasion resistance in high-wear areas. Buckle-secured front stash pocket can accommodate bulky gear. Tip grips are paired with speed hooks to securely hold trekking poles; pack also has multiple lash loops. Hydration-compatible design accepts most popular types of reservoirs (sold separately); you can route the sip tube over either shoulder. Water bottles can be twist-locked in place in the side pockets; angled pocket openings offer easy access. Stretch-mesh shoulder-strap pocket fits a camera. Bottom compression straps can be used to attach a sleeping pad. The REI women's Flash 58 Pack also includes handy hipbelt pockets where you can stash small trail essentials.","short_description":"The ultralight women's REI Flash 58 Pack is a multiday backpack built on an agile Activflex frame that comfortably handles your load while also allowing you to twist and turn as you hike.","category":"Camping & Hiking","subcategory":"Backpacking Packs","product_group":"Multi-Day Backpacks","thumb_url":"http://i1.avlws.com/115/s358663.png","image_url":"http://i1.avlws.com/115/l358663.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=358663&tt=df","keywords":"adult,lightweight","retail_price":"189.00","sale_price":"189.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=358663\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m358663.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862883&amp;link=&amp;tabs=-Details\"></script>","variants":{"8628830001":{"sku":"8628830001","vendor_sku":"16409","upc":"486288300016","size":"XS","color":"SWEDISH BLUE/BLAZE RED","retail_price":"189.00","sale_price":"189.00"},"8628830002":{"sku":"8628830002","vendor_sku":"16409","upc":"486288300023","size":"S","color":"SWEDISH BLUE/BLAZE RED","retail_price":"189.00","sale_price":"189.00"},"8628830003":{"sku":"8628830003","vendor_sku":"16409","upc":"486288300030","size":"M","color":"SWEDISH BLUE/BLAZE RED","retail_price":"189.00","sale_price":"189.00"}}}
