{"sku":"862866","manufacturer_id":"02-14-5050","brand_name":"Diamondback","product_name":" Diamondback Lustre 24\" Girls' Bike - 2014","long_description":"With a shock-absorbing front fork and 21 easy-shifting gears just like adult bikes, the Diamondback Lustre 24 in. girls' bike offers excellent all-around performance for family jaunts or local trails. Frame is constructed out of heat-treated aluminum for durable performance; sloped top tube accommodates an appropriate stand-over height for kids. Trail XC suspension fork offers 40mm of travel to smooth out rough roads and take the jolts out of bumps and roots on the trail. 21 gears handle all sorts of grades, making easy work of the ups, downs and arounds; chain ring guard helps protect clothing from getting caught in the crankset. Shimano Revo twist shifters are easy to use-simply twist the grip-integrated shifters to change gears. Linear-pull brakes supply sure stopping power and speed management; brake levers are sized for small hands. The rear derailleur hanger, a part that is particularly vulnerable to breakage from young riders, can be easily replaced, and extends the usable life of the frame. Specs on the Diamondback Lustre 24 in. girls' bike are subject to change.","short_description":"With a shock-absorbing front fork and 21 easy-shifting gears just like adult bikes, the Diamondback Lustre 24 in. girls' bike offers excellent all-around performance for family jaunts or local trails.","category":"Cycling","subcategory":"Bikes","product_group":"Kids' Bikes","thumb_url":"http://i1.avlws.com/115/s376435.png","image_url":"http://i1.avlws.com/115/l376435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376435&tt=df","retail_price":"309.00","sale_price":"309.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862866&amp;link=&amp;tabs=-Details\"></script>","variants":{"8628660001":{"sku":"8628660001","vendor_sku":"02-14-5050","upc":"791964421740","size":"24 IN","color":"WHITE","retail_price":"309.00","sale_price":"309.00"}},"categories":["cycling","bikes","kids-bikes"]}
