{"sku":"862873","brand_name":"Rei","product_name":"REI Pinnacle 35 Pack","long_description":"With its beefy suspension and features to handle a wide array of alpine gear, the REI Pinnacle 35 Pack is ideal for both climbing and winter activities. Molded foam back panel is comfortable and durable. Roll-top closure that buckles securely closed; the top of the pack also has detachable rope straps and a small zip pocket for essentials. Internal gear loops make it easy to rack and sort climbing gear; lash points let you secure bulky gear to the pack's exterior. Side-zip access allows retrieval of items buried deep in the pack. Rugged front pocket can store crampons and a jacket. Hydration-compatible design accepts most popular types of reservoirs (sold separately); you can route the sip tube over either shoulder. Wand pocket is generously sized to store small items like gloves and hats. Dedicated ski-tail loops and cam-lock buckles securely hold skis; snow-specific buckles work well with gloves and won't clog with snow. Over-the-top compression strap snugs loads close; strap can also be used to secure a climbing rope. Bottom of pack is padded to cushion contents and is reinforced to withstand abrasion. Removable hipbelt and framesheet let you strip down the REI Pinnacle 35 Pack to save weight.","short_description":"With its beefy suspension and features to handle a wide array of alpine gear, the REI Pinnacle 35 Pack is ideal for both climbing and winter activities.","category":"Camping & Hiking","subcategory":"Specialized Packs","product_group":"Climbing Packs","thumb_url":"http://i1.avlws.com/115/s358263.png","image_url":"http://i1.avlws.com/115/l358263.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=358263&tt=df","keywords":"scrambling,scrag,climb,climbing,backpack","retail_price":"139.00","sale_price":"139.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=358263\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m358263.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862873&amp;link=&amp;tabs=-Details\"></script>","variants":{"8628730001":{"sku":"8628730001","vendor_sku":"16413","upc":"486287300017","size":"M","color":"WILLOW/PICANTE","retail_price":"139.00","sale_price":"139.00"},"8628730002":{"sku":"8628730002","vendor_sku":"16413","upc":"486287300024","size":"L","color":"WILLOW/PICANTE","retail_price":"139.00","sale_price":"139.00"}}}
