{"sku":"862917","manufacturer_id":"010-01128-30","brand_name":"Garmin","product_name":"Garmin Forerunner 620 GPS Heart Rate Monitor","long_description":"Sporting a high-res color touchscreen, the Garmin Forerunner 620 GPS heart rate monitor offers recovery advisor, race predictor and VO2 max estimate to help you train smarter and achieve race goals. Light and comfortable design features a vivid color touchscreen display, high-sensitivy GPS and smartphone connectivity. When used with the included HRM-Run chest sensor, the 620 provides feedback on running form by showing your cadence, ground contact time and vertical oscillation. Heart rate sensor also helps gauge your fitness level through advanced features like recovery advisor, race predictor and VO2 max estimate. Reliable GPS ensures a faster GPS fix when you regularly connect to Garmin Connect(TM) for automatic satellite data. Interval training mode lets you set up exercise and rest intervals. Forerunner 620 lets you know when you achieve a personal record to help keep you motivated. Auto Pause(R) pauses and resumes timer based on speed. Built-in accelerometer in the Garmin Forerunner 620 GPS heart rate monitor tracks distance and pace for indoor training. Stay connected to friends and share your achievements with automatic uploads to Garmin Connect, live tracking and social media.","short_description":"Sporting a high-res color touchscreen, the Garmin Forerunner 620 GPS heart rate monitor offers recovery advisor, race predictor and VO2 max estimate to help you train smarter and achieve race goals.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413555.png","image_url":"http://i1.avlws.com/115/l413555.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413555&tt=df","keywords":"odometer,waterproof","retail_price":"450.00","sale_price":"450.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413555\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413555.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=862917&amp;link=&amp;tabs=-Details\"></script>","variants":{"8629170001":{"sku":"8629170001","vendor_sku":"010-01128-30","upc":"753759107024","color":"BLACK/BLUE","retail_price":"450.00","sale_price":"450.00"},"8629170002":{"sku":"8629170002","vendor_sku":"010-01128-31","upc":"753759107031","color":"ORANGE/WHITE","retail_price":"450.00","sale_price":"450.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
