{"sku":"863020","manufacturer_id":"9904","brand_name":"Cycleops","product_name":" CycleOps Fluid2 Bike Trainer - 2014","long_description":"With a range of resistance suited to advanced cyclists, the CycleOps Fluid2 bike trainer offers quiet operation and a smooth, roadlike feel that helps you keep up your bike routine during bad weather. There are no manual adjustments needed, simply shift gears as you would when riding outside to increase or decrease the resistance, and the faster you pedal the harder it gets. Spin along with virtually no resistance or hammer out a 2000-watt sprint-you will never outgrow this trainer no matter what training you require. With a quick load cam lever, you simply adjust the resistance once and then lock it into place so there is no guessing each time you put your bike on the trainer. Combine this with a smooth, quiet ride, locking bolt ring and heavy-duty steel construction, and you're ready to sprint, spin and climb with confidence. The Cyclops Fluid2 bike trainer features adjustable foot pads, a quick release handle, self-cooling mechanism and folding legs for storage. Updated frame works with all standard wheels and now works with 29er mountain bike wheels (fits most treads to 2.25 in.).","short_description":"With a range of resistance suited to advanced cyclists, the CycleOps Fluid2 bike trainer offers quiet operation and a smooth, roadlike feel that helps you keep up your bike routine during bad weather.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trainers","thumb_url":"http://i1.avlws.com/115/s379611.png","image_url":"http://i1.avlws.com/115/l379611.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=379611&tt=df","retail_price":"315.00","sale_price":"315.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=379611\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m379611.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863020&amp;link=&amp;tabs=-Details\"></script>","variants":{"8630200001":{"sku":"8630200001","vendor_sku":"9904","upc":"012527009718","color":"BLACK","retail_price":"315.00","sale_price":"315.00"}}}
