{"sku":"863023","manufacturer_id":"MC-2 25","brand_name":"Apex Ski Boots","product_name":"Apex Ski Boots MC-2 High Performance Ski Boots - Men's - 2013/2014","long_description":"The intermediate-level Apex MC-2 High Performance ski boots offer a stiff flex with a 2-part system: warm, easy-to-walk in support boots lock into a rigid open chassis when it's time to ski. The MC-2 High Performance ski boots offer a stiff flex for advanced or aggressive intermediate skiers and adjust to 110, 120, and 130 flex index to suit conditions. Easy to walk around in and very warm, the support boots feature Boa(TM) closures that make putting the boots on much easier than struggling with traditional ski buckles. Boa system tightens gradually using a simple twisting knob and lacing cables to produce even snugness throughout boots. Support boots feature grippy outsoles for excellent traction on snowy surfaces. When you are ready to ski, step into the open chassis and lock in support boots with ratcheting buckles. The chassis offer a direct connection to your skis and precise control thanks to their rigid construction, and they're designed to work very well with modern ski shapes. Custom-moldable liners offer a great fit right out of the box, but they may be custom formed using a heat treatment.","short_description":"The intermediate-level Apex MC-2 High Performance ski boots offer a stiff flex with a 2-part system: warm, easy-to-walk in support boots lock into a rigid open chassis when it's time to ski.","category":"Skiing","subcategory":"Ski Boots","product_group":"Downhill Ski Boots","thumb_url":"http://i1.avlws.com/115/s456459.png","image_url":"http://i1.avlws.com/115/l456459.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456459&tt=df","retail_price":"995.00","sale_price":"995.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456459\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456459.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863023&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["snow","ski-boots","downhill-ski-boots"]}
