{"sku":"863039","manufacturer_id":"01002","brand_name":"Sigma Sport","product_name":" SIGMA SPORT ROX 10.0 GPS Basic Bike Computer - Wireless","long_description":"A basic cycling GPS you can use to navigate and track your route, the SIGMA SPORT ROX 10.0 GPS Wireless Bike Computer enhances your training with detailed data and route recording. GPS navigation functions display time and distance to destinations and sound an alarm when you're off track or going the wrong direction. Compatible with all power meters using ANT+ transmission technology (power meters not included). Lap counter records speed for each lap up to 99 laps. The trip data is automatically recorded in the LOG and can be optionally downloaded to the SIGMA DATA CENTER 3 evaluation software; up to 25 hrs. can be recorded in the LOG. DATA CENTER 3 software makes ride data simple to download, track and analyze; the start page features a concise summary for quick analysis. SIGMA SPORT ROX 10.0 GPS Wireless Bike Computer includes computer, mounting bracket battery key and attachment materials.","short_description":"A basic cycling GPS you can use to navigate and track your route, the SIGMA SPORT ROX 10.0 GPS Wireless Bike Computer enhances your training with detailed data and route recording.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s451435.png","image_url":"http://i1.avlws.com/115/l451435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451435&tt=df","retail_price":"200.00","sale_price":"200.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863039&amp;link=&amp;tabs=-Details\"></script>","variants":{"8630390001":{"sku":"8630390001","vendor_sku":"01002","upc":"750220010029","color":"BLACK","retail_price":"200.00","sale_price":"200.00"}}}
