{"sku":"863031","manufacturer_id":"14591","brand_name":"Rei","product_name":"REI Flash 45 Pack - Special Buy","long_description":"The streamlined REI Flash 45 Pack balances minimal weight with maximum comfort and convenience. It's the perfect companion for a long weekend of fast and light backpacking. Molded, mesh-covered EVA back panel rivals heavier packs with its comfort and ventilation; shoulder straps are made with perforated foam, allowing sweat vapor to pass through. Aluminum headrail teams up with 2 flexible Delrin rods to offer genuine load transfer to the hips, which is virtually unheard of in a pack this light! Spacious main compartment features a hydration sleeve (reservoir sold separately); floating top lid extends to accommodate bulky items and larger loads. Floating front pocket offers adaptable and generous storage, fitting a wide array of contents such as rain gear or water bottles. Zippered hipbelt pockets offer immediate access to snacks and other small items. Lightweight lash points allow additional gear to be strapped to the outside of the pack; quick-clip bungee loops let you secure an ice axe or trekking poles. The REI Flash 45 Pack features side and top compression straps that help pull the load close to your body and provide attachment points for additional gear. Special Buy.","short_description":"The streamlined REI Flash 45 Pack balances minimal weight with maximum comfort and convenience. It's the perfect companion for a long weekend of fast and light backpacking.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Internal Frame Packs","thumb_url":"http://i1.avlws.com/115/s363939.png","image_url":"http://i1.avlws.com/115/l363939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=363939&tt=df","keywords":"BACKPACK FOR backpacking,frame,Internal","retail_price":"129.00","sale_price":"89.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=363939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m363939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863031&amp;link=&amp;tabs=-Details\"></script>","variants":{"8630310001":{"sku":"8630310001","vendor_sku":"14591","upc":"486303100010","size":"M","color":"BLACK/LIME SPRITZ","retail_price":"89.73","sale_price":"89.73"},"8630310002":{"sku":"8630310002","vendor_sku":"14591","upc":"486303100027","size":"L","color":"BLACK/LIME SPRITZ","retail_price":"89.73","sale_price":"89.73"}}}
