{"sku":"863028","manufacturer_id":"16350","brand_name":"Novara","product_name":" Novara E.T.A. Backpack","long_description":"Tough enough to handle the gritty bike lane without weighing you down, the sleek Novara E.T.A. Backpack offers plenty of room to carry everyday items during routine trips on 2 wheels. Front zip compartment features a mesh organizer with room for the small stuff like keys, wallet and cash; top zip compartment is large enough to accommodate a smartphone. Main zippered compartment has hydration-compatible reservoir pocket, hanger cord and drink tube exit port for on-the-go hydration (reservoir not included). Hydration sleeve doubles as a laptop sleeve; top of pack features an adjustable helmet holder. PVC-free, coated nylon fabric shields contents from light moisture and road grime, and integrated rain cover deploys for complete weatherproof protection when you need it. Breathable, mesh-covered back panel with egg-crate foam padding protects your back from pointy gear. Shoulder straps feature mesh and perforated foam padding for ventilation; adjustable sternum strap and removable webbing waistbelt help distribute weight and stabilize pack. Reflective hanging tabs on pack can be removed and attached to loops outside raincover for better visibility. Reflective detailing on the Novara E.T.A. Backpack increases visibility in low light; bottom strap works with a blinky light (not included).","short_description":"Tough enough to handle the gritty bike lane without weighing you down, the sleek Novara E.T.A. Backpack offers plenty of room to carry everyday items during routine trips on 2 wheels.","category":"Cycling","subcategory":"Cycling Backpacks And Bags","product_group":"Cycling Commuter Backpacks","thumb_url":"http://i1.avlws.com/115/s390523.png","image_url":"http://i1.avlws.com/115/l390523.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390523&tt=df","retail_price":"79.50","sale_price":"79.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390523\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390523.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863028&amp;link=&amp;tabs=-Details\"></script>","variants":{"8630280001":{"sku":"8630280001","vendor_sku":"16350","upc":"486302800010","color":"MAGNET/LIME SPRITZ","retail_price":"79.50","sale_price":"79.50"},"8630280002":{"sku":"8630280002","vendor_sku":"16350","upc":"486302800027","color":"BRIGHT COBALT/BRILLIANT B","retail_price":"79.50","sale_price":"79.50"}}}
