{"sku":"863007","manufacturer_id":"16351","brand_name":"Novara","product_name":" Novara Gotham Backpack","long_description":"Crafted for the needs of cyclists, the Novara Gotham Backpack offers a great fit designed for pedaling and plenty of pockets for everything you need during commutes or tours. Novara Gotham Backpack features a wide-mouth opening so you can easily pack work clothing, groceries from the market or everyday essentials like a laptop or tablet. Made from PVC-free material, the polyurethane coated nylon shields contents from the elements. Top zippered opening flap is held tightly closed for weather-resistance when side buckles are cinched tight; loosening buckles still allows access to main zip opening. Front zip compartment features a mesh organizer pocket, and middle zippered pocket stores bike tools and U-lock (rip-and-stick strap prevents lock from jostling around). Breathable mesh-covered, foam-padded back panel and a thin, low-density polyethylene framesheet protect your back from bulky textbooks and pointy laptops. Shoulder straps feature perforated-foam padding and adjustable sternum strap; removable webbing waistbelt helps distribute weight and prevent pack from swaying. Removable raincover has its own storage pocket; raincover has a polyurethane coating and taped seams for extreme weather resistance; features reflective Novara logo. Reflective tabs on pack are removable and can be attached to loops outside of raincover for better visibility. Top of pack features an adjustable cinch cord that holds a helmet to the front of the pack and that stashes inside when not in use. Hydration-compatible design features reservoir pocket, hanger cord and drink tube exit port for on-the-go hydration (reservoir not included). Hydration sleeve doubles as a laptop sleeve when not carrying a reservoir; pocket also features a sleeve for your air pump. Reflective detailing increases visibility in low light.","short_description":"Crafted for the needs of cyclists, the Novara Gotham Backpack offers a great fit designed for pedaling and plenty of pockets for everything you need during commutes or tours.","category":"Cycling","subcategory":"Cycling Backpacks And Bags","product_group":"Cycling Commuter Backpacks","thumb_url":"http://i1.avlws.com/115/s390519.png","image_url":"http://i1.avlws.com/115/l390519.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=390519&tt=df","retail_price":"99.50","sale_price":"99.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=390519\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m390519.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863007&amp;link=&amp;tabs=-Details\"></script>","variants":{"8630070001":{"sku":"8630070001","vendor_sku":"16351","upc":"486300700015","color":"MAGNET/LIME SPRITZ","retail_price":"99.50","sale_price":"99.50"},"8630070002":{"sku":"8630070002","vendor_sku":"16351","upc":"486300700022","color":"BRIGHT COBALT/BRILLIANT B","retail_price":"99.50","sale_price":"99.50"}},"categories":["cycling","cycling-backpacks-and-bags","cycling-commuter-backpacks"]}
