{"sku":"863027","manufacturer_id":"05170","brand_name":"Sigma Sport","product_name":"SIGMA SPORT ROX 5.0 Bike Computer - Wireless","long_description":"The SIGMA SPORT ROX 5.0 wireless bike computer displays multiple speed, heart rate and cadence values and seamlessly transitions into a running computer for use off the bike. With a unique shape and durable design, this computer can handle any terrain. Includes 4 intensity zones and will show how much time is spent in each zone; you may use the pre-programmed zones or customize your own based on specific fitness goals. Use the pre-programmed Fitness or Fat Burning Zone or easily create your own; an audible and visual zone alarm will help keep you in your target zone. Lap counter records speed, cadence and heart rate values for each lap up to 99 laps. In run mode, the key functions include heart rate, run time, target zone and intensity zones. The trip data is automatically recorded in the LOG and can be optionally downloaded to the SIGMA DATA CENTER 3 evaluation software; up to 25 hrs. can be recorded in the LOG. DATA CENTER 3 software makes ride data simple to download, track and analyze; the start page features a concise summary for quick analysis. Includes computer, mounting bracket, speed and cadence transmitter, spoke and cadence magnet, wristband, heart-rate chest strap, battery key and attachment materials.","short_description":"The SIGMA SPORT ROX 5.0 wireless bike computer displays multiple speed, heart rate and cadence values and seamlessly transitions into a running computer for use off the bike.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375255.png","image_url":"http://i1.avlws.com/115/l375255.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375255&tt=df","retail_price":"140.00","sale_price":"140.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375255\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375255.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863027&amp;link=&amp;tabs=-Details\"></script>","variants":{"8630270001":{"sku":"8630270001","vendor_sku":"05170","upc":"750220051701","color":"BLACK","retail_price":"140.00","sale_price":"140.00"}},"categories":["cycling","bike-accessories","bike-computers"]}
