{"sku":"863038","manufacturer_id":"06171","brand_name":"Sigma Sport","product_name":" SIGMA SPORT ROX 6.0 Bike Computer - Wireless","long_description":"With an altimeter for tracking climbs and descents during hilly mountain bike or road rides, the SIGMA SPORT ROX 6.0 wireless bike computer also displays multiple speed, heart rate and cadence values. Compact and durable, the SIGMA SPORT ROX 6.0 bike computer also transitions into a hiking computer for use off the bike with an included wristband. Pressure-based altimeter offers accurate measurements of altitude gains and losses, an elevation profile for the last 3 mi. of biking, as well as easy calibration. Includes 4 intensity zones and will show how much time is spent in each zone; you may use the pre-programmed zones or customize your own based on specific fitness goals. Use the pre-programmed Fitness or Fat Burning Zone or easily create your own; an audible and visual zone alarm will help keep you in your target zone. Lap counter records speed, cadence and heart rate values for each lap up to 99 laps. In hiking mode, the key functions include heart rate, hiking time, altitude, general time functions and graphs of the target and intensity zones. The trip data is automatically recorded in the LOG and can be optionally downloaded to the SIGMA DATA CENTER 3 evaluation software; up to 25 hrs. can be recorded in the LOG. DATA CENTER 3 software makes ride data simple to download, track and analyze; the start page features a concise summary for quick analysis. Includes computer, mounting bracket, speed and cadence transmitter, cadence magnet pedal insert, wristband, heart-rate chest strap, battery key and attachment materials.","short_description":"With an altimeter for tracking climbs and descents during hilly mountain bike or road rides, the SIGMA SPORT ROX 6.0 wireless bike computer also displays multiple speed, heart rate and cadence values.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s375259.png","image_url":"http://i1.avlws.com/115/l375259.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375259&tt=df","retail_price":"165.00","sale_price":"165.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375259\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375259.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863038&amp;link=&amp;tabs=-Details\"></script>","variants":{"8630380001":{"sku":"8630380001","vendor_sku":"06171","upc":"750220061717","color":"WHITE","retail_price":"165.00","sale_price":"165.00"}}}
