{"sku":"863377","manufacturer_id":"MT350R","brand_name":"Motorola","product_name":" Motorola Talkabout MT350R 2-Way Radios - 2 Pack","long_description":"The black and orange Motorola MT350R 2-way radios can endure extreme weather and harsh environments while delivering high-end communication and NOAA weather information. Radios transmit and receive up to 35 mi. (per manufacturer); range is based on an unobstructed line of sight between you and another radio operator in good weather. Weatherproof design helps protect against snow, rain, splashes and dust. Receives 11 NOAA weather channels, offering coverage of all government-operated NOAA weather broadcasts. Talk on both Family Radio Service (FRS) and General Mobile Radio Service (GMRS), providing 22 channels with 121 privacy codes. Power is automatically stepped down to a half-watt across FRS-only channels (2-mile range), enabling radios to talk to all existing FRS 2-way radios. iVOX voice activation lets you talk hands-free when used with or without optional accessories; vibrating call alert is useful for situations where ringing can be intrusive. 10 audible call tones grab the attention of your family and friends before you start speaking; talk-confirmation tone signals you've finished speaking. Built-in LED flashlights provide an emergency light source; LCD display with backlight makes the radio easy to read in the dark. Recharge with the provided mini-USB charger or drop in 3 AA alkaline batteries (sold separately). The Motorola MT350R 2-way radios provide up to 10 hrs. of talk time with the NiMH rechargeable battery pack and up to 15 hours with alkaline batteries. Radios come with 2 NiHM battery packs, 2 belt clips, wall adapter with 2 mini-USB connectors, emergency preparedness checklist and user guide.","short_description":"The black and orange Motorola MT350R 2-way radios can endure extreme weather and harsh environments while delivering high-end communication and NOAA weather information.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412871.png","image_url":"http://i1.avlws.com/115/l412871.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412871&tt=df","keywords":"walkie talkies","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412871\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412871.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863377&amp;link=&amp;tabs=-Details\"></script>","variants":{"8633770001":{"sku":"8633770001","vendor_sku":"MT350R","upc":"843677001426","color":"BLACK/ORANGE","retail_price":"89.95","sale_price":"89.95"}}}
