{"sku":"863333","manufacturer_id":"16324","brand_name":"Rei","product_name":"REI Grand Tour 85 Travel Pack - Men's","long_description":"Designed for carrying comfort on extended treks, the men's REI Grand Tour 85 Tavel Pack is loaded with savvy touches such as a removable, full-featured daypack. Suspension system can be adjusted to fit your torso length and its advanced backpack harness has nicely padded, ergonomically shaped hipbelt and shoulder straps. Detachable daypack has a roomy main compartment; organizer panel and a soft neoprene sleeve to hold your 13 in. laptop. Removable daypack rides in the outer stash pocket; daypack can also be clipped to the main pack's front sternum strap for greater security. With daypack removed, the pocket is handy for stowing a heavy coat; pocket also cinches snugly against the main pack to create a clean exterior. Main pack includes a rain/travel cover to protect it from the elements and wear-and-tear during baggage handling. For added security, the main pack also has lockable outer zippers (locks not included). Interior compression straps prevent clothes from shifting; exterior compression straps stabilize the load. Side mesh pockets on main pack offer a convenient spot to stow a water bottle. Side and top handles with foam padding make the pack comfortable to heft. The men's REI Grand Tour 85 Travel Pack includes 2 internal aluminum stays to support heavy loads.","short_description":"Designed for carrying comfort on extended treks, the men's REI Grand Tour 85 Tavel Pack is loaded with savvy touches such as a removable, full-featured daypack.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s433711.png","image_url":"http://i1.avlws.com/115/l433711.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433711&tt=df","retail_price":"189.00","sale_price":"189.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433711\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433711.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863333&amp;link=&amp;tabs=-Details\"></script>","variants":{"8633330001":{"sku":"8633330001","vendor_sku":"16324","upc":"486333300015","color":"BLACK","retail_price":"189.00","sale_price":"189.00"}}}
