{"sku":"863644","manufacturer_id":"HS214-10","brand_name":"Maui Jim","product_name":"Maui Jim Pearl City Polarized Sunglasses - Women's","long_description":"Drawing inspiration from the north shore of Pearl Harbor, The Maui Jim Pearl City polarized sunglasses shield your eyes with comfortable, stylish frames and high-quality optics for all-day clarity. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Maui Jim PolarizedPlus(R)2 technology blocks glare and UV rays from all angles; manages harmful blue light and boosts colors for clarity and contrast. MauiGradient lenses feature a darker coating at the top that gets lighter moving down the lens, allowing appropriate amounts of light to filter through for optimal protection. Gloss Black frames feature neutral gray lenses, ideal for bright, direct sunlight days. Tortoise frames feature HCL(R) Bronze lenses, ideal for variable conditions from sun to overcast. Scratch-reistant glass lenses offer amazing optical clarity. Lightweight nylon frames offer a consistent fit and flexibility at any temperature, and they are extremely durable. Anti-corrosive springs provide flexibility and a secure fit for all face shapes and sizes. The Maui Jim Pearl City polarized sunglasses come with a protective case and cleaning cloth.","short_description":"Drawing inspiration from the north shore of Pearl Harbor, The Maui Jim Pearl City polarized sunglasses shield your eyes with comfortable, stylish frames and high-quality optics for all-day clarity.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423303.png","image_url":"http://i1.avlws.com/115/l423303.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423303&tt=df","keywords":"Cycling","retail_price":"219.00","sale_price":"219.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423303\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423303.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863644&amp;link=&amp;tabs=-Details\"></script>","variants":{"8636440001":{"sku":"8636440001","vendor_sku":"GS214-03A","upc":"603429024833","size":"NEUTRAL GREY","color":"GLOSS BLACK","retail_price":"219.00","sale_price":"219.00"},"8636440002":{"sku":"8636440002","vendor_sku":"HS214-10","upc":"603429024840","size":"HCL BRONZE","color":"TORTOISE","retail_price":"219.00","sale_price":"219.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
