{"sku":"863640","manufacturer_id":"HTS267-10M","brand_name":"Maui Jim","product_name":" Maui Jim Waterways Polarized Sunglasses","long_description":"With a modern take on the classic wayfarer-style frame, the Maui Jim Waterways polarized sunglasses help protect your eyes when you're on the water, at the beach or driving to work. Matte Black rubber frames feature neutral grey lenses, ideal for bright, direct sunlight days. Olive Stripe frames feature Maui HT(TM) high transmission lenses for times when most lenses would be too dark-they offer great contrast and definition. Darker coating at the top gradually gets lighter down the lenses, allowing appropriate amounts of light to filter through for optimal protection. PolarizedPlus(R)2 blocks glare and UV light from all angles while managing harmful blue light and boosting colors for clarity and contrast. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. High-transmission lenses offer sharp contrast, depth of field and vibrant color for early morning, late afternoon and foggy days. SuperThin glass/polycarbonate lenses offer brilliant views and durable, scratch-resistant optical clarity; they're 20% thinner and lighter than standard laminated glass lenses. Lightweight, high-grade injected nylon frames offer a superior fit and flexibility at any temperature. Maui Jim Waterways polarized sunglasses come with a case and soft pouch for cleaning and storage.","short_description":"With a modern take on the classic wayfarer-style frame, the Maui Jim Waterways polarized sunglasses help protect your eyes when you're on the water, at the beach or driving to work.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423291.png","image_url":"http://i1.avlws.com/115/l423291.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423291&tt=df","keywords":"Cycling","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423291\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423291.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863640&amp;link=&amp;tabs=-Details\"></script>","variants":{"8636400001":{"sku":"8636400001","vendor_sku":"HTS267-10M","upc":"603429025205","size":"MAUI HT","color":"OLIVE STRIPE","retail_price":"199.00","sale_price":"199.00"},"8636400002":{"sku":"8636400002","vendor_sku":"GS267-02MR","upc":"603429025182","size":"NEUTRAL GREY","color":"MATTE BLACK RUBBER","retail_price":"199.00","sale_price":"199.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
