{"sku":"863729","manufacturer_id":"PD35L2BK","brand_name":"Fenix","product_name":" Fenix PD35 Flashlight","long_description":"Weighing only 3.7 oz., measuring only 5.5 in. long and boasting a stunning 850-lumen output, the Fenix PD35 flashlight proves that compact size and mighty output are not mutually exclusive. Features 5 brightness levels, including a turbo mode that outputs a stunning 850-lumen beam that shines 185m (606 ft.) to illuminate the darkest forests and trails. High-quality Cree XM-L2 (U2) LED outputs 850 lumens on turbo, 450 lumens on high, 170 lumens on medium, 45 lumens on medium-low and 10 lumens on low. Bright strobe mode comes in handy when you're trying to signal someone or get help; strobe mode outputs 850 lumens. Press the tail cap switch lightly for momentary on or all the way to turn the light on completely; with the flashlight on, press the switch on the side to adjust the output. PD35 remembers the last output level, so the next time you turn it on it starts where you left off. Powered by one rechargeable 18650 (sold separately) or two CR123A batteries (included). Batteries provide 140 hrs. of runtime on low, 29 hrs. on medium-low, 7 hrs. 45 min. on medium, 2 hrs. 30 min. on high and 1 hr. 15 min. on turbo. Regulated output maintains consistent light output over the lifetime of the batteries. Rugged aircraft-grade aluminum body is designed to resist rolling and has a knurled finish for a solid grip. Fenix PD35 flashlight has an IPX8 water resistance rating for protection against prolonged immersion in 2m of water.","short_description":"Weighing only 3.7 oz., measuring only 5.5 in. long and boasting a stunning 850-lumen output, the Fenix PD35 flashlight proves that compact size and mighty output are not mutually exclusive.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416923.png","image_url":"http://i1.avlws.com/115/l416923.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416923&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416923\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416923.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863729&amp;link=&amp;tabs=-Details\"></script>","variants":{"8637290001":{"sku":"8637290001","vendor_sku":"PD35L2BK","color":"BLACK","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
