{"sku":"863766","manufacturer_id":"45870-001","brand_name":"Marmot","product_name":" Marmot Oracle Rain Jacket - Women's - 2013 Closeout","long_description":"Offering waterproof, breathable protection and sporty style, the women's Marmot Oracle Rain Jacket is feature-loaded so you can hike, backpack or climb in wet or iffy weather. Marmot Oracle offers great lightweight coverage and a comfortable fit with durable stretch fabric in key movement areas. MemBrain(R) Strata(TM) 2.5-layer waterproof, breathable laminate reduces internal condensation to effectively increase your comfort range without weighing you down. Durable and fully protective, the Oracle jacket features microstitched and seam-taped seams. Adjustable brimmed storm hood provides unhindered peripheral vision; hood zips off. Soft DriClime(R) lines the collar, cuffs and chin guard for added softness and warmth. PitZips(TM) allow excellent ventilation control. Elastic drawcord hem and rip-and-stick adjustable cuffs. Zippered hand pockets. Articulated elbows on sleeves allow comfortable, unrestricted range of motion. Marmot Oracle Rain Jacket for women is designed to fit over a fleece or soft shell. Closeout.","short_description":"Offering waterproof, breathable protection and sporty style, the women's Marmot Oracle Rain Jacket is feature-loaded so you can hike, backpack or climb in wet or iffy weather.","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Rain Jackets","thumb_url":"http://i1.avlws.com/115/s394039.png","image_url":"http://i1.avlws.com/115/l394039.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=394039&tt=df","keywords":"hardshell","retail_price":"185.00","sale_price":"121.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=394039\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m394039.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863766&amp;link=&amp;tabs=-Details\"></script>","variants":{"8637660003":{"sku":"8637660003","vendor_sku":"45870-001","upc":"486376600035","size":"L","color":"BLACK","retail_price":"121.73","sale_price":"121.73"}}}
