{"sku":"863850","manufacturer_id":"21520-6405","brand_name":"Marmot","product_name":"Marmot Trestles Sleeping Bag - Kids'","long_description":"Camping trips in any weather, including rain, call for the kids' synthetic Marmot Trestles Sleeping Bag. It offers warmth, low bulk and excellent packability, and continues to insulate even if wet. Rated for warmth down to about 30degF, the Marmot Trestles Sleeping Bag is a great choice when introducing your young adventurer to 3 seasons of sleeping under the stars. Synthetic high-loft insulation and wave construction-overlapping shingles of insulation-combine to prevent cold spots. Blend of spiral hollow fibers and polyester fibers provides loft, warmth and compressibility. Polyester shell and lining fabrics are treated with a durable water repellent finish to repel moisture and stains. 3D hood envelops your head in warmth; drawcords around hood allow face muff to be cinched snug without digging into face. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make top opening adjustments easy. 2-way, dual-side zippers-1 full-zip that extends around footbox, 1 partial-zip-allow top of bag to fold back, allowing easy entry. Trapezoid footbox is wide in toe area and narrow at the heels for comfort that does not compromise warmth. Zipper guard along draft tube keeps fabric from snagging in the coils. Stash pocket stows nighttime essentials. The kids' Marmot Trestles Sleeping Bag includes a compression stuff sack.","short_description":"Camping trips in any weather, including rain, call for the kids' synthetic Marmot Trestles Sleeping Bag. It offers warmth, low bulk and excellent packability, and continues to insulate even if wet.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421547.png","image_url":"http://i1.avlws.com/115/l421547.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421547&tt=df","keywords":"compact","retail_price":"79.00","sale_price":"79.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421547\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421547.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863850&amp;link=&amp;tabs=-Details\"></script>","variants":{"8638500001":{"sku":"8638500001","vendor_sku":"21520-2059","upc":"785562425286","size":"Regular","color":"DARK AZURE","retail_price":"79.00","sale_price":"79.00"},"8638500002":{"sku":"8638500002","vendor_sku":"21520-6405","upc":"785562425293","size":"Regular","color":"LIPSTICK","retail_price":"79.00","sale_price":"79.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
