{"sku":"863808","manufacturer_id":"1539851011","brand_name":"Mountain Hardwear","product_name":" Mountain Hardwear Direttissima 50 Pack","long_description":"A choice of guides and serious alpinists, the Mountain Hardwear Direttissima 50 Pack hits the sweet spot with a balance of durability, versatility and light weight for one-day to multiday climbs. The Direttissima 50 transforms for each stage of a climb; start out with full-featured comfort and support, then strip out weight and bulk as the climb becomes more technical. Remove the top lid, framesheet and stay as necessary for mid-mountain climbs between camps; swap the padded hipbelt for a webbing belt for lighter loads and summit bids. HardWave suspension conforms comfortably to the curve of your back and distributes weight evenly but is removable for carrying light loads. Large zippered front pocket and separate, easy-access crampon pocket allow storage of often needed items or tools; pockets maintain volume even when main compartment is full. Removable top lid features 2 compartments for organizing essentials. Multiple lash points and long compression webbing allow for overloading while effectively reducing volume as needed to keep any size load stable. The Mountain Hardwear Direttissima 50 Pack features a tough X-Ply ripstop front panel that offers extreme abrasion resistance and tear strength at an incredibly light weight.","short_description":"A choice of guides and serious alpinists, the Mountain Hardwear Direttissima 50 Pack hits the sweet spot with a balance of durability, versatility and light weight for one-day to multiday climbs.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s450739.png","image_url":"http://i1.avlws.com/115/l450739.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450739&tt=df","keywords":"multiday","retail_price":"240.00","sale_price":"240.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450739\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450739.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=863808&amp;link=&amp;tabs=-Details\"></script>","variants":{"8638080001":{"sku":"8638080001","vendor_sku":"1539851011","upc":"887487428721","size":"S/M","color":"SHARK","retail_price":"240.00","sale_price":"240.00"},"8638080002":{"sku":"8638080002","vendor_sku":"1539851011","upc":"887487428738","size":"M/L","color":"SHARK","retail_price":"240.00","sale_price":"240.00"}}}
