{"sku":"864055","manufacturer_id":"1546062360","brand_name":"Mountain Hardwear","product_name":" Mountain Hardwear Heratio 32 Sleeping Bag - Women's","long_description":"Weighing only 1 lb. 14 oz. and rated to keep you warm to 32degF, the down-filled Mountain Hardwear Heratio 32 Sleeping Bag is a great way to lighten your load on mild-weather backpacking trips. Insulated with lightweight and compressible Q.Shield(TM) 650-fill-power down to keep you warm. Q.Shield advanced water-repellency technology protects individual down fibers from moisture so they retain loft and insulation properties; Q.Shield won't wear off. Women-specific comfort mummy cut efficiently maximizes warmth without constriction, with extra insulation in the torso and foot areas. ThermoTrap Baffle construction locks the down into small chambers for less down migration, an even loft height and consistent wamth. With a European Norm (EN) comfort rating of 32degF, the Heratio 32 is a versatile bag for lightweight adventures in the mountains in summer. Down-filled face gasket comfortably blocks drafts at the hood opening. Insulated draft tube with anti-snag panel prevents cold spots along the zipper. Full-length, 2-way zipper with locking sliders stays in place when the bag is partially unzipped for ventilation. Single-handed drawcords easily adjust hood closure. Mountain Hardwear Heratio 32 Sleeping Bag for women comes with a mesh storage sack and a stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Weighing only 1 lb. 14 oz. and rated to keep you warm to 32degF, the down-filled Mountain Hardwear Heratio 32 Sleeping Bag is a great way to lighten your load on mild-weather backpacking trips.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s442355.png","image_url":"http://i1.avlws.com/115/l442355.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442355&tt=df","keywords":"compact","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442355\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442355.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864055&amp;link=&amp;tabs=-Details\"></script>","variants":{"8640550002":{"sku":"8640550002","vendor_sku":"1546062360","upc":"887487427823","size":"Long Right","color":"ATLANTIS","retail_price":"250.00","sale_price":"250.00"}}}
