{"sku":"864051","manufacturer_id":"1541152372","brand_name":"Mountain Hardwear","product_name":" Mountain Hardwear Ratio 32 Sleeping Bag","long_description":"The Mountain Hardwear Ratio 32 down sleeping bag delivers warmth in the summer and shoulder seasons for backpackers and campers who want to lighten their load with down fill instead of synthetic. Insulated with lightweight and compressible Q.Shield(TM) 650-fill-power down to keep you warm. Q.Shield advance water repellency technology protects individual down fibers from moisture so they retain loft and insulation properties; Q.Shield won't wear off. ThermoTrap Baffle construction locks the down into small chambers for less down migration, an even loft height and consistent wamth. With a lower-limit European Norm (EN) rating of 27degF, the Ratio 32 is a versatile bag for lightweight adventures into the mountains. Comfort mummy cut efficiently maximizes warmth and minimizes weight without constriction. Down-filled face gasket comfortably blocks drafts at the hood opening. Insulated draft tube with anti-snag panel prevents cold spots along the zipper. Full-length, two-way zipper with locking sliders stays in place when the bag is partially unzipped for ventilation. Single-handed drawcords easily adjust hood closure. Mountain Hardwear Ratio 32 sleeping bag comes with a mesh storage sack and a stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The Mountain Hardwear Ratio 32 down sleeping bag delivers warmth in the summer and shoulder seasons for backpackers and campers who want to lighten their load with down fill instead of synthetic.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s442339.png","image_url":"http://i1.avlws.com/115/l442339.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442339&tt=df","keywords":"compact","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442339\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442339.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864051&amp;link=&amp;tabs=-Details\"></script>","variants":{"8640510001":{"sku":"8640510001","vendor_sku":"OU8532-372","upc":"786559072476","size":"Regular Left","color":"SHERWOOD","retail_price":"230.00","sale_price":"230.00"}}}
