{"sku":"864077","manufacturer_id":"21780-6169","brand_name":"Marmot","product_name":" Marmot Always Summer Sleeping Bag","long_description":"Stuffed with quality 650-fill down, the Marmot Always Summer Sleeping Bag is a prime choice for summer slumbers, and it's also warm enough when nighttime temps unexpectedly take a dip. With a European Norm (EN) lower-limit rating of 37degF, the Sawtooth sleeping bag is suitable for mild-weather, 3-season use. 650-fill-power duck down insulation is protected by a durable nylon shell with a water-repellent finish. Down is treated to resist moisture to maintain warmth; treated down stays drier 10 times longer, maintains 150% more loft and dries 30% faster than untreated down. Nautilus 5-baffle hood envelops your head in warmth; face muff allows hood to be cinched snug without chafing your face. Ground-level side seams keep warm air from escaping. No more midnight drawcord fumbling-smooth, flat upper cord and hard, round lower cord make hood adjustments easy. Stretch tricot baffles provide strength and durability for long bag life. Trapezoidal footbox allows down to loft fully around your feet for optimum warmth and comfort. Stash pocket on the top chest near hood stows nighttime essentials. Locking, two-way, snag-free zipper prevents bag from inadvertently opening during the night. Marmot Always Summer Sleeping Bag includes stuff sack and large storage bag. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Stuffed with quality 650-fill down, the Marmot Always Summer Sleeping Bag is a prime choice for summer slumbers, and it's also warm enough when nighttime temps unexpectedly take a dip.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421555.png","image_url":"http://i1.avlws.com/115/l421555.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421555&tt=df","keywords":"compact","retail_price":"209.00","sale_price":"209.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421555\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421555.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864077&amp;link=&amp;tabs=-Details\"></script>","variants":{"8640770001":{"sku":"8640770001","vendor_sku":"21770-6169","upc":"785562485181","size":"Regular Left","color":"CARDINAL/CHILI PEPPER","retail_price":"189.00","sale_price":"189.00"},"8640770002":{"sku":"8640770002","vendor_sku":"21780-6169","upc":"785562485204","size":"Long Left","color":"CARDINAL/CHILI PEPPER","retail_price":"209.00","sale_price":"209.00"}}}
