{"sku":"864086","manufacturer_id":"22330-1468","brand_name":"Marmot","product_name":" Marmot Plasma 15 Sleeping Bag","long_description":"No, you're not dreaming. The Marmot Plasma 15 Sleeping Bag comes in under 2 lbs. (regular length) with 875-fill-power, water-resistant goose down-backpacking season can't get here soon enough! With a European Norm (EN) lower-limit rating of 18degF, the Plasma 15 sleeping bag is suitable for 3-season use and occasional winter outings. Filled with certified, super-lofty, ultralight, 875-fill-power goose down (the largest down cluster with the lowest trace of feather) for an unsurpassed warmth-to weight ratio. Down is treated to resist moisture to maintain warmth; treated down stays drier 10 times longer, maintains 150% more loft and dries 30% faster than untreated down. Pertex(R) Quantum nylon ripstop shell is lightweight, durable and silky soft. Shell is treated with a Durable Water Repellent finish that causes moisture to bead up and roll off. Hood drawcord and insulated collar envelop your head and shoulders in warmth; down gasket face muff lets you cinch the hood snug without it digging into your face. Vertical baffles prevent cold spots by keeping the goose down fully lofted and in place. Down-insulated draft tube backs the two-way, full-length zipper to keep the cold out. Wrap-around footbox construction reduces down compression; Flow design with the classic trapezoidal foot box shape lets feet move freely and keeps down lofted for warmth. Zipper guard runs the entire length of the draft tube to prevent fabric from getting caught in zipper. Marmot Plasma 15 Sleeping Bag features an ultralight stuff sack and storage bag. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"No, you're not dreaming. The Marmot Plasma 15 Sleeping Bag comes in under 2 lbs. (regular length) with 875-fill-power, water-resistant goose down-backpacking season can't get here soon enough!","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421583.png","image_url":"http://i1.avlws.com/115/l421583.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421583&tt=df","keywords":"compact","retail_price":"559.00","sale_price":"559.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421583\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421583.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864086&amp;link=&amp;tabs=-Details\"></script>","variants":{"8640860001":{"sku":"8640860001","vendor_sku":"22320-1468","upc":"785562500679","size":"Regular Left","color":"SLATE GREY/ATOMIC BLUE","retail_price":"539.00","sale_price":"539.00"},"8640860002":{"sku":"8640860002","vendor_sku":"22330-1468","upc":"785562500686","size":"Long Left","color":"SLATE GREY/ATOMIC BLUE","retail_price":"559.00","sale_price":"559.00"}}}
