{"sku":"864142","manufacturer_id":"1541271842","brand_name":"Mountain Hardwear","product_name":"Mountain Hardwear EV 2 Tent","long_description":"Compact, light and strong, the single-wall Mountain Hardwear EV 2 Tent shelters 2 climbers throughout 4 seasons of high-altitude expeditions. Single-wall fabric is waterproof, breathable and fire-retardant. Designed with a trim floor that fits on ledges; its clip setup aids pitching in high wind. 4 welded adjustable vents with mesh and zippers provide versatile ventilation options and frost management. Vestibule area is built into the tent, creating room for boots and other gear near the door. DAC Featherlite(R) poles have a high strength-to-weight ratio and use extrusions instead of inserts to avoid breakage; poles are anodized without the use of harmful acids. Evolution Tension Arch(TM) technology enhances the structural integrity of the tent skeleton without adding poles or heavy wall fabric. Stiff yet light fabric spreads the load-bearing capability of the poles over a wide surface area; ribbed wall fabric adds strength while remaining lightweight. Laminated, non-stretch TXO7 polyurethane reinforcements are light and strong; superlight 1/4 in. buckles and webbing reduce tent weight. 2 clear SVX windows enhance interior brightness and let you look outside to check on the weather. Welded zipper flap construction saves weight and stays drier than a sewn flap; reflective zipper pulls enhance nighttime visibility. The Mountain Hardwear EV 2 Tent has a watertight snow port in its floor that provides an exit point for accumulated frost/snow.","short_description":"Compact, light and strong, the single-wall Mountain Hardwear EV 2 Tent shelters 2 climbers throughout 4 seasons of high-altitude expeditions.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s446939.png","image_url":"http://i1.avlws.com/115/l446939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=446939&tt=df","retail_price":"700.00","sale_price":"700.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=446939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m446939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864142&amp;link=&amp;tabs=-Details\"></script>","variants":{"8641420001":{"sku":"8641420001","vendor_sku":"1541271842","upc":"887487428387","color":"STATE ORANGE","retail_price":"700.00","sale_price":"700.00"}},"categories":["camping-hiking","tents","backpacking-tents"]}
