{"sku":"864147","manufacturer_id":"1541301842","brand_name":"Mountain Hardwear","product_name":" Mountain Hardwear Trango 4 Tent","long_description":"The Mountain Hardwear Trango 4 Tent is designed for winter mountaineering. It's built strong and engineered to shelter 4 climbers in tough alpine conditions. 2 mesh/fabric doors provide easy entry and exit; large vestibule provides work-worthy space while smaller vestibule is handy for access, overflow storage and vent manipulation. Stiff but light fabric spreads the load-bearing capability of the poles over a wide surface area; ribbed wall fabric adds strength while remaining lightweight. DAC Featherlite(R) poles have a high strength-to-weight ratio and use extrusions instead of inserts to avoid breakage; poles are anodized without the use of harmful acids. Fully taped fly, taped perimeter seams, welded corners and welded guy clip anchors create a watertight shelter; mesh/fabric zippered through-vent ensures good air circulation. 2 clear SVX windows are placed correctly to check the weather; bright tent color fends off depression while you wait for the weather to improve. Catenary-cut seams create a taut canopy and rainfly for improved strength; dry-entry front vestibule with snow flaps prevents water from dripping in when the vestibule is open. Expedition bathtub-style nylon floor features a polyurethane coating and durable water repellent finish for waterproofness and durability. DirectConnect point secures tent body, frame and fly at each guy out point for a solid connection between all 3 components. Poles are color coded to the bar tacks in the webbing of the grommet tabs; reflective starter points make it easy to set up in low light. Internal guy system provides additional rigidity to the structure by creating resistance to the flexing or deformation of the frame. Superlight buckles and webbing save weight; canopy storage pockets help keep your tent organized.","short_description":"The Mountain Hardwear Trango 4 Tent is designed for winter mountaineering. It's built strong and engineered to shelter 4 climbers in tough alpine conditions.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424071.png","image_url":"http://i1.avlws.com/115/l424071.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424071&tt=df","retail_price":"800.00","sale_price":"800.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424071\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424071.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864147&amp;link=&amp;tabs=-Details\"></script>","variants":{"8641470001":{"sku":"8641470001","vendor_sku":"1541301842","upc":"887487428462","color":"STATE ORANGE","retail_price":"800.00","sale_price":"800.00"}},"categories":["camping-hiking","tents","backpacking-tents"]}
