{"sku":"864246","manufacturer_id":"1070306531","brand_name":"Tifosi","product_name":" Tifosi Podium XC Fototec Photochromic Sunglasses - Men's","long_description":"The Tifosi Podium XC Fototec Photochromic Sunglasses ensure clear vision during muscle-powered adventures, from dawn runs to cycling in the glaring sun. Fototec lenses automatically adjust tint according to light conditions; lenses darken in bright light and lighten in dim conditions. Lightweight and virtually shatterproof, polycarbonate lenses are 20 times more impact resistant than glass and one-third the weight. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Rubber nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather; nosepiece is easily removed for swapping lenses. Ventilated lenses increase airflow to eliminate fogging. Interchangeable design allows you to swap out lenses with compatible Tifosi interchangeable lenses (not included). Tifosi Podium XC Photochromic Sunglasses fit small to medium profiles. Glasses come with a semirigid carrying case and cleaning cloth.","short_description":"The Tifosi Podium XC Fototec Photochromic Sunglasses ensure clear vision during muscle-powered adventures, from dawn runs to cycling in the glaring sun.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423319.png","image_url":"http://i1.avlws.com/115/l423319.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423319&tt=df","keywords":"Cycling","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423319\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423319.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864246&amp;link=&amp;tabs=-Details\"></script>","variants":{"8642460001":{"sku":"8642460001","vendor_sku":"1070306531","upc":"848869003592","size":"LIGHT NIGHT FOTOTEC","color":"SILVER","retail_price":"79.95","sale_price":"79.95"}}}
