{"sku":"864329","manufacturer_id":"APPCGYMVT","brand_name":"Smith","product_name":" Smith Approach Interchangeable Sunglasses - Women's","long_description":"A do-it-all pair of shades for women, the Smith Approach interchangeable sunglasses offer a set of lenses for any light level you might encounter when running, riding, hiking or paddling. Violet frames feature platinum (gray-tinted) lenses to reduce glare while preserving true color definition in very bright light. Frames include two additional sets of lenses: Ignitor (red-tinted) for optimal depth perception in medium light/overcast conditions and clear for dim light. Frames are made from a bio-plastic derived from non-GMO castor seeds and lightweight nylon for a resilient, consistent fit. Scratch- and impact-resistant Carbonic lenses use Smith Tapered Lens Technology(TM) to provide distortion-free vision. Tapered Lens Technology progressively tapers the lens so that light travels through without distortion-what you see is what you get. Hydrophilic Megol(TM) nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. Smith Approach interchangeable sunglasses for women have a medium fit with medium coverage.","short_description":"A do-it-all pair of shades for women, the Smith Approach interchangeable sunglasses offer a set of lenses for any light level you might encounter when running, riding, hiking or paddling.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423375.png","image_url":"http://i1.avlws.com/115/l423375.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423375&tt=df","keywords":"Cycling","retail_price":"159.00","sale_price":"159.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423375\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423375.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864329&amp;link=&amp;tabs=-Details\"></script>","variants":{"8643290001":{"sku":"8643290001","vendor_sku":"APPCGYMVT","upc":"715757420734","size":"PLATINUM","color":"VIOLET","retail_price":"159.00","sale_price":"159.00"}}}
