{"sku":"864321","manufacturer_id":"VNPCGYMSP","brand_name":"Smith","product_name":"Smith Pivlock V90 Interchangeable Sunglasses - Women's","long_description":"With a simple system to swap out lenses, the women's Smith PivLock V90 interchangeable sunglasses offer lightweight, rimless coverage for active sports and extra lenses for any time of day. Ideal for very bright light, Platinum (gray-tinted) lenses reduce visible light and glare while preserving natural color definition. Frames include 2 additional sets of lenses: photochromic Ignitor (red-tinted) for optimal depth perception in medium light/overcast conditions and clear for dim light. With the PivLock interchangeable system, simply rotate temple pieces up 45deg and remove from lens; to remove nosepiece, grasp lens and pull piece away. Scratch- and impact-resistant polycarbonate lenses use Smith Tapered Lens Technology(TM); the lens is progressively tapered so that light travels through without distortion. Permanent lens coating repels moisture, grease and grime to keep your vision clear. Frames are made from a bio-plastic derived from non-GMO castor seeds and lightweight nylon for a resilient, consistent fit. Hydrophilic temple and nose pads become tackier when wet for reliable grip during exercise and hot weather; slide-on temple tips. Adjustable nose bridge lets you customize the fit for narrow, medium or wide bridges. Smith PivLock V2 interchangeable sunglasses offer a small-medium fit with medium lense coverage, and they include a protective case.","short_description":"With a simple system to swap out lenses, the women's Smith PivLock V90 interchangeable sunglasses offer lightweight, rimless coverage for active sports and extra lenses for any time of day.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s460067.png","image_url":"http://i1.avlws.com/115/l460067.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460067&tt=df","keywords":"Cycling","retail_price":"139.00","sale_price":"139.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460067\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460067.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864321&amp;link=&amp;tabs=-Details\"></script>","variants":{"8643210001":{"sku":"8643210001","vendor_sku":"VNPCGYMSP","upc":"715757420956","size":"PLATINUM","color":"SUGAR PLUM","retail_price":"139.00","sale_price":"139.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
