{"sku":"864317","manufacturer_id":"APPCGNMWT","brand_name":"Smith","product_name":" Smith Approach Interchangeable Sunglasses - Men's","long_description":"A do-it-all pair of shades for running, riding or hiking, the Smith Approach interchangeable sunglasses include additional lenses for any light level you might encounter. Each frame includes 1 set of lenses (tint depends on frame color) and 2 additional sets of lenses for a total of 3 sets of lenses. White frames feature Green Mirror (gray-tinted) lenses; Black frames include Red Mirror (gray-tinted) lenses. Both Green Mirror and Red Mirror lenses allow objects to be seen in their most natural state without color distortion in bright light. Frames include 2 additional sets of lenses: Ignitor (red-tinted) for optimal depth perception in medium light/overcast conditions and clear for dim light. Frames are made from a bio-plastic derived from non-GMO castor seeds and lightweight nylon for a resilient, consistent fit. Scratch- and impact-resistant Carbonic lenses use Smith Tapered Lens Technology(TM) to provide distortion-free vision. Tapered Lens Technology progressively tapers the lens so that light travels through without distortion-what you see is what you get. Hydrophilic Megol(TM) nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. Smith Approach Max interchangeable sunglasses have a medium fit with extra-large lenses for greater coverage. A do-it-all pair of shades for running, riding or hiking, the Smith Approach Max interchangeable sunglasses offer maximum coverage and a set of lenses for any light level. Each frame includes 1 set of lenses (tint depends on frame color) and 2 additional sets of lenses for a total of 3 sets of lenses. White frames feature Green Mirror (gray-tinted) lenses that allow objects to be seen in their most natural state without color distortion in bright light. Black frames include Red Mirror (gray-tinted) lenses that allow objects to be seen in their most natural state without color distortion in bright light.","short_description":"A do-it-all pair of shades for running, riding or hiking, the Smith Approach interchangeable sunglasses include additional lenses for any light level you might encounter.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423355.png","image_url":"http://i1.avlws.com/115/l423355.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423355&tt=df","keywords":"Cycling","retail_price":"159.00","sale_price":"159.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423355\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423355.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864317&amp;link=&amp;tabs=-Details\"></script>","variants":{"8643170001":{"sku":"8643170001","vendor_sku":"APPCDMBK","upc":"715757420703","size":"RED MIRROR","color":"BLACK","retail_price":"159.00","sale_price":"159.00"},"8643170002":{"sku":"8643170002","vendor_sku":"APPCGNMWT","upc":"715757420741","size":"GREEN MIRROR","color":"WHITE","retail_price":"159.00","sale_price":"159.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
