{"sku":"864320","manufacturer_id":"VWNXBOIB","brand_name":"Smith","product_name":" Smith PivLock V2 Interchangeable Sunglasses - Men's","long_description":"The rimless Smith PivLock V2 interchangeable sunglasses feature lightweight, interchangeable lenses that let you adapt to changing light conditions during your active sports. Ideal for very bright light, Blackout (gray-tinted) lenses allow you to see objects without color distortion. Frames include 2 additional sets of lenses: photochromic Ignitor (red-tinted) for medium light/overcast conditions and clear for dim light. Photochromic Ignitor lenses automatically adjust tint according to light conditions, and eliminate glare and enhance contrast while maintaining accuracy of color. With the PivLock interchangeable system, simply rotate temple pieces up 45deg and remove from lens; to remove nosepiece, grasp lens and pull piece away. Scratch- and impact-resistant polycarbonate lenses use Smith Tapered Lens Technology(TM); the lens is progressively tapered so that light travels through without distortion. Permanent lens coating repels moisture, grease and grime to keep your vision clear. Frames are made from a bio-plastic derived from non-GMO castor seeds and lightweight nylon for a resilient, consistent fit. Hydrophilic temple and nose pads become tackier when wet for reliable grip during exercise and hot weather; slide-on temple tips. Adjustable nose bridge lets you customize the fit for narrow, medium or wide bridges. Smith PivLock V2 interchangeable sunglasses are medium-sized with wrap-around coverage, and include a protective case.","short_description":"The rimless Smith PivLock V2 interchangeable sunglasses feature lightweight, interchangeable lenses that let you adapt to changing light conditions during your active sports.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423363.png","image_url":"http://i1.avlws.com/115/l423363.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423363&tt=df","keywords":"Cycling","retail_price":"239.00","sale_price":"239.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423363\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423363.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864320&amp;link=&amp;tabs=-Details\"></script>","variants":{"8643200001":{"sku":"8643200001","vendor_sku":"VWNXBOIB","upc":"715757414245","size":"BLACKOUT","color":"IMPOSSIBLY BLACK","retail_price":"239.00","sale_price":"239.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
