{"sku":"864426","manufacturer_id":"11879","brand_name":"Rei","product_name":" REI Arctic Pod +20 Sleeping Bag - Long - Special Buy","long_description":"First time sleeping under the stars? Make a sound investment with the REI Arctic Pod 20 synthetic sleeping bag in a long length. It's feature-packed, built to last and priced for your budget. Synthetic hollow-fiber insulation retains heat while providing loft and some compressibility; construction eliminates cold spots. Equally distributed insulation all the way around the bag accommodates the multiposition sleeper. Relaxed fit from the shoulders to the hips increases comfort by providing ample space to move around. Ripstop nylon shell resists water and abrasion; smooth nylon taffeta lining is comfortable against your skin. Shell fabric is treated with a durable water repellent finish to repel moisture and stains. Contoured hood, insulated full-face muffler, full draft collar and full-length draft tube with ground-level seams keep body heat in and cold air out. Pillow pocket keeps camp pillow in place; stuff clothing inside pocket if you don't have a pillow. The REI Arctic Pod long sleeping bag has an external chest pocket that stows your watch, glasses or other small essentials. Differentiated drawcords (1 round, 1 flat) let you adjust hood and neck easily in the dark. Full-length of zipper is backed by wide, antisnag binding tape. Any REI backpacking bag can be zipped to any other REI backpacking bag because of the consistent 63 in., No. 5, YKK zipper; women's bags zip on the right, men's on the left. Pad loops provide attachment points to keep your sleeping bag and pad together to avoid rolling off onto the cold ground (straps and sleeping pad not included). European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags. The REI Arctic Pod 20 Long Sleeping Bag includes stuff sack and storage bag. Special buy.","short_description":"First time sleeping under the stars? Make a sound investment with the REI Arctic Pod 20 synthetic sleeping bag in a long length. It's feature-packed, built to last and priced for your budget.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421631.png","image_url":"http://i1.avlws.com/115/l421631.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421631&tt=df","keywords":"compact","retail_price":"109.00","sale_price":"75.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421631\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421631.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864426&amp;link=&amp;tabs=-Details\"></script>","variants":{"8644260001":{"sku":"8644260001","vendor_sku":"11879","upc":"486442600013","size":"Long Left","color":"DEEP RED/BLACK","retail_price":"75.73","sale_price":"75.73"}}}
