{"sku":"864546","manufacturer_id":"A1Q5L0C","brand_name":"The North Face","product_name":" The North Face Blue Kazoo Sleeping Bag","long_description":"Get a good night's rest after a full day on the trail with the Blue Kazoo Sleeping Bag from The North Face. The lofty 650-fill goose down will keep you warm throughout spring, summer and fall. With a European Norm (EN) lower-limit rating of 15degF, the Blue Kazoo is a versatile bag for 3-season backpacking and climbing adventures. Lofty 650-fill-power ProDown(TM) natural goose down insulation keeps the overall weight of the bag down while providing great warmth. ProDown(TM) is enhanced with a hydrophobic finish that improves warmth by allowing it to dry faster and repel moisture up to 10x longer than untreated. Trapezoidal side baffles trap insulation and prevent it from shifting to ensure a constant baffle volume and help prevent cold spots. Ergonomically shaped Climashield(R) Prism synthetic insulation pads on the bottom create a compression-resistant, insulating buffer between you and the ground. Anti-compression pads made from Heatseeker(TM) Eco synthetic insulation are sewn into high-pressure areas that contact the ground to create an insulating buffer. Shaped hood and down-insulated draft collar hold in warmth. Insulated draft tube backs the zipper to prevent warm air from escaping; antisnag tape keeps the zipper from catching on the draft tube. Full-length, 2-way zipper lets you make adjustments for ventilation. Footbox allows natural foot movement while also eliminating excess lateral space so you stay warm and comfortable all night long. The North Face Blue Kazoo Sleeping Bag comes with a compression stuff sack and a storage sack. Pad loops give you a way to attach the sleeping bag to your sleeping pad (sleeping pad and attachment straps not included). European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Get a good night's rest after a full day on the trail with the Blue Kazoo Sleeping Bag from The North Face. The lofty 650-fill goose down will keep you warm throughout spring, summer and fall.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421671.png","image_url":"http://i1.avlws.com/115/l421671.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421671&tt=df","keywords":"compact","retail_price":"289.00","sale_price":"289.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421671\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421671.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864546&amp;link=&amp;tabs=-Details\"></script>","variants":{"8645460001":{"sku":"8645460001","vendor_sku":"A1Q5L0C","upc":"715752273939","size":"Regular Left","color":"HONOR BLUE/ASPHALT GREY","retail_price":"279.00","sale_price":"279.00"},"8645460002":{"sku":"8645460002","vendor_sku":"A1Q5L0C","upc":"715752273915","size":"Long Left","color":"HONOR BLUE/ASPHALT GREY","retail_price":"289.00","sale_price":"289.00"}}}
