{"sku":"864550","manufacturer_id":"A2Z3M5P","brand_name":"The North Face","product_name":"The North Face Cat's Meow Sleeping Bag - Women's","long_description":"The North Face Cat's Meow Sleeping Bag for women meets the needs of 3-season backpackers and mountaineers looking to save a little weight and gain a cozy night's sleep when temps dip below freezing. With a European Norm (EN) comfort rating of 21degF, the women's Cat's Meow is a versatile bag for 3-season backpacking adventures, and occasional winter outings. Heatseeker(TM) Pro synthetic insulation is warm, light and compressible; synthetic insulation continues to insulate well even when damp. Shaped hood and down-insulated draft collar hold in warmth; internal handwarmer pockets help keep your fingers toasty while you sleep. Insulated draft tube backs the zipper to prevent warm air from escaping; antisnag tape keeps the zipper from catching on the draft tube. Full-length, 2-way zipper lets you make adjustments for ventilation. Footbox allows natural foot movement while also eliminating excess lateral space so you stay warm and comfortable all night long. Pad loops give you a way to attach the sleeping bag to your sleeping pad (sleeping pad and attachment straps not included). The North Face Cat's Meow Sleeping Bag comes with a compression stuff sack and a storage bag. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The North Face Cat's Meow Sleeping Bag for women meets the needs of 3-season backpackers and mountaineers looking to save a little weight and gain a cozy night's sleep when temps dip below freezing.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421687.png","image_url":"http://i1.avlws.com/115/l421687.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421687&tt=df","keywords":"compact","retail_price":"179.00","sale_price":"179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421687\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421687.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864550&amp;link=&amp;tabs=-Details\"></script>","variants":{"8645500001":{"sku":"8645500001","vendor_sku":"A2Z3M5P","upc":"715752283532","size":"Regular Right","color":"CAPRI BREEZE BLUE/ZINC GR","retail_price":"169.00","sale_price":"169.00"},"8645500002":{"sku":"8645500002","vendor_sku":"A2Z3M5P","upc":"715752283549","size":"Long Right","color":"CAPRI BREEZE BLUE/ZINC GR","retail_price":"179.00","sale_price":"179.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
