{"sku":"864547","manufacturer_id":"A1Q8L6D","brand_name":"The North Face","product_name":" The North Face Furnace 5 Sleeping Bag","long_description":"Warm enough for winter, the down-insulated Furnace 5 Sleeping Bag from The North Face has a less-tapered cut than a standard backpacking bag, giving you more room to relax on your adventures. With a European Norm (EN) lower-limit rating of 9degF, the Furnace 5 is a versatile bag for year-round backpacking adventures when temps dip into the single digits. 550-fill-power ProDown(TM) natural goose down insulation is light and lofty. ProDown(TM) is enhanced with a hydrophobic finish that improves warmth by allowing it to dry faster and repel moisture up to 10 times longer than untreated down. Anti-compression pads made from Heatseeker(TM) Eco synthetic insulation are sewn into high-pressure areas that contact the ground to create an insulating buffer. Shaped hood and down-insulated draft collar hold in warmth. Insulated draft tube backs the zipper to prevent warm air from escaping; antisnag tape keeps the zipper from catching on the draft tube. 3/4-length, 2-way zipper lets you make adjustments for ventilation. Comfort-oriented shape has a less-tapered cut than some backpacking sleeping bags, allowing you more room to move around. Footbox allows natural foot movement while also eliminating excess lateral space so you stay warm and comfortable all night long. The North Face Furnace 5 Sleeping Bag comes with a compression stuff sack and a storage sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"Warm enough for winter, the down-insulated Furnace 5 Sleeping Bag from The North Face has a less-tapered cut than a standard backpacking bag, giving you more room to relax on your adventures.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421675.png","image_url":"http://i1.avlws.com/115/l421675.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421675&tt=df","keywords":"compact","retail_price":"219.00","sale_price":"219.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421675\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421675.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864547&amp;link=&amp;tabs=-Details\"></script>","variants":{"8645470001":{"sku":"8645470001","vendor_sku":"A1Q8L6D","upc":"715752282436","size":"Regular Left","color":"SCALLION GREEN/ASPHALT GR","retail_price":"209.00","sale_price":"209.00"},"8645470002":{"sku":"8645470002","vendor_sku":"A1Q8L6D","upc":"715752282467","size":"Long Left","color":"SCALLION GREEN/ASPHALT GR","retail_price":"219.00","sale_price":"219.00"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
