{"sku":"864540","manufacturer_id":"A3A0M8R","brand_name":"The North Face","product_name":" The North Face Aleutian 20 Sleeping Bag","long_description":"The synthetic Aleutian 20 Sleeping Bag from The North Face is cut to be roomy and unzips flat for excellent comfort on your mountain explorations throughout spring, summer and fall. With a European Norm (EN) lower-limit rating of 15degF, the Aleutian 20 is a versatile bag for 3-season backpacking adventures when temps might dip below freezing. Heatseeker(TM) Eco insulation offers a great warmth-to-weight ratio, is highly compressible and extremely durable; made with 30% post-consumer recycled material. Full-length zipper wraps all the way around the footbox so you can unzip and use the sleeping bag as a blanket. Unzip the short zipper opposite the full-length zipper so you can fold the front of the sleeping bag down like you would with a comforter at home. Roomy, comfort-oriented cut gives you ample space to move around. Full-length draft tube backing the zipper keeps the warmth in and the cold out; draft collar limits heat loss. Vaulted footbox allows natural foot movement and eliminates excess lateral space, increasing thermal efficiency to keep your feet warm and comfortable. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The synthetic Aleutian 20 Sleeping Bag from The North Face is cut to be roomy and unzips flat for excellent comfort on your mountain explorations throughout spring, summer and fall.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421647.png","image_url":"http://i1.avlws.com/115/l421647.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421647&tt=df","keywords":"compact","retail_price":"119.00","sale_price":"119.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421647\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421647.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864540&amp;link=&amp;tabs=-Details\"></script>","variants":{"8645400002":{"sku":"8645400002","vendor_sku":"A3A0M8R","upc":"715752283792","size":"Long Left","color":"STRIKER BLUE/ZINC GREY","retail_price":"119.00","sale_price":"119.00"}}}
