{"sku":"864664","manufacturer_id":"1RR000100","brand_name":"Tomtom","product_name":"TomTom Runner GPS Fitness Monitor","long_description":"See more and achieve more with the TomTom Runner GPS fitness monitor. See your detailed metrics at a glance to stay motivated and reach your running goals. Extra-large display with full-screen graphics lets you see your key running stats at-a-glance; view distance, run time and pace on a high-resolution and high-contrast display. Navigate easily through menus with the intuitive one-button control. View your training performance at-a-glance with three training modes: Race, Goal and Zone. Race mode compares your current run with past performances; Goal mode helps you stay on track to achieve your goals; Zone mode helps you stay in the right training zone. Note: Zone mode requires optional heart rate monitor accessory (not included). Run anytime, anywhere with an indoor/treadmill tracker, all-weather, waterproof construction and up to 10 hours of battery life in GPS mode. Designed specifically for runners, the TomTom Runner GPS fitness monitor features an ultra-slim design, super-tough display, vibration alerts and QuickGPSFix technology. Multi-platform compatibility lets you sync, analyze and share your stats on popular running sites or apps; upload information about your runs to track against your goals. TomTom Runner GPS fitness monitor comes with a desk dock and documentation.","short_description":"See more and achieve more with the TomTom Runner GPS fitness monitor. See your detailed metrics at a glance to stay motivated and reach your running goals.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413575.png","image_url":"http://i1.avlws.com/115/l413575.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413575&tt=df","keywords":"odometer,waterproof","retail_price":"169.95","sale_price":"169.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413575\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413575.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864664&amp;link=&amp;tabs=-Details\"></script>","variants":{"8646640001":{"sku":"8646640001","vendor_sku":"1RR000100","upc":"636926063616","color":"DARK GREY","retail_price":"169.95","sale_price":"169.95"}},"categories":["camping-hiking","camp-electronics","watches"]}
