{"sku":"864662","manufacturer_id":"1RS000102","brand_name":"Tomtom","product_name":"TomTom Multisport GPS Heart Rate Monitor Bundle","long_description":"The TomTom Multi-Sport GPS heart rate monitor bundle lets you track, analyze and share your running, cycling and swimming metrics to help you stay motivated and reach your training goals. Bundle includes a Bluetooth(R) heart rate sensor and chest strap, cadence/speed sensor, altimeter and bike mount. Cadence/speed sensor mounts easily on your bike to measure pedal strokes; barometric altimeter accurately tracks your elevation, ascent, descent and grade. Extra-large, durable and scratch-resistant display with high-resolution, high-contrast graphics lets you read your key training stats at a glance; view distance, time and pace. Navigate easily through menus with the intuitive one-button control. Stay focused on your activity with vibration alerts; hear beeps and feel vibrations to get milestone, lap and interval alerts, even when listening to music. When running, track time, distance and pace outdoors or on a treadmill. When biking, the handlebar mount keeps your speed and distance in view, front-and-center. Track your swimming efficiency, strokes, stroke type, lengths, distance and speed, indoors and out. Three unique graphical training modes include Race, Goal and Zone. Race mode compares your current run with past performances; Goal mode helps you stay on track to achieve your goals; Zone mode helps you stay in the right training zone. Train anytime, anywhere with all-weather, waterproof construction, an indoor/treadmill tracker and up to 10 hours of battery life in GPS mode. QuickGPSFix technology helps your watch connect with GPS satellites and find your precise location quickly so you can start your activity. Multi-platform compatibility lets you sync, analyze and share your stats on popular running sites or apps; upload information about your runs to track against your goals. Light, ultra-slim design and comfortable strap fits all wrist sizes.","short_description":"The TomTom Multi-Sport GPS heart rate monitor bundle lets you track, analyze and share your running, cycling and swimming metrics to help you stay motivated and reach your training goals.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s448003.png","image_url":"http://i1.avlws.com/115/l448003.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448003&tt=df","keywords":"waterproof,odometer","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448003\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448003.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864662&amp;link=&amp;tabs=-Details\"></script>","variants":{"8646620001":{"sku":"8646620001","vendor_sku":"1RS000102","upc":"636926063661","color":"DARK GREY","retail_price":"299.95","sale_price":"299.95"}},"categories":["camping-hiking","camp-electronics","watches"]}
