{"sku":"864605","manufacturer_id":"CM2406MD01","brand_name":"Cannondale","product_name":" Cannondale Trigger 29er Alloy 4 Bike - 2014","long_description":"A full-suspension 29er with a unique rear shock that adjusts to both climbs and descents, the Cannondale Trigger 29er Alloy 4 mountain bike offers plush handling and serious stoke to dedicated riders. Fox DYAD RT2 rear shock offers 80mm of travel for bumpy climbs and 130mm of bottomless confidence on flowing descents with two separate modes. Switching between the modes also slightly changes the geometry of the bike, giving you a forward and agile angle for climbs and a low, slack and stable position for descents. RockShox Revelation RL 29er fork offers 130mm of smooth, responsive travel and precise handling; easy-access lockout and rebound controls are glove-friendly. Plus, Revelation's Motion Control damping senses when to flow and when to lock; tunable to user's desired level of efficiency. Very lightweight aluminum frame features a race-ready, agile design and plenty of stiffness for a responsive ride; super-stiff seatstays and chainstays minimize flex. Oversize 1.5 in. headtube enhances strength, rigidity and steering precision. Shimano Deore Hollowtech II crankset is paired with SLX shifters, a Deore rear derailleur and SLX front derailleur to make up a 3x10 drivetrain with 30 gears. BB30 bottom bracket design increases stiffness for improved power-transfer. Shimano hydraulic disc brakes supply easy speed management with a 180mm rotor up front, 160mm in the back. WTB rims are outfitted with fast-rolling and versatile WTB Wolverine tires for confident trail handling and traction. Specs on the Cannondale Trigger 29er Alloy 4 mountain bike are subject to change.","short_description":"A full-suspension 29er with a unique rear shock that adjusts to both climbs and descents, the Cannondale Trigger 29er Alloy 4 mountain bike offers plush handling and serious stoke to dedicated riders.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374915.png","image_url":"http://i1.avlws.com/115/l374915.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374915&tt=df","retail_price":"3199.00","sale_price":"3199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374915\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374915.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864605&amp;link=&amp;tabs=-Details\"></script>","variants":{"8646050002":{"sku":"8646050002","vendor_sku":"CM2406MD01","upc":"884603518366","size":"M","color":"JET BLACK/ULTRA BLUE","retail_price":"3199.00","sale_price":"3199.00"}}}
