{"sku":"864668","manufacturer_id":"014644-512","brand_name":"Osprey","product_name":"Osprey Talon 44 Pack","long_description":"The updated Osprey Talon 44 pack adds a lighter harness and more comfortable back panel to an already popular design. It's perfect for day hikes, light overnight backpacking and minimalist thru-hikes. Lightweight Osprey AirScape(TM) back panel features molded foam ridges with air channels and a vertical \"air chimney\" covered in soft, airy mesh for ventilation and comfort. Mesh-covered, die-cut slotted foam BioStretch(TM) shoulder straps and hipbelt offer light and breathable comfort; hipbelt tightens with easy ErgoPull(TM) closure. Harness accommodates a variety of back lengths with an adjustable torso: just rip it, adjust it and stick it. Peripheral aluminum frame adds structure support and effectively shifts load weight to your hips. Top-loading main compartment holds lunch, an extra layer of clothes and tools; lower sleeping bag compartment features separate zippered access. Removable top lid contains a zippered top pocket and mesh under-lid pocket. Hydration compartment opens between the torso adjustment and main pack compartment, making it easily accessible from the outside (reservoir sold separately). Front stretch pocket stashes a jacket, helmet, book or other often-used gear. Two zippered stretch mesh pockets on the hipbelt keep a compact digital camera or snacks at your fingertips. Stretch pockets on the shoulder straps stow a cell phone or GPS, or conveniently secure the end of your hydration tube. The Osprey Talon 44 pack features a rope-carry strap under the top lid, ice-axe attachment points, tow loop and a blinker patch (blinker light sold separately).","short_description":"The updated Osprey Talon 44 pack adds a lighter harness and more comfortable back panel to an already popular design. It's perfect for day hikes, light overnight backpacking and minimalist thru-hikes.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410859.png","image_url":"http://i1.avlws.com/115/l410859.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410859&tt=df","keywords":"multiday","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410859\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410859.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864668&amp;link=&amp;tabs=-Details\"></script>","variants":{"8646680001":{"sku":"8646680001","vendor_sku":"014644-628-1-S/","upc":"877257031886","size":"S/M","color":"AVATAR BLUE","retail_price":"149.95","sale_price":"149.95"},"8646680002":{"sku":"8646680002","vendor_sku":"014644-628-2-M/","upc":"877257031893","size":"M/L","color":"AVATAR BLUE","retail_price":"149.95","sale_price":"149.95"},"8646680005":{"sku":"8646680005","vendor_sku":"014644-512","upc":"877257031862","size":"S/M","color":"ONYX BLACK","retail_price":"149.95","sale_price":"149.95"},"8646680006":{"sku":"8646680006","vendor_sku":"014644-512","upc":"877257031879","size":"M/L","color":"ONYX BLACK","retail_price":"149.95","sale_price":"149.95"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
