{"sku":"864746","manufacturer_id":"OO9171-19","brand_name":"Oakley","product_name":"Oakley Racing Jacket Interchangeable Sunglasses - Men's","long_description":"Your active life in the fast lane deserves the optical quality, aerodynamic style, easily interchangeable lenses and wrap-around protection of the Oakley Racing Jacket sunglasses. Designed for easy lens swapping, Switchlock(TM) lens removal system relieves distortion-causing frame pressure by allowing the bottom part of the frame to pivot open. Quick-release removal system minimizes lens handling, so dirty fingers needn't touch lenses; cam lock frame closure securely holds lenses in place. Optically correct, shatterproof and scratch-resistant polycarbonate lenses are made for lasting use. Matte White frames feature Jade Iridium(R) lenses for medium to bright light; includes a second set of amber lenses for flat/low light. Polished Black and Black/White Ghost frames feature gray-tint Black Iridium lenses for medium-bright light and blocking water glare; second set of amber lenses included. Reflective Iridium coating enhances optical clarity and contrast, and reduces glare in varying light. Unique three-point fit includes optical alignment for sharp accurate vision, impact absorption for improved safety and geometry that extends the peripheral view. Nose pads and stem sleeves are made from hydrophilic rubber that increases in tackiness as you perspire, holding eyewear in place as you move. Lightweight, flexible nylon frames resist damaging stresses. To preserve the superior optical quality, sunglasses come with a specially woven, electrostatic bag for cleaning and storage. Removable retaining strap.","short_description":"Your active life in the fast lane deserves the optical quality, aerodynamic style, easily interchangeable lenses and wrap-around protection of the Oakley Racing Jacket sunglasses.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423387.png","image_url":"http://i1.avlws.com/115/l423387.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423387&tt=df","keywords":"Cycling","retail_price":"220.00","sale_price":"220.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423387\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423387.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864746&amp;link=&amp;tabs=-Details\"></script>","variants":{"8647460001":{"sku":"8647460001","vendor_sku":"OO9171-16","upc":"700285794730","size":"BLACK IRIDIUM/VR28","color":"BLACK/WHITE GHOST TEXT","retail_price":"220.00","sale_price":"220.00"},"8647460003":{"sku":"8647460003","vendor_sku":"OO9171-19","upc":"700285837147","size":"BLACK IRIDIUM/P42","color":"POLISHED BLACK","retail_price":"220.00","sale_price":"220.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
