{"sku":"864756","manufacturer_id":"TDX-1300","brand_name":"Cygolite","product_name":" CygoLite TridenX 1300 OSP Front Bike Light","long_description":"A lightweight, very bright bike light for high-performance riding at night, the CygoLite TridenX 1300 OSP bike light supplies 1,300 lumens of bright illumination in a sleek, compact design. 3 superbright Cree LEDs use CrossFire(TM) projection, which crosses the beams for good ground coverage and downrange visibility. OSP (On-Site Programmable) technology means you can set brightness levels and customize light flash speeds to suit your needs; all with the push of the button while riding. 4 total brightness and 4 special settings: boost, high, medium and low along with SteadyPulse(TM), day flash, slow flash and walking. SteadyPulse illumination mode combines steady brightness with an alerting flash, letting you see what's ahead of you while also letting others know you're present. Water-resistant aluminum casing and waterproof seals protect the light from mud, moisture and corrosion. Illuminated display indicates which light setting is in use and a battery indicator displays 3 levels of remaining power; buttons are on top of light for quick and easy use. Slim, rechargeable lithium ion battery lasts 1 hr. 40 min. on the highest setting and up to 16 hrs. on low; battery is small enough to be mounted on helmet or stem. The CygoLite TridenX 1100 OSP bike light has a tool-free handlebar mount that fits 25.4mm - 31.8mm handlebars; also includes a quick-release helmet mount. Comes with head unit, battery, wall charger, handlebar and helmet mounts, and a 3 ft. battery extension cable. Battery weighs 140g and light weighs 130g for a total of 270g.","short_description":"A lightweight, very bright bike light for high-performance riding at night, the CygoLite TridenX 1300 OSP bike light supplies 1,300 lumens of bright illumination in a sleek, compact design.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Lights","thumb_url":"http://i1.avlws.com/115/s375567.png","image_url":"http://i1.avlws.com/115/l375567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375567&tt=df","keywords":"flashing","retail_price":"249.95","sale_price":"249.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864756&amp;link=&amp;tabs=-Details\"></script>","variants":{"8647560001":{"sku":"8647560001","vendor_sku":"TDX-1300","upc":"745025036077","color":"BLACK","retail_price":"249.95","sale_price":"249.95"}}}
