{"sku":"864747","manufacturer_id":"OO9196-05","brand_name":"Oakley","product_name":"Oakley Radarlock XL Straight Interchangeable Sunglasses - Men's","long_description":"With a semi-rimless design, Oakley Radarlock XL straight interchangeable sunglasses give you wide peripheral vision that is perfect for riding, running and everything else you do fast. Switchlock(TM) interchangeable lens technology enables quick and easy lens switch-outs; sunglasses include a black iridium lens and an amber lens. Black iridum lens reduces glare with a gray tint and is ideal for bright, well-lit conditions; amber lens adds contrast and brightness to overcast and low-light days. Stress-resistant nylon frames are light and flexible for all-day comfort. 19mm nose-bridge height offers a large field of view. Open-edge design extends your vertical field of vision and retains peripheral clarity. Oakley three-point fit includes optical alignment for sharp, accurate vision, impact absorption for improved protection, and geometry designed to enhance peripheral view. Hydrophilic rubber nose pads and earpads become tackier as you perspire, holding the sunglasses in place as you move.","short_description":"With a semi-rimless design, Oakley Radarlock XL straight interchangeable sunglasses give you wide peripheral vision that is perfect for riding, running and everything else you do fast.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s449879.png","image_url":"http://i1.avlws.com/115/l449879.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449879&tt=df","keywords":"Cycling","retail_price":"220.00","sale_price":"220.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449879\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449879.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864747&amp;link=&amp;tabs=-Details\"></script>","variants":{"8647470001":{"sku":"8647470001","vendor_sku":"OO9196-05","upc":"700285788258","size":"BLACK IRIDIUM/VR28","color":"POLISHED BLACK","retail_price":"220.00","sale_price":"220.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
