{"sku":"864739","manufacturer_id":"1006FD SIZE 48","brand_name":"Zamberlan","product_name":" Zamberlan 1006 Vioz Plus GT RR Hiking Boots - Men's","long_description":"Made for hikers with wide feet, the Zamberlan 1006 Vioz Plus GT RR hiking boots offer waterproof protection and burly construction to handle everything from easy day hikes to long backcountry trips. Hydrobloc(R) full-grain leather uppers offer excellent support and flexibility; rubber reinforcements enhance durability. Seam-sealed Gore-Tex(R) liners protect feet from wet weather and allow excess moisture vapor to escape, keeping feet dry and comfortable. Nylon linings wick moisture away from feet, further ensuring dry comfort. Padded and gusseted tongues relieve lace pressure across insteps while also keeping out trail debris; heel loops aid entry. Removable, moisture-wicking footbeds are anatomic for extra comfort and are perforated for ventilation and moisture control. Polyurethane midsoles provide all-day cushioning while thermoplastic urethane midsole shanks enhance rigidity and stability on uneven terrain. 1006 Vioz Plus GT RR hiking boots feature Vibram(R) rubber outsoles for durability and reliable traction on rough ground. Please note: 1006 Vioz Plus GT RR hiking boots are built with the Zamberlan Wide Last (ZWL); fit is ideal for users from width D to EE.","short_description":"Made for hikers with wide feet, the Zamberlan 1006 Vioz Plus GT RR hiking boots offer waterproof protection and burly construction to handle everything from easy day hikes to long backcountry trips.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s385299.png","image_url":"http://i1.avlws.com/115/l385299.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=385299&tt=df","retail_price":"320.00","sale_price":"320.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=385299\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m385299.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864739&amp;link=&amp;tabs=-Details\"></script>","variants":{"8647390006":{"sku":"8647390006","vendor_sku":"1006FD SIZE 45","size":"10.5","color":"WAXED FOREST","retail_price":"320.00","sale_price":"320.00"}}}
