{"sku":"864881","manufacturer_id":"34314-74900","brand_name":"Deuter","product_name":"Deuter Futura Vario Pro 50 + 10 Pack - Men's","long_description":"The Deuter Futura Vario Pro 50 + 10 Pack gets you out for multi-day hikes with an advanced suspension that offers lightweight, breathable comfort and a pivoting hipbelt for flexibility. Patented Aircomfort Vario Pro suspension brings together topnotch ventilation, superb load transfer and a pivoting hipbelt for great freedom of movement. Vari Fit system makes it easy to adjust the harness for a customized fit. Mesh ventilated back holds the pack body away from your back, promoting fresh airflow and reducing perspiration. Spring steel wire design combined with a horizontal stay effectively transfers load weight to your hips. Padded Vari Flex hipbelt with forward-pull adjustment pivots at the center of your lower back, following your natural movement to help you keep your balance. Wide, anatomically shaped shoulder straps are lined with airy mesh for quick-drying breathability and feature stabilizer straps for fine-tuned load stability. Top-loading main compartment features zippered front access and a reservoir sleeve with a drink tube exit port that enables on-the-go hydration (reservoir sold separately). Front zippered pocket, large bellowed side pockets, spacious hipbelt pocket and mesh side pockets help organize gear. Separate zippered compartment for sleeping bag is accessible at the base of the pack; internal zip divider lets you combine sleeping bag compartment with main compartment. Floating top lid accommodates up to 10 extra liters of capacity for ropes or other bulky items. Lid pocket holds your map, compass or GPS, spare batteries and other small equipment items; interior valuables pocket secures important items. Side compression straps cinch down loads for jostle-free carrying; attachment points allow you to lash trekking poles and ice tools to pack exterior. The Deuter Futura Vario Pro 50 + 10 Pack lets you easily protect its contents with an integrated, removable raincover.","short_description":"The Deuter Futura Vario Pro 50 + 10 Pack gets you out for multi-day hikes with an advanced suspension that offers lightweight, breathable comfort and a pivoting hipbelt for flexibility.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s440667.png","image_url":"http://i1.avlws.com/115/l440667.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440667&tt=df","keywords":"multiday","retail_price":"219.00","sale_price":"219.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440667\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440667.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864881&amp;link=&amp;tabs=-Details\"></script>","variants":{"8648810001":{"sku":"8648810001","vendor_sku":"34314-74900","color":"BLACK/TITAN","retail_price":"219.00","sale_price":"219.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
