{"sku":"864812","manufacturer_id":"13635","brand_name":"Rei","product_name":"REI Quarter Dome T3 Tent - Special Buy","long_description":"Forget about small tents that cramp your backpacking style. The 3-season REI Quarter Dome T3 tent has room for 3 people so you and a few friends can embark on a spring, summer or fall adventure. Freestanding 3-person tent features 2 side entry doors and 2 Dry Entry vestibules and ample storage capacity. Advanced frame design maximizes headroom, interior volume and strength; pole clips provide quick and easy tent setup. Lightweight materials and DAC NSL hubbed poleset provide high interior volume and low overall weight. Windproof, breathable perimeter fabric blocks dust and sand from blowing in under the fly; bathtub floor with seam-sealed corners ensures complete waterproof protection. Fully adjustable, high-level vents mitigate condensation, drawing cool air under the fly from the lower perimeter and exhausting warm, moist air. Silicone-treated, lightweight ripstop nylon fly stays taut in the rain while keeping you dry. The REI Quarter Dome T3 tent offers multiple interior storage options with mesh side pockets and hang loops located throughout. Includes tapered, easy-to-stuff compression stuff sack, 6 stakes, 4 guylines and tighteners, pole repair tube, and pole and stake bags. Fly/footprint minimalist pitch option allows the fly, poles and footprint (not included) to be combined into a lightweight shelter without the tent itself. Special buy.","short_description":"Forget about small tents that cramp your backpacking style. The 3-season REI Quarter Dome T3 tent has room for 3 people so you and a few friends can embark on a spring, summer or fall adventure.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s357467.png","image_url":"http://i1.avlws.com/115/l357467.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=357467&tt=df","keywords":"summergear,tent,backpacking","retail_price":"349.00","sale_price":"269.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=357467\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m357467.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864812&amp;link=&amp;tabs=-Details\"></script>","variants":{"8648120001":{"sku":"8648120001","vendor_sku":"13635","upc":"486481200014","color":"LICHEN/PLATINUM","retail_price":"269.73","sale_price":"269.73"}}}
