{"sku":"864814","manufacturer_id":"14157","brand_name":"Rei","product_name":"REI Quarter Dome T3 Plus Tent - Special Buy","long_description":"Unlike cramped tents that sacrifice space for weight savings, the 3-person, 3-season REI Quarter Dome T3 Plus tent feels so roomy it's easy to forget it's a backpacking tent, not a luxury suite. The REI Quarter Dome T3 Plus has an additional 7.5 sq. ft. of floor space, an additional inch of headroom and larger vestibules compared to the standard Quarter Dome T3 tent. 2 side entry doors and Dry Entry vestibules offer convenient access and ample storage capacity. REI-exclusive Tension Truss design enhances structural stability, prevents deformation in the wind and maximizes room around your head and shoulders. Aluminum DAC Featherlight NSL hubbed poles are lightweight; setup is quick and easy with pole clips and color coding. Rectangular floor plan makes it easy to arrange sleeping bags and gear, and allows efficient use of space. Fully adjustable, high-level vents mitigate condensation, drawing cool air under the fly from the lower perimeter and exhausting warm, moist air. Bathtub floor with seam-sealed corners ensures waterproof protection. Windproof, breathable perimeter fabric blocks dust and sand from blowing in under the fly. Silicone-treated, lightweight ripstop nylon fly stays taut in the rain, avoiding moisture-transfer to the tent. REI Quarter Dome T3 Plus tent offers multiple interior mesh side pockets and hang loops for organization. Tent doors stuff into their own stash pockets for out-of-the-way convenience. Includes tapered, easy-to-stuff compression stuff sack, 6 stakes, 4 guylines and tighteners, pole repair tube, pole and stake bags. Fly/footprint minimalist pitch option lets you leave the tent at home and use the fly, poles and footprint (sold separately) as a lightweight shelter. Special buy.","short_description":"Unlike cramped tents that sacrifice space for weight savings, the 3-person, 3-season REI Quarter Dome T3 Plus tent feels so roomy it's easy to forget it's a backpacking tent, not a luxury suite.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424091.png","image_url":"http://i1.avlws.com/115/l424091.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424091&tt=df","retail_price":"399.00","sale_price":"309.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424091\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424091.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864814&amp;link=&amp;tabs=-Details\"></script>","variants":{"8648140001":{"sku":"8648140001","vendor_sku":"14157","upc":"486481400018","color":"LICHEN/PLATINUM","retail_price":"309.73","sale_price":"309.73"}},"categories":["camping-hiking","tents","backpacking-tents"]}
