{"sku":"864891","manufacturer_id":"46524-42240","brand_name":"Deuter","product_name":" Deuter Kid Comfort Air Child Carrier","long_description":"The Deuter Kid Comfort Air Child Carrier offers advanced comfort and security for both parents and kids while it carries your child and accessories on family outings. Aircomfort back system maximizes ventilation and helps reduce perspiration by up to 25%. Adjustable 5-point child safety harness with color-coded buckles offers maximum safety but also easy handling and adjustment. VARIFIT adjustable shoulder harness lets you easily customize the fit by making individual height adjustments for torsos measuring 15 - 21 in. Aluminum frame design ensures stiffness and durability; foldout stand creates a stable base when setting the pack on the ground. Side entry buckle allows access into child seat from the side. Height -adjustable seat is engineered for children to comfortably and securely be seated. Deuter recommends that the maximum weight of child and gear not exceed 48.5 lbs. Rigorous JPMA (Juvenile Products Manufacturers Association) testing exceeds ASTM, federal and state standards to help ensure quality, safety, performance and functionality.","short_description":"The Deuter Kid Comfort Air Child Carrier offers advanced comfort and security for both parents and kids while it carries your child and accessories on family outings.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Baby Carrier Packs","thumb_url":"http://i1.avlws.com/115/s410363.png","image_url":"http://i1.avlws.com/115/l410363.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410363&tt=df","retail_price":"239.00","sale_price":"239.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410363\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410363.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864891&amp;link=&amp;tabs=-Details\"></script>","variants":{"8648910001":{"sku":"8648910001","vendor_sku":"46524-42240","color":"GRANITE/EMERALD","retail_price":"239.00","sale_price":"239.00"}},"categories":["camping-hiking","backpacks","baby-carrier-packs"]}
