{"sku":"864810","manufacturer_id":"13634","brand_name":"Rei","product_name":" REI Quarter Dome T2 Plus Tent - Special Buy","long_description":"The freestanding REI Quarter Dome T2 Plus tent uses lightweight materials and a unique pole design to create a spacious, durable 3-season backpacking tent for a pair of adventurers. The REI Quarter Dome T2 Plus features an additional 5.2 sq. ft. of floor space, an additional inch of headroom and larger vestibules compared to the standard Quarter Dome T2. Two side-entry doors and Dry Entry vestibules offer convenient access and ample storage capacity. REI-exclusive Tension Truss design enhances structural stability, prevents deformation in the wind and maximizes room around your head and shoulders. Aluminum DAC Featherlight NSL hubbed poles are lightweight; setup is quick and easy with pole clips and color coding. Rectangular floor plan makes it easy to arrange sleeping bags and gear, and allows efficient use of space. Fully adjustable, high-level vents mitigate condensation, drawing cool air under the fly from the lower perimeter and exhausting warm, moist air. Bathtub floor with seam-sealed corners ensures waterproof protection; windproof, breathable perimeter fabric blocks dust and sand from blowing in under the fly. Silicone-treated, lightweight ripstop nylon fly stays taut in the rain, avoiding moisture-transfer to the tent while keeping you dry. REI Quarter Dome T2 Plus tent offers multiple interior mesh side pockets and hang loops for organization; tent doors stuff into their own stash pockets. Includes tapered, easy-to-stuff compression sack, 6 stakes, 4 guylines and tighteners, pole repair tube, and pole and stake bags. Fly/footprint minimalist pitch option lets you leave the tent at home and use the fly, poles and footprint (sold separately) as a lightweight shelter. Special buy.","short_description":"The freestanding REI Quarter Dome T2 Plus tent uses lightweight materials and a unique pole design to create a spacious, durable 3-season backpacking tent for a pair of adventurers.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424083.png","image_url":"http://i1.avlws.com/115/l424083.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424083&tt=df","retail_price":"319.00","sale_price":"249.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424083\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424083.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864810&amp;link=&amp;tabs=-Details\"></script>","variants":{"8648100001":{"sku":"8648100001","vendor_sku":"13634","upc":"486481000010","color":"LICHEN/PLATINUM","retail_price":"249.73","sale_price":"249.73"}}}
