{"sku":"864879","manufacturer_id":"34294-55100","brand_name":"Deuter","product_name":"Deuter Futura Pro 42 Pack","long_description":"Sized for overnights or weekends, the men's Deuter Futura Pro 42 Pack includes such niceties as a sleeping bag compartment, rain cover-and a free Deuter visor while supplies last. Aircomfort Flexlite Pro system supplies fantastic back ventilation, flexibility and a comfortable, floating hipbelt. Spring steel frame with 2 stays effectively transfers load weight to your hips. Anatomically shaped 3D AirMesh shoulder straps have load adjusters. Pull-forward closure allows the hipbelt to be easily tightened while on the move. 2 zippered hipbelt pockets for valuables, camera or snacks. 7 exterior pockets, including 1 in the lid, zippered front, side bellows, etc. Internal valuables pocket; water-resistant wet laundry pocket. Attachment for ice axe and walking poles; side compression straps. Hydration system compatible (sold separately), including a reflective attachment for drinking tube. Separate bottom compartment for sleeping bag; SOS label inside the lid. Deuter Futura Pro 42 Pack for men comes with a removable rain cover.","short_description":"Sized for overnights or weekends, the men's Deuter Futura Pro 42 Pack includes such niceties as a sleeping bag compartment, rain cover-and a free Deuter visor while supplies last.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s445559.png","image_url":"http://i1.avlws.com/115/l445559.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445559&tt=df","keywords":"multiday","retail_price":"169.00","sale_price":"169.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445559\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445559.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864879&amp;link=&amp;tabs=-Details\"></script>","variants":{"8648790001":{"sku":"8648790001","vendor_sku":"34294-55100","color":"FIRE/GRANITE","retail_price":"169.00","sale_price":"169.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
