{"sku":"864821","manufacturer_id":"STK-280-SL","brand_name":"Cygolite","product_name":" CygoLite Streak 280 USB and Hotshot 2W SL USB Combo Bike Light Set","long_description":"Illuminate the path ahead with a 280-lumen beam and enhance rear visibility while commuting with this CygoLite combo set. It includes the Streak 280 front light and the Hotshot 2W SL USB rear light. Improve your confidence on rides in dim light with the CygoLite Streak 280 front bike light, and when it's time to recharge, just plug it into the nearest USB port. CygoLite Streak 280 USB front bike light illuminates your way with 280 lumens and a beam pattern that's optimized for cycling. Three constant lighting modes include high, medium, low; two special lighting modes include 2-in-1 SteadyPulse(TM) and day flash. SteadyPulse illumination mode combines steady brightness with an alerting flash, letting you see what's ahead of you while simultaneously letting others know your presence. Internal lithium-ion battery charges via computer USB port (charge time of 5 hrs.). Regulated output ensures consistent performance throughout the whole battery cycle; charging indicator lets you know battery status. CygoLite Hotshot 2W SL USB rear bike light alerts others to your presence with bright light and multiple modes. Powerful 2-watt LED is paired with a specially designed reflector to maximize visibility; five useful flashing modes give you plenty of options. Customize light flash speeds to suit your needs with a simple push of a button on the light. USB-rechargeable lithium-ion battery on the Hotshot 2W SL USB lasts up to 200 hrs. (flashing mode) on a single charge. Water-resistant design keeps on truckin' through all riding conditions. CygoLite combo set icludes Streak 280 USB, HotShot 2W SL USB, tool-free handlebar mount, seat post mount and USB charging cable.","short_description":"Illuminate the path ahead with a 280-lumen beam and enhance rear visibility while commuting with this CygoLite combo set. It includes the Streak 280 front light and the Hotshot 2W SL USB rear light.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Lights","thumb_url":"http://i1.avlws.com/115/s375587.png","image_url":"http://i1.avlws.com/115/l375587.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375587&tt=df","keywords":"flashing","retail_price":"75.95","sale_price":"75.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375587\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375587.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864821&amp;link=&amp;tabs=-Details\"></script>","variants":{"8648210001":{"sku":"8648210001","vendor_sku":"STK-280-SL","upc":"745025036152","color":"BLACK","retail_price":"75.95","sale_price":"75.95"}}}
