{"sku":"864960","manufacturer_id":"13097","brand_name":"Rei","product_name":"REI Hobitat 6 Tent - Special Buy","long_description":"Designed to turn your campsite into a comfortable home base, the 3-season REI Hobitat 6 tent is easy to set up and sized to efficiently sleep 6 family members or friends. Rectangular floor plan makes it easy to arrange sleeping bags and gear; high-arching combi poles provide ample headroom. 2 doors provide ample access; multiple zipper sliders offer a variety of configurations and ventilation options; each door tucks away into an adjacent pocket. Combination of pole clips, pole sleeves and color coding simplifies the setup process. Huge front door with awning provides easy access and a sheltered entryway. Durable seam-sealed polyester fly is sag resistant; seam-sealed, cut-in floor provides a taut pitch. Roll-up side panels over mesh panels allow you to control ventilation. Storage options are provided by mesh side pockets and hang loops located throughout the tent. The REI Hobitat 6 tent includes a carrying/storage sack, 8 stakes and 4 guylines with tighteners; corresponding tent footprint is sold separately. Connect Tech zipper attachment lets you add more living space and storage with the Connect Tech Garage or Connect Tech Vestibule, both sold separately. Special buy.","short_description":"Designed to turn your campsite into a comfortable home base, the 3-season REI Hobitat 6 tent is easy to set up and sized to efficiently sleep 6 family members or friends.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Family Camping Tents","thumb_url":"http://i1.avlws.com/115/s357379.png","image_url":"http://i1.avlws.com/115/l357379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=357379&tt=df","keywords":"group,family,summergear,tent,large","retail_price":"349.00","sale_price":"269.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=357379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m357379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864960&amp;link=&amp;tabs=-Details\"></script>","variants":{"8649600001":{"sku":"8649600001","vendor_sku":"13097","upc":"486496000012","color":"SAGE/PLATINUM","retail_price":"269.73","sale_price":"269.73"}}}
