{"sku":"864960","manufacturer_id":"13097","brand_name":"Rei","product_name":"REI Hobitat 6 Tent - Special Buy","long_description":"Designed to turn your campsite into a luxurious home base, the 3-season REI Hobitat 6 tent is spacious, easy to set up and sized to fit 6 campers for maximum together time with family or friends. Rectangular floor plan makes it easy to arrange sleeping bags and gear, and provides organizational efficiency and comfort. Huge door with 4 zipper sliders provides multiple entry configurations that can be personalized for both children and adults; door tucks away into an adjacent pocket. Combination of pole clips, pole sleeves and color coding facilitate a quick and easy setup. Weatherproof door with awning provides easy access, ventilation and good weather protection. Seam-sealed polyester fly provides a waterproof, durable and sag-free cover; seam-sealed, cut-in floor provides a taut pitch and waterproof protection. Roll-up side panels mated to interior bug-proof mesh panels allow you to control ventilation. Multiple interior storage options are provided by various combinations of mesh side pockets and hang loops located throughout the tent. REI Hobitat 6 tent includes carry/storage sack, 8 stakes and 4 guylines with tighteners; corresponding tent footprint sold separately. Special buy.","short_description":"Designed to turn your campsite into a luxurious home base, the 3-season REI Hobitat 6 tent is spacious, easy to set up and sized to fit 6 campers for maximum together time with family or friends.","category":"Camping & Hiking","subcategory":"Tents","product_group":"Family Camping Tents","thumb_url":"http://i1.avlws.com/115/s357379.png","image_url":"http://i1.avlws.com/115/l357379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=357379&tt=df","keywords":"family,cottent,big,tent,large","retail_price":"349.00","sale_price":"269.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=357379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m357379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=864960&amp;link=&amp;tabs=-Details\"></script>","variants":{"8649600001":{"sku":"8649600001","vendor_sku":"13097","upc":"486496000012","color":"SAGE/PLATINUM","retail_price":"269.73","sale_price":"269.73"}}}
