{"sku":"865042","manufacturer_id":"A2V9VB3","brand_name":"The North Face","product_name":" The North Face Verto Micro Hoodie Jacket - Women's","long_description":"For featherweight core warmth and unencumbered arms while climbing, wear the women's Verto Micro Hoodie from The North Face. It's insulated with both water-repellent goose down and Polartec(R). The body of the hoodie contains premium water-repellent 800-fill-power goose down that is extremely warm while remaining highly compressible. ProDown(TM) water-repellent treatment improves warmth by repelling moisture longer and allowing the down fibers to dry faster than untreated down. Sleeves are insulated with 80g Polartec(R) Alpha for highly breathable warmth without bulk. Pertex(R) Quantum(R) GL body fabric is incredibly soft and windproof, and boasts an incredibly high strength-to-weight ratio, completely protecting your core. Shell sides, shoulders and sleeves are made of ripstop nylon that offers 2-way stretch. FlashDry(TM) stretch fabric under the arms wicks sweat and dries quickly, so you stay comfortable when going all out. Elastic-bound, close-fitting hood fits snugly and goes easily under helmets; extra insulation around the neck extends your comfort range. Sleek hem and cuff construction reduces bulk and improves fit. Women's Verto Micro Hoodie from The North Face stuffs into its own zippered handwarmer pocket for easy stowage. This jacket is part of The North Face Summit Series(TM), apparel designed and tested for use in harsh environments.","short_description":"For featherweight core warmth and unencumbered arms while climbing, wear the women's Verto Micro Hoodie from The North Face. It's insulated with both water-repellent goose down and Polartec(R).","category":"Women's Clothing","subcategory":"Women's Jackets","product_group":"Women's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s393767.png","image_url":"http://i1.avlws.com/115/l393767.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=393767&tt=df","retail_price":"249.00","sale_price":"249.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=393767\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m393767.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865042&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["womens","womens-jackets","womens-insulated-jackets"]}
