{"sku":"865149","manufacturer_id":"13615","brand_name":"Arc'teryx","product_name":" Arc'teryx Alpha FL 45 Pack","long_description":"The Arc'teryx Alpha FL 45 Pack offers climbers and alpinists an ultralight, durable and highly weather-resistant pack that's paired down to be as simple as possible with no extraneous straps or parts. Harness features a 1.6 in. webbing hipbelt, soft-edge shoulder straps with laminated foam padding and a high-density foam back panel for carrying light or heavy loads. Water-resistant roll-top closure saves weight, extends the pack's volume from 32 liters to 45 liters and allows easy access to the main compartment. Double-pull drawcord collar is easy to open and close, even when wearing gloves. Front and side external lash points and bungee cord make it easy to attach extra layers, helmet, crampons, tools, skis or sleeping pad. Ripstop nylon is coated on both sides and features taped seams to create an air-permeable, waterproof pack fabric; white inner surface makes it easy to see contents. The Arc'teryx Alpha FL 45 Pack features a top compression/rope strap, dual haul loops, adjustable sternum strap, hipbelt clip points and zippered external security pocket.","short_description":"The Arc'teryx Alpha FL 45 Pack offers climbers and alpinists an ultralight, durable and highly weather-resistant pack that's paired down to be as simple as possible with no extraneous straps or parts.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411407.png","image_url":"http://i1.avlws.com/115/l411407.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411407&tt=df","retail_price":"239.00","sale_price":"239.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411407\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411407.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865149&amp;link=&amp;tabs=-Details\"></script>","variants":{"8651490001":{"sku":"8651490001","vendor_sku":"13615","upc":"806955699258","size":"Regular","color":"CAYENNE","retail_price":"239.00","sale_price":"239.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
