{"sku":"865284","manufacturer_id":"13261","brand_name":"Rei","product_name":"REI Quantum Messenger Bag - Special Buy","long_description":"The REI Quantum Messenger Bag offers an updated take on a classic laptop bag design, sporting plenty of improvements to keep up with a world that moves as fast as you do. 100% post-consumer recycled PET fabrics are tough enough to withstand the urban grind and soft enough to feel good doing it. Fits up to a 17 in. laptop in a fully padded pocket easily accessible via a water-resistant zipper on the back panel, making removal at airport security painless. Sculpted top flap; shoulder-panel design securely covers main compartment; exterior zippered pocket accommodates travel documents, tickets and boarding passes. Removable shoulder strap includes an ergonomic pad for comfortable carrying during active commutes; padded top handle lets you carry bag like a briefcase. Internal organizer includes pockets for pens and business cards, and a microfleece-lined pocket sized for a phone or MP3 player. Reflective trim creates great visibility for active commuters; webbing loop provides reliable attachment point for blinking LED light (sold separately). The REI Quantum Messenger Bag has stretch mesh pockets on both ends for water bottles or small essentials for easy access. Special buy.","short_description":"The REI Quantum Messenger Bag offers an updated take on a classic laptop bag design, sporting plenty of improvements to keep up with a world that moves as fast as you do.","category":"Luggage & Travel","subcategory":"Packs And Bags","product_group":"Day Bags","thumb_url":"http://i1.avlws.com/115/s363991.png","image_url":"http://i1.avlws.com/115/l363991.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=363991&tt=df","keywords":"bag,shoulder,crossbody,luggage,day","retail_price":"89.50","sale_price":"61.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=363991\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m363991.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865284&amp;link=&amp;tabs=-Details\"></script>","variants":{"8652840001":{"sku":"8652840001","vendor_sku":"13261","upc":"486528400018","color":"BLACK","retail_price":"61.73","sale_price":"61.73"},"8652840002":{"sku":"8652840002","vendor_sku":"13261","upc":"486528400025","color":"RED MAPLE","retail_price":"61.73","sale_price":"61.73"}}}
