{"sku":"865279","manufacturer_id":"13549","brand_name":"Rei","product_name":" REI Lookout 40 Pack - Women's - Special Buy","long_description":"The REI Lookout 40 pack for women provides plenty of pockets for organizing a full day's worth of gear while a contoured fit helps keep you comfortable over miles of trails. Women-specific fit features shoulder straps positioned close together and an anatomic shape through the bustline. Post-consumer recycled PET polyester is tough enough to endure the daily grind. High-density polyethylene framesheet and a single aluminum stay support heavy loads and protect your back from bulky or pointy items. Sculpted foam back panel is designed to improve body contact comfort, with channels for air circulation to keep your back cool and dry. Contoured, padded shoulder straps and waistbelt wrap around to offer comfortable support under pack load; buckle on sternum strap doubles as a safety whistle. Wide panel opening to main compartment gives you easy access to contents; internal sleeve accommodates a hydration reservoir (not included). Front zip compartment has pockets for stashing and organizing essentials, such as money, ID, multi-tool and headlamp. Top stash pocket has room for other items, such as sunglasses or MP3 player; zippered pockets on waistbelt provides extra storage. Side mesh pockets create convenient storage and on-the-go access to water bottle, sunscreen, snacks or small electronics. Front-panel lash points and bottom compression straps let you strap on bulky gear, such as snowshoes and a sleeping pad. Side compression straps let you cinch down loads for jostle-free carrying. REI Lookout 40 women's pack features twin loops and corresponding removable retainers to let you lash on an ice axe or trekking poles. Special buy.","short_description":"The REI Lookout 40 pack for women provides plenty of pockets for organizing a full day's worth of gear while a contoured fit helps keep you comfortable over miles of trails.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411423.png","image_url":"http://i1.avlws.com/115/l411423.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411423&tt=df","retail_price":"99.50","sale_price":"69.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411423\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411423.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865279&amp;link=&amp;tabs=-Details\"></script>","variants":{"8652790001":{"sku":"8652790001","vendor_sku":"13549","upc":"486527900014","color":"CASTLEROCK/PUGET SOUND","retail_price":"69.73","sale_price":"69.73"},"8652790002":{"sku":"8652790002","vendor_sku":"13549","upc":"486527900021","color":"DARK GRAPE/CASTLEROCK","retail_price":"69.73","sale_price":"69.73"}},"categories":["camping-hiking","backpacks","day-packs"]}
