{"sku":"865285","manufacturer_id":"13262","brand_name":"Rei","product_name":" REI Quantum Checkpoint Brief - Special Buy","long_description":"The REI Quantum Checkpoint Brief offers a good-looking solution for your fast-paced world, wrapped in an airport security checkpoint-friendly package. Fits up to a 17 in. laptop in a fully padded laptop pocket. Designed to be TSA checkpoint friendly, the brief opens flat by opening 2 buckles, allowing laptop to remain inside and protected during security screening. Offers a modular design with separate compartments for office gear and for your laptop; either side can be used independently or together. 100% post-consumer recycled PET fabrics are tough enough to withstand the urban grind and soft enough to feel good doing it. Slides over wheeled luggage pull handles for secure attachment as you go, getting you through the airport smoothly and easily. Removable strap offers sliding shoulder pad and easy length adjustment; padded carry handle with soft edges provides comfortable grip. Includes internal organizer panel with multiple pockets for pens, electronics and small essentials; exterior pocket fits travel documents, tickets and boarding passes. Reflective trim creates great visibility for active commuters; webbing loop provides reliable attachment point for LED blinking light (sold separately). The REI Quantum Checkpoint Brief has a stretch mesh side pocket to carry small essentials for easy access, or a 1-liter water bottle. Special buy.","short_description":"The REI Quantum Checkpoint Brief offers a good-looking solution for your fast-paced world, wrapped in an airport security checkpoint-friendly package.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s455779.png","image_url":"http://i1.avlws.com/115/l455779.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=455779&tt=df","keywords":"courier,sling,purses","retail_price":"99.50","sale_price":"44.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=455779\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m455779.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865285&amp;link=&amp;tabs=-Details\"></script>","variants":{"8652850001":{"sku":"8652850001","vendor_sku":"13262","upc":"486528500015","color":"BLACK","retail_price":"44.73","sale_price":"44.73"}}}
