{"sku":"865392","manufacturer_id":"TFLY114","brand_name":"Big Agnes","product_name":"Big Agnes Fly Creek UL1 Tent","long_description":"An ultralight, three-season shelter for one that weighs in at scant 1 lb. 10 oz., the Big Agnes Fly Creek UL1 tent grants protection from bugs and rain at an ethereal weight. Freestanding tent slashes weight with the latest in ultralight fabric and materials; single hub pole assembly also saves weight and sets up easily. Aluminum DAC Featherlite NSL aluminum poles offer the latest advancements in light weight and improved longevity; anodization process uses fewer chemicals than other processes. DAC Twist clips attach tent body to the pole frame for quick and easy set up. High-tenacity ripstop nylon rainfly and seamless floor feature polyurethane and silicone coatings and solvent-free polyurethane taped seams for waterproof durability. Woven nylon mesh walls help ensure excellent ventilation and 360deg views. Reflective guyouts and webbing on tent corners increase visibility at night. Single pocket and gear loft loops offer storage options. The Big Agnes Fly Creek UL1 tent comes with stuff sacks and eleven superlight aluminum stakes. For an even lighter setup during nice weather, leave the tent body behind; use the rainfly and footprint (sold separately) with the poles and stakes. Average minimum weight specification is based on tent, rainfly and poles only.","short_description":"An ultralight, three-season shelter for one that weighs in at scant 1 lb. 10 oz., the Big Agnes Fly Creek UL1 tent grants protection from bugs and rain at an ethereal weight.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424159.png","image_url":"http://i1.avlws.com/115/l424159.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424159&tt=df","retail_price":"329.95","sale_price":"329.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424159\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424159.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865392&amp;link=&amp;tabs=-Details\"></script>","variants":{"8653920001":{"sku":"8653920001","vendor_sku":"TFLY114","upc":"873840011709","color":"SILVER/GOLD","retail_price":"329.95","sale_price":"329.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
