{"sku":"865320","manufacturer_id":"13542","brand_name":"Rei","product_name":"REI Crestrail 48 Pack - Men's - Special Buy","long_description":"The REI Crestrail 48 pack balances comfort with performance and durability for superb carry comfort on overnight or weekend trips. Its compact design makes the most of light materials and components. Sculpted FreeFlow back panel has multiple peaks and valleys to reduce contact areas and increase ventilation; soft foam conforms to your back for a stable fit. ActivMotion(R) hipbelt pivots to follow the natural motion of your hips, helping keep the pack balanced and stable on your back when hiking on uneven terrain. Hipbelt webbing tightens with a forward pull for easy adjustment; 2 zippered pockets provide handy access to snacks. Tubular aluminum perimeter frame is lighter weight than HDPE/stay framesheets; it transfers weight to hips and stabilizes the pack, helping prevent unwanted side-to-side sway. Top-loading main compartment also features a large zippered opening to the bottom for easy access. Large front pocket with double-zipper access, stretch stash pocket and lightweight lash points provide storage and organization for often-used gear and clothing. Side bottle-locking pockets secure bottles or other items, helping prevent them from falling out when bushwhacking or taking your pack off. Quick Clip ice axe attachments are strategically positioned to avoid interference with pockets and access zippers. Over-the-top and dual side compression straps pull the load close to your back, minimize bulk and provide external attachment points for gear. Floating top lid extends, allowing the pack to handle large loads. Ripstop nylon fabric resists abrasion and tears; durable water resistant finish repels moisture. Water-repellent zippers help keep your contents dry and eliminate the need for fabric zipper flaps. The REI Crestrail 48 pack features a hydration-ready design that allows your reservoir's drink tube to be routed over either shoulder (reservoir not included). Special buy.","short_description":"The REI Crestrail 48 pack balances comfort with performance and durability for superb carry comfort on overnight or weekend trips. Its compact design makes the most of light materials and components.","category":"Camping & Hiking","subcategory":"Backpacks","product_group":"Internal Frame Packs","thumb_url":"http://i1.avlws.com/115/s356455.png","image_url":"http://i1.avlws.com/115/l356455.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=356455&tt=df","keywords":"frame,BACKPACK FOR backpacking,Internal","retail_price":"159.00","sale_price":"104.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=356455\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m356455.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865320&amp;link=&amp;tabs=-Details\"></script>","variants":{"8653200001":{"sku":"8653200001","vendor_sku":"13542","upc":"486532000013","size":"M","color":"MERCURY/PORPOISE","retail_price":"104.73","sale_price":"104.73"},"8653200002":{"sku":"8653200002","vendor_sku":"13542","upc":"486532000020","size":"L","color":"MERCURY/PORPOISE","retail_price":"104.73","sale_price":"104.73"}}}
