{"sku":"865315","manufacturer_id":"40151614","brand_name":"Sierra Designs","product_name":"Sierra Designs Flash 3 Tent","long_description":"The fusion of luxury and light weight come together perfectly in the 3-person, 3-season Sierra Designs Flash 3 Tent. It defies belief about how light a full-size, full-featured shelter can be. Hybrid double/single wall reduces weight and provides quick, dry setup, even in the rain; freestanding design can be pitched anywhere, no matter how impenetrable the surface. Symmetric dome shape allows for both head-to-head and head-to-toe sleeping configurations; high ceiling accommodates thicker mattresses with plenty of headroom. Immense interior space allows occupants to sit at either end with room in between for a comfortable game of cards. The Sierra Designs Flash 3 Tent features 2 drop doors that are uncommonly wide and large enough for 2 people to sit side by side. DAC Pressfit(R) poles feature a securely fixed, pressed-in ferrule, ensuring the poles will remain strong and reliable. 15 in. integrated awning poles maximize the door openings and drip lines without the extra weight of an additional support pole. 2 gear closets store gear away from the door; gear closets help keep gear dry in a rainstorm, whether closed or left open for additional venting.","short_description":"The fusion of luxury and light weight come together perfectly in the 3-person, 3-season Sierra Designs Flash 3 Tent. It defies belief about how light a full-size, full-featured shelter can be.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424127.png","image_url":"http://i1.avlws.com/115/l424127.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424127&tt=df","retail_price":"399.95","sale_price":"399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424127\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424127.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865315&amp;link=&amp;tabs=-Details\"></script>","variants":{"8653150001":{"sku":"8653150001","vendor_sku":"40151614","upc":"054003745147","color":"SD TAN/SD BLUE","retail_price":"399.95","sale_price":"399.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
