{"sku":"865391","manufacturer_id":"TCS414","brand_name":"Big Agnes","product_name":" Big Agnes Copper Spur UL4 Tent","long_description":"With a trail weight of 5 lbs. 15 oz., the updated Big Agnes Copper Spur UL4 tent lets you and 3 friends enjoy a light load and plenty of living space on your 3-season backpacking adventures. 2 doors and 2 vestibules provide easy access and shared storage areas; stormflaps protect vestibule zippers. Light yet strong, DAC Featherlite(R) NSL poles are anodized without the use of harmful acids. Double hub/pole design and DAC Twist Clips makes setup quick and easy; DAC H clip attaches tent body to cross pole. Crossover pole provides roominess up high. Lightweight fabric has a high thread count and double twisted thread for strength and durability. Opposing mesh doors provide good cross ventilation. Rainfly and floor are made from extrememly light silicone-treated ripstop nylon with a waterproof polyurethane coating. All seams taped with waterproof, solvent-free polyurethane tape. 8 interior mesh pockets keep your gear organized and up off the tent floor; includes gear loft loops. Reflective guyline and reflective webbing on tent corners aid nighttime visibility. Includes stuff sacks and 8 superlight aluminum J-stakes. For a lightweight setup during nice weather leave tent body behind; use the rainfly and footprint (sold separately) with the poles and stakes. Footprint extends the life of the Big Agnes Copper Spur UL4 tent by protecting it from abrasive wear and tear.","short_description":"With a trail weight of 5 lbs. 15 oz., the updated Big Agnes Copper Spur UL4 tent lets you and 3 friends enjoy a light load and plenty of living space on your 3-season backpacking adventures.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424155.png","image_url":"http://i1.avlws.com/115/l424155.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424155&tt=df","retail_price":"629.95","sale_price":"629.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424155\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424155.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865391&amp;link=&amp;tabs=-Details\"></script>","variants":{"8653910001":{"sku":"8653910001","vendor_sku":"TCS414","upc":"873840011846","color":"TERRA COTTA/SILVER","retail_price":"629.95","sale_price":"629.95"}}}
