{"sku":"865359","manufacturer_id":"70603214L","brand_name":"Sierra Designs","product_name":"Sierra Designs Backcountry Bed 800 3-Season Sleeping Bag","long_description":"The lofty 800-fill-power Sierra Designs Backcountry Bed 800 3-Season Sleeping Bag has an integrated comforter and zero zippers for a unique outdoor sleeping experience through spring, summer and fall. Climb into the bag via the large oval opening on top; the oversize comforter seals up the opening so you can sleep comfortably no matter your position: back, side or stomach. With a European Norm (EN) lower-limit rating of 20degF, the Backcountry Bed 800 3-Season sleeping bag is suitable for spring, summer and fall backpacking. On warmer nights, flip the comforter outside the sleeping bag and tuck it back for ventilation; insulated hand/arm pockets provide warmth when the comforter is outside the bag. Down is considered the best insulation available but when wet, it quickly loses loft and the ability to keep you warm; 800-fill-power DriDown is treated to resist moisture. Proprietary process treats each individual duck down plume with a molecular-level polymer so the down stays dry longer, lofts better and dries faster than untreated down. DriDown insulation stays dry 10 times longer, retains 170% more loft when exposed to moisture and dries 33% faster than untreated down. Premium 800-fill-power duck down is extremely compressible and offers exceptional warmth for its weight. Ripstop polyester exterior endures frequent use in the outdoors; polyester taffeta lining is soft and comfortable next to skin. Sleeping pad sleeve on the bottom of the bag secures your pad (pad sold separately) to create the experience of a fully integrated bed. Sierra Designs Backcountry Bed 800 3-Season Sleeping Bag comes with a stuff sack and storage sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The lofty 800-fill-power Sierra Designs Backcountry Bed 800 3-Season Sleeping Bag has an integrated comforter and zero zippers for a unique outdoor sleeping experience through spring, summer and fall.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421743.png","image_url":"http://i1.avlws.com/115/l421743.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421743&tt=df","keywords":"compact","retail_price":"419.95","sale_price":"419.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421743\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421743.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865359&amp;link=&amp;tabs=-Details\"></script>","variants":{"8653590001":{"sku":"8653590001","vendor_sku":"70603214R","upc":"054003745192","size":"Regular","color":"WILLOW","retail_price":"399.95","sale_price":"399.95"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
