{"sku":"865352","manufacturer_id":"BWLURR14","brand_name":"Big Agnes","product_name":"Big Agnes Lulu Sleeping Bag - Women's","long_description":"The women's Big Agnes Lulu Sleeping Bag is roomier than a traditional mummy bag and features quick-drying synthetic insulation for warmth and comfort when sleeping outside in damp weather. Designed for women, with a narrow cut at the shoulders, more width at the hips and extra insulation in the footbox and torso where it's needed most. Underside insulation has been eliminated and replaced with a sleeve for a Big Agnes 20 in. wide rectangular pad (sold separately). Semirectangular bag features short-staple synthetic insulation with 97% recycled content that provides high loft, superior warmth-to-weight ratio and excellent compressibility. Insotect Tubic(TM) tubular insulation system is engineered to provide the maximum cubic loft for excellent warmth. Big Agnes Lulu Sleeping Bag is rated to keep you warm down to about 15degF. Continuous draft wedge insulates the connection between the bag and your pad to prevent cold air from entering. Ripstop nylon shell is treated with a Durable Water Repellent finish; soft, breathable nylon taffeta lining cocoons you in comfort. 2-way, full-length, locking zipper has a big, easy-to-grab zipper pull; left- and right-zippered bags can be zipped together. Large draft tube located behind the zipper prevents warm air from escaping and cold air from entering. Pillow pocket allows you to stuff extra clothing or a travel pillow inside; zippered stash pocket at the shoulders holds your headlamp or watch close by. Interior fabric loops stabilize a sleeping bag liner, sold separately. Big Agnes Lulu Sleeping Bag includes a nylon stuff sack and large cotton storage bag.","short_description":"The women's Big Agnes Lulu Sleeping Bag is roomier than a traditional mummy bag and features quick-drying synthetic insulation for warmth and comfort when sleeping outside in damp weather.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421723.png","image_url":"http://i1.avlws.com/115/l421723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421723&tt=df","keywords":"compact","retail_price":"179.95","sale_price":"179.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865352&amp;link=&amp;tabs=-Details\"></script>","variants":{"8653520001":{"sku":"8653520001","vendor_sku":"BWLUPR14","upc":"873840011433","size":"Petite Right","color":"PURPLE/DARK PURPLE","retail_price":"169.95","sale_price":"169.95"},"8653520002":{"sku":"8653520002","vendor_sku":"BWLURR14","upc":"873840011457","size":"Regular Right","color":"PURPLE/DARK PURPLE","retail_price":"179.95","sale_price":"179.95"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
