{"sku":"865339","manufacturer_id":"APXL-BK","brand_name":"Princeton Tec","product_name":" Princeton Tec Apex LED Headlamp","long_description":"The biggest and brightest headlamp in the Princeton Tec professional series, the Apex(R) LED headlamp stands up to harsh weather and throws 275 lumens up to 116m on high. Features a high-output Maxbright LED for intense, long-range spot lighting; four Ultrabright 5mm LEDs combine to provide wide-angle, close-in lighting. Includes four brightness levels and an emergency strobe; dual switch design allows easy access to all five modes. Headlamp outputs 275 lumens and throws light up to 116m on high to light up the trail ahead. Power-regulated circuit board ensures consistent lighting levels; Apex provides 1.5 hrs. of regulated light and 90 hrs. of total burn time with the Maxbright LED on high. Switch to the 5mm LEDs on low and get up to 14 hrs. of regulated output and 150 hrs. of total burn time. Heat-regulating technology prevents light from getting too hot. Additional strap on top holds light securely in place; rear-mounted battery pack holds 4 AA alkaline batteries (included) and features padding for comfort. Battery power meter lets you know when your batteries are running low. High-grade materials ensure durability and strong resistance to weather and environmental conditions; IPX7 rating ensures protection against water down to 1m for up to 30 min. Princeton Tec Apex headlamp is compatible with AA alkaline, lithium and rechargeable batteries (sold separately).","short_description":"The biggest and brightest headlamp in the Princeton Tec professional series, the Apex(R) LED headlamp stands up to harsh weather and throws 275 lumens up to 116m on high.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417179.png","image_url":"http://i1.avlws.com/115/l417179.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417179&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417179\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417179.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865339&amp;link=&amp;tabs=-Details\"></script>","variants":{"8653390001":{"sku":"8653390001","vendor_sku":"APXL-BK","upc":"795626020562","color":"BLACK","retail_price":"89.95","sale_price":"89.95"}}}
