{"sku":"865446","manufacturer_id":"32205341","brand_name":"Exped","product_name":"Exped SynMat 12 Sleeping Pad","long_description":"The super-thick and warm and Exped SynMat 12 Sleeping Pad provides excellent insulation from the cold, hard ground for year-round adventures, and it still packs down small to fit in your backpack. Lofted microfiber insulation is laminated to top and bottom of inner walls, providing efficient, evenly distributed warmth and eliminating cold spots across all 4 seasons. R-value equals 6; most sleeping pads we sell range in R-value from 1.0 (minimally insulated) to 9.5 (well insulated). Exped Schnozzel Pumpbag is included for fast inflation; pad features 2 wide, low-profile, FlatValves for inflation and deflation. Intake valve features a built-in flap to prevent air escaping when inflating; flap can be released to let a little air out when seeking out that ideal comfort zone. Innovative 3D construction creates a flat sleeping surface from edge to edge; welded seams create airtight construction. Polyester fabric is UV- and abrasion-resistant; nonslip finish helps keep you on the pad; 75-denier fabric stands up to frequent use while backpacking. Exped SynMat 12 Sleeping Pad comes with its own stuff sack for protection during transportation; also includes repair kit with adhesive and fabric patches.","short_description":"The super-thick and warm and Exped SynMat 12 Sleeping Pad provides excellent insulation from the cold, hard ground for year-round adventures, and it still packs down small to fit in your backpack.","category":"Camping And Hiking","subcategory":"Sleeping Pads, Cots And Hammocks","product_group":"Sleeping Pads","thumb_url":"http://i1.avlws.com/115/s463459.png","image_url":"http://i1.avlws.com/115/l463459.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463459&tt=df","keywords":"mattress,mats","retail_price":"199.00","sale_price":"199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463459\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463459.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865446&amp;link=&amp;tabs=-Details\"></script>","variants":{"8654460001":{"sku":"8654460001","vendor_sku":"32205341","size":"L XWIDE","color":"TERRACOTTA","retail_price":"199.00","sale_price":"199.00"}},"categories":["camping-hiking","sleeping-pads-cots-and-hammocks","sleeping-pads"]}
