{"sku":"865402","manufacturer_id":"TSUL314","brand_name":"Big Agnes","product_name":" Big Agnes Slater UL3+ Tent","long_description":"Inspired by the Fly Creek UL line, the ultralight, 3-season Big Agnes Slater UL3+ tent offers the same light and fast design for three backpackers, plus extra floor space and less canopy mesh. Extra space comes at little cost in terms of weight; lightweight, breathable ripstop nylon walls offer extra warmth, privacy and protection. Light and strong DAC Featherlite(R) NSL poles, press-fit connectors and a lightweight hub use an anodization process with fewer chemicals than other processes. DAC twist clips and color-coded pole ends, webbing and buckles make setting up the Big Agnes Slater UL3+ quick and easy. Woven nylon mesh in the upper canopy provides ventilation; ripstop nylon helps keep sand and wind out of the tent when you head to the desert. Polyurethane- and silicone-coated high-tenacity ripstop nylon fly and floor; waterproof, solvent-free polyurethane tape seals all seams. Fly vent improves ventilation to reduce condensation; stormflap over vestibule zipper prevents water drips. Reflective guyouts and reflective webbing on tent corners increase visibility at night. 5 interior mesh pockets and gear loft loops (gear loft sold separately) accommodate storage. For a lightweight setup during nice weather leave tent body behind; use the rainfly and footprint (sold separately) with the poles and stakes. The Big Agnes Slater UL3+ tent comes with 15 superlight aluminum J stakes and stuff sacks.","short_description":"Inspired by the Fly Creek UL line, the ultralight, 3-season Big Agnes Slater UL3+ tent offers the same light and fast design for three backpackers, plus extra floor space and less canopy mesh.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424191.png","image_url":"http://i1.avlws.com/115/l424191.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424191&tt=df","retail_price":"549.95","sale_price":"549.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424191\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424191.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865402&amp;link=&amp;tabs=-Details\"></script>","variants":{"8654020001":{"sku":"8654020001","vendor_sku":"TSUL314","upc":"873840011792","color":"GOLD/GRAY","retail_price":"549.95","sale_price":"549.95"}}}
