{"sku":"865403","manufacturer_id":"TBH414","brand_name":"Big Agnes","product_name":" Big Agnes Big House 4 Tent","long_description":"The Big Agnes Big House 4 tent makes 3-season car camping a deluxe and comfortable experience. With a spacious design for 4 campers, easy setup and great ventilation, you'll have good reason to relax. 2 large doors have dual closure options: mesh only for ventilation, or zip up the polyester layer for complete closure and protection from the elements. Quick Stash on tent body door makes stowing unzipped door simple and easy; welcome mat at front door helps keep your Big House 4 tent free of debris. Optional, zip-on, pole-supported front vestibule (sold separately) adds a sheltered area for relaxing or generous storage space. Color-coded webbing and buckles create an intuitive setup; sleeves and plastic clips attach tent body to the pole frame quickly and easily. Mesh door, walls and ceiling of tent offer excellent cross-ventilation; ripstop polyester fly and rugged polyester taffeta floor have a waterproof polyurethane coating. Fly walls roll up to expose mesh walls for increased ventilation and visibility; vent in the fly minimizes condensation. Lightweight aluminum pole system features press-fit connectors; securely fixed, pressed-in ferrules help ensure the poles remain strong and reliable. Waterproof, solvent-free polyurethane tape seals all seams (no PVC or VOCs); waterproof door helps keeps tent dry. Stay organized with six interior mesh pockets and gear loft loops (gear loft not included); reflective guylines and reflective webbing on tent corners aid nighttime visibility. Big Agnes Big House 4 comes with a briefcase-style carry bag with shoulder straps and organizational pockets; includes 14 lightweight aluminum hook stakes. Optional, zip-on, pole-supported front vestibule adds generous storage area; footprint extends the life of your tent by protecting it from wear (both sold separately).","short_description":"The Big Agnes Big House 4 tent makes 3-season car camping a deluxe and comfortable experience. With a spacious design for 4 campers, easy setup and great ventilation, you'll have good reason to relax.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424483.png","image_url":"http://i1.avlws.com/115/l424483.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424483&tt=df","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424483\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424483.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865403&amp;link=&amp;tabs=-Details\"></script>","variants":{"8654030001":{"sku":"8654030001","vendor_sku":"TBH414","upc":"873840012133","color":"YELLOW/RED","retail_price":"299.95","sale_price":"299.95"}},"categories":["camping-hiking","tents","camping-tents"]}
