{"sku":"865450","manufacturer_id":"13344","brand_name":"Rei","product_name":"REI Polar Pod Sleeping Bag - Long - Special Buy","long_description":"A great value for campers and backpackers, the synthetic long REI Polar Pod Sleeping Bag is priced for your budget, yet it's still feature-packed and built to keep you warm on 3-season adventures. Synthetic hollow-fiber insulation retains heat while providing loft and compressibility; insulation is equally distributed all the way around the bag to eliminate cold spots. With a lower-limit European Norm (EN) rating of 31degF, the Polar Pod is a versatile bag for adventures into the mountains in spring, summer and fall. Relaxed fit from the shoulders to the hips increases comfort by providing ample space to move around. Ripstop nylon shell resists water and abrasion; smooth nylon taffeta lining is comfortable against your skin; treated with a durable water repellent finish to repel moisture. Contoured hood, insulated full-face muffler, full draft collar and full-length draft tube with ground-level seams keep body heat in and cold air out. Pillow pocket keeps your camp pillow in place; stuff clothing inside pocket if you don't have a pillow. The REI Polar Pod Sleeping Bag in a long-length has an external chest pocket that stows your watch, glasses or other small essentials. Differentiated drawcords (1 round, 1 flat) let you adjust hood and neck easily in the dark. Full-length of zipper is backed by wide, antisnag binding tape. Any REI backpacking bag can be zipped to any other REI backpacking bag because of the consistent 63 in., No. 5, YKK zipper; women's bags zip on the right, men's on the left. Pad loops provide attachment points to keep your sleeping bag and pad together to avoid rolling off onto the cold ground (straps and sleeping pad not included). Includes stuff sack and storage bag. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags. Special buy.","short_description":"A great value for campers and backpackers, the synthetic long REI Polar Pod Sleeping Bag is priced for your budget, yet it's still feature-packed and built to keep you warm on 3-season adventures.","category":"Camping & Hiking","subcategory":"Sleeping Bags","product_group":"3-Season Sleeping Bags (+15F To +32F)","thumb_url":"http://i1.avlws.com/115/s357359.png","image_url":"http://i1.avlws.com/115/l357359.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=357359&tt=df","keywords":"sleeping,sleeping bag,summergear,bedroll,bag","retail_price":"99.50","sale_price":"68.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=357359\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m357359.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865450&amp;link=&amp;tabs=-Details\"></script>","variants":{"8654500001":{"sku":"8654500001","vendor_sku":"13344","upc":"486545000017","size":"Long Left","color":"DEEP SEA/BLACK","retail_price":"68.73","sale_price":"68.73"}}}
