{"sku":"865652","manufacturer_id":"GC-XA2BUS","brand_name":"Jvc","product_name":" JVC ADIXXION Cam 2 Action Camera","long_description":"The pocket-sized JVC ADIXXION Cam 2 action camera has built-in Wi-Fi, a 1.5-in. LCD monitor and a rugged design that shrugs water, dust and freezing temps without the need for a separate housing. The ADIXXION lets you record all the action in 1080/60p full HD; gyro-sensor image stabilizer reduces shake; and super-wide lens expands your viewing angle. 8 mega-pixel back-illuminated CMOS captures a high resolution image and combined with the F2.4 lens, gives excellent low-light performance. Dual standard tripod mounts allow use of a wide range of accessories (sold separately). Built-in 1.5-in. LCD monitor features 112,000-pixel resolution, auto brightness and auto off. Wi-Fi and Quad View create a fast wireless connection that syncs to iOS and Android smartphones for remote control and video monitoring of up to four ADIXXION cameras at once. 5X digital zoom; 16-megapixel ultra-resolution stills; high-speed burst photos; simultaneous recording of video and stills; time-lapse stills; 720/120p high-speed recording. Gyro Sensor digital image stabilizer helps take the shake out of your video; integrated mic with 128 kbps audio ensures clear, high-quality sound. Connections include mini HDMI output, USB for computer connections and battery charging and SD/SDHC/SDXC card slot. Enjoy easy operation with on-board video effects, on-screen menu system, auto and manual white balance and simple USB battery charging. Works with iMovie and Final Cut Pro X for easy video editing, sharing and archiving; USTREAM video streaming allows you to easily upload video to Youtube and other video sites. The JVC ADIXXION Cam 2 action camera is waterproof to 5m, shockproof for drops from 2m, dustproof and freezeproof; battery provides up to 2 hrs. 5 min. record time.","short_description":"The pocket-sized JVC ADIXXION Cam 2 action camera has built-in Wi-Fi, a 1.5-in. LCD monitor and a rugged design that shrugs water, dust and freezing temps without the need for a separate housing.","category":"Electronics","subcategory":"Helmet Cameras","product_group":"Helmet Cams","thumb_url":"http://i1.avlws.com/115/s426807.png","image_url":"http://i1.avlws.com/115/l426807.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426807&tt=df","keywords":"hd,pov","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426807\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426807.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865652&amp;link=&amp;tabs=-Details\"></script>","variants":{"8656520001":{"sku":"8656520001","vendor_sku":"GC-XA2BUS","upc":"046838069048","retail_price":"299.95","sale_price":"299.95"}},"categories":["electronics","helmet-cameras","helmet-cams"]}
