{"sku":"865631","manufacturer_id":"531-6-2201","brand_name":"Timbuk2","product_name":"Timbuk2 Aviator Wheeled Backpack","long_description":"Packed on your back or rolled like a suitcase, the Timbuk2 Aviator Wheeled Backpack is a high-capacity, expertly organized pack with sophisticated styling that works downtown or out of town. Converts from suitcase to travel backpack with stowaway padded straps and removable hipbelt; great for going up a lot of stairs, over cobblestones or to remote train stations. Skateboard wheels and extending handle provide a silent, gliding roll. Large top compartment holds boots or a bulky jacket and can extend down into the main compartment if needed. Main duffel-style compartment has a U-shape zipper for easy packing. 3 external zippered pockets hold a phone, wallet, book or other quick-access items; the one on the side stows the backpack hipbelt when it's not needed. Made from durable nylon and reinforced tarpaulin fabric. External compression straps; grab handles on all sides. Padded, ventilated back panel on the Timbuk2 Aviator Wheeled Backpack lets you carry it in comfort in warm weather.","short_description":"Packed on your back or rolled like a suitcase, the Timbuk2 Aviator Wheeled Backpack is a high-capacity, expertly organized pack with sophisticated styling that works downtown or out of town.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433939.png","image_url":"http://i1.avlws.com/115/l433939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433939&tt=df","retail_price":"259.00","sale_price":"259.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865631&amp;link=&amp;tabs=-Details\"></script>","variants":{"8656310001":{"sku":"8656310001","vendor_sku":"531-6-2201","upc":"631364515383","color":"CARBON/CARBON RIPSTOP","retail_price":"259.00","sale_price":"259.00"}},"categories":["travel","luggage","wheeled-luggage"]}
