{"sku":"865788","manufacturer_id":"6702","brand_name":"Niterider","product_name":" NiteRider Lumina 700 Front Bike Light and Solas Rear Bike Light Combo","long_description":"Illuminate your path with a bright 700 lumens and enhance your visibility to others on your commute with the NiteRider combo light set. It includes the Lumina 700 front light and the Solas rear light. Lumina 700 front bike light eliminates external battery packs and finicky cords-everything is right there for quick, easy, no-fuss lighting. Together with highly efficient reflectors, the ultrabright LED delivers a nice, even light pattern void of rings or halos. Four continuous light levels include high, medium, low, and the battery-conserving \"walk\" mode; run times range from 1.5 hrs. on high to 5.5 hrs. on low to 18 hrs. on \"walk\". Light output for each level includes 700 lumens on high, 350 lumens on medium, 150 lumens on low and 40 lumens on \"walk\". Also offers a flashing mode for alerting others of your presence; 40 hrs. run time on flashing. Internal lithium-ion battery can be charged from the USB port of your computer, making charging at the office a snap; 5.5 hrs. maximum charge time. Incorporated quick-release handlebar mount on the NiteRider Lumina 700 bike light fits handlebar diameters up to 31.8mm; light can be easily disconnected from mount. NiteRider Solas USB is a rear safety light featuring a powerful, 2-watt LED that's so bright it's even noticable during the day. When it's time to recharge the Solas just plug it into your computer's USB port. Custom reflector offers maximum rider visibility even when light is turned off. Flash and steady mode. NiteRider Solas USB Rear bike light includes seat post and seat stay mounts, and batteries. Combo set includes NiteRider Lumina 700 head light with helmet mount, handlebar mount and USB charging cable; Solas taillight has seat post and seat stay mounts, and batteries.","short_description":"Illuminate your path with a bright 700 lumens and enhance your visibility to others on your commute with the NiteRider combo light set. It includes the Lumina 700 front light and the Solas rear light.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Lights","thumb_url":"http://i1.avlws.com/115/s375671.png","image_url":"http://i1.avlws.com/115/l375671.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375671&tt=df","keywords":"flashing","retail_price":"148.95","sale_price":"148.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375671\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375671.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865788&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657880001":{"sku":"8657880001","vendor_sku":"6702","upc":"702699067028","retail_price":"148.95","sale_price":"148.95"}}}
