{"sku":"865726","manufacturer_id":"234131-007","brand_name":"Scott","product_name":"Scott Metrix 40 Solution Women's Bike - 2014","long_description":"This women's Scott Metrix 40 Solution Bike offers dependable performance for commutes and everyday rides, thanks to an upright riding position, 24 gears for any terrain and a sturdy frame. Flat handlebar creates a comfortable, upright riding position that also allows better heads-up visiblity than traditional road bike drop handlebars. 6061 aluminum frame offers sturdy performance to tackle urban avenues and scenic paths, and to go the distance on long country roads; sloped top tube eases mounts/dismounts. Women-specific frame is designed to enhance the performance and comfort of women cyclists. Drivetrain features Shimano components for dependable, lasting performance and easy shifting through the 24 gear combinations. Tektro RX1 linear-pull brakes make it easy to manage your speed. Fast-rolling and agile 700c wheels are outfitted with puncture-resistant Schwalbe Spicer tires. Frame eyelets accept fenders or a rear rack (not included). Specs on the Scott Metrix 40 Solution women's bike are subject to change.","short_description":"This women's Scott Metrix 40 Solution Bike offers dependable performance for commutes and everyday rides, thanks to an upright riding position, 24 gears for any terrain and a sturdy frame.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s465679.png","image_url":"http://i1.avlws.com/115/l465679.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465679&tt=df","retail_price":"599.00","sale_price":"599.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465679\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465679.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865726&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657260003":{"sku":"8657260003","vendor_sku":"234131-008","upc":"886118607184","size":"L","color":"BLACK/BLUE","retail_price":"599.00","sale_price":"599.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
