{"sku":"865785","manufacturer_id":"6590","brand_name":"Niterider","product_name":" NiteRider MiNewt Mini.350 Plus Bike Light","long_description":"The NiteRider MiNewt Mini.350 Plus bike light illuminates your way for 6 hrs. of run time during low-light rides, and it includes both a helmet mount and handlebar mount for versatility. 3 continuous light levels include high, medium, low as well as a flashing mode for safety; run times range from 2 hrs. on high to 6 hrs. on low to 4.5 hrs. on flash. Light output for each level includes 350 lumens on high, 200 lumens on medium, 120 lumens on low. Custom reflector provides an ideal beam pattern for night cycling. Battery can be charged from the USB port of your computer, making charging at the office a snap; 4.5 hrs. maximum charge time. Battery can mount on your helmet or the stem; system is very small so there are many options for mounting. Low battery indicator lets you know when it's time to recharge. Helmet mount gives you a heads up view of your surroundings and allows you to illuminate objects not directly in front of you by turning your head. Incorporated quick-release handlebar mount on the NiteRider MiNewt Mini.350 plus bike light fits handlebar diameters up to 31.8mm; light can be easily disconnected from mount. Includes bike light, battery, charger, USB charging cable, helment mount with extension cable and handelbar mount.","short_description":"The NiteRider MiNewt Mini.350 Plus bike light illuminates your way for 6 hrs. of run time during low-light rides, and it includes both a helmet mount and handlebar mount for versatility.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Lights","thumb_url":"http://i1.avlws.com/115/s375659.png","image_url":"http://i1.avlws.com/115/l375659.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375659&tt=df","keywords":"flashing","retail_price":"93.95","sale_price":"93.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375659\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375659.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865785&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657850001":{"sku":"8657850001","vendor_sku":"6590","upc":"702699065901","retail_price":"93.95","sale_price":"93.95"}},"categories":["cycling","bike-accessories","bike-lights"]}
