{"sku":"865719","manufacturer_id":"234032-009","brand_name":"Scott","product_name":"Scott Genius 930 29er Bike - 2014","long_description":"Built with a superlight 6061 custom-butted alloy frame, the 30-speed Scott Genius 930 29er mountain bike offers serious trail riders 3 full-suspension modes you can change at the flip of a switch. Hydroformed and butted 6061 aluminum frame is lightweight and sturdy; geometry has been fine-tuned to maximize suspension performance. TwinLoc system provides remote, bar-top control of suspension travel and lockout, letting you customize performance on the fly. 3 TwinLoc settings supply full travel front and rear, Traction mode (full travel on fork with limited rear suspension), and lockout for both front and rear. Fox 32 Float Evolution CTD Air suspension fork has 130mm of air-sprung travel; Fox Float CTD rear shock has a progressive damping curve and excellent sensitivity. Rear shock linkage chip lets you adjust head tube angle by 0.4deg to meet your geometry preferences; oversize bearings help keep suspension stiff and responsive. Tapered head tube and 15mm front quick-release axle stiffen up the front end for enhanced strength and handling precision. Interchangeable dropout system (IDS-SL) lets you switch between rear axle standards (142x12mm, 135x12mm and 135x10mm QR) to further tune and enhance performance. 3x10 Shimano drivetrain features XT Shadow Plus rear derailleur along with Shimano SLX shifters and front derailleur for quick, efficient and precise performance. Shimano SLX hydraulic disc brakes offer responsive, progressive braking. Syncros XC69 wheels are outfitted with excellent all-arounder Schwalbe Rocket Ron tires to ensure great traction and fast-rolling performance on the trail. Specs Scott Genius 930 29er bike are subject to change.","short_description":"Built with a superlight 6061 custom-butted alloy frame, the 30-speed Scott Genius 930 29er mountain bike offers serious trail riders 3 full-suspension modes you can change at the flip of a switch.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s465635.png","image_url":"http://i1.avlws.com/115/l465635.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465635&tt=df","retail_price":"4099.00","sale_price":"4099.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465635\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465635.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865719&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
