{"sku":"865717","manufacturer_id":"233987-006","brand_name":"Scott","product_name":"Scott Spark 940 29er Bike - 2014","long_description":"Offering excellent cross-country performance for serious riders, the Scott Spark 940 29er full-suspension mountain bike delivers a 3-mode, shock-absorbent platform for climbs, flats and descents. Hydroformed and butted 6061 aluminum frame is lightweight and sturdy; geometry has been fine-tuned to maximize suspension performance. Oversize bearings help keep suspension stiff and responsive; rear shock linkage chip lets you adjust head tube angle by 0.5deg to meet your geometry preferences. TwinLoc system provides remote, bar-top control of suspension travel and lockout, letting you customize performance on the fly. 3 TwinLoc settings supply full travel front and rear, Traction mode (full travel on fork with limited rear travel), and lockout for both front and rear. Fox 32 Float 29 Evolution CTD Air suspension fork has 100mm of air-sprung travel; Fox Float CTD rear shock has a progressive damping curve and excellent sensitivity. Tapered head tube and 15mm front quick-release axle stiffen up the front end for enhanced strength and handling precision. 3x10 Shimano drivetrain features XT rear derailleur along with SLX shifters and front derailleur for quick, efficient and precise performance. Shimano Deore hydraulic disc brakes use a 180mm rotor up front and a 160mm rotor in back to facilitate responsive, progressive braking. Sturdy 29er wheels are outfitted with fast-rolling Schwalbe Rocket Ron tires with lightweight Kevlar(R) beads for high durability and excellent all-around traction. Please note: pedals are sold separately. Specs are subject to change.","short_description":"Offering excellent cross-country performance for serious riders, the Scott Spark 940 29er full-suspension mountain bike delivers a 3-mode, shock-absorbent platform for climbs, flats and descents.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s465627.png","image_url":"http://i1.avlws.com/115/l465627.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465627&tt=df","retail_price":"3299.00","sale_price":"3299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465627\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465627.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865717&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
