{"sku":"865783","manufacturer_id":"6596","brand_name":"Niterider","product_name":" NiteRider Lumina Micro 220 Front Bike Light","long_description":"Packing a 220-lumen punch for brightening the path during commutes and low-light rides, the NiteRider Lumina Micro 220 Front Bike Light keeps things simple with a compact, cordless design. Self-contained design eliminates external battery packs and finicky cords-everything is right there for quick, easy, no-fuss lighting. Together with highly efficient reflectors, the ultrabright LED delivers a nice, even light pattern void of rings or halos. Four continuous light levels include high, medium, low and the battery-conserving \"walk\" mode; run times range from 1.5 hrs. on high to 4 hrs. on low to 14 hrs. on \"walk\". Light output for each level includes 220 lumens on high, 120 lumens on medium, 80 lumens on low and 20 lumens on \"walk\". Internal lithium ion battery can be charged from the USB port of your computer, making charging at the office a snap; 3.5 hrs. maximum charge time. Quick-release handlebar mount on the NiteRider Lumina Micro 220 bike light fits handlebar diameters up to 31.8mm; light can be easily disconnected from mount.","short_description":"Packing a 220-lumen punch for brightening the path during commutes and low-light rides, the NiteRider Lumina Micro 220 Front Bike Light keeps things simple with a compact, cordless design.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Lights","thumb_url":"http://i1.avlws.com/115/s375651.png","image_url":"http://i1.avlws.com/115/l375651.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375651&tt=df","keywords":"flashing","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375651\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375651.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865783&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657830001":{"sku":"8657830001","vendor_sku":"6596","upc":"702699065963","retail_price":"59.95","sale_price":"59.95"}},"categories":["cycling","bike-accessories","bike-lights"]}
