{"sku":"865725","manufacturer_id":"234128-008","brand_name":"Scott","product_name":"Scott Metrix 20 Solution Women's Bike - 2014","long_description":"The Scott Metrix 20 Solution women's bike uses a hybrid design with reliable Shimano Sora components to deliver a comfortable, heads-up position for commutes and everyday riding. Flat handlebar creates a comfortable, upright riding position that also allows better heads-up visibility than traditional road bike drop handlebars. 6061 aluminum frame offers sturdy performance to tackle urban avenues, scenic paths and long country roads; sloped top tube eases mounts/dismounts. Women-specific frame is designed to enhance the performance and comfort of women cyclists. Carbon fork helps reduce weight and damps road vibrations to enhance comfort. Snappy Shimano Sora trigger shifters and derailleurs ensure fast, precise shifts though the wide-ranging and easy-spinning 18 gear combinations. Fast-rolling and agile 700c wheels are outfitted with puncture-resistant Continental Ultra Sport II tires so you can cruise along on a swift, sporty ride. Frame eyelets accept fenders or a rear rack (not included). Specs on the Scott Metrix 20 Solution women's bike are subject to change.","short_description":"The Scott Metrix 20 Solution women's bike uses a hybrid design with reliable Shimano Sora components to deliver a comfortable, heads-up position for commutes and everyday riding.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s465675.png","image_url":"http://i1.avlws.com/115/l465675.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465675&tt=df","retail_price":"999.00","sale_price":"999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465675\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465675.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865725&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","hybrid-bikes"]}
