{"sku":"865781","manufacturer_id":"6707","brand_name":"Niterider","product_name":" NiteRider Pro 2200 Race Bike Light","long_description":"With its compact battery, the NiteRider Pro 2200 LED Race bike light pumps out a very bright 2,200 lumens of light with little weight, so you can keep your race pace through the night. Switch at top of the headlamp lets you quickly and easily change the amount of light output. 5 continuous light levels include high, medium, low, race and the battery-conserving \"walk\" mode; run times range from 1.25 hrs. on high to 5 hrs. on low to 34 hrs. on \"walk\". Light output for each level includes 2,200 lumens on high, 1200 lumens on medium, 600 lumens on low, 250 lumens on race and 40 lumens on \"walk\". 8-step power gauge on top of the headlamp shows you the remaining battery life; charges in 6 hrs. Light can be mounted on handlebar (fits up to 31.8mm) or helmet (mount included); battery can be strapped to frame or stashed in a pack. NiteRider Pro 2200 LED Race bike light system includes headlamp, handlebar mount, helmet mount, lithium-ion battery with cord, charger.","short_description":"With its compact battery, the NiteRider Pro 2200 LED Race bike light pumps out a very bright 2,200 lumens of light with little weight, so you can keep your race pace through the night.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Lights","thumb_url":"http://i1.avlws.com/115/s375643.png","image_url":"http://i1.avlws.com/115/l375643.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375643&tt=df","keywords":"flashing","retail_price":"339.95","sale_price":"339.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375643\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375643.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865781&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657810001":{"sku":"8657810001","vendor_sku":"6707","upc":"702699067073","retail_price":"339.95","sale_price":"339.95"}}}
