{"sku":"865782","manufacturer_id":"6700","brand_name":"Niterider","product_name":" NiteRider Lumina Flare 650 Bike Light","long_description":"With a 650-lumen front beam to light the way and a rear flashing red light to cover your back, the NiteRider Lumina Flare 650 bike light packs a dual-purpose wallop into a compact cordless design. Self-contained design eliminates external battery packs and finicky cords; unit includes mounts for your helmet or handlebars. Together with highly efficient reflectors, the ultrabright LED delivers a nice, even light pattern without rings or halos. 1-watt integrated tail light enhances safety. 4 continuous light levels include high, medium, low, and the battery-conserving \"walk\" mode; run times range from 1.5 hrs. on high to 5.5 hrs. on low to 18 hrs. on \"walk\". Light output is 650 lumens on high, 350 lumens on medium, 200 lumens on low and 40 lumens on \"walk\". Also offers a flashing mode for alerting others of your presence. Internal lithium ion battery can be charged from the USB port of your computer, making charging at the office a snap; 6 hrs. maximum charge time. Incorporated quick-release handlebar mount on the NiteRider Lumina 550 bike light fits handlebar diameters up to 31.8mm; light can be easily disconnected from mount.","short_description":"With a 650-lumen front beam to light the way and a rear flashing red light to cover your back, the NiteRider Lumina Flare 650 bike light packs a dual-purpose wallop into a compact cordless design.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Lights","thumb_url":"http://i1.avlws.com/115/s375647.png","image_url":"http://i1.avlws.com/115/l375647.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375647&tt=df","keywords":"flashing","retail_price":"144.95","sale_price":"144.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375647\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375647.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865782&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657820001":{"sku":"8657820001","vendor_sku":"6700","upc":"702699067004","retail_price":"144.95","sale_price":"144.95"}}}
