{"sku":"865735","manufacturer_id":"234117-021","brand_name":"Scott","product_name":"Scott Speedster 20 Bike - 2014","long_description":"With an aero frame and dependable Shimano 105 components, the Scott Speedster 20 Bike delivers efficient speed for long road rides. Hydroformed, double-butted 6061 aluminum frame boasts aerodynamic tube shaping and internal cable routing for sleek performance. Carbon fork with alloy steerer tube reduces weight and helps damp energy-draining road vibrations. Compact Shimano 105 crankset is paired with a wide-ranging 12-30 cassette for 20 easy-spinning gear combinations to handle every ride, from steep hills to speedy pursuits. Shimano 105 derailleurs and shifters ensure precise shifts and dependable performance. Easily manage your speed, from fine-tuning to outright powerful stops, with the Shimano dual-pivot caliper brakes. Syncros wheels are wrapped with Schwalbe Lugano tires to deliver great road feel, grip and low rolling resistance. Please note: Pedals are not included. Specs on the Scott Speedster 20 Bike are subject to change.","short_description":"With an aero frame and dependable Shimano 105 components, the Scott Speedster 20 Bike delivers efficient speed for long road rides.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s465527.png","image_url":"http://i1.avlws.com/115/l465527.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465527&tt=df","retail_price":"1399.00","sale_price":"1399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465527\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465527.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865735&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
