{"sku":"865709","manufacturer_id":"234195-008","brand_name":"Scott","product_name":"Scott Contessa Scale 710 27.5 Women's Bike - 2014","long_description":"Swift and sure on tough trails, the Scott Contessa Scale 710 27.5 women's mountain bike pairs a reliable Shimano component set with 27.5 in. wheels for quick acceleration and excellent control. The Contessa Scale 710 27.5 bike is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Aluminum frame geometry is designed specifically for women, creating a more comfortable ride compared to unisex frames. RockShox XC 30 TK suspension fork has 100mm of travel to smooth out trails; bar-top remote lockout lets you control suspension on the fly. Shimano XT Shadow rear derailleur, Deore shifters and Deore front derailleur offer consistent shifting across the 30 gears. Shimano hydraulic disc brakes provide easy, progressive braking with a 180mm rotor up front and a 160mm rotor in the back. Syncros X-37 wheels are wrapped with the excellent all-arounder Schwalbe Rocket Ron tires to ensure great traction and fast-rolling performance on the trail. Full-length cable housing deters gunky buildup that saps shifting performance; replaceable rear derailleur hanger helps extend the frame's usable lifespan. Specs on the Scott Contessa Scale 710 27.5 women's mountain bike are subject to change.","short_description":"Swift and sure on tough trails, the Scott Contessa Scale 710 27.5 women's mountain bike pairs a reliable Shimano component set with 27.5 in. wheels for quick acceleration and excellent control.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s465595.png","image_url":"http://i1.avlws.com/115/l465595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465595&tt=df","retail_price":"1349.00","sale_price":"1349.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865709&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657090004":{"sku":"8657090004","vendor_sku":"234195-008","upc":"886118610450","size":"L","color":"WHITE/BLACK/BLUE","retail_price":"1349.00","sale_price":"1349.00"}},"categories":["cycling","bikes","mountain-bikes"]}
