{"sku":"865757","manufacturer_id":"PRW5050BN-5","brand_name":"Casio","product_name":" Casio ProTrek PRW5050BN-5 Multifunction Watch","long_description":"A tough and precise atomic time keeper, the Casio ProTrek PRW5050BN-5 multifunction watch draws its power from the sun and combines the intuitiveness of analog with the convenience of digital. Multi-band atomic timekeeping function receives six radio signals a day (five in China) to calibrate the time; it can be set to receive signals manually or atomically. No batteries to replace! Efficient, large-capacity solar battery requires very little light to recharge and lasts up to five months without recharging. Triple sensors enable easy, one-touch operation of an altimeter/barometer, compass and thermometer. Altimeter tracks elevation gain/loss from -2,300 to 32,800 ft. (-700 to 10,000m); stores up to 40 records of high/low altitude, cumulative ascent/descent and date/month/time. Numerical/trend graph data and distinctive arrow icons indicate barometric pressure patterns; barometer tracks atmospheric pressure from 260 to 1,100 hPa (7.68 to 32.49 inHg). Digital compass reports bearing in 1deg increments; thermometer ranges from 14 to 140degF (-10 to 60degC) measured in 0.2degF increments (0.1degC). Analog second hand points to magnetic north in compass mode while showing changes in elevation in altimeter mode and current pressure tendency in barometer mode. The Casio ProTrek PRW5050BN-5 multifunction watch operates in temperatures as low as 14degF/-10degC and resists water to depths of 100m (330 ft.). Stopwatch; elapsed time; splits; first/second place times; countdown timer; 12/24-hr. time; world time; 29 time zones; date/day; auto calendar; five daily alarms; hourly chime. Full Auto LED light allows flick-of-the-wrist illumination at night. Soft silicone band remains highly resistant to tearing and abrasion.","short_description":"A tough and precise atomic time keeper, the Casio ProTrek PRW5050BN-5 multifunction watch draws its power from the sun and combines the intuitiveness of analog with the convenience of digital.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s456279.png","image_url":"http://i1.avlws.com/115/l456279.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456279&tt=df","keywords":"waterproof","retail_price":"470.00","sale_price":"470.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456279\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456279.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865757&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657570001":{"sku":"8657570001","vendor_sku":"PRW5050BN-5","upc":"079767918231","color":"BLACK/TAN","retail_price":"470.00","sale_price":"470.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
