{"sku":"865755","manufacturer_id":"PRG270-1","brand_name":"Casio","product_name":" Casio ProTrek PRG270 Multifunction Watch","long_description":"The solar-powered, triple-sensor Casio ProTrek PRG270 multifunction watch sports easy-to-use features, including a digital compass, altimeter, barometer and thermometer. No batteries to replace! Efficient, large-capacity solar battery requires very little light to recharge and lasts up to 6 months without recharging. Triple sensors measure compass bearing, altitude/atmospheric pressure and temperature. Despite their smaller size, new sensors deliver better accuracy and energy efficiency than previous models, with 95% smaller sensors and 90% less power consumption. Altimeter tracks elevation in 1m increments from -2,300 to 32,800 ft. (-700 to 10,000m); it stores up to 30 records of high/low altitude, ascent/descent and date/month/time. Barometer tracks atmospheric pressure from 260 to 1,100 hPa (7.68 to 32.49 inHg). Digital compass reports bearing with 60 seconds of continuous measurement. Features include a countdown timer, 1/100 second stopwatch, time in 12- or 24-hr. format, world time with 31 time zones, 5 daily alarms and hourly chime. The Casio ProTrek PRG270 multifunction watch features a full auto LED backlight that allows you to check data and take readings with ease. 100m (330 ft.) water resistance and a stainless-steel case help protect the watch; resin wrist band is comfortable and durable.","short_description":"The solar-powered, triple-sensor Casio ProTrek PRG270 multifunction watch sports easy-to-use features, including a digital compass, altimeter, barometer and thermometer.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s449843.png","image_url":"http://i1.avlws.com/115/l449843.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449843&tt=df","keywords":"waterproof","retail_price":"180.00","sale_price":"180.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449843\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449843.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865755&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657550001":{"sku":"8657550001","vendor_sku":"PRG270-1","upc":"079767919726","color":"BLACK/BLACK","retail_price":"180.00","sale_price":"180.00"}}}
