{"sku":"865712","manufacturer_id":"233974-008","brand_name":"Scott","product_name":"Scott Spark 750 27.5 Bike - 2014","long_description":"Ready for epic days of cross-country bliss with its nimble 27.5 in. wheels, the Scott Spark 750 27.5 full-suspension bike offers up a lightweight, plush platform that adjusts easily on-the-fly. The Spark 750 27.5 is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Lightweight 6061 aluminum frame boasts a responsive, adjustable geometry and a stiff aluminum swingarm for excellent rear-end tracking. Oversize bearings help keep suspension stiff and responsive; rear shock linkage chip lets you adjust head tube angle by 0.5deg to meet your geometry preferences. TwinLoc system provides remote, bar-top control of suspension travel and lockout, letting you customize performance on the fly. 3 TwinLoc settings supply full travel front and rear, Traction mode (full travel on fork with limited rear suspension), and lockout for both front and rear. Fox 32 Float 29 Evolution CTD Air suspension fork has 120mm of air-sprung travel; Fox Float CTD rear shock has a progressive damping curve and excellent sensitivity. Tapered head tube and 15mm front quick-release axle stiffen up the front end for enhanced strength and handling precision. 3x10 Shimano drivetrain features an XT Shadow Plus rear derailleur along with Deore shifters and front derailleur for quick, efficient and precise performance. Shimano hydraulic disc brakes use a 180mm rotor up front and a 160mm rotor in back to facilitate responsive, progressive braking. Syncros XC39 wheels are outfitted with excellent all-arounder Schwalbe Rocket Ron tires to ensure great traction and fast-rolling performance on the trail. Specs on the Scott Spark 750 27.5 full-suspension mountain bike are subject to change.","short_description":"Ready for epic days of cross-country bliss with its nimble 27.5 in. wheels, the Scott Spark 750 27.5 full-suspension bike offers up a lightweight, plush platform that adjusts easily on-the-fly.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s465607.png","image_url":"http://i1.avlws.com/115/l465607.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465607&tt=df","retail_price":"2649.00","sale_price":"2649.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465607\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465607.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865712&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
