{"sku":"865789","manufacturer_id":"30117","brand_name":"Powertap","product_name":"PowerTap G3 46mm Carbon Shimano Wheelset","long_description":"Offering featherweight performance for racing and serious training, the PowerTap G3 46mm Carbon Shimano Wheelset features a PowerTap G3 power meter hub to precisely measure your cadence and power. Wheelset features a PowerTap G3 rear hub, which measures how hard you pedal and transmits the data to an ANT+ compatible device for analysis. Please note, you will need a Joule or other ANT+ compatible device to use the PowerTap G3 Power Meter hub, ANT+ compatible device not included. PowerTap G3 hub is lightweight and stiff (thanks to wide flanges) and has field-serviceable electronics; hub offers real-time power data and is accurate to within  1.5%. Rims use high-quality carbon and a precisely cured resin system to produce light weight with exceptional strength; rims manufactured by Reynolds. Wheels are built with DT Swiss Competition spokes and internal alloy pillar-style nipples; wheels are clinchers and not tubeless compatible. Please note: G3 hub will not work with the CycleOps Cervo (Yellow CPU); you will need a CycleOps Joule or other ANT+ compatible device to pair with this hub. The PowerTap G3 46mm Carbon Shimano Wheelset includes skewers and Reynolds Cryo-Blue brake pads and rim strips.","short_description":"Offering featherweight performance for racing and serious training, the PowerTap G3 46mm Carbon Shimano Wheelset features a PowerTap G3 power meter hub to precisely measure your cadence and power.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Tires, Tubes And Wheels","thumb_url":"http://i1.avlws.com/115/s446751.png","image_url":"http://i1.avlws.com/115/l446751.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=446751&tt=df","retail_price":"2199.00","sale_price":"2199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=446751\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m446751.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865789&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657890001":{"sku":"8657890001","vendor_sku":"30117","upc":"012527010615","size":"700C","color":"BLACK","retail_price":"2199.00","sale_price":"2199.00"}},"categories":["cycling","bike-components","bike-tires-tubes-and-wheels"]}
