{"sku":"865753","manufacturer_id":"GW2310-1","brand_name":"Casio","product_name":"Casio G-Shock GW2310-1 Atomic Solar Watch","long_description":"Inspired by the popular Tough Solar watch, the Casio G-Shock GW2310-1 Atomic Solar watch takes powerful accuracy to the next level while retaining the classic, utilitarian design of its predecessor. Multi-band atomic timekeeping (in the U.S., U.K., Germany, Japan, China) receives time-calibrating radio signals up to six times per day (five times per day in China). Tough solar power technology eliminates the need to ever change a battery; built-in solar panel converts sunlight and fluorescent light into energy. Shock-resistant case resists water down to 200m (660 ft.). Auto EL backlight with afterglow lets you see the display in the dark. World Time features 31 times zones, 48 cities, city code display and daylight saving on/off. Four daily alarms; snooze; stopwatch; hourly chime; countdown timer; auto calendar. 1/100-second stopwatch measures elapsed time, split time and 1st-place/2nd-place times. The Casio G-Shock GW2310-1 Atomic Solar watch features a battery that lasts up to 10 mos. on a full charge without further exposure to light.","short_description":"Inspired by the popular Tough Solar watch, the Casio G-Shock GW2310-1 Atomic Solar watch takes powerful accuracy to the next level while retaining the classic, utilitarian design of its predecessor.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s449839.png","image_url":"http://i1.avlws.com/115/l449839.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449839&tt=df","keywords":"waterproof","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449839\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449839.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865753&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657530001":{"sku":"8657530001","vendor_sku":"GW2310-1","upc":"079767437954","color":"BLACK","retail_price":"129.95","sale_price":"129.95"}},"categories":["camping-hiking","camp-electronics","watches"]}
