{"sku":"865721","manufacturer_id":"234151-008","brand_name":"Scott","product_name":"Scott Sportster 30 Bike - 2014","long_description":"Scott Sportster 30 bike uses a hybrid design ensure comfort while cruising around town or casually exploring the area, and it sweetens the deal with Shimano parts and a front, shock-absorbent fork. Aluminum frame is light and sturdy enough to tackle rough urban streets or pleasant rides in the countryside. Flat handlebar creates a comfortable, upright riding position that enables heads-up visibility. SR Suntour NEX HLO suspension fork provides 63mm of travel to soften bumps and jolts; suspension can be locked out when it's not needed. Shimano triple crankset powers 27 gear choices to confidently handle almost any grade; Shimano Altus shifters deftly guide the Deore derailleurs through each gear. Shimano hydraulic disc brakes deliver offer an upgrade over mechanical systems while ensuring all-weather performance. Large 700c wheels with plush, semislick tires cruise along easily for a swift, sporty ride. Specs on the Scott Sportster 30 bike are subject to change.","short_description":"Scott Sportster 30 bike uses a hybrid design ensure comfort while cruising around town or casually exploring the area, and it sweetens the deal with Shimano parts and a front, shock-absorbent fork.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s465663.png","image_url":"http://i1.avlws.com/115/l465663.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465663&tt=df","retail_price":"849.00","sale_price":"849.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465663\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465663.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865721&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657210004":{"sku":"8657210004","vendor_sku":"234151-009","upc":"886118608150","size":"XL","color":"BLACK/WHITE/BLUE","retail_price":"849.00","sale_price":"849.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
