{"sku":"865710","manufacturer_id":"234026-006","brand_name":"Scott","product_name":"Scott Genius 740 27.5 Bike - 2014","long_description":"Featuring 27.5 in. wheels for quick acceleration and excellent control, the high-performance Scott Genius 740 27.5 bike delivers a 3-mode, shock-absorbent platform for climbs, flats and descents. The Genius 27.5 mountain bike is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Hydroformed and butted 6061 aluminum frame is lightweight and sturdy; geometry has been fine-tuned to maximize suspension performance. Fox 32 Float 29 Evolution CTD Air suspension fork has 150mm of air-sprung travel; Fox Float CTD rear shock has a progressive damping curve and excellent sensitivity. TwinLoc system provides remote, bar-top control of suspension travel and lockout, letting you customize performance on the fly. 3 TwinLoc settings supply full travel front and rear, Traction mode (full travel on fork with limited rear suspension), and lockout for both front and rear. Rear shock linkage chip lets you adjust head tube angle by 0.4deg to meet your geometry preferences; oversize bearings help keep suspension stiff and responsive. Tapered head tube and 15mm front quick-release axle stiffen up the front end for enhanced strength and handling precision. 3x10 Shimano drivetrain features an XT Shadow rear derailleur along with Deore shifters and front derailleur for quick, efficient and precise performance. Shimano Deore hydraulic disc brakes use a 180mm rotor up front and a 160mm rotor in back to facilitate responsive, progressive braking. Schwalbe Nobby Nic Performance folding tires feature lightweight Kevlar(R) beads and dual compound composition for solid traction and handling.","short_description":"Featuring 27.5 in. wheels for quick acceleration and excellent control, the high-performance Scott Genius 740 27.5 bike delivers a 3-mode, shock-absorbent platform for climbs, flats and descents.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s465599.png","image_url":"http://i1.avlws.com/115/l465599.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465599&tt=df","retail_price":"3149.00","sale_price":"3149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465599\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465599.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865710&amp;link=&amp;tabs=-Details\"></script>","variants":{"8657100003":{"sku":"8657100003","vendor_sku":"234026-008","upc":"886118600093","size":"L","color":"BLACK/RED","retail_price":"3149.00","sale_price":"3149.00"}},"categories":["cycling","bikes","mountain-bikes"]}
