{"sku":"865896","manufacturer_id":"RC40U2BK","brand_name":"Fenix","product_name":" Fenix RC40 Flashlight","long_description":"The Fenix RC40 flashlight features a stunning 3,500 lumen beam and a 710m throw. With a 90-degree-wide beam you get a powerful combo of long-range and close-range coverage in one rechargeable unit. Using, four Cree XM-L (U2) LEDs, the RC40 blasts a 3,500 lumen beam, an output that was previously only available with bulky lights. Five brightness levels let you get as much light as you need: 3,500 lumens on turbo, 1,500 lumens on high, 550 lumens on medium, 150 lumens on medium-low and 35 lumens on low. Quick-access strobe mode outputs 3,500 lumens. Outstanding 710m throw on turbo mode lights up faraway objects and helps you find your way on dark trails. Rapid Scan Beam not only lights up objects at a distance, it has a 90deg wide beam angle to provide excellent close-range coverage. Rechargeable 7,800 mAh lithium-ion battery provides up to 160 hrs. of runtime on low, 5 hrs. on high and 1 hr. 30 min. on turbo. Battery recharges to 90% full in 2 hrs. 30 min. and 100% in 3 hrs. 30 min.; tail cap battery fuel gauge helps you keep track of battery life. Recharge the batteries at home or in your car with the two included chargers. Dual switch on the neck allows easy access to all five brightness settings and the strobe. Regulated output maintains consistent light output over the lifetime of the batteries. Rugged aircraft-grade aluminum body is anodized to withstand regular use in harsh environments; anti-roll design keeps the light from getting away. The Fenix RC40 rechargeable flashlight has an IPX8 water resistance rating for protection against prolonged immersion in water deeper than 1m (3.3 ft.). Includes a shoulder carrying strap, rechargeable lithium-ion battery, two battery charging cables, spare O-ring and anti-dust plug.","short_description":"The Fenix RC40 flashlight features a stunning 3,500 lumen beam and a 710m throw. With a 90-degree-wide beam you get a powerful combo of long-range and close-range coverage in one rechargeable unit.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416935.png","image_url":"http://i1.avlws.com/115/l416935.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416935&tt=df","retail_price":"379.95","sale_price":"379.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416935\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416935.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=865896&amp;link=&amp;tabs=-Details\"></script>","variants":{"8658960001":{"sku":"8658960001","vendor_sku":"RC40U2BK","color":"BLACK","retail_price":"379.95","sale_price":"379.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
