{"sku":"866062","manufacturer_id":"32388206","brand_name":"Victorinox","product_name":" Victorinox Limited Edition Vertical Zip Daypack","long_description":"Stylish and sleek, the Victorinox Vertical Zip Daypack is an ultra-spacious padded computer pack with divided organization. It holds everything you need for trips to the office or the gym. Padded rear laptop compartment holds up to a 17 in. laptop. 10 in. padded portable electronic device pocket protects a tablet or e-reader. Interior organization includes full-length zippered mesh pocket, dual storage pockets, pen slots and key fob. Exterior organization includes vertical-zip front pocket and multi-purpose, zip-close stretch side pockets ideal for a water bottle or umbrella. Molded back panel and adjustable shoulder straps maximize comfort; adjustable sternum strap evenly distributes weight. Victorinox Vertical Zip Daypack is made from durable nylon fabric with an abrasion-resistant, reinforced base. Limited edition green camo print incorporates the Victorinox logo; bright orange accents and lining add pop. This item meets carry-on size restrictions for most airlines (size not to exceed 45 linear inches when adding L+W+H; this is subject to change, so check with your airline).","short_description":"Stylish and sleek, the Victorinox Vertical Zip Daypack is an ultra-spacious padded computer pack with divided organization. It holds everything you need for trips to the office or the gym.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s433259.png","image_url":"http://i1.avlws.com/115/l433259.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433259&tt=df","keywords":"backpack","retail_price":"100.00","sale_price":"100.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433259\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433259.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866062&amp;link=&amp;tabs=-Details\"></script>","variants":{"8660620001":{"sku":"8660620001","vendor_sku":"32388206","upc":"674204048870","color":"DARK GREEN PRINT","retail_price":"100.00","sale_price":"100.00"}}}
