{"sku":"866061","manufacturer_id":"31303206","brand_name":"Victorinox","product_name":" Victorinox CH 25 Limited Edition Expandable Wheeled Luggage","long_description":"Going far afield? The Victorinox CH 25 Limited Edition Expandable Wheeled Luggage lets you expand its capacity when you collect momentos during your travels. Comes with a matching travel umbrella-while supplies last! Limited-edition camo print designed with the Victorinox logo has a bright orange lining so you can easily find smaller items. One-touch, dual-trolley aluminum handle system recesses into bag when not in use. Spacious main compartment expands 2 in. (5cm) for additonal packing capacity. Top and side haul handles enable grip and lifting; compression straps inside and out help stabilize the load and add security. Interior organization includes a zippered hanging pocket, large interior door pocket with a zippered U-shaped opening, and an internal mesh zippered pocket. Top zippered exterior compartment is ideal for tickets and other accessories. Inline skate wheels on the Victorinox CH 25 Limited Edition Expandable Wheeled Luggage provide a smooth roll and easy handling. Rear corner guards and plastic kick plate protect vulnerable areas of bag. Includes a Travel Sentry(R)-approved luggage lock that allows U.S. airport security screeners to open the lock without destroying it and relock it after inspection. Removable Attach-a-Bag strap secures an additional bag (not included) weighing up to 30 lbs. to the front of the CH 25 for consolidated travel.","short_description":"Going far afield? The Victorinox CH 25 Limited Edition Expandable Wheeled Luggage lets you expand its capacity when you collect momentos during your travels.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433947.png","image_url":"http://i1.avlws.com/115/l433947.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433947&tt=df","retail_price":"280.00","sale_price":"280.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433947\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433947.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866061&amp;link=&amp;tabs=-Details\"></script>","variants":{"8660610001":{"sku":"8660610001","vendor_sku":"31303206","upc":"674204048863","color":"DARK GREEN PRINT","retail_price":"280.00","sale_price":"280.00"}},"categories":["travel","luggage","wheeled-luggage"]}
