{"sku":"866105","manufacturer_id":"3209300535","brand_name":"Lowa","product_name":"Lowa Renegade Pro GTX Mid Hiking Boots - Women's","long_description":"Offering incredible comfort right out of the box, the Lowa Renegade Pro GTX Mid Hiking Boots are the luxury version of the Renegade GTX, featuring new leather trim and an inside leather comfort cuff. This Pro luxury version of the Renegade was released to celebrate Lowa's 90th birthday; the boots are so comfortable they don't require a break-in period. Renegade Pro uses comfortable, high-quality leather in the ankle cuff in place of the nylon band used in the regular Renegade. Waterproof, breathable GORE-TEX(R) liners keep your feet dry when you're stepping in shallow streams and hiking hard. Durable nubuck/split leather uppers resist scuffs, abrasion and water; polyester linings wick moisture to keep feet dry inside. Full-length nylon shanks offer lots of support for long days on your feet; polyurethane midsoles absorb shock. Footbeds have comfort perforations for breathability to help keep your feet dry. External polyurethane Monowrap(R) frame offers lateral stability while reducing weight. Lugged Vibram(R) Evo rubber outsoles provide exellent traction on rough trails. Lowa Renegade Pro GTX Mid Hiking Boots for women sport retro-styled hardwear.","short_description":"Offering incredible comfort right out of the box, the Lowa Renegade Pro GTX Mid Hiking Boots are the luxury version of the Renegade GTX, featuring new leather trim and an inside leather comfort cuff.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Boots","thumb_url":"http://i1.avlws.com/115/s386935.png","image_url":"http://i1.avlws.com/115/l386935.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=386935&tt=df","retail_price":"250.00","sale_price":"250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=386935\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m386935.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866105&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","womens-footwear","womens-boots"]}
