{"sku":"866159","manufacturer_id":"2103177299","brand_name":"Lowa","product_name":"Lowa Weisshorn GTX Mountaineering Boots - Men's","long_description":"Handcrafted in Italy, the waterproof, insulated Lowa Weisshorn GTX Mountaineering Boots excel at getting you up mixed alpine routes that involve rock scrambling and crossing glaciers. Split leather uppers combine with Cordura(R) nylon and microfiber material for excellent durability to withstand abrasion from rock and snow. Waterproof GORE-TEX(R) liners keep your feet dry when you're kicking steps on snowy slopes or sloshing through puddles on the approach. GORE-TEX Duratherm(R) synthetic insulation is bonded to the membrane, offering lightweight warmth and breathability without bulk. Lowa Weisshorn GTX Mountaineering Boots support the natural motion of your ankles for comfort when you're cramponing up steep slopes. Double tongue system with removable and adjustable inner tongues allows for a perfect fit across the tops of the feet. 3-zone lacing system lets you make accurate adjustments to fine-tune the fit of the boots. Insoles have warm fleece and an aluminum coating to reflect heat back to your feet. Polyurethane midsoles have carbon inlays for a consistent flex and great torsional stability. Vibram(R) Dolent rubber outsoles offer secure grip and high edge strength for performance on snow and rock. Boots accept step-in crampons.","short_description":"Handcrafted in Italy, the waterproof, insulated Lowa Weisshorn GTX Mountaineering Boots excel at getting you up mixed alpine routes that involve rock scrambling and crossing glaciers.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s451519.png","image_url":"http://i1.avlws.com/115/l451519.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451519&tt=df","retail_price":"480.00","sale_price":"480.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451519\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451519.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866159&amp;link=&amp;tabs=-Details\"></script>","variants":{"8661590009":{"sku":"8661590009","vendor_sku":"2103177299","upc":"840054195044","size":"12","color":"LIME/BLACK","retail_price":"480.00","sale_price":"480.00"}},"categories":["footwear","mens-footwear","mens-boots"]}
