{"sku":"866164","manufacturer_id":"32001","brand_name":"Goal Zero","product_name":"Goal Zero Lighthouse 250 LED Lantern","long_description":"A great addition to camping gear or your emergency preparedness kit, the Goal Zero Lighthouse 250 LED Lantern not only lights up the night, but it can also be used to recharge your USB electronics. Two 3W LEDs output up to 250 lumens to light up your campsite or home; brightness level is easy to adjust with the turn of a dial. Built-in 4,400 mAH rechargeable battery powers the lantern for 48 hrs. on low and 2 hrs. 30 min. on high. Recharge the lantern anytime, anywhere-plug it into a Goal Zero solar panel (sold separately) or any standard USB port, or turn the built-in crank. Battery recharges fully from the sun or USB power source in 7 hrs.; 1 min. of cranking provides 10 min. of runtime. Lighthouse 250 lantern can also be used to power your electronic gadgets. Use the built-in USB port to boost your tablet's battery power by 40%, or recharge an e-book once, a smartphone twice or a digital music player six times. Goal Zero Lighthouse 250 LED Lantern has a battery level indicator that lets you know when you need to recharge the battery.","short_description":"A great addition to camping gear or your emergency preparedness kit, the Goal Zero Lighthouse 250 LED Lantern not only lights up the night, but it can also be used to recharge your USB electronics.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Lanterns","thumb_url":"http://i1.avlws.com/115/s417427.png","image_url":"http://i1.avlws.com/115/l417427.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417427&tt=df","retail_price":"79.95","sale_price":"79.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417427\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417427.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866164&amp;link=&amp;tabs=-Details\"></script>","variants":{"8661640001":{"sku":"8661640001","vendor_sku":"32001","upc":"847974002186","color":"BLACK","retail_price":"79.95","sale_price":"79.95"}},"categories":["camping-hiking","camp-lighting","lanterns"]}
