{"sku":"866109","manufacturer_id":"ATRKBP7","brand_name":"The North Face","product_name":"The North Face Hedgehog GTX XCR III Hiking Shoes - Women's - 2013 Closeout","long_description":"The women's Hedgehog III GTX XCR hiking shoes from The North Face blend light-hiker flexibility and comfort with rugged, waterproof performance for your time on the trail. Polyurethane-coated leather uppers with nylon mesh panels are flexible, lightweight and durable for breathable, comfortable use. Reinforced toe boxes protect uppers from abrasion; gusseted and padded tongues keep out debris and add comfort. Seam-sealed Gore-Tex(R) XCR(R) inserts with wicking nylon linings offer waterproof protection while allowing moisture vapor to escape. Removable EVA footbeds feature forefoot and heel cushioning pads along with built-up heel cradles for enhanced support. Dual-density EVA midsoles deliver all-day cushioning and shock absorption; heels feature a stiffened cradle to help center the heel and enhance stabilty. Thermoplastic urethane plates add torsional rigidity and protection from uneven terrain. The Hedgehog III GTX XCR hiking shoes for women feature aggressive Vibram(R) rubber outsoles to supply dependable traction on all-mountain terrain. Closeout.","short_description":"The women's Hedgehog III GTX XCR hiking shoes from The North Face blend light-hiker flexibility and comfort with rugged, waterproof performance for your time on the trail.","category":"Footwear","subcategory":"Women's Shoes","product_group":"Trail Shoes","thumb_url":"http://i1.avlws.com/115/s330455.png","image_url":"http://i1.avlws.com/115/l330455.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=330455&tt=df","keywords":"footwear,fitness,trail,walking,exercise","retail_price":"120.00","sale_price":"83.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=330455\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m330455.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866109&amp;link=&amp;tabs=-Details\"></script>","variants":{"8661090010":{"sku":"8661090010","vendor_sku":"ATRKBP7","upc":"486610900105","size":"8","color":"CLASSIC KHAKI/ RED","retail_price":"83.73","sale_price":"83.73"},"8661090011":{"sku":"8661090011","vendor_sku":"ATRKBP7","upc":"486610900112","size":"8.5","color":"CLASSIC KHAKI/ RED","retail_price":"83.73","sale_price":"83.73"}}}
