{"sku":"866132","manufacturer_id":"T36C 1X3","brand_name":"Jansport","product_name":"JanSport Klamath 75 Pack","long_description":"The comfortable and customizable JanSport Klamath 75 Pack hauls your gear on multiday adventures or day trips, whether you're crossing the Sierras, traveling through Europe or bagging another peak. GridFit(TM) system combines 3-point shoulder width adjustment with a sliding torso length adjustment to let you easily dial the pack fit to your body. Harness features padded shoulder straps with load lifters and sternum strap, a dual-density foam hipbelt and a fully padded back panel with vertical ventilation channel. Polyethylene framesheet and aluminum stay control the load and shift pack weight to your hips. Large top-loading main compartment features a drawstring closure and zippered side access; hydration sleeve with clip and port accommodates a reservoir (sold separately). Separate sleeping bag compartment with internal shelf. Keep gear organized and accessible with a top-lid compartment, zippered side and front pockets, dual stretch-mesh water-bottle pockets and a zippered hipbelt pocket. The JanSport Klamath 75 Pack features bottom lashing webbing with buckles, multiple side webbing compression points and a large webbing haul handle.","short_description":"The comfortable and customizable JanSport Klamath 75 Pack hauls your gear on multiday adventures or day trips, whether you're crossing the Sierras, traveling through Europe or bagging another peak.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s463239.png","image_url":"http://i1.avlws.com/115/l463239.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463239&tt=df","keywords":"multiday","retail_price":"175.00","sale_price":"175.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463239\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463239.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866132&amp;link=&amp;tabs=-Details\"></script>","variants":{"8661320001":{"sku":"8661320001","vendor_sku":"T36C 1X3","upc":"689914678996","size":"One Size","color":"BLACK/TAR","retail_price":"175.00","sale_price":"175.00"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
