{"sku":"866113","manufacturer_id":"20173152","brand_name":"Exped","product_name":" Exped Mountain Lite 20 Pack","long_description":"The compact and lightweight Exped Mountain Lite 20 Pack feels right at home from foothills to mountain peaks or on a long climb. Versatile front-compression design reduces volume and secures gear. Removable, slim hipbelt carries weight without obstructing a climbing harness; shoulder strap webbing is secured to the base for load control, even without the hipbelt. Hipbelt padding can be removed when only a simple hip strap is required for climbing, biking or urban use. Variable-position hipbelt buckle can be centered or, depending on personal preference, worn left or right over the padded belt to prevent pressure on your abdomen. Slim pack body brings the center of gravity close to your body for load control when climbing, skiing or biking. Quick and easy zippered access to main compartment; key clip and small zippered lid pockets outside and inside. Bright-colored interior coating for excellent visibility of contents; hydration tube port and hook in the pack are compatible with most hydration reservoirs (sold separately). Front compression system with adjustable shock cord and 1-hand buckle operation; shock cord can be unhooked on the sides and bottom for easy handling and stowing of gear. 2 stowable ice tool/trekking pole loops; stretch fabric side pockets provide additional storage space. The Exped Mountain Lite 20 Pack features rip-and-stick tabs on all adjustable straps to keep strap ends from flapping in the wind.","short_description":"The compact and lightweight Exped Mountain Lite 20 Pack feels right at home from foothills to mountain peaks or on a long climb. Versatile front-compression design reduces volume and secures gear.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411455.png","image_url":"http://i1.avlws.com/115/l411455.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411455&tt=df","retail_price":"149.00","sale_price":"149.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411455\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411455.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866113&amp;link=&amp;tabs=-Details\"></script>","variants":{"8661130001":{"sku":"8661130001","vendor_sku":"20173152","color":"DEEP SEA BLUE","retail_price":"149.00","sale_price":"149.00"},"8661130002":{"sku":"8661130002","vendor_sku":"20173151","color":"TERRACOTTA","retail_price":"149.00","sale_price":"149.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
