{"sku":"866114","manufacturer_id":"21000602","brand_name":"Exped","product_name":"Exped Torrent 30 Pack","long_description":"The durable and waterproof Exped Torrent 30 Pack excels at all-around use in any weather with its compact body, welded seams, wide opening, roll-top closure and comfortable suspension.;. Clean, single-compartment pack features a slim shape that puts the center of gravity close to your body for great load control and load distribution, even when partially full. Comfortable suspension system with mesh padding; shoulder strap webbing secures to the pack's base for effective load control. Hipbelt can be removed, or stowed by running the strap through the lower links of the central daisy chain; hipbelt is held in place with a rip-and-stick tab. Set the position of the hipbelt buckle to your preference; reduce pressure points on your hips by setting the buckle over the hipbelt padding. User-friendly fold-and-roll closure for waterproof performance; seal the closure by hooking the included carabiners into the lateral daisy chains for a compact load. Top compression strap is simple and practical with a durable aluminum Rapide hook that clips into the front daisy chain. Generous opening for quick and easy packing. Internal organizer with quick-access pocket, zippered mesh pouch and key clip. The Exped Torrent 30 Pack features 3 daisy chains for endless attachment options; all adjustable straps have rip-and-stick tabs to keep strap ends from flapping in the wind.","short_description":"The durable and waterproof Exped Torrent 30 Pack excels at all-around use in any weather with its compact body, welded seams, wide opening, roll-top closure and comfortable suspension.;","category":"Paddling","subcategory":"Paddling Bags And Cases","product_group":"Dry Bags","thumb_url":"http://i1.avlws.com/115/s442363.png","image_url":"http://i1.avlws.com/115/l442363.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442363&tt=df","retail_price":"139.00","sale_price":"139.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442363\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442363.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866114&amp;link=&amp;tabs=-Details\"></script>","variants":{"8661140001":{"sku":"8661140001","vendor_sku":"21000603","color":"BLACK/CHARCOAL","retail_price":"139.00","sale_price":"139.00"},"8661140002":{"sku":"8661140002","vendor_sku":"21000602","color":"MOSSGREEN","retail_price":"139.00","sale_price":"139.00"}},"categories":["paddling","paddling-bags-and-cases","dry-bags"]}
