{"sku":"866261","manufacturer_id":"EC-60273125","brand_name":"Eagle Creek","product_name":"Eagle Creek RFID Travel Bug Mini Daypack","long_description":"Don't let the size of the Eagle Creek RFID Travel Bug Mini Daypack fool you. This mini is maxi on travel-safe features. Features Eagle Creek's All Ways Secure(TM) system, which includes a passport-size RFID-blocking pocket to help prevent ID theft by illicit scanning devices. Anti-theft lockable zippers are found on main compartment and organizer panel; lock-point grommets let you position zipper pulls over grommet and secure with one lock. Padded sleeve lined with e-fleece holds a tablet; additional e-fleece-lined electronics pocket can hold a music player or phone. Reflectivity enhances your visibility in dim light for increased safety; loop allows you to attach a blinking light (not included). Zippered expansion adds 20% more capacity to the main compartment. Interior organization includes slip pockets, zippered mesh pocket, pen slot and key fob. Exterior front zip pocket, side zip pocket, and side mesh slip pocket quickly stash items. Breathable mesh contoured shoulder straps and back panel provide comfortable carrying; adjustable hip belt is detachable. Back slip panel lets you slide the Eagle Creek RFID Travel Bug Mini Daypack over the handle of your wheeled luggage.","short_description":"Don't let the size of the Eagle Creek RFID Travel Bug Mini Daypack fool you. This mini is maxi on travel-safe features.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s433267.png","image_url":"http://i1.avlws.com/115/l433267.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433267&tt=df","keywords":"backpack","retail_price":"70.00","sale_price":"70.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433267\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433267.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866261&amp;link=&amp;tabs=-Details\"></script>","variants":{"8662610001":{"sku":"8662610001","vendor_sku":"EC-60273125","upc":"617931782501","color":"SLATE BLUE","retail_price":"70.00","sale_price":"70.00"}},"categories":["travel","day-bags-and-packs","travel-daypacks"]}
