{"sku":"866293","manufacturer_id":"T6342110","brand_name":"Leki","product_name":"Leki Lhasa Lite Aergon Antishock Women's Trekking Poles - Pair","long_description":"The women's Leki Lhasa Lite Aergon Antishock Trekking Poles let you navigate trails with ease, offering lightweight, telescoping utility to support your every step over rough terrain. Speed Lock adjustment on the upper shaft features a quick, strong and secure external lever mechanism that is easy to manipulate, even when wearing thick gloves. Super Lock adjustment on the lower shaft features a simple, lightweight internal twist-lock mechanism that is engineered to support up to 300 lbs. Antishock Lite system in the lower shafts absorbs impacts before they reach your wrists. Light, compact grips feature an edgeless shape and a cork/rubber composite that reduces sweat for a superior grip. Positive-angle grips position your hands at an ergonomically correct angle for optimal swing efficiency and stress relief at the wrists. 3-section telescoping poles extend from 25.5 to 49.25 in.; thin aluminum alloy shaft walls reduce swing weight by 20% without loss of strength. Baskets provide extra support on soft terrain; durable carbide tip ends optimize grip on ice and rocks. The Leki Lhasa Lite Aergon Antishock Trekking Poles feature scratch-resistant surfaces and high-polish lacquer that help protect poles from abrasion.","short_description":"The women's Leki Lhasa Lite Aergon Antishock Trekking Poles let you navigate trails with ease, offering lightweight, telescoping utility to support your every step over rough terrain.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Trekking Poles And Hiking Staffs","thumb_url":"http://i1.avlws.com/115/s451143.png","image_url":"http://i1.avlws.com/115/l451143.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451143&tt=df","keywords":"collapsible","retail_price":"159.95","sale_price":"159.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451143\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451143.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866293&amp;link=&amp;tabs=-Details\"></script>","variants":{"8662930001":{"sku":"8662930001","vendor_sku":"T6342110","upc":"691957142273","color":"WHITE","retail_price":"159.95","sale_price":"159.95"}},"categories":["camping-hiking","gadgets","trekking-poles-and-hiking-staffs"]}
