{"sku":"866223","manufacturer_id":"50200111","brand_name":"Pacsafe","product_name":"Pacsafe TourSafe EXP34 Wheeled Luggage","long_description":"Stay confident on far-flung expeditions when you use the TourSafe EXP34 Wheeled Luggage from Pacsafe with its smart anti-theft technology, including the innovative Roobar(TM) anchor lock. Roobar anti-theft anchor locks zippers and multiple compartments together, and can lock your luggage to a secure fixture so you don't have to sleep with one eye open. All nylon panels in the luggage are protected with eXomesh(R) slashguard, a concealed, built-in metal mesh that helps prevent a slash-and-run theft. Lightweight yet durable molded EVA back is laminated with water-resistant nylon. Puncture-resistant ToughZip(TM) helps prevent forced entry into your luggage with a ballpoint pen or other tool; and helps prevent unwanted items placed inside your luggage. Stainless-steel 3mm locking cable attaches your luggage to a secure fixture, like a cafe table leg, so thieves won't run off with it; cable storage pouch included. Interlocking zipper sliders can take a TSA-approved padlock (sold separately); only 1 padlock required for multiple compartments with the Roobar anchor. Flap cover disguises Roobar locking system and makes a temporary hold for your jacket. Strong, lightweight reinforced-aluminum handle and high-clearance performance wheels with protective kick-plate, rails and corner bumpers let you maneuver rough streets easily. Front zippered compartment features 2 zippered mesh pockets for organization, and zipper access to the main compartment. Main compartment features 3 zippered mesh pockets and compression straps. External webbing side compression straps manage bulk; external webbing loops let you attach gear. Padded side and top haul handles let you grab and lift quickly. Pacsafe TourSafe EXP34 Wheeled Luggage also features a zippered luggage ID pocket, pen holder and key/wallet clip.","short_description":"Stay confident on far-flung expeditions when you use the TourSafe EXP34 Wheeled Luggage from Pacsafe with its smart anti-theft technology, including the innovative Roobar(TM) anchor lock.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433963.png","image_url":"http://i1.avlws.com/115/l433963.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433963&tt=df","retail_price":"380.00","sale_price":"380.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433963\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433963.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866223&amp;link=&amp;tabs=-Details\"></script>","variants":{"8662230001":{"sku":"8662230001","vendor_sku":"50200111","upc":"688334011376","color":"STORM GREY","retail_price":"380.00","sale_price":"380.00"}},"categories":["travel","luggage","wheeled-luggage"]}
