{"sku":"866285","manufacturer_id":"T6342125","brand_name":"Leki","product_name":"Leki Carbonlite Aergon XL Trekking Poles - Pair","long_description":"Giving you confident footing for your hiking and trekking endeavors, the Leki Carbonlite Aergon XL Trekking Poles provide superior comfort and convenience in an innovative design. Lightweight Aergon grips feature an edgeless shape and a textured foam surface to maximize comfort and minimize hand fatigue. Ergonomic corrective angle creates a neutral wrist position for optimal swing efficiency and stress relief at your wrist joints. Grippy foam extends down the shaft, perfect for choking down on a trekking pole while traversing a hillside. Included photo adapter hardwear turns 1 of the poles into a camera monopod. 3-section carbon fiber shafts are heat-treated for outstanding tensile strength. Simple and fast, Super Lock System adjustment requires little effort to securely lock pole sections in position. Poles collapse from 53 to 24.8 in. for easy packing. Universal carbide flex tips ensure durability and an optimal grip on ice and rock. The Leki Carbonlite Aergon XL Trekking Poles feature nylon wrist straps with a soft side for comfort against the skin.","short_description":"Giving you confident footing for your hiking and trekking endeavors, the Leki Carbonlite Aergon XL Trekking Poles provide superior comfort and convenience in an innovative design.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Trekking Poles And Hiking Staffs","thumb_url":"http://i1.avlws.com/115/s449103.png","image_url":"http://i1.avlws.com/115/l449103.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449103&tt=df","keywords":"collapsible","retail_price":"219.95","sale_price":"219.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449103\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449103.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866285&amp;link=&amp;tabs=-Details\"></script>","variants":{"8662850001":{"sku":"8662850001","vendor_sku":"T6342125","upc":"691957142235","color":"BLACK/SILVER","retail_price":"219.95","sale_price":"219.95"}},"categories":["camping-hiking","gadgets","trekking-poles-and-hiking-staffs"]}
