{"sku":"866260","manufacturer_id":"EC-60278010","brand_name":"Eagle Creek","product_name":"Eagle Creek RFID Straight Up Convertible Business Brief Bag","long_description":"Checkpoint friendly and incredibly secure on many fronts, the RFID Straight Up Convertible Business Brief Bag from Eagle Creek takes much of the worry out of business travel. 3 carry options include padded, tuck-away backpack straps, a removable cross-body shoulder strap or padded grab handles. Checkpoint-friendly laptop compartment opens butterfly-style and has padded, e-fleece-lined sleeves for a 17 in. laptop as well as a tablet. Features Eagle Creek's All Ways Secure(TM) system, which has an RFID blocker to help prevent ID theft, plus lockable self-repairing zippers and reflectivity for visibility. Zippered stretch pocket on backpack strap holds a phone; zippered front pocket stashes items quickly. Internal organization includes slip pockets for documents, e-fleece pocket, zippered pockets, pen slots and key fob. Ergonomically contoured Air Mesh shoulder straps have an adjustable sternum strap. Back slip panel lets you slide the Eagle Creek RFID Straight Up Convertible Business Brief Bag over the handle of your wheeled luggage.","short_description":"Checkpoint friendly and incredibly secure on many fronts, the RFID Straight Up Convertible Business Brief Bag from Eagle Creek takes much of the worry out of business travel.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Shoulder Bags","thumb_url":"http://i1.avlws.com/115/s432723.png","image_url":"http://i1.avlws.com/115/l432723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=432723&tt=df","keywords":"courier,sling,purses","retail_price":"160.00","sale_price":"160.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=432723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m432723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866260&amp;link=&amp;tabs=-Details\"></script>","variants":{"8662600001":{"sku":"8662600001","vendor_sku":"EC-60278010","upc":"617931796492","color":"BLACK","retail_price":"160.00","sale_price":"160.00"}},"categories":["travel","day-bags-and-packs","shoulder-bags"]}
