{"sku":"866296","manufacturer_id":"40813311","brand_name":"Kelty","product_name":"Kelty Hula House 6 Tent - 2012 Closeout","long_description":"Get the family outside for some fun in the great outdoors. The Kelty Hula House 6 tent is a spacious family tent designed for 6 sleepers that you can use during spring, summer and fall weather. Easy clip and pole-sleeve construction makes setting up camp a breeze; high-quality DAC(R) aluminum poles offer a lifetime of adventure. 1 large door with a large vestibule offers easy access and a place to store some gear. Freestanding design makes it easy to move the tent to land that perfectly comfortable spot. Design keeps seams off the ground to increase durability and weather resistance, and watertight, taped seams ensure weather protection. Mesh wall panels ensure good cross ventilation and views outside. Double zipper-track vestibule is easy to roll up and out of the way; clear, welded window allows light into vestibule and a view of the weather outside. Side-release tent to rainfly connections are easy to set up and allow easy tensioning of the rainfly. Noiseless zipper pulls let you sleep peacefully. Kelty Hula House 4 tent includes stuff sacks, stakes and guyline/tensioners. Closeout.","short_description":"Get the family outside for some fun in the great outdoors. The Kelty Hula House 6 tent is a spacious family tent designed for 6 sleepers that you can use during spring, summer and fall weather.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s424499.png","image_url":"http://i1.avlws.com/115/l424499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424499&tt=df","retail_price":"399.95","sale_price":"223.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866296&amp;link=&amp;tabs=-Details\"></script>","variants":{"8662960001":{"sku":"8662960001","vendor_sku":"40813311","upc":"486629600010","color":"COOL GREY/PUTTY/APPLE GRE","retail_price":"223.73","sale_price":"223.73"}},"categories":["camping-hiking","tents","camping-tents"]}
