{"sku":"866218","manufacturer_id":"60320606","brand_name":"Pacsafe","product_name":"Pacsafe VentureSafe 45L GII Travel Pack","long_description":"Offering peace of mind when traveling, the Pacsafe VentureSafe 45L GII Travel Pack features slash-proof wire mesh, puncture-resistant zippers and a locking cable to protect your gear from theft. EXomesh(R), a lightweight stainless-steel wire mesh, is built discreetly into vulnerable areas to prevent thieves from slashing through the fabric. Roobar anti-theft anchor locks zippers and multiple compartments together, and you can lock your luggage to a secure fixture so you don't have to sleep with one eye open. Includes a 3mm stainless-steel cable to use with the Roobar for locking the pack to a secure fixture; storage pouch for the cable is included. Puncture-resistant ToughZip(TM) helps prevent forced entry into your pack with a ball-point pen or other tool, and helps prevent unwanted items placed inside your luggage. Interlocking zipper sliders can take a TSA-approved padlock (sold separately); only 1 padlock required for multiple compartments with the Roobar anchor. Padded shoulder straps, sternum strap and waist belt balance and secure your load; they stow away for protection in transit. Molded foam back support features airflow channels for comfort. Main zippered compartment opens book-style for easy access to clothing and gear, and features an internal zippered mesh pocket. Front zippered compartment features a large zippered pocket that can hold a magazine, tablet or 13 in. laptop; compartment also has 2 smaller zippered mesh pockets. Top and side haul handles and internal and side compression straps help you manage your load. The Pacsafe VentureSafe 45LGII Travel Pack also features a zippered luggage ID pocket, pen holder and key/wallet clip.","short_description":"Offering peace of mind when traveling, the Pacsafe VentureSafe 45L GII Travel Pack features slash-proof wire mesh, puncture-resistant zippers and a locking cable to protect your gear from theft.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s457695.png","image_url":"http://i1.avlws.com/115/l457695.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457695&tt=df","retail_price":"225.00","sale_price":"225.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457695\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457695.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866218&amp;link=&amp;tabs=-Details\"></script>","variants":{"8662180001":{"sku":"8662180001","vendor_sku":"60320606","upc":"688334010713","color":"NAVY BLUE","retail_price":"225.00","sale_price":"225.00"}},"categories":["travel","luggage","travel-packs"]}
