{"sku":"866292","manufacturer_id":"T6342134","brand_name":"Leki","product_name":" Leki Thermolite XL Antishock Trekking Poles - Pair","long_description":"The Leki Thermolite XL Antishock Trekking Poles combine comfort and convenience with an innovative, ultralight design and ergonomic grips. Antishock system absorbs shock with minimal rebound. Speed Lock adjustment on the upper shaft features a quick, strong and secure external lever mechanism that is easy to manipulate, even when wearing thick gloves. Super Lock adjustment on the lower shaft features a simple, lightweight internal twist-lock mechanism that is engineered to support up to 300 lbs. 3-section telescoping poles collapse from 53.2 in. to 27.2 in. for easy packing. Lightweight Aergon Thermo XL grips feature an edgeless shape and a rubberized, textured surface to maximize comfort and minimize hand fatigue. Grips position your hands at an ergonomically correct 15deg angle for comfort and a neutral wrist position for optimal swing efficiency and stress relief at wrist joints. Synthetic tips flex up to 30deg without damaging the pole shaft; universal carbide tip ends ensure durability and an optimal grip on ice and rock surfaces. The Leki Thermolite XL Antishock Trekking Poles feature soft nylon wrist straps that are comfortable against your skin.","short_description":"The Leki Thermolite XL Antishock Trekking Poles combine comfort and convenience with an innovative, ultralight design and ergonomic grips.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Trekking Poles And Hiking Staffs","thumb_url":"http://i1.avlws.com/115/s449111.png","image_url":"http://i1.avlws.com/115/l449111.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449111&tt=df","keywords":"collapsible","retail_price":"179.95","sale_price":"179.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449111\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449111.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866292&amp;link=&amp;tabs=-Details\"></script>","variants":{"8662920001":{"sku":"8662920001","vendor_sku":"T6342134","upc":"691957142037","color":"BLACK/GREEN","retail_price":"179.95","sale_price":"179.95"}},"categories":["camping-hiking","gadgets","trekking-poles-and-hiking-staffs"]}
