{"sku":"866384","manufacturer_id":"BD620611VBORALL","brand_name":"Black Diamond","product_name":"Black Diamond Storm Headlamp","long_description":"If you need bright, reliable light and the weather's bad, grab the fully waterproof Black Diamond Storm Headlamp for 160 lumens of illumination to spot rappel anchors or light up a trail. Headlamp features a high-output Quad Power LED that outputs up to 160 lumens and throws a beam up to 70m so you can locate the hiking trail at night. 2 SinglePower white LEDs and 2 SinglePower red LEDs output 25 lumens. Use the red LEDs to preserve night vision while hanging out at camp or making your way down the trail; red LED activates without having to cycle through white mode. Press and hold the top button to activate the dimmer that lets you choose the light output needed for the task at hand, from a blazing 160 lumens down to 25 lumens. PowerTap Technology allows fast and simple transitioning between full and dimmed power with just a tap of a finger on the side of the touch-sensitive housing. Use the 3 strobe functions to flash white light on high or low, or red light. Sleek headlamp operates on 4 AAA batteries, included; Heatsink technology keeps the batteries warm for long burn times. 4 AAA batteries provide 36 hrs. of use on high and 200 hrs. on low; battery indicator light helps you determine how much battery power you have left. Lock mode helps prevent accidentally turning the headlamp on when it's in your backpack. The Black Diamond Storm headlamp has an IPX7 rating (protected against water immersion down to 1m for 30 min.).","short_description":"If you need bright, reliable light and the weather's bad, grab the fully waterproof Black Diamond Storm Headlamp for 160 lumens of illumination to spot rappel anchors or light up a trail.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417191.png","image_url":"http://i1.avlws.com/115/l417191.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417191&tt=df","retail_price":"49.95","sale_price":"49.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417191\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417191.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866384&amp;link=&amp;tabs=-Details\"></script>","variants":{"8663840002":{"sku":"8663840002","vendor_sku":"BD620611RVGRALL","upc":"793661198819","color":"REVOLUTION GREEN","retail_price":"49.95","sale_price":"49.95"},"8663840003":{"sku":"8663840003","vendor_sku":"BD620611DKSHALL","upc":"793661210788","color":"DARK SHADOW","retail_price":"49.95","sale_price":"49.95"},"8663840005":{"sku":"8663840005","vendor_sku":"BD620611VBORALL","upc":"793661198840","color":"VIBRANT ORANGE","retail_price":"49.95","sale_price":"49.95"}},"categories":["camping-hiking","camp-lighting","headlamps"]}
