{"sku":"866357","manufacturer_id":"14-14-2500","brand_name":"Raleigh","product_name":" Raleigh Eva 4.5 27.5 Women's Bike - 2014","long_description":"Built with nimble 27.5 in. wheels, the Raleigh EVA 4.0 women's hardtail mountain bike offers dependable performance for novice mountain bikers. The Raleigh EVA 4.0 women's mountain bike is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Butted aluminum frame features a formed down tube and CNC-machined head tube for improved strength; frame geometry is performance-tuned to better fit women. SR Suntour XCT suspension fork features 100mm of travel and preload adjustment to smooth out the jarring bumps and help keep the bike in control. 24-speed drivetrain features SR Suntour XCT V3 cranks and a Shimano Acera rear derailleur; Shimano EF-51 EZ Fire trigger shifters deliver snappy, precise shifts. Promax mechanical disc brakes supply powerful and dependable braking performance even in wet conditions. Tough Weinmann XC-260 double-walled rims and Kenda tires keep you rolling along the trail in confidence. Raleigh EVA 4.0 frame includes a replaceable rear derailleur hanger to help extend the usable life of the frame. Includes a basic set of composite platform pedals (pedals not pictured). Specs are subject to change.","short_description":"Built with nimble 27.5 in. wheels, the Raleigh EVA 4.0 women's hardtail mountain bike offers dependable performance for novice mountain bikers.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374947.png","image_url":"http://i1.avlws.com/115/l374947.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374947&tt=df","retail_price":"499.00","sale_price":"499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374947\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374947.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866357&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
