{"sku":"866354","manufacturer_id":"14-14-2340","brand_name":"Raleigh","product_name":"Raleigh Tokul 2.0 27.5 Bike - 2014","long_description":"Fitted with 27 versatile gears and sturdy Shimano components, the Raleigh Tokul 2.0 27.5 hardtail mountain bike uses 27.5 in. wheels for quick acceleration and excellent control. The Tokul 2.0 is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. The sturdy Shimano drivetrain offers responsive shifting and efficient power transfer; trigger shifters deliver snappy, precise shifts through the 27 gears. Butted aluminum frame features a formed down tube and CNC-machined, tapered head tube for improved strength. SR Suntour XCR 32 suspension fork offers 120mm of travel to damp big bumps; suspension can be locked out when not needed. Promax Decipher hydraulic disc brakes deliver powerful braking in all conditions. Weinmann U28 rims are outfitted with versatile Schwalbe Rapid Rob tires for good grip, confident cornering and fast-rolling performance. Bike includes a basic set of alloy platform pedals (pedals not pictured). Specs on the Raleigh Tokul 2.0 27.5 hardtail mountain bike are subject to change.","short_description":"Fitted with 27 versatile gears and sturdy Shimano components, the Raleigh Tokul 2.0 27.5 hardtail mountain bike uses 27.5 in. wheels for quick acceleration and excellent control.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374935.png","image_url":"http://i1.avlws.com/115/l374935.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374935&tt=df","retail_price":"749.00","sale_price":"749.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374935\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374935.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866354&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
