{"sku":"866481","manufacturer_id":"14-14-1800","brand_name":"Raleigh","product_name":" Raleigh Sojourn Bike - 2014","long_description":"Ready for short journeys or the long haul, the smooth, steel-frame Raleigh Sojourn touring bike is ready to roll, thanks to the included rack, fenders and a comfortable Brooks saddle. Reynolds 631 butted steel frame offers smooth handling and strength under heavy loads; spoke holder and pump peg complement the classic touring design. Shimano drivetrain features a triple crankset and an 11-25 cassette for 27 gears to get you and your equipment up and over mountain passes and across the flatlands. Shimano Dura-Ace bar end shifters offer reliable, low-maintenance shifting of the Alivio and Sora derailleurs. Powerful Shimano mechanical disc brakes offer responsive braking, even in the worst conditions. Tough double-walled rims and puncture-resistant Vittoria Randonneur Cross tires have the durability needed to log long miles. Classic Brooks B17 aged leather saddle offers well-established comfort and performance. The Sojourn comes with a rear rack and fenders; platform pedals with toe clips accommodate many casual shoes. Specs on the Raleigh Sojourn touring bike are subject to change.","short_description":"Ready for short journeys or the long haul, the smooth, steel-frame Raleigh Sojourn touring bike is ready to roll, thanks to the included rack, fenders and a comfortable Brooks saddle.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374703.png","image_url":"http://i1.avlws.com/115/l374703.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374703&tt=df","retail_price":"1199.00","sale_price":"1199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374703\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374703.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866481&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
