{"sku":"866468","manufacturer_id":"14-14-2482","brand_name":"Raleigh","product_name":"Raleigh Eva 5.5 27.5 Women's Bike - 2014","long_description":"Whether it's your first ride or you're an experienced trail rider, the women's Raleigh Eva 5.5 27.5 hardtail mountain bike offers a value-packed, responsive ride with its nimble 27.5 in. wheels. The Raleigh Eva 5.5 27.5 women's mountain bike is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Butted aluminum frame features a formed down tube and CNC-machined, tapered head tube for improved strength; frame geometry is performance-tuned to better fit women. Suntour XC suspension fork offers 100mm of travel to take the harsh edges off of trail features; suspension can be locked out when not needed. Sturdy Shimano drivetrain offers responsive shifting and efficient power transfer; trigger shifters deliver snappy, precise shifts through the 24 gears. Promax hydraulic disc brakes deliver powerful braking in all conditions. Weinmann U28 rims are outfitted with the versatile Kenda Slant Six tires for good grip, confident cornering and fast-rolling performance. Includes a basic set of alloy platform pedals. Specs on the women's Raleigh Eva 5.5 27.5 hardtail mountain bike are subject to change.","short_description":"Whether it's your first ride or you're an experienced trail rider, the women's Raleigh Eva 5.5 27.5 hardtail mountain bike offers a value-packed, responsive ride with its nimble 27.5 in. wheels.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374951.png","image_url":"http://i1.avlws.com/115/l374951.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374951&tt=df","retail_price":"649.00","sale_price":"649.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374951\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374951.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866468&amp;link=&amp;tabs=-Details\"></script>","variants":{"8664680002":{"sku":"8664680002","vendor_sku":"14-14-2481","upc":"791964412182","size":"S","color":"PURPLE/PINK/ORANGE","retail_price":"649.00","sale_price":"649.00"}},"categories":["cycling","bikes","mountain-bikes"]}
