{"sku":"866469","manufacturer_id":"14-14-2462","brand_name":"Raleigh","product_name":"Raleigh Eva 6.5 27.5 Women's Bike - 2014","long_description":"With 27 versatile gears and a shock-absorbent front fork for bumps, the Raleigh Eva 6.5 27.5 hardtail mountain bike uses fast-rolling and nimble 27.5 in. wheels to negotiate flowing singletrack. The Raleigh Eva 6.5 27.5 hardtail mountain bike is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Butted aluminum frame features a formed down tube and CNC-machined, tapered head tube for improved strength; frame geometry is performance-tuned to better fit women. Suntour XCT suspension fork supplies 100mm of travel to take the harsh edges off of trail features; suspension can be locked out when not needed. All-Shimano drivetrain offers responsive shifting and efficient power transfer; intuitive shifters deliver snappy, precise shifts through the 27 gears. ProMax Decipher hydraulic disc brakes deliver powerful braking in all conditions. Weinmann XM280 rims are outfitted with the versatile Geax AKA tires for good grip, confident cornering and fast-rolling performance. Includes a basic set of alloy platform pedals (pedals not pictured). Specs on the women's Raleigh Eva 6.5 27.5 hardtail mountain bike are subject to change.","short_description":"With 27 versatile gears and a shock-absorbent front fork for bumps, the Raleigh Eva 6.5 27.5 hardtail mountain bike uses fast-rolling and nimble 27.5 in. wheels to negotiate flowing singletrack.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374955.png","image_url":"http://i1.avlws.com/115/l374955.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374955&tt=df","retail_price":"749.00","sale_price":"749.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374955\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374955.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866469&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
