{"sku":"866485","manufacturer_id":"14-14-1584","brand_name":"Raleigh","product_name":" Raleigh Tamland 2.0 Bike - 2014","long_description":"With a steel frame and a geometry meant for gravel races and cyclocross, the Raleigh Tamland 2.0 Bike uses 22 speeds and Shimano Ultegra components to dominate long rides in harsh conditions. Reynolds 520 chromoly frame offers great stability and strength as well as the reliably smooth ride quality that steel is known for. Double-butted tubing, long chainstays and low bottom bracket offer great handling at high speed in gravel. Shimano Ultegra crankset is outfitted with 52/36 chainrings for just-right 'cross gearing. With snappy shifts and an intuitive design, the very light Shimano Ultegra derailleurs and shifters offer very precise, dependable shifts throughout the 22 gear combinations. TRP Spyre mechanical disc brakes with 160mm rotors offer sure stopping in any conditions. Highly puncture-resistant Clement XPlor MSO tires provide exceptional bite for muddy endeavors. Specs on the Raleigh Tamland 2.0 Bike are subject to change.","short_description":"With a steel frame and a geometry meant for gravel races and cyclocross, the Raleigh Tamland 2.0 Bike uses 22 speeds and Shimano Ultegra components to dominate long rides in harsh conditions.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s448775.png","image_url":"http://i1.avlws.com/115/l448775.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448775&tt=df","retail_price":"2199.00","sale_price":"2199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448775\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448775.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866485&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
