{"sku":"866483","manufacturer_id":"14-14-1624","brand_name":"Raleigh","product_name":" Raleigh Roper Bike - 2014","long_description":"Cyclocross-ready and commuter-friendly, the Raleigh Roper Bike offers a smooth ride thanks to a steel frame paired with reliable Shimano 105 components. Butted steel frame supplies a smooth ride while remaining responsive; BB30 bottom bracket design increases stiffness for improved power-transfer. Shimano 105 shifters and derailleurs supply dependable, responsive shifts. FSA Gossamer Pro compact crankset is paired with a Shimano 105 11-28 cassette for 20 wide-ranging gear combinations to handle any terrain. Bar-top Tektro RL721 brake levers give you braking control when you're riding on top of the bars; 105 integrated levers let you brake when you're in the drops. Hayes CX5 mechanical disc brakes deliver weatherproof braking for all kinds of conditions, such as rain, mud, sand or grass. Schwalbe CX Comp tires boast a fast-rolling center section and aggressive outer edges for cornering control. Specs on the Raleigh Roper Bike are subject to change.","short_description":"Cyclocross-ready and commuter-friendly, the Raleigh Roper Bike offers a smooth ride thanks to a steel frame paired with reliable Shimano 105 components.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s374707.png","image_url":"http://i1.avlws.com/115/l374707.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374707&tt=df","retail_price":"1399.00","sale_price":"1399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374707\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374707.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866483&amp;link=&amp;tabs=-Details\"></script>","variants":{"8664830002":{"sku":"8664830002","vendor_sku":"14-14-1622","upc":"791964412137","size":"55 CM","color":"BURNT ORANGE","retail_price":"1399.00","sale_price":"1399.00"}}}
