{"sku":"866588","manufacturer_id":"234244-008","brand_name":"Scott","product_name":"Scott Scale 760 27.5 Bike - 2014","long_description":"The Scott Scale 760 27.5 hardtail mountain bike offers 27.5 in. wheels for quick acceleration and excellent control with a reliable Shimano component set to supply swift trail performance. Scott Scale 760 is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Lightweight, butted aluminum frame is tuned to optimize efficiency in the climbs and remain responsive when descending. Rock Shox XC 30 TK Solo Air suspension fork has 100mm of travel to smooth out trails; bar-top remote lockout lets you control suspension on the fly. Shimano XT Shadow rear derailleur, Deore shifters and Deore front derailleur offer consistent shifting across the 30 gears. Shimano hydraulic disc brakes provide easy, progressive braking with a 180mm rotor up front and a 160mm rotor in the back. Sturdy wheels are wrapped with the excellent all-arounder Schwalbe Rocket Ron tires to ensure great traction and fast-rolling performance on the trail. Full-length cable housing deters gunky buildup that saps shifting performance; replaceable rear derailleur hanger helps extend the frame's usable lifespan. Specs on the Scott Scale 760 27.5 hardtail mountain bike are subject to change.","short_description":"The Scott Scale 760 27.5 hardtail mountain bike offers 27.5 in. wheels for quick acceleration and excellent control with a reliable Shimano component set to supply swift trail performance.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s465643.png","image_url":"http://i1.avlws.com/115/l465643.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465643&tt=df","retail_price":"1449.00","sale_price":"1449.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465643\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465643.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866588&amp;link=&amp;tabs=-Details\"></script>","variants":{"8665880003":{"sku":"8665880003","vendor_sku":"234244-008","upc":"886118613963","size":"L","color":"ANTHRACITE/BLACK/WHITE/BL","retail_price":"1449.00","sale_price":"1449.00"},"8665880004":{"sku":"8665880004","vendor_sku":"234244-009","upc":"886118613970","size":"XL","color":"ANTHRACITE/BLACK/WHITE/BL","retail_price":"1449.00","sale_price":"1449.00"}},"categories":["cycling","bikes","mountain-bikes"]}
