{"sku":"866593","manufacturer_id":"234094-025","brand_name":"Scott","product_name":"Scott Solace 20 Compact Bike - 2014","long_description":"A high-performace, all-carbon road bike with precise Shimano Ultegra components and a compact crankset, the Scott Solace 20 Compact Bike provides dedicated riders with a balance of comfort and speed. Carbon-fiber frame features two zones, a stiff Power Zone around the drivetrain that transfers energy efficiently and a flexible and shock-damping cockpit Comfort Zone. Geometry is not as aggressive as a full-bred race bike, but it offers plenty of efficiency for long days in the saddle. The 1-1/8 in. full-carbon steerer enhances precision. Geared for speed, the Ultegra 50/34 compact crankset is paired with an 11-32 cassette to give you a \"just right\" gear for tough gradients and wide-open flats. With snappy shifts and an intuitive design, the very light Shimano Ultegra derailleurs and shifters offer very precise, dependable shifts throughout the 22 gear combinations. Lightweight and smooth Syncros RP2.0 wheels are outfitted with fast and grippy Schwalbe Durano tires. Pedals sold separately. Specs on the Scott Solace 20 Compact Bike are subject to change.","short_description":"A high-performace, all-carbon road bike with precise Shimano Ultegra components and a compact crankset, the Scott Solace 20 Compact Bike provides dedicated riders with a balance of comfort and speed.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s465551.png","image_url":"http://i1.avlws.com/115/l465551.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465551&tt=df","retail_price":"3399.00","sale_price":"3399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465551\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465551.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866593&amp;link=&amp;tabs=-Details\"></script>","variants":{"8665930001":{"sku":"8665930001","vendor_sku":"234094-021","upc":"886118604329","size":"52 CM","color":"BLACK/WHITE/RED","retail_price":"3399.00","sale_price":"3399.00"}},"categories":["cycling","bikes","road-bikes"]}
