{"sku":"866586","manufacturer_id":"148 354 518","brand_name":"Native Eyewear","product_name":" Native Eyewear Chonga Polarized Sunglasses - 2013 Closeout","long_description":"The Native Eyewear Chonga Polarized Sunglasses feature copper lenses and provide serious coverage in a playful package. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Snow frames feature polarized copper lenses and are ideal for moderate to bright sunlight; interchangeable lens system lets you swap lenses (additional lenses not included). Polarized Crystal Carbonate(R) (P.C.C.) lenses have the strongest hard coating available to protect against scratching. P.C.C. lenses pass the rigorous ANSI Z80.3 tests for optical clarity and impact resistance and block 100% of harmful UVA and UVB light. Tough thermoplastic frames endure extreme highs and lows in temperature. Venting system incorporated into the frames enhances airflow and virtually eliminates fog and condensation. Self-adjusting nosepads and temple boots create a nonslip grip that keeps sunglasses in place, ensuring a soft feel and personalized fit. Mastoid Temple Grip design ensures the temple ends hug behind your ears to securely keep sunglasses in place. Anti-Ocular Intrusion System(R), a 4-point configuration, helps prevent lenses from shooting into your face in the event of high-velocity impact. Cam-action spring hinges quickly lock temples in position. The Chonga Polarized Reflex Sunglasses are sized to best fit medim-large profiles. Includes a soft protective pouch that doubles as a cleaning cloth. Closeout.","short_description":"The Native Eyewear Chonga Polarized Sunglasses feature copper lenses and provide serious coverage in a playful package.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423403.png","image_url":"http://i1.avlws.com/115/l423403.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423403&tt=df","keywords":"Cycling","retail_price":"89.00","sale_price":"43.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423403\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423403.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866586&amp;link=&amp;tabs=-Details\"></script>","variants":{"8665860001":{"sku":"8665860001","vendor_sku":"148 354 518","upc":"764824008863","size":"COPPER","color":"SNOW","retail_price":"43.73","sale_price":"43.73"}}}
