{"sku":"866577","manufacturer_id":"SP128","brand_name":"Sawyer","product_name":"Sawyer Mini Water Filter","long_description":"Weighing only 2 oz. and sized to fit in the palm of your hand, the Sawyer Mini water filter is one of the lightest, most compact filters available, and you can use it to drink straight from a stream. Hollow-fiber membrane offers a high flow rate; sip on the Mini like a straw and it filters the water while it's on the way to your mouth. Get down close to the stream or lake and use the filter to drink straight from the source, or fill your water bottle and insert the filter to start sipping. Filter will also fit the threads on the included Sawyer 16 fl. oz. reusable pouch that you can fill at a lake or stream and then use to squeeze water through the filter. 0.1-micron filter physically removes 99.99999% of all bacteria, such as salmonella, cholera and E.coli; removes 99.9999% of all protozoa, such as giardia and cryptosporidium. Use the included syringe to backflush the filter to maintain a high-flow rate. Filter will also fit the threads on most bottles of water that you buy at a grocery store; can also be used as an inline filter (adapters and hoses not included). Avoid freezing this filter; freezing may ruin the hollow-fiber membrane. Includes Sawyer Mini water filter, one 16 fl. oz. resusable squeeze pouch, a filter tip cap and a cleaning syringe.","short_description":"Weighing only 2 oz. and sized to fit in the palm of your hand, the Sawyer Mini water filter is one of the lightest, most compact filters available, and you can use it to drink straight from a stream.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s463543.png","image_url":"http://i1.avlws.com/115/l463543.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463543&tt=df","retail_price":"24.95","sale_price":"24.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463543\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463543.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866577&amp;link=&amp;tabs=-Details\"></script>","variants":{"8665770001":{"sku":"8665770001","vendor_sku":"SP128","upc":"050716001280","retail_price":"24.95","sale_price":"24.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
