{"sku":"866621","manufacturer_id":"05597","brand_name":"Platypus","product_name":"Platypus Sprint XT 25 Hydration Pack - 100 fl. oz.","long_description":"If you can do it in a day, the simple, panel-loading Platypus Sprint XT 25 Hydration Pack can likely handle it-from some simple layers and snacks, to high alpine excursions. It delivers key features such as ice axe, trekking pole and helmet carry options, plus weatherproof construction and easy access to hydration to keep you moving on the trail. Premium 3.0L Big Zip(TM) LP reservoir features a low-profile shape and a wide-mouth opening that locks securely. Ventilated, padded shoulder straps and back panel offer breathable suspension; multi-use hipbelt with pockets. Removable framesheet controls the load and transfers pack weight to your hips. Weatherproof construction (taped seams, waterproof-coated fabrics and water resistant zippers) stands up to heavy precipitation and rugged use. Internal zippered mesh pocket provides a secure place to store keys and other valuables; easy-access panel loading main compartment. Stashable accessory straps make it easy to carry your helmet, ice axe or trekking poles. Independent hydration pocket with multiple hose routing options; 100 fl. oz. reservoir included. The Platypus Sprint XT 25 Hydration Pack features zippered panel access, hipbelt pockets, mesh side pockets and an expanding mesh front pocket.","short_description":"If you can do it in a day, the simple, panel-loading Platypus Sprint XT 25 Hydration Pack can likely handle it-from some simple layers and snacks, to high alpine excursions.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411499.png","image_url":"http://i1.avlws.com/115/l411499.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411499&tt=df","retail_price":"139.95","sale_price":"139.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411499\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411499.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866621&amp;link=&amp;tabs=-Details\"></script>","variants":{"8666210001":{"sku":"8666210001","vendor_sku":"05597","upc":"040818055977","size":"S/M","color":"RAVEN","retail_price":"139.95","sale_price":"139.95"},"8666210002":{"sku":"8666210002","vendor_sku":"05599","upc":"040818055991","size":"M/L","color":"RAVEN","retail_price":"139.95","sale_price":"139.95"}},"categories":["camping-hiking","backpacks","day-packs"]}
