{"sku":"866672","manufacturer_id":"30609018AGY","brand_name":"Hoka One One","product_name":" Hoka One One Stinson Tarmac Road-Running Shoes - Men's","long_description":"Built to soar, the light Hoka One One Stinson Tarmac Road-Running Shoes feature voluminous midsoles to reduce load to the body, and built-in rocker in the forefoot to propel you quickly forward. EVA midsoles feature foam that is 30% softer than traditional running shoe foam, and 2.5 times more voluminous; this extra cushioning dissipates shock from heel striking. Midsoles allow for as much as 20mm of compression in the heel. 6mm heel-to-toe drop positions this shoe as a transition between a barefoot style and a traditional running shoe. Active Foot Frame midsole geometry allows the feet to sink into the shoes as opposed to sitting on top to provide great feedback to the feet while you're running. Wide outsole platforms counterbalance the excess height of the midsole to provide a stable base. Shoes feature closed polyester mesh uppers with flexible thermoplastic urethene reinforcements for featherlight support. Polyester linings wick moisture away from feet for extended comfort. The Hoka One One Stinson Tarmac Road-Running Shoes feature single-pull lacing for easy and quick on/off. Sticky rubber outsoles grip wet and dry surfaces with ease.","short_description":"Built to soar, the light Hoka One One Stinson Tarmac Road-Running Shoes feature voluminous midsoles to reduce load to the body, and built-in rocker in the forefoot to propel you quickly forward.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Shoes","thumb_url":"http://i1.avlws.com/115/s386291.png","image_url":"http://i1.avlws.com/115/l386291.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=386291&tt=df","retail_price":"160.00","sale_price":"160.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=386291\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m386291.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866672&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","mens-footwear","mens-shoes"]}
