{"sku":"866628","manufacturer_id":"3SWSBLK","brand_name":"Astral","product_name":" Astral Sea Wolf PFD - 2013 Closeout","long_description":"The Sea Wolf PFD from Astral Buoyancy combines storage space, lightweight construction and a fit that's beyond the ordinary. Use it for long paddles with kayaks, canoes or SUPs for excellent comfort. You'll paddle more easily thanks to separate foam panels that move freely with your paddling motion. They're designed to work like tectonic plates, with an outer panel moving freely while the inner panel remains anchored in place. Outer ripstop shell provides superior abrasion resistance and durability. Large clamshell front pocket features plenty of space and additional organization pocket. Side buckles make it easy to enter PFD from the side if you are wearing paddling layers. 7 in. elastic back band enhances comfort during long paddles; front adjustment straps dial in the torso length. Two side pockets offer a cozy place to warm up hands. Specialized attachment point on back of PFD is designed to work with a paddling strobe light, not included. Dial in the fit using the adjustable webbing side straps and adjustable shoulder straps. Reflective highlights placed high on the vest both in front and behind increase visibility when sitting low on the surface of the water. Closeout.","short_description":"The Sea Wolf PFD from Astral Buoyancy combines storage space, lightweight construction and a fit that's beyond the ordinary. Use it for long paddles with kayaks, canoes or SUPs for excellent comfort.","category":"Paddling","subcategory":"Pfds","product_group":"Men's Pfds","thumb_url":"http://i1.avlws.com/115/s431987.png","image_url":"http://i1.avlws.com/115/l431987.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431987&tt=df","retail_price":"185.95","sale_price":"139.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431987\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431987.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866628&amp;link=&amp;tabs=-Details\"></script>","variants":{"8666280001":{"sku":"8666280001","vendor_sku":"3SWSBLK","upc":"818040012088","size":"S/M","color":"BLACK","retail_price":"139.73","sale_price":"139.73"},"8666280004":{"sku":"8666280004","vendor_sku":"3SWSRED","upc":"818040012118","size":"S/M","color":"RED","retail_price":"139.73","sale_price":"139.73"}},"categories":["paddling","pfds","mens-pfds"]}
