{"sku":"866639","manufacturer_id":"151 312 515","brand_name":"Native Eyewear","product_name":" Native Eyewear Endura Polarized Sunglasses - 2013 Closeout","long_description":"Native Endura Polarized Sunglasses offer unbeatable sun and glare protection in every type of light. Bring on the sun! Gunmetal and Snow frames come with gray polarized lenses; Tiger's Eye frames come with brown polarized lenses; both lenses are suitable for sunny days. Each frame includes 1 set of polarized lens and 1 set of SportFlex(TM) lenses, for a total of 2 sets of lenses. Snap-Back(TM) interchangeable lens system lets you switch lenses to accommodate a variety of light conditions and activities. Polarized Crystal Carbonate(R) lenses have the strongest hard coating available to protect against scratching. P.C.C.(R) lenses pass the rigorous ANSI Z80.3 tests for optical clarity and impact resistance while blocking 100% of harmful UVA and UVB light. Rhyno-Tuff(R) AIR frames endure extreme highs and lows in temperature. Anti-Ocular Intrusion System(R), a 4-point configuration, helps prevent lenses from shooting into your face in the event of high-velocity impact. Frames are extremely lightweight, yet flexible and durable enough to withstand high velocity collisions. Self-adjusting Cushinol(TM) nosepads and ear stems create a nonslip grip that keeps sunglasses in place. Venting system incorporated into the frames enhances airflow and virtually eliminates fog and condensation. Cam-action spring hinges allow the temples to quickly lock into position. Additional SportFlex orange-yellow lenses have a blue mirror coating suitable for a range of low-light conditions including cloudy, overcast, dusk and dawn. Frames best fit small to medium faces. Native Endura Polarized Sunglasses come with a protective carrying case. Closeout.","short_description":"Native Endura Polarized Sunglasses offer unbeatable sun and glare protection in every type of light. Bring on the sun!","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423415.png","image_url":"http://i1.avlws.com/115/l423415.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423415&tt=df","keywords":"Cycling","retail_price":"119.00","sale_price":"58.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423415\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423415.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866639&amp;link=&amp;tabs=-Details\"></script>","variants":{"8666390002":{"sku":"8666390002","vendor_sku":"151 312 515","upc":"486663900022","size":"BROWN","color":"TIGER'S EYE","retail_price":"58.73","sale_price":"58.73"},"8666390003":{"sku":"8666390003","vendor_sku":"151 354 502","upc":"764824011207","size":"GRAY","color":"SNOW","retail_price":"58.73","sale_price":"58.73"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
