{"sku":"866642","manufacturer_id":"138 364 518","brand_name":"Native Eyewear","product_name":" Native Eyewear Bolder Polarized Sunglasses - 2013 Closeout","long_description":"With bold style and tough yet flexible frames, the Native Eyewear Bolder Polarized Sunglasses offer superior protection from sun and glare during all your outdoor adventures. Snap-Back(TM) Interchange lens system lets you switch lenses to accommodate a variety of light conditions and activities. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Polarized Crystal Carbonate(R) (P.C.C.) lenses protect against scratching and block 100% of harmful UVA and UVB light. Tough thermoplastic frames endure extreme highs and lows in temperature; cam-action spring hinges quickly lock temples in position. Venting system incorporated into the frames enhances airflow and virtually eliminates fog and condensation. Self-adjusting nosepads and grippy temple tips create a nonslip fit that keeps sunglasses in place. The Native Eyewear Bolder Polarized Sunglasses are sized to best fit large profiles; sunglasses include an extra set of lenses. Closeout.","short_description":"With bold style and tough yet flexible frames, the Native Eyewear Bolder Polarized Sunglasses offer superior protection from sun and glare during all your outdoor adventures.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423427.png","image_url":"http://i1.avlws.com/115/l423427.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423427&tt=df","keywords":"Cycling","retail_price":"109.00","sale_price":"53.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423427\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423427.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866642&amp;link=&amp;tabs=-Details\"></script>","variants":{"8666420001":{"sku":"8666420001","vendor_sku":"138 364 518","upc":"486664200015","size":"COPPER","color":"SAHARA SNOW","retail_price":"53.73","sale_price":"53.73"}}}
