{"sku":"866673","manufacturer_id":"30108024WBLI","brand_name":"Hoka One One","product_name":"Hoka One One Rapa Nui 2 Tarmac Road-Running Shoes - Men's","long_description":"Built to soar down the road, the Hoka One One Rapa Nui 2 Tarmac Road-Running Shoes feature voluminous midsoles to reduce load to the body, and built-in rocker in the forefoot to propel you forward. Polyester air-mesh provides lightweight comfort while lightweight no-sew layered materials provide seamless support. Rapa Nui 2 Tarmac Shoes offer lots of cushioning with 21mm under the balls of the feet and 26mm under the heels. EVA midsoles feature foam that is 30% softer than traditional running shoe foam, and 1.5 times more voluminous; this extra cushioning dissipates shock from heel striking. Balanced stage Meta-Rocker geometry and a low 5mm drop encourage a natural gait and accelerated forward propulsion. A wide outsole profile and a deep Active Foot Frame provide an inherently stable ride. Outsole features high-wear carbon rubber for durability. The Hoka One One Rapa Nui 2 Tarmac Road-Running Shoes have a single-pull lacing system for easy on and off.","short_description":"Built to soar down the road, the Hoka One One Rapa Nui 2 Tarmac Road-Running Shoes feature voluminous midsoles to reduce load to the body, and built-in rocker in the forefoot to propel you forward.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Shoes","thumb_url":"http://i1.avlws.com/115/s386295.png","image_url":"http://i1.avlws.com/115/l386295.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=386295&tt=df","retail_price":"130.00","sale_price":"130.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=386295\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m386295.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866673&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","mens-footwear","mens-shoes"]}
