{"sku":"866773","manufacturer_id":"061LL","brand_name":"Sea To Summit","product_name":" Sea to Summit Spark Sp I Sleeping Bag","long_description":"The Sea to Summit Spark Sp I Sleeping Bag is an ultralight bag that balances size, weight and warmth to make it an excellent choice for summertime backpacking, cycle touring and mountaineering. High-loft, premium 850-fill-power European goose down offers superb warmth with minimal weight; Ultra-Dry Down(TM) water-repellent treatment protects down from moisture. Ultra-Dry Down is a water-repellent polymer treatment applied to the down; Ultra-Dry Down retains 60% more loft and absorbs 30% less moisture than untreated down. With a European Norm (EN) lower-limit rating of 46degF, the Sea to Summit Spark Sp I will help keep you warm on 3-season backpacking adventures in warm weather. You can also use the Spark Sp I as a booster bag by slipping it inside another sleeping bag to add warmth. Ultralight 10-denier Pertex(R) Quantum(R) fabric with a durable water repellent treatment sheds moisture. Soft 15-denier nylon fabric lines the sleeping bag for excellent comfort next to skin. 1/3-length zipper saves weight over a full-length zipper. Compresses to the size of a grapefruit. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags.","short_description":"The Sea to Summit Spark Sp I Sleeping Bag is an ultralight bag that balances size, weight and warmth to make it an excellent choice for summertime backpacking, cycle touring and mountaineering.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421783.png","image_url":"http://i1.avlws.com/115/l421783.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421783&tt=df","keywords":"compact","retail_price":"319.00","sale_price":"319.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421783\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421783.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=866773&amp;link=&amp;tabs=-Details\"></script>","variants":{"8667730002":{"sku":"8667730002","vendor_sku":"061LL","size":"Long","color":"SILVER","retail_price":"319.00","sale_price":"319.00"}}}
