{"sku":"867046","manufacturer_id":"62231","brand_name":"Camelbak","product_name":" CamelBak Octane XCT Hydration Pack - 100 fl. oz.","long_description":"The streamlined CamelBak Octane XCT hydration pack with 100 fl. oz. bladder is ideal for minimalist adventure racers and fast-paced trail runners or riders who want comfort and weight savings. Comfortable, lightly padded hipbelt is designed for maximum load stability; hipbelt sports 2 small zip pockets, 1 with key fob, for small snacks and essentials. With its separate, large zippered opening, the 100 fl. oz. (3L) hydration reservoir can be easily refilled without removal from the pack. Ventilated back panel and air-mesh harness enhance cooling airflow. Quick Link(R) system lets you effortlessly add accessories such as a Fresh(R) filter, insulated tube, tube director or flow meter (accessories sold separately). HydroGuard(TM) technology inhibits bacterial growth on reservoir and tube surfaces (but does not protect user from disease organisms; please wash reservoir after each use). Big Bite(TM) valve is ergonomically positioned for easy drinking; handy HydroLock(TM) securely shuts off water flow. The CamelBak Octane XCT hydration pack body is made of ultralight 70-denier ripstop nylon.","short_description":"The streamlined CamelBak Octane XCT hydration pack with 100 fl. oz. bladder is ideal for minimalist adventure racers and fast-paced trail runners or riders who want comfort and weight savings.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s445579.png","image_url":"http://i1.avlws.com/115/l445579.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445579&tt=df","retail_price":"85.00","sale_price":"85.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445579\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445579.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867046&amp;link=&amp;tabs=-Details\"></script>","variants":{"8670460002":{"sku":"8670460002","vendor_sku":"62231","upc":"886798622316","size":"One Size","color":"ENGINE RED/SILVER","retail_price":"85.00","sale_price":"85.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
