{"sku":"867117","manufacturer_id":"CHDHX-302","brand_name":"Gopro","product_name":" GoPro HERO3+ Black Edition Camera - Adventure Package","long_description":"Capture your active life with up to 4Kp15 video and immersive wide-angle perspective. The smaller, lighter GoPro HERO3+ Black Edition Adventure package offers improved imagery, power and convenience. Adventure package includes a Wi-Fi remote, quick release buckles, curved and flat adhesive mounts, 3-way pivot arm and USB charging cable. Combined with 30% longer-life lithium ion battery life, faster built-in Wi-Fi and a sharper lens, the HERO3+ Black Edition is the most advanced GoPro yet. New SuperView(TM) video mode records immersive wide angle perspective, while Auto Low Light mode intelligently adjusts frame rate for stunning low-light performance. Enjoy professional-quality ultra high definition video up to 4K and 33% improved image sharpness and reduced distortion with the ultra wide-angle glass lens. Video modes include professional 4Kp15, 2.7Kp30, 1440p48, 1080p60, 960p100 and 720p120 fps; take 12MP still photos at up to 30 frames per second. Advanced capture settings include looping video, continuous photo, white balance and protune mode. Built-in Wi-Fi supports Wi-Fi remote (included), plus content preview, playback and sharing via the GoPro App; wireless camera software updates via the GoPro app. The GoPro HERO3+ Black Edition features a 20% smaller and lighter housing that is waterproof to 131 ft. (40m). Wearable, mountable design allows you to capture fast-action footage of yourself and your favorite activities. Compatible with LCD Touch BacPac, Battery BacPac and all GoPro mounts (sold separately) for attaching to your body, gear, vehicles and more.","short_description":"Capture your active life with up to 4Kp15 video and immersive wide-angle perspective. The smaller, lighter GoPro HERO3+ Black Edition Adventure package offers improved imagery, power and convenience.","category":"Electronics","subcategory":"Helmet Cameras","product_group":"Helmet Cams","thumb_url":"http://i1.avlws.com/115/s426815.png","image_url":"http://i1.avlws.com/115/l426815.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426815&tt=df","keywords":"pov,hd","retail_price":"399.95","sale_price":"399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426815\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426815.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867117&amp;link=&amp;tabs=-Details\"></script>","variants":{"8671170001":{"sku":"8671170001","vendor_sku":"CHDHX-302","upc":"818279010817","retail_price":"399.95","sale_price":"399.95"}},"categories":["electronics","helmet-cameras","helmet-cams"]}
