{"sku":"867135","manufacturer_id":"024196","brand_name":"Sierra Designs","product_name":" Sierra Designs DriDown Tov Jacket - Men's - 2012 Closeout","long_description":"The Sierra Designs DriDown Tov Jacket offers the warmth of a traditional puffy down jacket but is made with DriDown insulation that stays lofted, dry and warm even if the down get wet. Insulated with 600-fill-power DriDown hydrophobic down insulation, the Tov outperforms standard down by taking the chill out of the coldest, dampest days. Regular down is treated with a molecular-level polymer to create a hydrophobic finish on each individual down plume. DriDown stays dry longer, lofts better and dries faster than regular down to keep you warmer in any environment. Additionally, DriDown keeps rain, sweat or melting snow from soaking in while allowing internal moisture to easily escape. Baffle construction keeps the down from migrating, eliminating cold spots; hung lining enhances warmth. Fitted, adjustable elasticized hood and elasticized cuffs with thumbholes seal in warmth. Stormflap behind the full-length front zipper keeps breezes out; chin guard protects sensitve skin. Jacket has 2 zip hand pockets; includes1 interior zip pocket and a mesh drop-in pocket. Sierra Designs DriDown Tov Jacket comes with a stuff sack for easy packing. Closeout.","short_description":"The Sierra Designs DriDown Tov Jacket offers the warmth of a traditional puffy down jacket but is made with DriDown insulation that stays lofted, dry and warm even if the down get wet.","category":"Men's Clothing","subcategory":"Men's Jackets","product_group":"Men's Insulated Jackets","thumb_url":"http://i1.avlws.com/115/s401831.png","image_url":"http://i1.avlws.com/115/l401831.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=401831&tt=df","retail_price":"259.00","sale_price":"179.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=401831\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m401831.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867135&amp;link=&amp;tabs=-Details\"></script>","variants":{"8671350005":{"sku":"8671350005","vendor_sku":"024196","upc":"486713500059","size":"XXL","color":"BLACK","retail_price":"179.73","sale_price":"179.73"}}}
