{"sku":"867116","manufacturer_id":"CHDHN-302","brand_name":"Gopro","product_name":" GoPro HERO3+ Silver Edition Camera","long_description":"With up to 1080p HD video, the smaller and lighter GoPro HERO3+ Silver Edition Camera is more powerful- than ever, making it the most advanced Silver Edition camera yet. Wearable, gear-mountable and waterproof to 131 ft. (40m), it captures professional-quality video at resolutions up to 1080p60 and 10MP photos at up to 10 frames per second. With faster built-in Wi-Fi, enhanced low-light performance and 30% longer battery life, the HERO3+ Silver Edition makes capturing and sharing your life easier than ever. Faster built-in Wi-Fi for enhanced connectivity to the Wi-Fi remote (sold separately) and GoPro app. Enjoy improved image sharpness, reduced distortion, upgraded audio performance and 30% longer battery life. Video modes include professional 1080p60, 960p60, 720p120 fps; take 10MP still photos at up to 10 frames per second. Built-in Wi-Fi supports optional Wi-Fi remote, plus content preview, playback and sharing via the GoPro App; wireless camera software updates via the GoPro app. The GoPro HERO3+ Silver Edition Camera features a 15% smaller and lighter housing that is waterproof to 131 ft. (40m). Wearable, mountable design allows you to capture fast-action footage of yourself and your favorite activities. Compatible with LCD Touch BacPac, Battery BacPac and all GoPro mounts (sold separately) for attaching to your body, gear, vehicles and more.","short_description":"With up to 1080p HD video, the smaller and lighter GoPro HERO3+ Silver Edition Camera is more powerful- than ever, making it the most advanced Silver Edition camera yet.","category":"Electronics","subcategory":"Helmet Cameras","product_group":"Helmet Cams","thumb_url":"http://i1.avlws.com/115/s426811.png","image_url":"http://i1.avlws.com/115/l426811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426811&tt=df","keywords":"pov,hd","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867116&amp;link=&amp;tabs=-Details\"></script>","variants":{"8671160001":{"sku":"8671160001","vendor_sku":"CHDHN-302","upc":"818279010855","retail_price":"299.95","sale_price":"299.95"}},"categories":["electronics","helmet-cameras","helmet-cams"]}
