{"sku":"867279","manufacturer_id":"12-3-07","brand_name":"Tern","product_name":" Tern Link D8 Folding Bike - 2014","long_description":"Ride it, fold it and stash it in the closet. The 8-speed Tern Link D8 Folding Bike is ready for urban trips and errands with fenders for rainy day protection and a rear rack for hauling. Capable of folding in under 10 seconds, the Link D8 is a study in simplicity and ease; folded dimensions are 31.1 x 28.3 x 14.1 in. Strong 6061 aluminum frame is designed to minimize flex and deliver a stiff, responsive platform for efficient transfer of your pedaling energy. Strong, stiff OCL Joint frame hinge offers smooth, easy operation; large, smooth lever automatically locks into place. When frame is folded in half, the frame hinge surfaces lock together for a secure fit; lever folds flat and braces against joint for protection in transit. The precision-machined Physis folding handlepost features an oversized hinge and a secure lock to minimize flex. Handlepost hinge lever automatically locks in place and is easy to use; if hinge is accidentally left unlocked, the hinge won't open when handlebar is pushed forward. Handlepost hinge features 3 rubber seals to keep weather out and protect the headset; redundant double bolts clamp handlepost to steerer. Schwalbe Citizen tires feature double-layer puncture protection to deter flats. Accommodates riders up to 6 ft. 2 in. tall; recommended maximum weight of rider with gear is 242 lbs. Specs on the Tern Link D8 folding bike are subject to change.","short_description":"Ride it, fold it and stash it in the closet. The 8-speed Tern Link D8 Folding Bike is ready for urban trips and errands with fenders for rainy day protection and a rear rack for hauling.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378595.png","image_url":"http://i1.avlws.com/115/l378595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378595&tt=df","retail_price":"700.00","sale_price":"700.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867279&amp;link=&amp;tabs=-Details\"></script>","variants":{"8672790001":{"sku":"8672790001","vendor_sku":"12-3-07","upc":"817378010674","size":"One Size","color":"BLACK/BLUE","retail_price":"700.00","sale_price":"700.00"}}}
