{"sku":"867296","manufacturer_id":"62192","brand_name":"Camelbak","product_name":" CamelBak Fourteener 24 Hydration Pack - 100 fl. oz.","long_description":"The generously-sized CamelBak Fourteener 24 Hydration Pack is a compact and technical pack for done-in-a-day alpine adventures and everyday outings. 100 fl. oz. Antidote(TM) reservoir features a welded center baffle and low-profile shape for stability. Quick Link(TM) system lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director or flow meter (accessories sold separately). Hydration compartment loads easily, holding the reservoir flat against your back to leave more room for layers and gear. Wide mouth makes it easy to fill and clean the reservoir; quick-snap cap tightens in just a quarter turn. Folding arms lock into position to hold the reservoir open when drying; arms tuck out of the way around the port when not in use. With its separate zippered opening, the reservoir can be easily refilled without removing it from the pack. Harness with padded shoulder straps, sternum strap and hipbelt provide maximum comfort and even load distribution. NV(TM) back panel features upper pods that articulate for maximum comfort and superior ventilation, while lower pod provides load transfer. Main compartment holds lunch, gear and all your 10 essentials for a 1-day peak ascent. Large, zippered front pocket keeps valuables close at hand; small zippered top pocket with fleece lining stores sunglasses or MP3 player. Dual side-compression straps help stabilize the load; tool loop and lash point let you attach extra gear to the exterior of the pack. The CamelBak Fourteener 24 Hydration Pack is made from rugged, polyurethane-coated nylon for long-lasting wear.","short_description":"The generously-sized CamelBak Fourteener 24 Hydration Pack is a compact and technical pack for done-in-a-day alpine adventures and everyday outings.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411531.png","image_url":"http://i1.avlws.com/115/l411531.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411531&tt=df","retail_price":"145.00","sale_price":"145.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411531\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411531.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867296&amp;link=&amp;tabs=-Details\"></script>","variants":{"8672960001":{"sku":"8672960001","vendor_sku":"62191","upc":"886798621913","size":"100 FL OZ","color":"CHARCOAL/GRAPHITE","retail_price":"145.00","sale_price":"145.00"},"8672960002":{"sku":"8672960002","vendor_sku":"62192","upc":"886798621920","size":"100 FL OZ","color":"DEEP OLIVE/WOODBINE","retail_price":"145.00","sale_price":"145.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
