{"sku":"867332","manufacturer_id":"02-14-3163","brand_name":"Diamondback","product_name":" Diamondback Clarity STI-8 Women's Bike - 2014","long_description":"With a smooth-shifting internally geared rear hub, the Diamondback Clarity STI-8 women's hybrid bike offers a clean, speedy and comfortable platform for day-in, day-out riding around town. Sturdy aluminum frame provides a comfortable upright ride, reducing body strains and enhancing visibility; frame has been specifically crafted to deliver a great fit for women. Shimano Nexus internally geared rear hub provides 8 smooth-shifting gears to comfortably cruise cities and paths; twist-grip shifter changes gears with a flick of a wrist. Internally geared hubs require much less maintenance when compared to derailleur-and-cassette systems. Linear-pull brakes offer easy speed management. Speedy 700c wheels are outfitted with puncture-resistant Kenda Kwik Trax tires for low rolling resistance and comfortable handling. Diamondback Performance Hybrid seat features gel padding for extended comfort in the saddle. Frame eyelets accept fenders or a rear rack for added utility (not included). Specs on the Diamondback Clarity STI-8 hybrid bike are subject to change.","short_description":"With a smooth-shifting internally geared rear hub, the Diamondback Clarity STI-8 women's hybrid bike offers a clean, speedy and comfortable platform for day-in, day-out riding around town.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378619.png","image_url":"http://i1.avlws.com/115/l378619.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378619&tt=df","retail_price":"649.00","sale_price":"649.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378619\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378619.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867332&amp;link=&amp;tabs=-Details\"></script>","variants":{"8673320003":{"sku":"8673320003","vendor_sku":"02-14-3163","upc":"791964419358","size":"L","color":"GREY","retail_price":"649.00","sale_price":"649.00"}}}
