{"sku":"867323","manufacturer_id":"02-14-2031","brand_name":"Diamondback","product_name":" Diamondback Sortie 1 29er Bike - 2014","long_description":"A high-performance bike with a Fox shock for aggressive trails, the Diamondback Sortie 1 29er combines the performance of big wheels with a responsive and efficient full-suspension platform. 6061-T6 weapons-grade aluminum frame boasts an array of hydroformed and butted and formed tubes along with a tapered head tube to deliver a strong, stiff and responsive ride. The heart of the Sortie 1 is the Knuckle Box platform, which lowers the center of gravity of the suspension to optimize efficiency and effortlessly absorb small bumps. Fox 32 Float CTD 29 Air fork has 120mm of travel that can be easily tuned between the 3 CTD settings (Climb, Trail, Descend); 15mm thru axle helps stiffen the front. Fox Float CTD Air rear shock features Boost Valve technology along with the CTD ProPedal platform to efficiently absorb bumps with great protection from bottoming out. 3x9 Shimano drivetrain boasts SLX front and rear derailleurs guided by Alivio shifters; triple crank and 11-34t cassette supply versatile gearing. Shimano hydraulic disc brakes put responsive, progressive braking control in your hands with a 180mm rotor up front and 160mm rotor in the back. Sturdy WTB Speed Disc double-walled rims are outfitted with WTB Wolverine Comp folding tires, which handle everything from loose to hardpacked trails. Oversize 1.5 in. tapered steerer on the fork pairs with the tapered head tube to ensure plenty of strength and handling precision. Specs on the Diamondback Sortie 1 29er full-suspension mountain bike are subject to change.","short_description":"A high-performance bike with a Fox shock for aggressive trails, the Diamondback Sortie 1 29er combines the performance of big wheels with a responsive and efficient full-suspension platform.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s375023.png","image_url":"http://i1.avlws.com/115/l375023.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375023&tt=df","retail_price":"2199.00","sale_price":"2199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375023\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375023.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867323&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
