{"sku":"867320","manufacturer_id":"02-14-2081","brand_name":"Diamondback","product_name":"Diamondback Mason FS 29er Bike - 2014","long_description":"Fast-rolling 29er wheels, 20 speeds and a rear Fox shock with multiple modes for climbs and descents make the Diamondback Mason FS 29er full-suspension mountain bike a premier ride for any trail. The heart of the Mason FS 29er is the Knuckle Box platform, which lowers the center of gravity of the suspension to optimize efficiency and effortlessly absorb small bumps. Fox Float CTD Air rear shock can be easily tuned between the 3 CTD settings (Climb, Trail, Descend) for efficiency on any gradient with great protection from bottoming out. Fox 34 Float CTD 29 Air fork has 140mm of travel that can be easily tuned among the 3 modes, and includes a tapered steerer, magnesium lowers and a 15mm thru axle. RaceFace Respond double-ringed crankset is paired with a 10-speed, 11-36t cassette for a simple approach to trail domination. SRAM X7 shifter guides the SRAM X9 Type 2 rear derailleur quickly and precisely through the 20 gears. 6061-T6 weapons-grade aluminum frame boasts an array of formed and butted-and-formed tubes along with a tapered head tube to deliver a strong, stiff and responsive ride. Slack 66.5deg head tube angle offers stable, confidence-inspiring handling on aggressive trails; 16.77 in. long chainstays make it easier to get the front up over obstacles. Avid Elixir 5 hydraulic disc brakes deliver responsive braking thanks to a 180mm rotor up front and 160mm rotor in the back. Diamondback AM290HD rims spin smoothly around sealed cartridge bearing hubs and are wrapped with Kenda Nevegal 29 x 2.2 tires for great traction. Specs on the Diamondback Mason FS 29er full-suspension mountain bike are subject to change.","short_description":"Fast-rolling 29er wheels, 20 speeds and a rear Fox shock with multiple modes for climbs and descents make the Diamondback Mason FS 29er full-suspension mountain bike a premier ride for any trail.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s375015.png","image_url":"http://i1.avlws.com/115/l375015.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375015&tt=df","retail_price":"2999.00","sale_price":"2999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375015\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375015.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867320&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
