{"sku":"867319","manufacturer_id":"02-14-2061","brand_name":"Diamondback","product_name":"Diamondback Mission Bike - 2014","long_description":"The capable Diamondback Mission full-suspension mountain bike boasts a solid pedaling platform with 6 in. Fox suspension for great all-mountain performance. 6061-T6 Weapons Grade aluminum frame boasts an array of hydroformed and butted and formed tubes along with a tapered head tube to deliver a strong, stiff and responsive ride. At the heart of the Mission is the Knuckle Box platform, which keeps rear suspension low, tight and plush to optimize efficiency, small-bump compliance and leverage ratios. Fox 34 Float CTD Air fork delivers 160mm of smooth travel thanks to Easton aluminum stanchions, tapered and butted 1.5 in. alloy steerer and QR15 thru-axle. Fox Float CTD Air rear shock features Boost Valve technology along with the CTD ProPedal platform to give the bike plush, efficient suspension with great bottom-out protection. CTD settings (Climb, Trail, Descend) and external rebound adjustments make it simple and easy to tune the ride to the trail. 2x10 drivetrain offers weight savings with fast, precise shifts and a gear range savvy enough to handle races and all-day riding. Drivetrain highlights include the stiff and tough RaceFace Respond crankset with bash guard, SRAM X9 Type 2 rear derailleur and SRAM X7 shifters. Avid Elixir 5 hydraulic disc brakes deliver responsive braking thanks to a 200mm rotor up front and 180mm rotor in the back. 15mm thru-axle up front and 142x12mm thru-axle in the rear ensure stiff, strong performance at the critical wheel/frame interface. Specs on the Diamondback Mission full-suspension mountain bike are subject to change.","short_description":"The capable Diamondback Mission full-suspension mountain bike boasts a solid pedaling platform with 6 in. Fox suspension for great all-mountain performance.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s375011.png","image_url":"http://i1.avlws.com/115/l375011.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375011&tt=df","retail_price":"2999.00","sale_price":"2999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375011\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375011.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867319&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
