{"sku":"867309","manufacturer_id":"02-14-2113","brand_name":"Diamondback","product_name":" Diamondback Mason 29er Bike - 2014","long_description":"The 10-speed Diamondback Mason 29er hardtail mountain bike offers a solid, stable ride for aggressive descents thanks to its fast-rolling 29 in. wheels and RockShox fork with 5.5 in. of travel. Large 29er wheels roll over obstacles easier and faster thanks to more momentum and a decreased angle of attack; plus, you get more tire contact for enhanced traction. RockShox Sektor Silver front fork to conquers trail obstacles with 160mm of travel. 6061-T6 weapons-grade aluminum frame boasts an array of formed and butted-and-formed tubes along with a tapered head tube to deliver a strong, stiff and responsive ride. Slack 66.5deg head tube angle offers stable, confidence-inspiring handling on aggressive trails; 16.77 in. long chainstays make it easier to get the front up over obstacles. SRAM X5 shifter guides the SRAM X5 rear derailleur quickly and precisely through the 10 gears. RaceFace Respond single-ringed crankset with MRP chain guide is paired with 10-speed, 11-36t cassette for good all-around gearing; ISCG 05 tabs make an upgrade easy. Avid Elixir 5 hydraulic disc brakes deliver responsive braking thanks to a 200mm rotor up front and 180mm rotor in the back. Diamondback AM290 rims spin smoothly around sealed cartridge bearing hubs and are wrapped with Kenda Nevegal 29 x 2.2 (front) and Slant 6 29 x 2.0 (rear) tires. 15mm thru axle up front and 142x12mm thru axle in the rear ensure stiff, strong performance at the critical wheel/frame interface. Specs on the Diamondback Diamondback Mason 29er hardtail mountain bike are subject to change.","short_description":"The 10-speed Diamondback Mason 29er hardtail mountain bike offers a solid, stable ride for aggressive descents thanks to its fast-rolling 29 in. wheels and RockShox fork with 5.5 in. of travel.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s374971.png","image_url":"http://i1.avlws.com/115/l374971.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=374971&tt=df","retail_price":"1499.00","sale_price":"1499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=374971\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m374971.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867309&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
