{"sku":"867345","manufacturer_id":"02-14-3240","brand_name":"Diamondback","product_name":" Diamondback Trace Comp Bike - 2014","long_description":"With an upright, comfortable riding position, bump-absorbing fork and powerful disc brakes, the Diamondback Trace Comp hybrid bike is great for everyday city rides, work commutes and fun. Sturdy aluminum frame withstands the rigors of regular use; flat handlebar enables an upright riding position for greater comfort and heads-up visibility. Suspension fork helps keep you in control and comfortable with 75mm of bump-absorbing suspension; convenient lockout disables suspension when it's not needed. 24 gears let you spin easily and swiftly up hills and through the city; dependable Shimano shifters and derailleurs make precise work of shifting. Hayes mechanical disc brakes supply all-weather stopping power. Sturdy double-walled rims are wrapped with Innova DualSport tires, which offer puncture resistance and can go from pavement to packed dirt or gravel paths with ease. Specs on the Diamondback Trace Comp bike are subject to change.","short_description":"With an upright, comfortable riding position, bump-absorbing fork and powerful disc brakes, the Diamondback Trace Comp hybrid bike is great for everyday city rides, work commutes and fun.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378627.png","image_url":"http://i1.avlws.com/115/l378627.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378627&tt=df","retail_price":"649.00","sale_price":"649.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378627\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378627.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867345&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
