{"sku":"867444","manufacturer_id":"100201","brand_name":"Bic Sport","product_name":" BIC Sport ACE-TEC Wing Limited Stand Up Paddleboard - 12' 6\"","long_description":"Built with a rich, high-gloss finish and designed for fitness, touring and racing, the Bic Sport ACE-TEC Wing Limited 12 ft. 6 in. Stand Up Paddleboard offers smooth, easy gliding for large paddlers. Flat hull under standing area increases stability and slightly V-shaped tail section reduces drag. High-volume bow and sharp V shape cuts easily through chop and smooths out the ride. EPS foam core wrapped with an epoxy resin/fiberglass cloth is encased in a styrene polymer outer shell; construction offers lightweight durability. Multiaxial fiberglass cloth distributes weight in multiple directions in the board, offering excellent stiffness and low weight. Padded deck supplies reliable wax-free traction when paddling in the standing or kneeling position, and it increases comfort on long paddles. Recessed standing area on the deck makes it easy to stay on your feet. 9-in. single fin promotes straight tracking in the water. FCS SUP Touring fin features injection-molded construction and a specialized structure on the inside face of the fin that reduces drag and enhances performance. 9 deck clips offer multiple spots to attach day-tripping accessories. Carry handle allows you to curve fingers inside for easy grip; the Bic Sport ACE-TEC Wing Limited 12 ft. 6 in. Stand Up Paddleboard weighs 34 lbs.","short_description":"Built with a rich, high-gloss finish and designed for fitness, touring and racing, the Bic Sport ACE-TEC Wing Limited 12 ft. 6 in. Stand Up Paddleboard offers smooth, easy gliding for large paddlers.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430815.png","image_url":"http://i1.avlws.com/115/l430815.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430815&tt=df","retail_price":"1399.95","sale_price":"1399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430815\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430815.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867444&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674440001":{"sku":"8674440001","vendor_sku":"100201","upc":"883667005171","size":"12 FT 6 IN","color":"BLUE/RED","retail_price":"1399.95","sale_price":"1399.95"}}}
