{"sku":"867414","manufacturer_id":"SPPF-MP-EF","brand_name":"Steripen","product_name":"SteriPEN Classic 3 Water Purifier with Prefilter","long_description":"Trusted in the mountains and on international trips, the handheld SteriPEN Classic 3 Water Purifier with Prefilter is simple and quick to use, and it ensures your water is safe for drinking. This updated version of the Classic has a new LED display, a more ergonomic design and the ability to accept alkaline, lithium and NiMH batteries (sold separately). Ultraviolet (UV-C) light rays safely sterilize clear water by destroying 99.99% of protozoa (including giardia and cryptosporidia), bacteria and even viruses. To purify your water, just press a button and gently agitate the water with a quick stir. If clear water is not available, no worries-the SteriPEN prefilter clears particulates and debris from water. Prefilter fits Nalgene(R) and other water bottles with 63mm wide-mouth openings; pour source water through filter, and clean water enters bottle. SteriPEN Classic 3 Water Purifier purifies 16 fl. oz. of water (cold or warm) in less than a minute or 32 fl. oz. in a minute and a half. Small size fits most containers-use it in cups, mugs, water bottles and canteens. SteriPEN turns itself off once ultraviolet treatment is complete; can be used up to 8,000 times! With 1 set of batteries, the Classic 3 purifies up to 50 liters of water; operates on 4 AA alkaline, lithium or NiMH batteries (sold separately). Includes SteriPEN Classic 3 Water Purifier, prefilter and instruction manuals.","short_description":"Trusted in the mountains and on international trips, the handheld SteriPEN Classic 3 Water Purifier with Prefilter is simple and quick to use, and it ensures your water is safe for drinking.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s463547.png","image_url":"http://i1.avlws.com/115/l463547.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463547&tt=df","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463547\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463547.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867414&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674140001":{"sku":"8674140001","vendor_sku":"SPPF-MP-EF","upc":"899321000178","retail_price":"69.95","sale_price":"69.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
