{"sku":"867476","manufacturer_id":"010-01040-20","brand_name":"Garmin","product_name":" Garmin Tactix GPS Multifunction Watch","long_description":"Inspired by special-ops forces, the high-sensitivity Garmin Tactix GPS multifunction watch boasts an altimeter, barometer, compass, waypoints and TracBac(R) navigation capability. Enjoy high-sensitivity GPS positioning with automatic calibrating altimeter, barometer and 3-axis compass. Mark and store up to 1,000 waypoints; TracBac reverses the track log so you can navigate back to your starting point. ANT+(TM) and Bluetooth(R) connectivity wirelessly shares tracks, waypoints, routes and more with other compatible Garmin devices or smartphones. Wireless sensors let you pair with optional ANT+ sensors such as heart rate monitor, temperature sensor, foot pod, or VIRB action camera (all sold separately). Sun/moon info; hunt/fish calendar; alarm clock; vibration alerts; tones; timer; stopwatch; world clock with automatic time-zone calibration. Comes preloaded with Jumpmaster software for skydivers, U.S. tide data and a worldwide basemap; plan trips and share adventures with friends using BaseCamp(TM) software. Rechargeable lithium-ion battery lasts up to 50 hrs. in GPS mode, 3 weeks in sensor mode, and 5 weeks in watch mode. Metal surfaces are coated in black to be non-reflective; scratch-resistant, curved mineral glass lens won't reflect the sun's glare; rugged forged stainless-steel rear case. The rugged and durable Garmin Tactix GPS multifunction watch resists water down to 50m (165 ft.); negative-mode LCD with green backlight allows use with night-vision goggles.","short_description":"Inspired by special-ops forces, the high-sensitivity Garmin Tactix GPS multifunction watch boasts an altimeter, barometer, compass, waypoints and TracBac(R) navigation capability.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413595.png","image_url":"http://i1.avlws.com/115/l413595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413595&tt=df","keywords":"odometer,waterproof","retail_price":"450.00","sale_price":"450.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867476&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674760001":{"sku":"8674760001","vendor_sku":"010-01040-20","upc":"753759113308","color":"BLACK","retail_price":"450.00","sale_price":"450.00"}}}
