{"sku":"867445","manufacturer_id":"100390","brand_name":"Bic Sport","product_name":"BIC Sport ACE-TEC Cross Stand Up Paddleboard - 10'","long_description":"An approachable board for all-around family fun, the Bic Sport ACE-TEC Cross 10 ft. Stand Up Paddleboard cruises flatwater with high stability and offers lots of space for yoga and touring. 33 in width and a flat deck offer inviting stability for paddlers of any ability level, and 6 tie-down points let you secure gear for day tours. Perfect for paddlers under 220 lbs., the 10 ft. length handles nicely in surf and tracks well in flatwater, and keel shape in nose enhances tracking and increases glide. EPS foam core wrapped with an epoxy resin/fiberglass cloth and encased in a styrene polymer outer shell; construction offers lightweight durability. Multiaxial fiberglass cloth distributes weight in multiple directions on the board, offering excellent stiffness and low weight. Padded deck supplies reliable wax-free traction and comfort for paddling on knees or standing. 9 in. single fin promote straight tracking in the water. FCS fin features injection-molded construction and a specialized structure on the inside face of the fin that reduces drag and enhances performance. Carry handle features space on the interior that allows you to curve your fingers to the inside and get a solid grip. Bic Sport ACE-TEC Cross 10 ft. Stand Up Paddleboard weighs 27 lbs.","short_description":"An approachable board for all-around family fun, the Bic Sport ACE-TEC Cross 10 ft. Stand Up Paddleboard cruises flatwater with high stability and offers lots of space for yoga and touring.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s457435.png","image_url":"http://i1.avlws.com/115/l457435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457435&tt=df","retail_price":"1099.95","sale_price":"1099.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867445&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674450001":{"sku":"8674450001","vendor_sku":"100390","upc":"883667005140","size":"10 FT","color":"WHITE/BLUE","retail_price":"1099.95","sale_price":"1099.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
