{"sku":"867421","manufacturer_id":"62169","brand_name":"Camelbak","product_name":" CamelBak Aventura 22 Hydration Pack - 100 fl. oz. - Women's","long_description":"The women's CamelBak Aventura Hydration Pack comfortably hauls a day's worth of gear and 3 liters of water. It offers easy zippered access to the reservoir via the back panel. Suspension features a hipbelt and S-curve shoulder straps that comfortably fit a woman's shape. NV(TM) back panel features upper pods that articulate for maximum comfort and superior ventilation, while lower pod provides load transfer. 100 fl. oz. Antidote(TM) reservoir features a welded center baffle and low-profile shape for stability. Quick Link(TM) system lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director or flow meter (accessories sold separately). Folding arms lock into position to hold the reservoir open when drying; arms tuck out of the way around the port when not in use. Wide-mouth port makes it easy to fill and clean the reservoir; quick-snap cap tightens in just a quarter turn. Hydration compartment loads easily, holding the reservoir flat against your back to leave more room for layers and gear. Generous main compartment holds lunch, gear and all your essentials for a 1-day peak ascent. Large, zippered front pocket keeps electronics, cell phone or other valuables close at hand; small zippered top pocket with fleece lining stores sunglasses or MP3 player. Dual side-compression straps help stabilize the load; tool loops let you attach extra gear to the exterior of the pack. The CamelBak Aventura Hydration Pack is made from rugged, polyurethane-coated nylon for long-lasting wear.","short_description":"The women's CamelBak Aventura Hydration Pack comfortably hauls a day's worth of gear and 3 liters of water. It offers easy zippered access to the reservoir via the back panel.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411551.png","image_url":"http://i1.avlws.com/115/l411551.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411551&tt=df","retail_price":"145.00","sale_price":"145.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411551\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411551.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867421&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674210001":{"sku":"8674210001","vendor_sku":"62168","upc":"886798621685","size":"100 FL OZ","color":"BLACKBERRY CORDIAL/GRAPE","retail_price":"145.00","sale_price":"145.00"},"8674210002":{"sku":"8674210002","vendor_sku":"62169","upc":"886798621692","size":"100 FL OZ","color":"MYKONOS BLUE/BLUE JEWEL","retail_price":"145.00","sale_price":"145.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
