{"sku":"867442","manufacturer_id":"100255","brand_name":"Bic Sport","product_name":"BIC Sport ACE-TEC Platinum Wahine Stand Up Paddleboard - 10' 6\"","long_description":"A stable board for flatwater and light surf, the women's Bic Sport ACE-TEC Platinum Wahine 10' 6\" Stand Up Paddleboard lets you get out on the water to explore and get some exercise. 10 ft. 6 in. length maneuvers well in light surf and cruises swiftly in flatwater. Balanced rocker design and longboard-style outline offer excellent handling on flatwater and easy maneuverability in waves and light surf. EPS foam core wrapped with an epoxy resin/fiberglass cloth is encased in a styrene polymer outer shell; construction offers lightweight durability. Multiaxial fiberglass cloth distributes weight in multiple directions in the board, offering excellent stiffness and low weight. Padded deck supplies reliable wax-free traction when paddling in the standing or kneeling position, and it increases comfort on long paddles. 10 in. single fin and 2 side fins promote straight tracking in the water. FCS fin features injection-molded construction and a specialized structure on the inside face of the fin that reduces drag and enhances performance. Carry handle allows you to curve fingers inside for easy grip; the Bic Sport ACE-TEC Platinum Wahine 10 ft. 6 in. Stand Up Paddleboard weights 26 lbs.","short_description":"A stable board for flatwater and light surf, the women's Bic Sport ACE-TEC Platinum Wahine 10' 6\" Stand Up Paddleboard lets you get out on the water to explore and get some exercise.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430807.png","image_url":"http://i1.avlws.com/115/l430807.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430807&tt=df","retail_price":"1149.95","sale_price":"1149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430807\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430807.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867442&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674420001":{"sku":"8674420001","vendor_sku":"100255","upc":"883667005126","size":"10 FT 6 IN","color":"PLATINUM/PINK","retail_price":"1149.95","sale_price":"1149.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
