{"sku":"867435","manufacturer_id":"9617","brand_name":"Rei","product_name":"REI Day Hiker First-Aid Kit","long_description":"The REI Day Hiker First-Aid Kit provides essential medical supplies for up to 2 people going on day hikes. All contents are packed together in a zippered nylon case; clear compartments let you easily find the items you need. Reflective trim makes the kit easier to locate quickly inside a pack. Comes with with a handy first-aid/CPR guide for reference on the trail. Treat cuts with an assortment of adhesive bandages, including 1 in. strips, 0.75 in. strips, knuckle bandages, fingertip bandages and butterfly closures. For larger wounds, the kit also includes an assortment of gauze pads, a roll of gauze and a roll of medical tape. Prep and care for wounds with antiseptic towelettes, triple-antibiotic ointment and sting-relief wipes. Medications include antacid tablets, ibuprofen tablets, acetaminophen tablets and allergy-relief tablets. Also includes Moleskin to help prevent and treat blisters. Equipment includes a pair of bandage scissors and a splinter-removal tool. The REI Day Hiker First-Aid Kit is assembled in the USA of imported and domestic materials.","short_description":"The REI Day Hiker First-Aid Kit provides essential medical supplies for up to 2 people going on day hikes.","category":"Camping And Hiking","subcategory":"Health And Safety","product_group":"First Aid","thumb_url":"http://i1.avlws.com/115/s420551.png","image_url":"http://i1.avlws.com/115/l420551.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=420551&tt=df","retail_price":"13.50","sale_price":"13.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=420551\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m420551.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867435&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674350001":{"sku":"8674350001","vendor_sku":"9617","upc":"486743500012","color":"RED/GRAY","retail_price":"13.50","sale_price":"13.50"}},"categories":["camping-hiking","health-and-safety","first-aid"]}
