{"sku":"867489","manufacturer_id":"90509","brand_name":"Emotion Kayaks","product_name":"Emotion Kayaks Darter Kayak","long_description":"Ready for leisurely day trips on smooth water, the Emotion Kayaks Darter Kayak brings a full array of features at an incredible value to the casual paddler. Beginners will love the confidence-inspiring initial stability that's built into the hull; stern keel and tracking channels help keep new paddlers going in a straight line. Short length and 40 lb. weight allows you to carry the kayak on your own. Polyethylene hull resists abrasion and UV light, and it offers good looks at a great value. Specialized blowmolding process produces a strong hull of consistent quality. Large cockpit opening makes it easy to get into the boat with some extra gear; flared bow offers lots of leg room. Adjustable foot pegs promote a comfortable paddling position for a wide range of paddlers. Molded seat enhances comfort; a beverage holder keeps refreshment close by and also stores small accessories. Foam block in stern enhances flotation and makes it easier to handle a water-logged boat. Fore and aft deck rigging; paddle holder; toggle handles.","short_description":"Ready for leisurely day trips on smooth water, the Emotion Kayaks Darter Kayak brings a full array of features at an incredible value to the casual paddler.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s449199.png","image_url":"http://i1.avlws.com/115/l449199.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449199&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449199\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449199.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867489&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674890001":{"sku":"8674890001","vendor_sku":"90509","upc":"081483800097","size":"9 FT","color":"RED","retail_price":"299.00","sale_price":"299.00"}},"categories":["paddling","kayaks","recreational-kayaks"]}
