{"sku":"867498","brand_name":"Rei","product_name":"REI Backpacker Multiday First-Aid Kit","long_description":"The REI Backpacker Multiday First-Aid Kit provides essential medical supplies for up to 4 people on 5-day trips into the backcountry. All contents are packed together in a zippered nylon case; clear fold-out compartments let you easily find the items you need. Reflective trim makes the kit easier to locate quickly inside a pack. Comes with a wilderness first-aid manual for reference on the trail, along with an accident record and pencil. Treat cuts with an assortment of adhesive bandages, including 1 in. strips, 0.75 in. strips, knuckle bandages, fingertip bandages and butterfly closures. For larger wounds, the kit also includes an assortment of gauze pads, a roll of gauze, larger wound pads, sponges and a roll of medical tape. For injured joints, arms and legs, the kit includes an elastic bandage. Prep and care for injuries with antiseptic towelettes, triple-antibiotic ointment, iodine wipes, antimicrobial wipes, sting-relief wipes, burn cream and hydrocortisone cream. Medications include antacid tablets, ibuprofen tablets, acetaminophen tablets and allergy-relief tablets; kit also has a pill vial. Equipment includes safety pins, latex-free medical gloves, bandage scissors, splinter forceps and a resealable waste bag. The REI Backpacker Multiday First-Aid Kit is assembled in the USA with domestic and imported parts.","short_description":"The REI Backpacker Multiday First-Aid Kit provides essential medical supplies for up to 4 people on 5-day trips into the backcountry.","category":"Camping & Hiking","subcategory":"First Aid","product_group":"First-Aid Kits","thumb_url":"http://i1.avlws.com/115/s354811.png","image_url":"http://i1.avlws.com/115/l354811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=354811&tt=df","keywords":"activefamily,backpacking,survival,aid,health","retail_price":"36.50","sale_price":"36.50","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=354811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m354811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867498&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674980001":{"sku":"8674980001","vendor_sku":"9619","upc":"486749800017","color":"RED/GRAY","retail_price":"36.50","sale_price":"36.50"}}}
