{"sku":"867420","manufacturer_id":"62249","brand_name":"Camelbak","product_name":"CamelBak Aventura 18 Hydration Pack - 100 fl. oz. - Women's","long_description":"Perfect for hiking, the women's CamelBak Aventura 18 Hydration Pack maximizes comfort and ventilation. It packs everything you need for a done-in-a-day expedition. Entire pack is tailored to fit women comfortably, including a shorter torso length and an S-shape harness with adjustment hardware moved away from the chest. Ventilated NV(TM) back panel keeps you cool and comfortable via its articulated suspension; individual pods move in sync with you while keeping the pack's contents balanced. 100 fl. oz. Antidote#8482; reservoir features a welded center baffle and low-profile shape for stability. Quick Link#8482; system lets you effortlessly add accessories such as a filter, insulated tube, tube director or flow meter (accessories sold separately). Folding arms lock into position to hold the reservoir open when drying; arms tuck out of the way around the port when not in use. Wide-mouth port makes it easy to fill and clean the reservoir; quick-snap cap tightens in just a quarter turn. Patented Big Bite#8482; valve; HydroGuard#8482; technology; PureFlow#8482; tube. Hydration compartment loads easily, holding the reservoir flat against your back to leave more room for layers and gear. Large main compartment, overflow pocket, front organizational pocket and 2 stretch side pockets organize your gear and keep essentials quickly accessible. Easy-access, fleece-lined pocket holds your sunglasses, smartphone or other valuables. The CamelBak Aventura 18 Hydration Pack features 4-point compression that helps stabilize your cargo.","short_description":"Perfect for hiking, the women's CamelBak Aventura 18 Hydration Pack maximizes comfort and ventilation. It packs everything you need for a done-in-a-day expedition.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s411547.png","image_url":"http://i1.avlws.com/115/l411547.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=411547&tt=df","retail_price":"125.00","sale_price":"125.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=411547\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m411547.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867420&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674200001":{"sku":"8674200001","vendor_sku":"62249","upc":"886798622491","size":"100 FL OZ","color":"MYKONOS BLUE/BLUE JEWEL","retail_price":"125.00","sale_price":"125.00"},"8674200002":{"sku":"8674200002","vendor_sku":"62250","upc":"886798622507","size":"100 FL OZ","color":"BLACKBERRY CORDIAL/GRAPE","retail_price":"125.00","sale_price":"125.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
