{"sku":"867443","manufacturer_id":"100197","brand_name":"Bic Sport","product_name":" BIC Sport ACE-TEC Classic Platinum Stand Up Paddleboard - 11' 6\"","long_description":"Perfect for flatwater and light surf, the Bic Sport ACE-TEC Classic Platinum 11 ft. 6 in. Stand Up Paddleboard offers width, volume and stability geared toward beginners and large paddlers. With a weight capacity of 250 lbs., the 11 ft. 6 in. length handles nicely and tracks well in flatwater. The 11 ft. 6 in. length is also a great choice for multiple users-high stability means everyone can have a fun time. Balanced rocker design and longboard-style outline offer excellent handling on flatwater and easy maneuverability in waves and light surf. EPS foam core wrapped with an epoxy resin/fiberglass cloth is encased in a styrene polymer outer shell; construction offers lightweight durability. Multiaxial fiberglass cloth distributes weight in multiple directions in the board, offering excellent stiffness and low weight. Padded deck supplies reliable wax-free traction when paddling in the standing or kneeling position, and it increases comfort on long paddles. 10-in. single fin promotes straight tracking in the water. FCS fin features injection-molded construction and a specialized structure on the inside face of the fin that reduces drag and enhances performance. Carry handle allows you to curve fingers inside for easy grip; the Bic Sport ACE-TEC Classic Platinum 11 ft. 6 in. Stand Up Paddleboard weighs 30 lbs.","short_description":"Perfect for flatwater and light surf, the Bic Sport ACE-TEC Classic Platinum 11 ft. 6 in. Stand Up Paddleboard offers width, volume and stability geared toward beginners and large paddlers.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430811.png","image_url":"http://i1.avlws.com/115/l430811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430811&tt=df","retail_price":"1199.95","sale_price":"1199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867443&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674430001":{"sku":"8674430001","vendor_sku":"100197","upc":"883667005133","size":"11 FT 6 IN","color":"PLATINUM/RED","retail_price":"1199.95","sale_price":"1199.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
