{"sku":"867457","manufacturer_id":"MT21A","brand_name":"Nitecore","product_name":" Nitecore MT21A Flashlight","long_description":"The Nitecore MT21A Flashlight has an output that adjusts from 260 lumens on turbo to 15 lumens on low to meet all your lighting needs around the house and at the campsite. Premium Cree XP-E2 R2 LED has a turbo output of 260 lumens and a throw distance of up to 200m (656 ft.); outputs 130 lumens on high, 60 lumens on mid and 15 lumens on low. Turn the flashlight on and off with the easy-to-operate tail-cap button; loosen the flashlight head, and then use the on/off button to switch between low, mid and high. Access turbo mode by turning the flashlight on when the head is tightened. 2 AA batteries (sold separately) provide 50 hrs. of use on low, 12 hrs. on mid, 5 hrs. on high and 2 hrs. on turbo. 2 different strobes can be used for signaling. Aerospace-grade aluminum alloy body with hard anodizing stands up to regular use in the outdoors; impact resistant to 1.5m. Nitecore MT21A flashlight has an IPX8 water-resistance rating, making it submersible to 2m. Includes a lanyard, spare plastic cap and a spare O-ring.","short_description":"The Nitecore MT21A Flashlight has an output that adjusts from 260 lumens on turbo to 15 lumens on low to meet all your lighting needs around the house and at the campsite.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416939.png","image_url":"http://i1.avlws.com/115/l416939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416939&tt=df","retail_price":"34.95","sale_price":"34.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867457&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674570001":{"sku":"8674570001","vendor_sku":"MT21A","color":"BLACK","retail_price":"34.95","sale_price":"34.95"}}}
