{"sku":"867459","manufacturer_id":"SRT3","brand_name":"Nitecore","product_name":" Nitecore SRT3 Flashlight","long_description":"The Nitecore SRT3 flashlight features a premium Cree XM-L LED for a maximum output of 550 lumens and a selector ring that lets you rapidly choose any level of light output down to 0.1 lumen. Cree XM-L LED throws a beam a distance of 134m (439 ft.) to illuminate the dark trails and streets. 4 \"brightness\" levels: turbo, low, red LED and blue LED plus dimmer that allows you to select any light level. Rotate the selector ring to rapidly choose any level of light output from 0.1 to 550 lumens, and to select strobe modes, turbo output, low output and different colored LEDs. Operates on either one CR123 lithium battery or a rechargeable RCR123 lithium battery (both sold separately) to provide up to 150 hrs. of runtime on the lowest output level. Can also run on one AA battery (sold separately) with the use of the included AA extension tube. Equipped with red and blue LEDs that are useful for signaling; red light is also useful for general outdoor use when you don't want to ruin your night vision. Includes a standard strobe mode and a police warning light that alternates red and blue light; leave the flashlight in location beacon strobe mode to find it easily at night. Aerospace-grade aluminum alloy and a stainless-steel retaining ring protect the core components from damage. Includes a titanium-plated stainless-steel clip for attaching the light to a belt or pant pocket. The Nitecore SRT3 flashlight has an IPX8 water resistance rating for submersion to 2m; impact resistant to 1.5m. Includes a holster, removable clip, AA extension tube, lanyard, spare tail-cap button and spare O-ring.","short_description":"The Nitecore SRT3 flashlight features a premium Cree XM-L LED for a maximum output of 550 lumens and a selector ring that lets you rapidly choose any level of light output down to 0.1 lumen.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416947.png","image_url":"http://i1.avlws.com/115/l416947.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416947&tt=df","retail_price":"94.95","sale_price":"94.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416947\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416947.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867459&amp;link=&amp;tabs=-Details\"></script>","variants":{"8674590001":{"sku":"8674590001","vendor_sku":"SRT3","color":"BLACK","retail_price":"94.95","sale_price":"94.95"}}}
