{"sku":"867545","manufacturer_id":"9480","brand_name":"Cycleops","product_name":"CycleOps PowerBeam Pro ANT+ Bike Trainer","long_description":"Designed for the most demanding riders, the CycleOps PowerBeam Pro ANT+ Bike Trainer offers a real road feel and precise control of training variables to maximize training efficiency. Tailor your training to your specific goals by pre-programming your workout parameters with the included software. Included software lets you create and manage custom workouts based on power range, power zone, slope or target power; software is MAC and PC compatible. The CycleOps PowerBeam Pro ANT+ trainer targets and locks in exact power output from 30 - 1000+ watts or slopes up to 10 percent. Post-training, you can download ride and interval data and analyze rides based on critical power, heart rate, cadence, speed and detailed variable correlations. Backlighted color console displays power and speed (current, average, max), heart rate and current/average cadence, energy output (total kjoules), ride distance and ride time. Optional subscription-based Virtual Training software lets you download or create courses, analyze collected training data and share statistics with similarly wired friends. Flywheel is precision engineered for limited dead weight and optimized for a smooth, real-world feel; large machined alloy roller reduces tire wear and slippage. Quick-lock cam lever allows quick and easy bike installation and can even be used with 29ers; install and remove bike with a simple 90deg turn of the handle. Convenient skewer clamp centers your bike from just one side and holds it securely by way of the included skewer; wide, stable platform ensures worry-free training. Foldable frame makes for compact storage; handy, single-leg leveling adjusts for riding on most surfaces. Stiff yoke limits vibrations at all speeds for silky, quiet operation. Fits most 29er wheels up to 2.25 in. width depending on tire tread; Cyclops recommends using a slick or trainer-specific tire.","short_description":"Designed for the most demanding riders, the CycleOps PowerBeam Pro ANT+ Bike Trainer offers a real road feel and precise control of training variables to maximize training efficiency.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trainers","thumb_url":"http://i1.avlws.com/115/s439791.png","image_url":"http://i1.avlws.com/115/l439791.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=439791&tt=df","retail_price":"1000.00","sale_price":"1000.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=439791\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m439791.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867545&amp;link=&amp;tabs=-Details\"></script>","variants":{"8675450001":{"sku":"8675450001","vendor_sku":"9480","upc":"012527012091","color":"BLACK","retail_price":"1000.00","sale_price":"1000.00"}},"categories":["cycling","bike-accessories","bike-trainers"]}
