{"sku":"867528","manufacturer_id":"GM0322MD01","brand_name":"Gt","product_name":" GT Sensor Expert 27.5 Bike - 2014","long_description":"Offering an exhilarating ride with its nimble 27.5 in. wheels, the GT Sensor Expert 27.5 delivers excellent trail performance with a 3-mode Fox shock and a top-notch, 30-speed Shimano SLX drivetrain. GT Sensor Expert 27.5 is quicker and lighter than 29ers, but offers the same benefits of large-diameter wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Lightweight 6061 hydroformed aluminum frame uses the GT Independent Drive design, allowing rear suspension to move independently of bottom bracket for a fully active rear end. Independent Drive system also smooths out pedaling on rough trails and minimizes suspension-induced feedback; forged linkage components ensure strength where it's needed. RockShox Sector Gold RL suspension fork offers 130mm of travel with rebound adjustment, lockout, stiff 15mm thru-axle and a tapered steerer. Fox Float CTD rear shock provides a plush, responsive and tunable rear end; CTD design optimizes performance with 3 modes of travel adjustment (climb, trail, descend). Shimano SLX components combine for snappy and precise shifts throughout the 30 gear combinations. Formula RX hydraulic disc brakes provide powerful deceleration and easy speed management with a 180mm rotors. Specs are subject to change.","short_description":"Offering an exhilarating ride with its nimble 27.5 in. wheels, the GT Sensor Expert 27.5 delivers excellent trail performance with a 3-mode Fox shock and a top-notch, 30-speed Shimano SLX drivetrain.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s375059.png","image_url":"http://i1.avlws.com/115/l375059.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375059&tt=df","retail_price":"3499.00","sale_price":"3499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375059\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375059.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867528&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","mountain-bikes"]}
