{"sku":"867561","manufacturer_id":"BA0014-1106-RF","brand_name":"Surftech","product_name":" Surftech Bamboo Generator Stand Up Paddleboard - 11' 6\"","long_description":"Ideal for large paddlers who like a single board for any condition, the Surftech Bamboo Generator 11 ft. 6 in. Stand Up Paddleboard blends surf and flatwater prowess into one capable design. Surftech Bamboo Generator 11 ft. 6 in. uses sleek lines and a narrow shape to help it carve through chop as well as move efficiently through calm water on longer tours. Increased width and volume through the middle of the board make stability a stand-out feature on the Generator 11 ft. 6 in. paddleboard. 11 ft. 6 in. length offers stability and a smooth ride through surf and on long flatwater tours, and 250 lb. weight capacity offers high flotation for any size paddler. Tapered rails and tail are made for high maneuverability when paddling in surf and whitewater. Construction features layers of fiberglass with an extra layer of wood under the standing area for key structural reinforcement. Waterproof EPS core uses fused-cell technology for a fully waterproof foam core that stays watertight even if you ding it up in the surf. Integrated deck pad provides exceptional grip and reduces foot fatigue. Center fin and 2 side fins on the Surftech Generator 11 ft. 6 in. Stand Up Paddleboard promote straight tracking in the water.","short_description":"Ideal for large paddlers who like a single board for any condition, the Surftech Bamboo Generator 11 ft. 6 in. Stand Up Paddleboard blends surf and flatwater prowess into one capable design.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s456959.png","image_url":"http://i1.avlws.com/115/l456959.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456959&tt=df","retail_price":"1395.00","sale_price":"1395.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456959\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456959.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867561&amp;link=&amp;tabs=-Details\"></script>","variants":{"8675610001":{"sku":"8675610001","vendor_sku":"BA0014-1106-RF","upc":"816209011118","size":"11 FT 6 IN","color":"BROWN","retail_price":"1395.00","sale_price":"1395.00"}},"categories":["paddling","paddleboarding","paddleboards"]}
