{"sku":"867531","manufacturer_id":"GM0178MD02","brand_name":"Gt","product_name":" GT Transeo 3.0 Bike - 2014","long_description":"From city streets to scenic bike paths, the GT Transeo 3.0 bike is always ready for a fun ride thanks to its shock-absorbent fork and comfortable, heads-up geometry. Aluminum frame features hydroformed tubes for increased performance and a geometry that lends itself to a sporty, comfortable ride. Flat handlebar keeps you in an upright riding position, improving visibility and taking pressure off hands for enhanced comfort. SR Suntour suspension fork provides 63mm of travel to take the bumps and jolts out of the road; preload adjustment and easy lockout let you customize the ride. 24 gear combinations ensure easy gearing for spinning up hills and cruising along bike paths; Shimano trigger shifters and derailleurs offer quick gear changes. ProMax mechanical disc brakes provide sure stopping power in all kinds of weather. Tough rims are outfitted with Schwalbe Landcruiser tires, which resist punctures and feature reflective sidewalls. Frame includes mounts for rack and fenders (not included) for all-season versatility. Specs on the GT Transeo 3.0 bike are subject to change.","short_description":"From city streets to scenic bike paths, the GT Transeo 3.0 bike is always ready for a fun ride thanks to its shock-absorbent fork and comfortable, heads-up geometry.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378639.png","image_url":"http://i1.avlws.com/115/l378639.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378639&tt=df","retail_price":"629.00","sale_price":"629.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378639\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378639.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867531&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
