{"sku":"867524","manufacturer_id":"SA122-1106-RF","brand_name":"Surftech","product_name":" Surftech Universal Stand Up Paddleboard - 11' 6\"","long_description":"Ready for fitness, fun and exploration on flatwater and light surf, the Surftech Universal 11 ft. 6 in. stand up paddleboard offers a stable platform for large paddlers of any skill level. Designed by shaping expert Randy French, this board is designed for stability and glide and is a great choice for those looking to get into stand up paddling. Built for paddlers up to 250 lbs., the 11 ft. 6 in. length handles nicely in surf and tracks well in flatwater. Full rails and a wide platform enhance stability so you can focus on the fun of the paddle. High-quality, pressure-molded EPS core is watertight; should you ding your board, water will not enter and weigh the board down as it might with cores of lesser quality. Waterproof EPS core is encased in multiple layers of fiberglass and high-quality epoxy resin to create a lightweight, highly responsive board; EPS core is fully recyclable. In addition to ensuring a comfortable experience underfoot, integrated Softop EVA deck offers reliable wax-free traction when paddling in the standing or kneeling position. 9 in. center fin promotes straight tracking in the water. Center handle makes transporting the Surftech Universal 11 ft. 6 in. paddleboard a breeze.","short_description":"Ready for fitness, fun and exploration on flatwater and light surf, the Surftech Universal 11 ft. 6 in. stand up paddleboard offers a stable platform for large paddlers of any skill level.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430831.png","image_url":"http://i1.avlws.com/115/l430831.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430831&tt=df","retail_price":"1250.00","sale_price":"1250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430831\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430831.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867524&amp;link=&amp;tabs=-Details\"></script>","variants":{"8675240001":{"sku":"8675240001","vendor_sku":"SA122-1106-RF","upc":"849799000699","size":"11 FT 6 IN","color":"BLUE","retail_price":"1250.00","sale_price":"1250.00"}}}
