{"sku":"867507","manufacturer_id":"GM0323MD01","brand_name":"Gt","product_name":" GT Sensor Elite 27.5 Bike - 2014","long_description":"A high-performance full-suspension bike with nimble 27.5 in. wheels, the GT Sensor Elite 27.5 Bike blazes over trails with solid Shimano components, a RockShox fork and Fox Float rear shock. With 27.5 in. wheels, the GT Sensor Elite is quicker and lighter than 29ers but offers the same benefits of large wheels-more speed and better traction. Compared to 26 in. wheels, larger-diameter wheels roll over obstacles more easily so you won't stall going uphill over roots and loose soil. Lightweight 6061 hydroformed aluminum frame uses the GT Independent Drive design, allowing rear suspension to move independently of bottom bracket for a fully active rear end. Independent Drive system also smooths out pedaling on rough trails and minimizes suspension-induced feedback; forged linkage components ensure strength where it's needed. RockShox Sektor Silver TK suspension fork offers up a stiff 15mm thru axle, a tapered steerer and 130mm of travel with rebound adjustment and lockout. Fox Float CTD rear shock provides a plush, responsive and tunable rear end; CTD design optimizes performance with 3 modes of travel adjustment (Climb, Trail, Descend). Shimano Deore shifters, Deore Shadow Plus rear derailler and Deore front derailleur combine to supply snappy and precise shifts throughout the 30 gear combinations. Formula C1 hydraulic disc brakes provide powerful deceleration and easy speed management with 180mm rotors. Continental X-King tires offer excellent traction. Specs on the GT Sensor Elite 27.5 Bike are subject to change.","short_description":"A high-performance full-suspension bike with nimble 27.5 in. wheels, the GT Sensor Elite 27.5 Bike blazes over trails with solid Shimano components, a RockShox fork and Fox Float rear shock.","category":"Cycling","subcategory":"Bikes","product_group":"Mountain Bikes","thumb_url":"http://i1.avlws.com/115/s375055.png","image_url":"http://i1.avlws.com/115/l375055.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=375055&tt=df","retail_price":"2599.00","sale_price":"2599.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=375055\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m375055.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867507&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
