{"sku":"867532","manufacturer_id":"GM0318XL01","brand_name":"Gt","product_name":"GT Corsa Disc Bike - 2014","long_description":"Built with a steel frame, snappy Shimano 105 components and a smooth carbon fork, the GT Corsa Disc Bike is designed to be ridden far and hard. Double-butted chromoly steel frame supplies a buttery-smooth ride quality while remaining stiff and responsive. All-carbon fork with tapered carbon steerer supplies vibration-damping performance to increase ride quality. Lightweight Shimano 105 derailleurs and shifters offer precise, dependable shifts throughout the 20 gear combinations. Compact FSA Gossamer 53/39 crankset is paired with a 12-30 cassette to offer a wide range of gears for any gradient. Frame eyelets make it easy to attach fenders or a rear rack (not included) for enhanced utility. Hayes CX-5 mechanical disc brakes offer powerful braking even in wet weather. Continental Cross Speed tires roll smoothly and grip well in corners for good all-around performance. Specs on the GT Corsa Disc Bike are subject to change; pedals sold separately.","short_description":"Built with a steel frame, snappy Shimano 105 components and a smooth carbon fork, the GT Corsa Disc Bike is designed to be ridden far and hard.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s459471.png","image_url":"http://i1.avlws.com/115/l459471.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=459471&tt=df","retail_price":"1699.00","sale_price":"1699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=459471\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m459471.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867532&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
