{"sku":"867547","manufacturer_id":"9478","brand_name":"Cycleops","product_name":"CycleOps PowerBeam Pro Bluetooth Smart Bike Trainer","long_description":"A smooth magnetic trainer with a realistic road feel for serious cyclists, the PowerBeam Pro Bluetooth Smart Bike Trainer syncs up with your smartphone or tablet to offer speed and cadence values. Speed/cadence sensor uses Bluetooth Smart to sync up with compatible devices, including iPhone 4S or higher, iPad 3 or higher and Android running OS Jelly Bean 4.3 or higher. Tailor training to your specific goals by pre-programming workout parameters with the included software. Included software lets you create and manage custom workouts based on power range, power zone, slope or target power; software is compatible with both Mac and PC. The PowerBeam Pro Bluetooth Smart Bike Trainer targets and locks in exact power output from 30 - 1000+ watts, or slopes up to 10%. After training, you can download your ride and interval data and analyze rides based on critical power, heart rate, cadence, speed and detailed variable correlations. Backlighted color console displays power and speed (current, average, max), heart rate, current/average cadence, energy output (total kilojoules), ride distance and ride time. Optional subscription-based Virtual Training software lets you download or create courses, analyze collected training data and share statistics with similarly wired friends. Flywheel is precision engineered for limited dead weight and optimized for a smooth, real-world feel; large machined alloy roller reduces tire wear and slippage. Quick-lock cam lever allows quick and easy bike installation and can even be used with 29ers; install and remove your bike with a simple 90deg turn of the handle. Convenient skewer clamp centers your bike from just one side and holds it securely with the skewer; wide, stable platform helps ensure worry-free training. Foldable frame makes for compact storage; handy, single-leg leveling adjusts for riding on most surfaces.","short_description":"A smooth magnetic trainer with a realistic road feel for serious cyclists, the PowerBeam Pro Bluetooth Smart Bike Trainer syncs up with your smartphone or tablet to offer speed and cadence values.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trainers","thumb_url":"http://i1.avlws.com/115/s439795.png","image_url":"http://i1.avlws.com/115/l439795.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=439795&tt=df","retail_price":"1000.00","sale_price":"1000.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=439795\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m439795.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867547&amp;link=&amp;tabs=-Details\"></script>","variants":{"8675470001":{"sku":"8675470001","vendor_sku":"9478","upc":"012527011728","color":"BLACK","retail_price":"1000.00","sale_price":"1000.00"}},"categories":["cycling","bike-accessories","bike-trainers"]}
