{"sku":"867515","manufacturer_id":"HDR-AS30V/B","brand_name":"Sony","product_name":"Sony Action Cam Wearable Camcorder + GPS","long_description":"With Wi-Fi connectivity and GPS that tracks your location and speed, the optically-brilliant Sony Action Cam Wearable Camcorder + GPS lets you capture and share all your fast-action experiences. Built-in GPS can be used in conjunction with the free PlayMemories(TM) Home software to track your speed and performance. Location, trail and speed information add more layers to your ability to analyze your performance that can be captured and displayed on your video. Weighs in at just 3.2 oz. with battery so you can capture your adventures on the mountain, in the water and anywhere else you go for your adrenaline fixes. Action Cam includes a rugged, waterproof housing with tripod mount; camera is waterproof down to 60m (197 ft.), and is nearly impervious to mud, snow and grime. Ultra-wide-angle Carl Zeiss(R) Tessar(R) F2.8 lens offers amazing optics; 170deg viewing angle ensures it's not just you in the picture but everything around you. Camera features built-in Wi-Fi, image stabilizer and high-definition recording with 1920 x 1080 at 30 fps and 1280 x 720 at 60 fps. HD Slow 2x and HD Slow 4x let you slow it all down; ideal for studying and refining form and technique. Full high-definition resolution lets you capture every kicked-up rock and every drop of sweat; capable of 30p recording and playback via HDMI(R) and compatible HDTV. Share your footage in a snap via Wi-Fi-enabled mobile phones and tablets running the free PlayMemories Mobile(TM) application. Select the clips and the camera will transfer and compress web-optimized movies and photos without a single cable; then share your cuts on the web and social media apps. Whether you're mountain biking, skiing, skateboarding or surfing, SteadyShot(R) image stabilization and Active Mode deliver stunningly smooth wide-angle to telephoto video. Turn on the shake canceling mode for added electronic stability and even smoother video capture.","short_description":"With Wi-Fi connectivity and GPS that tracks your location and speed, the optically-brilliant Sony Action Cam Wearable Camcorder + GPS lets you capture and share all your fast-action experiences.","category":"Electronics","subcategory":"Helmet Cameras","product_group":"Helmet Cams","thumb_url":"http://i1.avlws.com/115/s426819.png","image_url":"http://i1.avlws.com/115/l426819.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426819&tt=df","keywords":"pov,hd","retail_price":"249.95","sale_price":"199.99","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426819\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426819.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867515&amp;link=&amp;tabs=-Details\"></script>","variants":{"8675150001":{"sku":"8675150001","vendor_sku":"HDR-AS30V/B","upc":"027242870505","color":"BLACK","retail_price":"199.99","sale_price":"199.99"}},"categories":["electronics","helmet-cameras","helmet-cams"]}
