{"sku":"867687","manufacturer_id":"10101320","brand_name":"Thule","product_name":" Thule CX 2 Stroller with Strolling Kit","long_description":"With hand-activated disc brakes, a versatile handlebar and full window venting, the top-flight Thule Chariot CX 2 Stroller comes ready to transport 2 children with the included Stroller Kit. Conversion kits let you conveniently configure the CX 2 to fit your adventurous family activities, whether hiking, cycling or cross-country skiing (kits sold separately). Main compartment features an easy-to-secure, padded 5-point seatbelt system with fleece-covered shoulder straps and hidden buckles. Removable padded seat bottoms are topped with moisture-wicking mesh fabric; can be easily removed and washed by hand. Chassis suspension can be adjusted to supply the smoothest ride and maximize comfort based on passenger weight. Durable 2-in-1 weather cover provides easy and quiet access to the child compartment; also features a wide window with great visibility. Large, tinted windows enhance UV protection while allowing easy viewing; flap-covered side air vents let you adjust air circulation or you can remove side windows altogether. Ergonomically designed handlebar features padding, and lots of hand positioning options ensure your comfort as you push the carrier. Hand-operated disc brakes are controlled via a removable lever on the handlebar. Keep on-the-go necessities easily accessible by storing them in the included rear compartment bag. External frame design maximizes legroom and lowers the step-in height; ezFold(TM) design is simple and fast, and ensures the open carrier is locked into position. Built-in brackets allow you to store Jogging or Bike Trailer Kit (sold separately) on the carrier when not in use for easy on-the-go conversions. Lightweight 20 in. wheels feature tires with reflective sidewalls and are easy to remove with a push of a button; bearings are designed for minimal maintenance. Abundant 3M Scotchlite(TM) reflective material enhances visibility in low light.","short_description":"With hand-activated disc brakes, a versatile handlebar and full window venting, the top-flight Thule Chariot CX 2 Stroller comes ready to transport 2 children with the included Stroller Kit.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s427547.png","image_url":"http://i1.avlws.com/115/l427547.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427547&tt=df","retail_price":"1150.00","sale_price":"1150.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427547\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427547.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867687&amp;link=&amp;tabs=-Details\"></script>","variants":{"8676870001":{"sku":"8676870001","vendor_sku":"10101320","upc":"872299037476","color":"BURGUNDY","retail_price":"1150.00","sale_price":"1150.00"},"8676870002":{"sku":"8676870002","vendor_sku":"10101321","upc":"872299037483","color":"BLUE","retail_price":"1150.00","sale_price":"1150.00"}},"categories":["fitness","running","strollers"]}
