{"sku":"867688","manufacturer_id":"10101221","brand_name":"Thule","product_name":" Thule Chariot CX 1 Stroller with Strolling Kit","long_description":"A smooth ride for 1 child, the Thule Chariot CX 1 Stroller comes ready to go with the included Stroller Kit and offers everything you need to have a great family outing. Conversion kits let you configure the CX 2 to fit your family activities, whether hiking, cycling or cross-country skiing (kits sold separately). Main compartment features an easy-to-secure, padded 5-point seatbelt system with fleece-covered shoulder straps and hidden buckles. Removable padded seat bottoms are topped with moisture-wicking mesh fabric; can be easily removed and washed by hand. Chassis suspension can be adjusted for a smooth ride based on passenger weight. Durable 2-in-1 weather cover provides easy and quiet access to the child compartment; also features a wide window with great visibility. Large, tinted windows enhance UV protection while allowing easy viewing; flap-covered side air vents let you adjust air circulation, or you can remove side windows altogether. Ergonomically designed handlebar features padding and lots of hand positioning options to ensure your comfort as you push the carrier. Hand-operated disc brakes are controlled via a removable lever on the handlebar. Keep on-the-go necessities easily accessible by storing them in the included rear compartment bag. External frame design maximizes leg room and lowers the step-in height; ezFold(TM) design is simple and fast, and ensures the open carrier is locked into position. Built-in brackets allow you to store the Jogging or Cycling Kit (sold separately) on the carrier when not in use for easy on-the-go conversions. Lightweight 20 in. wheels feature tires with reflective sidewalls and are easy to remove with a push of a button; bearings are designed for minimal maintenance. Abundant 3M Scotchlite(TM) reflective material enhances visibility in low light.","short_description":"A smooth ride for 1 child, the Thule Chariot CX 1 Stroller comes ready to go with the included Stroller Kit and offers everything you need to have a great family outing.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s427551.png","image_url":"http://i1.avlws.com/115/l427551.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427551&tt=df","retail_price":"1050.00","sale_price":"1050.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427551\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427551.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867688&amp;link=&amp;tabs=-Details\"></script>","variants":{"8676880001":{"sku":"8676880001","vendor_sku":"10101220","upc":"872299037452","color":"BURGUNDY","retail_price":"1050.00","sale_price":"1050.00"},"8676880002":{"sku":"8676880002","vendor_sku":"10101221","upc":"872299037469","color":"BLUE","retail_price":"1050.00","sale_price":"1050.00"}},"categories":["fitness","running","strollers"]}
