{"sku":"867692","manufacturer_id":"10100422","brand_name":"Thule","product_name":"Thule Cheetah 1 Stroller with Strolling Kit","long_description":"A lightweight, single-child stroller for active families, the Thule Chariot Cheetah 1 with Strolling Kit comes with everything you need to go for a stroll in comfort. Conversion kits let you conveniently configure the Thule Chariot Cheetah 1 to fit any family activity, whether hiking, cycling or cross-country skiing (kits sold separately). Main compartment features an easy-to-secure, padded 5-point seatbelt system with fleece-covered shoulder straps, hidden buckles and a padded seat bottom. Durable 2-in-1 weather cover offers protection from changing weather; rear flap doubles as a sunscreen with visor. Large, tinted windows enhance UV protection while allowing easy viewing. Ergonomically designed handlebar features padding and lots of hand positioning options to ensure your comfort as you push the carrier. Keep on-the-go necessities easily accessible in the mesh pocket under the handlebar. ezFold(R) design is simple and fast, and ensures the open carrier is locked into position. Lightweight 20 in. wheels are easy to remove with a push of a button. Abundant 3M Scotchlite(TM) reflective material enhances visibility in low light. Cheetah 1 Chassis includes strolling kit, rear wheels, 2-in-1 weather cover, padded height-adjustable handlebar, rear storage compartment and foot-operated parking brake.","short_description":"A lightweight, single-child stroller for active families, the Thule Chariot Cheetah 1 with Strolling Kit comes with everything you need to go for a stroll in comfort.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s427567.png","image_url":"http://i1.avlws.com/115/l427567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427567&tt=df","retail_price":"450.00","sale_price":"450.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867692&amp;link=&amp;tabs=-Details\"></script>","variants":{"8676920001":{"sku":"8676920001","vendor_sku":"10100422","upc":"872299037537","color":"GREEN","retail_price":"450.00","sale_price":"450.00"}},"categories":["fitness","running","strollers"]}
