{"sku":"867689","manufacturer_id":"10100932","brand_name":"Thule","product_name":" Thule Chariot Cougar 2 Stroller with Strolling Kit","long_description":"A 2-child stroller with suspension, rear cargo space and a place to mount extra conversion kits, the Thule Chariot Cougar 2 Stroller is ready to roll with the included Stroller kit. Suspension can be adjusted for passenger weight to maximize comfort and give the smoothest ride possible. Sizeable rear storage compartment lets you carry more stuff for longer trips; compartment folds up and out of the way when not needed. Conversion kits let you conveniently configure the Cougar 2 to fit your adventurous family activities, whether hiking, cycling or cross-country skiing (kits sold separately). Convenient kit mounting system lets you attach and remove the extra kits (jogging or cycling) with a simple push of a button. Main compartment features easy-to-secure, padded 5-point seatbelt system with fleece-covered shoulder straps and hidden buckles. Removable padded seat bottom is topped with moisture-wicking mesh fabric; can be easily removed and washed by hand. Durable 2-in-1 weather cover with Quickclips(TM) provides easy and quiet access to the child compartment; also features a wide window with great visibility. Large, tinted windows enhance UV protection while allowing easy viewing; flap-covered side air vents let you adjust air circulation to provide partial venting. Mesh rear pocket sits just under the handlebar and provides additional storage for your wallet, keys and cell phone. Foot-activated, rear wheel parking brake secures the Cougar 2 when you're not moving. External frame design maximizes leg room and lowers the step-in height; ezFold(TM) design is simple and fast and also ensures the open carrier is locked into position. Lightweight 20 in. wheels are easy to remove with a push of a button; bearings are designed for lasting use with minimal need for maintenance. Abundant 3M Scotchlite(TM) reflective material enhances visibility in low light.","short_description":"A 2-child stroller with suspension, rear cargo space and a place to mount extra conversion kits, the Thule Chariot Cougar 2 Stroller is ready to roll with the included Stroller kit.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s427555.png","image_url":"http://i1.avlws.com/115/l427555.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427555&tt=df","retail_price":"750.00","sale_price":"750.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427555\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427555.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867689&amp;link=&amp;tabs=-Details\"></script>","variants":{"8676890001":{"sku":"8676890001","vendor_sku":"10100931","upc":"872299037513","color":"RED","retail_price":"750.00","sale_price":"750.00"}},"categories":["fitness","running","strollers"]}
