{"sku":"867685","manufacturer_id":"10101609","brand_name":"Thule","product_name":"Thule Chariot Chinook 2 Stroller","long_description":"Bring along 2 kids in the spacious Thule Chariot Chinook 2 stroller. Its versatile design rolls from city parks to National parks and beyond with a smooth-rolling front wheel and adjustable seating. Conversion kits let you conveniently configure the Chinook 2 to fit your adventurous family activities, whether hiking, cycling or cross-country skiing (kits not included). Front wheel can pivot freely for greater mobility or be locked for predictable tracking; front wheel can also be easily folded away when it's not needed. Main compartment for 2 kids features easy-to-secure, padded 5-point seatbelt systems with fleece-covered shoulder straps and hidden buckles. The padded and adjustable reclining seat offers premium comfort for children. Chassis suspension can be adjusted without tools to supply the smoothest ride and maximize comfort based on passenger weight. Sturdy aluminum frame balances safety and interior space to offer plenty of security and comfort; integrated helmet space ensures passenger comfort, even with a helmet on. One-handed folding design makes it simple and fast to fold up and unfold the Chinook 2, plus the system ensures the open carrier is locked into position. Lightweight 20 in. wheels are easy to remove with a push of a button, making it easier to transport and store the Chinook 2. Sizeable rear storage compartment lets you carry more stuff for long trips. Large, tinted windows enhance UV protection while allowing easy viewing; venting options make it easy to adjust airflow for passenger comfort. Abundant 3M Scotchlite(TM) reflective material enhances visibility in low light. Convenient weather cover and sun shade offer adaptable protection. Total weight capacity including passengers and gear is 100 lbs. Chinook 2 comes with a front wheel, rear wheels, 2-in-1 weather cover, padded adjustable handlebar, rear storage compartment and parking brake.","short_description":"Bring along 2 kids in the spacious Thule Chariot Chinook 2 stroller. Its versatile design rolls from city parks to National parks and beyond with a smooth-rolling front wheel and adjustable seating.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s427539.png","image_url":"http://i1.avlws.com/115/l427539.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=427539&tt=df","retail_price":"1250.00","sale_price":"1250.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=427539\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m427539.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867685&amp;link=&amp;tabs=-Details\"></script>","variants":{"8676850001":{"sku":"8676850001","vendor_sku":"10101609","upc":"872299037575","color":"AQUA","retail_price":"1250.00","sale_price":"1250.00"},"8676850002":{"sku":"8676850002","vendor_sku":"10101610","upc":"872299037582","color":"BLACK","retail_price":"1250.00","sale_price":"1250.00"}},"categories":["fitness","running","strollers"]}
