{"sku":"867636","manufacturer_id":"9781594858239","brand_name":"Mountaineers Books","product_name":" Mountaineers Books Don't Freeze Out There! - Deck of Cards","long_description":"Ante up while you brush up on your cold-weather survival skills. The. Deck of 52 standard playing cards; black-and-white illustrations. The Mountaineers Books; copyright 2013. Each card features a topic followed by a short explanation or illustration. Topics are organized by suit. Diamonds includes snow travel and related hazards, including routefinding, tree wells, whiteouts, crevasses, snowshoes, crampons, glissading and self-arrests. Clubs includes avalanche safety and survival, including gear, probes, tranceivers, rescue techniques and fun facts about avalanche dogs. Hearts includes cold-related illness and injury, including cold-water immersion, shivering, frostbite, hypothermia, chilblains, trench foot and snow blindness. Spades includes subjects that have to do with staying warm and dry, including windchill factor, regulating core temperature, layering and shelters.","short_description":"Ante up while you brush up on your cold-weather survival skills. The Don't Freeze Out There! Deck of Cards offers tips on cold-weather survival on each card.","category":"Lifestyle And Gifts","subcategory":"Games And Toys","product_group":"Games","thumb_url":"http://i1.avlws.com/115/s429799.png","image_url":"http://i1.avlws.com/115/l429799.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=429799&tt=df","retail_price":"7.95","sale_price":"7.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=429799\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m429799.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867636&amp;link=&amp;tabs=-Details\"></script>","variants":{"8676360001":{"sku":"8676360001","vendor_sku":"9781594858239","retail_price":"7.95","sale_price":"7.95"}}}
