{"sku":"867765","manufacturer_id":"90351442","brand_name":"Dagger","product_name":" Dagger Axis10.5 Kayak with Skeg","long_description":"The Dagger Axis 10.5 Kayak with Skeg takes on all types of water with the adventurous beginner in mind; it's maneuverable, stable and ready for lakes or rivers thanks to a whitewater-inspired design. Stable hull inspires confidence for beginners, and defined chines enhance maneuverability. 10.5 ft. length offers high maneuverability and a manageable weight, and an integrated beam stiffens the hull to keep you in control when turning. Polyethylene construction offers performance, responsiveness and rugged durability. Height-adjustable, drop-down skeg enhances tracking in strong winds and currents. Seat and back pads use soft, contoured foam covered in a textured stretch material for plush comfort and protection from the cold; oversized cockpit increases comfort. Backrest with side-mounted cam buckle and durable webbing allows simple adjustments while seated in kayak. Soft knee pads attach either inside the cockpit or on the exterior, offering customizable comfort. Slidelock footbraces are easy to adjust from inside the boat; simply raise the black plastic rod to unlock and slide foot peg into desired position. Mesh pocket attached to the bow deck offers secure storage for small accessories, and it's within easy reach. Rear hatch provides enough storage for a day trip. unlike hard, plastic handles, the soft-touch handles are easy on cold, paddle-weary hands. The Dagger Axis 10.5 Kayak weighs 50 lb.","short_description":"The Dagger Axis 10.5 Kayak with Skeg takes on all types of water with the adventurous beginner in mind; it's maneuverable, stable and ready for lakes or rivers thanks to a whitewater-inspired design.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s430599.png","image_url":"http://i1.avlws.com/115/l430599.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430599&tt=df","retail_price":"769.00","sale_price":"769.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430599\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430599.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867765&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677650002":{"sku":"8677650002","vendor_sku":"90351442","upc":"729282317131","size":"10 FT 5 IN","color":"LAVA","retail_price":"769.00","sale_price":"769.00"}},"categories":["paddling","kayaks","recreational-kayaks"]}
