{"sku":"867761","brand_name":"Delta Kayaks","product_name":" Delta Kayaks Delta 12.10 Kayak","long_description":"A light touring kayak with enough leg room for any size paddler, the Delta 12.10 from Delta Kayaks offers ample storage for day trips or short overnights. Thermoformed ABS plastic hull material is stiff and light like traditional composite kayaks and offers similar looks, but costs considerably less; kayak weighs 43 lbs. Updated for 2014, the adjustable, multi-position seat offers excellent back support, quick adjustment and cushy comfort. Neoprene padding on leg bracing in the cockpit improves comfort and control. Cockpit-adjustable footbraces fit most paddlers and integrated thigh braces increase overall comfort. A low-profile front day pod and 2 main dry storage areas provide space for your gear. Press-Lock hatch covers create a watertight seal with a specially designed gasket that envelops the rim of the hatch with an easy push. Bungee deck rigging at bow and stern retains extra gear; safety straps aft of cockpit and nylon perimeter lines aid in paddle float self-rescue. The Delta 12.10 Kayak features ergonomic, rubber grab handles that are easy on the hands.","short_description":"A light touring kayak with enough leg room for any size paddler, the Delta 12.10 from Delta Kayaks offers ample storage for day trips or short overnights.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s454207.png","image_url":"http://i1.avlws.com/115/l454207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454207&tt=df","retail_price":"1450.00","sale_price":"1450.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867761&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677610002":{"sku":"8677610002","upc":"486776100029","size":"12 FT 10 IN","color":"LIME","retail_price":"1450.00","sale_price":"1450.00"}}}
