{"sku":"867754","manufacturer_id":"03-011A-ECL5M","brand_name":"Boreas","product_name":"Boreas Bootlegger Modular Pack System","long_description":"The innovative Boreas Bootlegger Modular Pack System features 1 Super-Tramp suspension and 3 packs, so you can customize your pack choice for every adventure, wet or dry. Need a dry bag for water or snow outings? Click the Super-Tramp suspension into the waterproof, fully submersible Scrimshaw so you can wear it; or simply use it as a bag. The Scrimshaw roll-top \"do anything\" dry bag/pack has a 30-liter capacity and is designed to fully contain the Hopper pack to keep it dry in bad weather. The Hopper 28-liter daypack is ideal for daily commutes, day hikes or travel; it has hydration sleeve and dual ports, and 2 front stretch pockets. Hopper also has a waterproof top pocket for your cellphone and wallet; 4 compression straps and a hidden daisy-chain for attaching gear; and a reflective screen print. The Torpedo is an ultralight, stripped-down 9-oz. hydration sleeve that holds a 100-oz.(3L) bladder (not included) and has dual hose ports and zippered top pocket. Torpedo offers a 13-liter capacity, just big enough for hydration and a few small essentials for summit hikes, trail runs or cycling. Super-Tramp suspension includes aluminum frame with stainless steel stays, mesh back panel, perforated EVA foam shoulder straps with air mesh backing; adjustable hipbelt. Trampoline-style suspension has straps to adjust the tension, giving you either more air space between the pack and your back, or less to keep it close when off-trail. Easily attach the suspension to any of the 3 packs in the Boreas Bootlegger Modular Pack System and you're good to go.","short_description":"The innovative Boreas Bootlegger Modular Pack System features 1 Super-Tramp suspension and 3 packs, so you can customize your pack choice for every adventure, wet or dry.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s444479.png","image_url":"http://i1.avlws.com/115/l444479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=444479&tt=df","retail_price":"200.00","sale_price":"200.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=444479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m444479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867754&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677540002":{"sku":"8677540002","vendor_sku":"03-0111A-ORB5M","upc":"852326004152","size":"One Size","color":"ORBIT","retail_price":"200.00","sale_price":"200.00"}},"categories":["camping-hiking","backpacks","day-packs"]}
