{"sku":"867778","manufacturer_id":"35608914","brand_name":"Mavic","product_name":"Mavic Crossmax Enduro Disc Wheelset with Tires - 27.5\" Wheels","long_description":"Lithe and lightning fast, the Mavic Crossmax Enduro Disc Wheelset with Tires is built to meet the demands of cross-country racing with a nimble 27.5 in. wheel size. Proprietary lightweight aluminum rims use a drilling method that doesn't penetrate the tube-facing wall, enhancing wheel strength and rigidity. This drilling method also allows UST tubeless compatibility, offering all the benefits of tubeless with the option of using a traditional tube/tire setup. Inter Spoke Milling 3D dramatically reduces material between spokes and along sides of rims, reducing weight and making them well suited to climbing and fast acceleration. Rim joints are welded and milled to maximize strength, rigidity and wheel balance while also offering a smooth finish. Rear hub uses Instant Transfer System 4 freewheel design to supply fast engagement via 4 pawls, ensuring your energy is transferred to the wheel quickly and efficiently. Double-sealed cartridge bearings deliver excellent longevity and smooth spinning; microadjustability lets you fine-tune bearing loads to optimize your ride. Both wheels use 20 lightweight, straight-pull and bladed Zicral alloy spokes; front is laced 2-cross while rear uses radial lacing on drive-side and 2-cross on non-drive-side. Front hub is compatible with either 15mm thru-axle or traditional 9mm quick-release; rear hub is compatible with 9mm or 12mm axles, 135mm or 142mm axle widths. Mavic Crossmax Enduro Disc Wheelset with Tires is compatible with standard 6-bolt disc brake rotors. Comes with wheel bags, quick-release (QR) skewers, front and rear QR adapters, rear 12x142mm adapters, removable UST valves/accessories, magnet, adjustment tool and disc bolts. Mavic recommended maximum combined weight of the cyclist, bike and equipment is 220 lbs. (100kg); recommended tire width is 2.0 - 2.5 in.","short_description":"Lithe and lightning fast, the Mavic Crossmax Enduro Disc Wheelset with Tires is built to meet the demands of cross-country racing with a nimble 27.5 in. wheel size.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Tires, Tubes And Wheels","thumb_url":"http://i1.avlws.com/115/s389703.png","image_url":"http://i1.avlws.com/115/l389703.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=389703&tt=df","retail_price":"999.95","sale_price":"999.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=389703\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m389703.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867778&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677780001":{"sku":"8677780001","vendor_sku":"35608914","upc":"887850024284","size":"27.5 IN","color":"YELLOW","retail_price":"999.95","sale_price":"999.95"}},"categories":["cycling","bike-components","bike-tires-tubes-and-wheels"]}
