{"sku":"867764","manufacturer_id":"90350442","brand_name":"Dagger","product_name":"Dagger Zydeco 9.0 Kayak","long_description":"A great kayak for ponds, lakes and mellow rivers, the Dagger Zydeco 9.0 Kayak offers a fun time for any paddler thanks to its roomy cockpit, smooth hull design and comfortable seating. 9 ft. 1 in. hull turns easily yet tracks well, accelerates quickly and cruises efficiently. Seat and back pads use soft, contoured foam covered in a textured stretch material for plush comfort and protection from the cold; oversized cockpit increases comfort. Backrest with side-mounted cam buckle and durable webbing allows simple adjustments while seated in kayak. Soft knee pads attach either inside the cockpit or on the exterior, offering customizable comfort. Slidelock footbraces are easy to adjust from inside the boat; simply raise the black plastic rod to unlock and slide foot peg into desired position. Touring-style deck rigging offers quick access to necessities; small bungee on left side of cockpit stores paddle to free up hands. Soft-to-the-touch carry handles at bow and stern make trips from the water easy; unlike hard, plastic handles, the soft-touch handles are easy on cold hands. Light enough to transport and launch by yourself, the Dagger Zydeco weighs in at a very manageable 36 lbs.","short_description":"A great kayak for ponds, lakes and mellow rivers, the Dagger Zydeco 9.0 Kayak offers a fun time for any paddler thanks to its roomy cockpit, smooth hull design and comfortable seating.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s430595.png","image_url":"http://i1.avlws.com/115/l430595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430595&tt=df","retail_price":"499.00","sale_price":"499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867764&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677640001":{"sku":"8677640001","vendor_sku":"90350484","upc":"729282317162","size":"9 FT","color":"BLUE","retail_price":"499.00","sale_price":"499.00"},"8677640002":{"sku":"8677640002","vendor_sku":"90350461","upc":"729282317179","size":"9 FT","color":"LIME","retail_price":"499.00","sale_price":"499.00"}},"categories":["paddling","kayaks","recreational-kayaks"]}
