{"sku":"867788","manufacturer_id":"36237714","brand_name":"Mavic","product_name":"Mavic Ksyrium Elite Wheelset","long_description":"A speedy blend of light weight and high performance, the Mavic Ksyrium Elite wheelset comes equipped with tires for a complete, convenient wheel system that's ready to roll right out of the box. 22mm deep front and 25mm deep rear rims are strengthened where the spokes exert the greatest stress; rear rim has an asymmetric shape to enhance stiffness and durability. Lightweight yet strong, proprietary aluminum rims use a drilling method that doesn't penetrate the tube-facing wall, strengthening the rim and eliminating need for rim strips. Both rims feature a milled braking surface to improve friction; rim joints are welded and milled to eliminate shuddering during braking and provide superior wheel balance. Inter Spoke Milling reduces material between spokes, lowering weight and the amount of effort needed to spin the wheels up for superb climbing and acceleration. Rear hub features a lightweight and stiff aluminum hub body with pawls that are backed by stainless-steel inserts for reliable, strong engagement and power transfer. Hubs boast a microadjustable system that lets you dial in bearing performance; double-sealed cartridge bearings deliver excellent longevity and smooth spinning. 18/20 double-butted straight-pull, bladed steel spokes are laced radially on the front wheel; rear has radial lacing on the drive-side, 2-cross on the non-drive-side. Yksion Pro 700x23c clincher tires are included, offering front- and rear-specific performance for maximizing grip up front and minimizing rolling resistance in the back. Tires have supple 127 tpi casings and are backed with a strong, puncture-resistant nylon breaker; maximum recommended pressure of 130 psi (9 bars). Please note: tubes use Presta valves. Mavic Kysrium Elite wheelset with tires comes with quick-release skewers and a multifunction adjustment wrench; 100mm front and 130mm rear axle spacing.","short_description":"A speedy blend of light weight and high performance, the Mavic Ksyrium Elite wheelset comes equipped with tires for a complete, convenient wheel system that's ready to roll right out of the box.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Tires, Tubes And Wheels","thumb_url":"http://i1.avlws.com/115/s389727.png","image_url":"http://i1.avlws.com/115/l389727.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=389727&tt=df","retail_price":"799.95","sale_price":"799.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=389727\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m389727.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867788&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677880001":{"sku":"8677880001","vendor_sku":"36237714","upc":"887850023409","size":"700C","color":"BLACK","retail_price":"799.95","sale_price":"799.95"}},"categories":["cycling","bike-components","bike-tires-tubes-and-wheels"]}
