{"sku":"867767","manufacturer_id":"90214440","brand_name":"Dagger","product_name":"Dagger Alchemy 14.0L Kayak with Skeg","long_description":"Designed with a high volume for large kayakers and lots of touring gear, the Dagger Alchemy 14.0L Kayak straddles the line between performance touring watercraft and easy-to-paddle recreational boats. Pronounced chine enhances maneuverability, and high secondary stability makes it easy to dig in and put the Alchemy on edge. Pour on the speed thanks to a shallow-V and swede-form hull with low rocker. Tough polyethylene construction offers high performance and rugged durability. Comfort Fit Seating System seat and back pad uses soft, contoured foam for plush comfort and protection from the cold. Fabric-covered thighbraces and sliding footbraces easily adjust to personalize fit. Height-adjustable drop-down skeg improves tracking when the winds pick up; skeg deploys easily from the cockpit. 10 in. bow hatch, 8 in. day hatch and full-size stern hatch provide plenty of storage space for overnight adventures. Bulkheads help keep contents of hatches dry, and dual-density hatch covers offer watertight protection. The Dagger Alchemy 14.0L Kayak's bow and stern deck rigging offer additional locations to stash gear, dry bags and an extra paddle. 54 lb. weight and soft, contoured handles make transport from the water easy for tired hands.","short_description":"Designed with a high volume for large kayakers and lots of touring gear, the Dagger Alchemy 14.0L Kayak straddles the line between performance touring watercraft and easy-to-paddle recreational boats.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s456787.png","image_url":"http://i1.avlws.com/115/l456787.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456787&tt=df","retail_price":"1229.00","sale_price":"1229.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456787\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456787.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867767&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677670001":{"sku":"8677670001","vendor_sku":"90214440","upc":"729282317247","size":"14 FT","color":"RED","retail_price":"1229.00","sale_price":"1229.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
