{"sku":"867787","manufacturer_id":"32819214","brand_name":"Mavic","product_name":" Mavic Cosmic Carbone SLS Wheelset with Tires","long_description":"A mix of carbon fiber and aluminum with fast Yksion Pro tires, the Mavic Cosmic Carbone SLS Wheelset delivers a featherweight, aerodynamic advantage for serious riders, racers and triathletes. 52mm-deep rims are made of a proprietary strong and lightweight alloy; elliptically shaped carbon fiber shells are bonded to them for excellent aerodynamic performance. Beneath the carbon fiber, Inter Spoke Milling is used to reduce the amount of alloy material, lowering weight without compromising performance. Rims feature a milled braking surface to improve friction; rim joints are welded and milled to eliminate shuddering during braking and provide superior wheel balance. Rear hub features a lightweight and stiff aluminum hub body with pawls that are backed by stainless-steel inserts for reliable, strong engagement and power transfer. Both hubs boast a microadjustable system that lets you dial in bearing performance; double-sealed cartridge bearings deliver excellent longevity and smooth spinning. 16/20 straight-pull, bladed steel spokes are laced radially on the front wheel; rear has radial lacing on the drive side, 2-cross on the non-drive side. 100mm front and 130mm rear axle spacing; freehub body is compatible with Shimano/SRAM cassettes. Mavic recommended maximum combined weight of the cyclist, bike and equipment is 220 lbs. (100kg). Please note: these wheels are clincher-compatible only, with a recommended tire width of 19 - 28mm. Mavic Cosmic Carbone SLS wheelset comes with one valve extender, quick-release skewers, rim tape and a multifunction adjustment wrench.","short_description":"A mix of carbon fiber and aluminum with fast Yksion Pro tires, the Mavic Cosmic Carbone SLS Wheelset delivers a featherweight, aerodynamic advantage for serious riders, racers and triathletes.","category":"Cycling","subcategory":"Bike Components","product_group":"Bike Tires, Tubes And Wheels","thumb_url":"http://i1.avlws.com/115/s389723.png","image_url":"http://i1.avlws.com/115/l389723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=389723&tt=df","retail_price":"1299.95","sale_price":"1299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=389723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m389723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867787&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677870001":{"sku":"8677870001","vendor_sku":"32819214","upc":"887850022983","size":"700C","color":"BLACK","retail_price":"1299.95","sale_price":"1299.95"}}}
