{"sku":"867762","brand_name":"Delta Kayaks","product_name":"Delta Kayaks Delta 16 Kayak with Rudder","long_description":"The Delta 16 Kayak with Rudder from Delta Kayaks is designed to excel in rough conditions. It balances maneuverability with excellent tracking and has enough storage for long-distance tours. Thermoformed ABS plastic hull provides high abrasion- and impact-resistance coupled with superior UV protection so your kayak looks like new for years to come. Shallow V hull with pronounced chine provides an optimal blend of speed and stability while also allowing for advanced edging and unparalleled tracking. Cockpit offers a close-fitting, performance fit and feel. Updated for 2014, the adjustable, multi-position seat offers excellent back support, quick adjustment and cushy comfort. Neoprene padding on leg bracing in the cockpit improves comfort and control. Cockpit-adjustable footbraces fit most paddlers and integrated thighbraces increase overall comfort. Channel-mounted and individually tubed rudder lines ensure a smooth and kink-free operation of the rudder and spring-loaded skeg system. A low-profile front day pod and day hatch are within easy reach, and 2 main dry storage areas provide ample space for your gear. Press-Lock hatch covers create a watertight seal with a specially designed gasket that envelops the rim of the hatch with an easy push. Bungee deck rigging at bow and stern retains extra gear; safety straps aft of cockpit and nylon perimeter lines aid in paddle float self-rescue. The Delta 16 kayak with Rudder features ergonomic, retractable rubber grab handles that are easy on the hands.","short_description":"The Delta 16 Kayak with Rudder from Delta Kayaks is designed to excel in rough conditions. It balances maneuverability with excellent tracking and has enough storage for long-distance tours.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s454211.png","image_url":"http://i1.avlws.com/115/l454211.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454211&tt=df","retail_price":"2375.00","sale_price":"2375.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454211\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454211.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867762&amp;link=&amp;tabs=-Details\"></script>","variants":{"8677620002":{"sku":"8677620002","upc":"486776200026","size":"16 FT","color":"LIME","retail_price":"2375.00","sale_price":"2375.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
