{"sku":"867873","manufacturer_id":"K-SKY RED P","brand_name":"Eddyline","product_name":" Eddyline Skylark Kayak","long_description":"Sized for fun but built with the features of high-performance sea kayaks, the12 ft. Eddyline Skylark Kayak brings stability and speed to mellow waters with its high-quality ABS construction. Co-extruded ABS laminate creates a hull that offers the looks and performance of a composite kayak with the durability of plastic. Plastic is shaped into a 2-layer sheet with durable interior and a an abrasion- and UV-resistant exterior, and then it's thermoformed using very high temperatures and a vacuum. 2-layer plastic laminate offers incredible stiffness and a hard, glossy appearance that resists abrasion and impact; plus, because it's plastic, it can also be easily repaired. Abundant stability and a roomy fit offer comfort to the novice, and hard chines create responsive turns and enhance tracking for the more experienced paddler. Large cockpit makes it easy to get into kayak and enhances comfort during long paddles; thighbraces increase maneuverability when putting the kayak on edge. The 41 lb. Eddyline Skylark Kayak also features 2 hatches to store day-tripping gear, bow and stern bulkheads, bungee deck rigging and carry handles.","short_description":"Sized for fun but built with the features of high-performance sea kayaks, the12 ft. Eddyline Skylark Kayak brings stability and speed to mellow waters with its high-quality ABS construction.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s430715.png","image_url":"http://i1.avlws.com/115/l430715.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430715&tt=df","retail_price":"1349.00","sale_price":"1349.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430715\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430715.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867873&amp;link=&amp;tabs=-Details\"></script>","variants":{"8678730001":{"sku":"8678730001","vendor_sku":"K-SKY RED P","upc":"700736516454","size":"12 FT","color":"RED PEARL","retail_price":"1349.00","sale_price":"1349.00"},"8678730002":{"sku":"8678730002","vendor_sku":"K-SKY YP","upc":"700736516478","size":"12 FT","color":"YELLOW PEARL","retail_price":"1349.00","sale_price":"1349.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
