{"sku":"867839","manufacturer_id":"97522409","brand_name":"Wilderness Systems","product_name":"Wilderness Systems Tarpon 120 Angler Sit-On-Top Kayak","long_description":"Decked out with a rod holder and lots of room for your fishing gear, the Wilderness Systems Tarpon 120 Angler Sit-On-Top Kayak offers easy-to-paddle stability to chase the big one. Smooth-paddling design lends itself to serious paddling fun; kayak tracks very well, offers surprising speed and turns easily. 12 ft. 3 in. length and moderate weight allow kayak to be transported by the solo paddler while still providing great stability. Hull is crafted in high-density polyethylene to provide rugged durability and easy care. Seat and back pads use soft, contoured foam covered in a textured stretch material for plush comfort and protection from the cold. Scalloped, contoured seat pan cradles and cushions legs, and backrest conforms to size of paddler and flexes a bit with every paddle stroke. Leg lifter uses handle to shore up space below your legs; back strap lowers seat back, and the angle of back rest is adjustable as well. Small gear bag under seat features a gear clip and enough capacity for a water bottle or extra food. Dual Slide-Trax rail system at front of seating area and tank well can attach compatible accessories (not included) without tools or complicated adjustments. Adjustable Keepers footbraces; center and bow hatch with locking levers; 64 lb. weight.","short_description":"Decked out with a rod holder and lots of room for your fishing gear, the Wilderness Systems Tarpon 120 Angler Sit-On-Top Kayak offers easy-to-paddle stability to chase the big one.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s454191.png","image_url":"http://i1.avlws.com/115/l454191.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454191&tt=df","retail_price":"1089.00","sale_price":"1089.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454191\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454191.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867839&amp;link=&amp;tabs=-Details\"></script>","variants":{"8678390001":{"sku":"8678390001","vendor_sku":"97522409","upc":"729282751140","size":"12 FT","color":"SAND","retail_price":"1089.00","sale_price":"1089.00"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
