{"sku":"867875","manufacturer_id":"K-FATHOM GB","brand_name":"Eddyline","product_name":"Eddyline Fathom Kayak with Skeg","long_description":"An elegant kayak for both aspiring novices or experience paddlers on extended tours, the Eddyline Fathom Kayak with Skeg moves through ocean waters like it's a part of the natural environment. The Eddyline Fathom features a good amount of initial stability to build confidence for new paddlers on multiday excursions. Combination of hard chines mid-ship and a healthy amount of rocker provide high secondary stability, making leaned, carved turns and more advanced techniques easy. Co-extruded ABS laminate creates a hull that offers the looks and performance of a composite kayak with the durability of plastic. Plastic is shaped into a 2-layer sheet with durable interior and an abrasion- and UV-resistant exterior, and then it's thermoformed using very high temperatures and a vacuum. 2-layer plastic laminate offers incredible stiffness and a hard, glossy appearance that resists abrasion and impact; plus, because it's plastic, it can also be easily repaired. Full-volume front deck offers enough room for large paddlers, and the countoured thigh braces offer a secure fit for any size paddler. Sliding seat adjusts in relation to the thighbraces to enhance comfort. Low back deck makes it easy to execute a roll. Skeg is deployable in small increments to allow for fine-tuning in any condition in order to reduce weathercocking in crosswinds and increase tracking. The Eddyline Fathom features bulkheads, a recessed compass holder, and 3 day hatches with enough space to easily pack in overnight gear and then some.","short_description":"An elegant kayak for both aspiring novices or experience paddlers on extended tours, the Eddyline Fathom Kayak with Skeg moves through ocean waters like it's a part of the natural environment.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s430723.png","image_url":"http://i1.avlws.com/115/l430723.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430723&tt=df","retail_price":"2699.00","sale_price":"2699.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430723\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430723.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867875&amp;link=&amp;tabs=-Details\"></script>","variants":{"8678750001":{"sku":"8678750001","vendor_sku":"K-FATHOM GB","upc":"700736516744","size":"16 FT 6 IN","color":"GALAXY BLUE","retail_price":"2699.00","sale_price":"2699.00"},"8678750002":{"sku":"8678750002","vendor_sku":"K-FATHOM OR","upc":"700736516775","size":"16 FT 6 IN","color":"ORANGE","retail_price":"2699.00","sale_price":"2699.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
