{"sku":"867859","manufacturer_id":"SS020339000","brand_name":"Suunto","product_name":" Suunto Core Multifunction Watch - Brushed Steel","long_description":"With a sleek and rugged design, the brushed steel Suunto Core multifunction watch gives you a wealth of data to inform your backcountry or aquatic adventures. Altimeter, Barometer, Compass (ABC) wrist-top design delivers crucial data for gauging performance, direction and weather. Barometric altimeter is accurate to 29,500 ft. and displays current elevation and elevation gain/loss; records entire session for later analysis. Unique start-from-zero function simplifies altimeter usage by eliminating need to enter a reference altitude. Barometer function measures and records air pressure to help predict changing conditions; weather trend indicator shows history over last 3 to 6 hrs. Automatic Alti/Baro mode senses movement, or lack thereof, and seamlessly switches between altimeter and barometer functions. Storm alarm feature activates when a rapid drop in air pressure is detected over a 3 hr. period; alarm sounds and flashes to indicate bad weather. Digital compass monitors direction; set and follow a bearing using rotating bezel ring, or point top of watch in direction of travel to lock in bearing. Sunrise/sunset times ensure you never miss another beautiful dusk or dawn; set regional data and watch will inform you how much daylight remains. Snorkelers will appreciate the underwater buttons and accurate depth readings to 10m (30 ft.). The brushed steel Suunto Core multifunction watch features a mineral crystal, aluminum watch body and fixed bezel and a comfortable strap that withstands rugged outdoor use.","short_description":"With a sleek and rugged design, the brushed steel Suunto Core multifunction watch gives you a wealth of data to inform your backcountry or aquatic adventures.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s413599.png","image_url":"http://i1.avlws.com/115/l413599.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413599&tt=df","keywords":"waterproof","retail_price":"500.00","sale_price":"500.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413599\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413599.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867859&amp;link=&amp;tabs=-Details\"></script>","variants":{"8678590001":{"sku":"8678590001","vendor_sku":"SS020339000","upc":"045235909223","color":"STEEL","retail_price":"500.00","sale_price":"500.00"}}}
