{"sku":"867838","manufacturer_id":"97351409","brand_name":"Wilderness Systems","product_name":"Wilderness Systems Pungo 120 Angler Kayak","long_description":"Built for anglers that prefer the feel of a sit-inside kayak, the Wilderness Systems Pungo 120 Angler gets you out on the water and chasing fins with an easy-to-paddle design. Multichine, distinct-keel hull delivers stability and easy handling with tracking unexpected in kayaks of this short length. Roomy cockpit offers comfort and a boat that's easy to get in and out of, even for full-size paddlers. High-density polyethylene hull withstands years of use and offers high durability. Seat and back pads use soft, contoured foam covered in a textured stretch material for plush comfort and protection from the cold; oversize cockpit increases comfort. Backrest with side-mounted cam buckle and durable webbing allows simple adjustments while seated in kayak. Small gear bag under seat features a gear clip and enough capacity for a water bottle or extra food. Slidelock footbraces are easy to adjust from inside the boat; simply raise the black plastic rod to unlock and slide foot peg into desired position. Generous Orbix stern hatch holds your lunch, paddling gear and extra clothes. Orbix hatch cover features a hinged design and locking lever; to open hatch, simply slide lever to unlock cover and flip open to access gear. Comes with rod holder, bulkhead flotation, carry handles and crisscross bungee deck rigging. Comfort carry handles at bow and stern make transporting the 54 lb. Pungo 120 Angler Kayak easy.","short_description":"Built for anglers that prefer the feel of a sit-inside kayak, the Wilderness Systems Pungo 120 Angler gets you out on the water and chasing fins with an easy-to-paddle design.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s454215.png","image_url":"http://i1.avlws.com/115/l454215.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454215&tt=df","retail_price":"1039.00","sale_price":"1039.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454215\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454215.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867838&amp;link=&amp;tabs=-Details\"></script>","variants":{"8678380001":{"sku":"8678380001","vendor_sku":"97351409","upc":"729282752598","size":"12 FT","color":"SAND","retail_price":"1039.00","sale_price":"1039.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
