{"sku":"867924","manufacturer_id":"2629336","brand_name":"Eureka","product_name":"Eureka Sunrise 6 Tent","long_description":"The 3-season, 6-person Eureka Sunrise 6 Tent is perfect for the recreational camping enthusiast who values ease of setup in a durable, feature-rich tent for frequent family campouts. 1 door with mesh half window for views and ventilation; 3 windows with zippered fabric panels for privacy and ventilation control. 2 mesh vents allow cool air to enter the tent; zippered fabric panel controls ventilation. E!luminate system reflects lantern light down towards the floor where it is most needed, increasing floor-level lighting up to 3 times (lantern not included). Touchscreen-friendly E! Media Center features a clear center sleeve, making it easy to watch video on tablets and other small electronics from the comfort of your sleeping bag. E! Power Port brings an electrical power cord inside the tent through its dedicated zippered port (power cord not included). Mesh pockets at front and rear keep lightweight small items at hand; removable 3-pocket gear hammock keeps small items organized and off the floor. The Eureka Sunrise 6 Tent features poles that extend the protective fly over each side to provide shade and shelter the door and windows from rain.","short_description":"The 3-season, 6-person Eureka Sunrise 6 Tent is perfect for the recreational camping enthusiast who values ease of setup in a durable, feature-rich tent for frequent family campouts.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Camping Tents","thumb_url":"http://i1.avlws.com/115/s463519.png","image_url":"http://i1.avlws.com/115/l463519.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463519&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463519\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463519.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867924&amp;link=&amp;tabs=-Details\"></script>","variants":{"8679240001":{"sku":"8679240001","vendor_sku":"2629336","upc":"083826293368","color":"SNORKEL BLUE/BLUE PEARL","retail_price":"299.00","sale_price":"299.00"}},"categories":["camping-hiking","tents","camping-tents"]}
