{"sku":"867968","manufacturer_id":"CF33N3X","brand_name":"The North Face","product_name":"The North Face Overhaul 40 Daypack","long_description":"The North Face Overhaul 40 Daypack makes travel easy, whether you're headed for a weekend getaway or a cross-country flight. Its laptop panel opens flat so you can cruise through airport security. Back panel with sleeves for a tablet and a 15 in. laptop unzips to lie flat for security screening. Back panel also features a convenient pass-through slot for easily sliding the bag onto your luggage handle. Stowable shoulder straps and side handle transform the backpack into a horizontal briefcase-style bag. Bottom zippered pocket is great for isolating dirty shoes or laundry. Expandable zippered gusset lets you adjust the volume to carry more or less. Large front fleece-lined pocket is perfect for your phone, camera or sunglasses. Internal organization panel keeps all other gear safe and organized. Molded, padded shoulder straps and back panel add comfort; winged hipbelt, a sternum strap and load lifters customize the fit. External water-bottle pockets double as quick stash pockets. The North Face Overhaul 40 Daypack features multiple interior pockets and sleeves so you can find what you need quickly.","short_description":"The North Face Overhaul 40 Daypack makes travel easy, whether you're headed for a weekend getaway or a cross-country flight. Its laptop panel opens flat so you can cruise through airport security.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s433287.png","image_url":"http://i1.avlws.com/115/l433287.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433287&tt=df","keywords":"backpack","retail_price":"159.00","sale_price":"159.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433287\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433287.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=867968&amp;link=&amp;tabs=-Details\"></script>","variants":{"8679680001":{"sku":"8679680001","vendor_sku":"CF33N3X","upc":"887867947521","size":"One Size","color":"INK BLUE/TNF BLACK","retail_price":"159.00","sale_price":"159.00"}},"categories":["travel","day-bags-and-packs","travel-daypacks"]}
