{"sku":"868032","manufacturer_id":"EDGE14.5YO","brand_name":"Riot","product_name":" Riot Edge 14.5 Kayak - Special Buy","long_description":"Sleek, fast and equipped with a rudder that makes it easier to paddle in a straight line, the Riot Edge 14.5 Kayak glides through nautical miles on day tours and short overnights. Kayak has just the right amount of chine and keel to make it track well, yet it covers water quickly in smooth or choppy conditions. Low-volume cockpit and a sleek outline aid in learning paddling techniques such as kayak rolls and bracing strokes. Rotomolded polyethylene construction offers performance, rugged durability and affordability. Integrated thighbraces and adjustable sliding footbraces ensure a comfortable paddling position. Foot-pedal-controlled rudder system with cockpit deployment helps you steer and track effectively. Bow and stern hatches features easy-to-use covers that seal securely, and rear bulkhead compartment enhances flotation when hatch is sealed. The Riot Edge 14.5 Kayak features a reflective perimeter line, bungee rigging fore and aft of cockpit and a drainplug. Special buy.","short_description":"Sleek, fast and equipped with a rudder that makes it easier to paddle in a straight line, the Riot Edge 14.5 Kayak glides through nautical miles on day tours and short overnights.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s454223.png","image_url":"http://i1.avlws.com/115/l454223.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454223&tt=df","retail_price":"999.00","sale_price":"798.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454223\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454223.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868032&amp;link=&amp;tabs=-Details\"></script>","variants":{"8680320001":{"sku":"8680320001","vendor_sku":"EDGE14.5YO","upc":"486803200012","size":"14 FT 6 IN","color":"YELLOW/ORANGE","retail_price":"798.73","sale_price":"798.73"}},"categories":["paddling","kayaks","touring-kayaks"]}
