{"sku":"868018","manufacturer_id":"86113.01.100","brand_name":"Nrs","product_name":"NRS Mayra Inflatable Stand Up Paddleboard - Women's - 10' 6\"","long_description":"The women's NRS Mayra Inflatable Stand Up Paddleboard is designed with lots of deck space and high stability for touring, flatwater, surf and SUP yoga. 10 ft. 6 in. long and 32 in. wide, the NRS Mayra gives you plenty of room for poses and exercises, and the high-volume nose and tail make it stable from end to end. 4 in. thickness provides high volume and excellent stability for paddlers up to 200 lbs. Inflates to a rock-hard 15 psi for performance that rivals a hard board, then rolls up compactly when deflated for easy transport and storage. The smooth foam deck pad gives you a comfortable surface for yoga positions and good grip for extra control, and stomp pad on the tail gives you leverage for quick turns. Includes a single 9 in. center fin for tracking with a set of 5 in. side fins and a set of 2 in. side fins. Sturdy webbing handle offers easy transport, and bow and stern webbing handles offer a handy place to grab when remounting board from the water. Bow and stern D-rings give you places to clip accessories or a board leash (not included). The NRS Mayra Inflatable Stand Up Paddleboard includes a carrying case with shoulder straps, high-pressure pump, pressure gauge and repair kit. Uses Leafield C7 valves for reliability.","short_description":"The women's NRS Mayra Inflatable Stand Up Paddleboard is designed with lots of deck space and high stability for touring, flatwater, surf and SUP yoga.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s452171.png","image_url":"http://i1.avlws.com/115/l452171.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=452171&tt=df","retail_price":"1095.00","sale_price":"1095.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=452171\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m452171.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868018&amp;link=&amp;tabs=-Details\"></script>","variants":{"8680180002":{"sku":"8680180002","vendor_sku":"86113.01.100","upc":"603403015031","size":"10 FT 6 IN","color":"WHITE/BLUE","retail_price":"1095.00","sale_price":"1095.00"}},"categories":["paddling","paddleboarding","paddleboards"]}
