{"sku":"868267","manufacturer_id":"0070300331","brand_name":"Tifosi","product_name":" Tifosi Tyrant Sunglasses - 2013 Closeout","long_description":"Tifosi Tyrant photochromic sunglasses in Gunmetal feature lenses that automatically adjust their tint so you can keep running, cycling or hiking without stopping to change lenses. Matte Black frames include non-photochromic smoke lenses plus 2 extra pairs lenses (red and clear tints) for better visibility in low light or on cloudy days. Fototec(TM) photochromic lenses in Gunmetal frames automatically adjust tint according to light levels; lenses darken in bright light and lighten when there's less light. Polycarbonate lenses are lightweight and virtually shatterproof. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Adjustable, hydrophilic rubber nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather. Ventilated lenses increase airflow to help eliminate fogging. Tifosi Tyrant Sunglasses best fit small to medium faces. Includes a semirigid carrying case and cleaning cloth. Closeout.","short_description":"Tifosi Tyrant photochromic sunglasses in Gunmetal feature lenses that automatically adjust their tint so you can keep running, cycling or hiking without stopping to change lenses.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423463.png","image_url":"http://i1.avlws.com/115/l423463.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423463&tt=df","keywords":"Cycling","retail_price":"69.95","sale_price":"45.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423463\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423463.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868267&amp;link=&amp;tabs=-Details\"></script>","variants":{"8682670002":{"sku":"8682670002","vendor_sku":"0070300331","upc":"486826700025","size":"LIGHT NIGHT FOTOTEC","color":"GUNMETAL","retail_price":"45.73","sale_price":"45.73"}}}
