{"sku":"868341","manufacturer_id":"P-356083","brand_name":"Primus","product_name":" Primus ETA Lite Stove System","long_description":"Boil water and cook 1-pot meals fast and efficiently with the Primus ETA Lite Stove System. Its pot attaches directly to the stove burner for great performance and convenience on backpacking trips. 0.5-liter anodized-aluminum pot connects directly to the stove for excellent heat transfer; built-in windscreen and heat exchanger on the pot maximize efficiency. Boil 0.5 liters of water in about 2 min. 45 sec.; a single 100g fuel canister (not included) will provide approximately 59 min. of total burn time. Stove burner and cooking cup twist together to create a single convenient system for cooking; disconnect the stove burner and cooking cup for storage. Lid features an integrated strainer that comes in handy when cooking pasta or steaming vegetables; be sure to press the lid on securely before pouring. Insulating cozy on the cooking cup stays in place during cooking without melting, thereby increasing heat retention and efficiency. Webbing strap on the cozy doubles as a pot handle when cooking and a top strap to keep the whole system contained when it's in your backpack. Integrated piezo igniter lights the Primus ETA Lite Stove System with a simple click. Stove burner and 110g fuel canister (not included) stow inside the cup; buckle the handle strap over the top to secure the stove and fuel canister inside the cup. Included stabilizer attaches to a fuel canister, widening the overall stove base to enhance stability. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"Boil water and cook 1-pot meals fast and efficiently with the Primus ETA Lite Stove System. Its pot attaches directly to the stove burner for great performance and convenience on backpacking trips.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s416655.png","image_url":"http://i1.avlws.com/115/l416655.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416655&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416655\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416655.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868341&amp;link=&amp;tabs=-Details\"></script>","variants":{"8683410001":{"sku":"8683410001","vendor_sku":"P-356083","retail_price":"99.95","sale_price":"99.95"}}}
