{"sku":"868368","manufacturer_id":"97517440","brand_name":"Wilderness Systems","product_name":" Wilderness Systems Ride 115 Sit-On-Top Kayak","long_description":"Less than 12 ft. long, the versatile Wilderness Systems Ride 115 Sit-On-Top Kayak is packed with features to rival any longer sit on top on inland waterways, flatwater and coastal areas. 11 ft. 6 in. length is easy to carry, store and maneuver on the water, and 500 lb. capacity lets you bring along lots of gear. Performance-oriented hull increases boat's speed and stability, helping it track straight as you explore. The Ride 115 offers enough stability to stand up if desired, and wide foot areas on deck make it easy to get onto your feet confidently. High-density polyethylene construction offers performance, durability and low maintenance. Breathable, padded seat adjusts forward and backward, and leg lifters and large backrest enhance comfort; seat may be completely removed for use as a beach chair. Orbix bow and midship hatches let you store gear away from splashes. Orbix hatch cover features a hinged design and locking lever; to open hatch, simply slide lever to unlock cover and flip open to access gear. Comfort carry handles at bow, stern and sides make transporting the 76 lb. Ride 115 kayak easy. Footbraces; stern tank well; cup holder; paddle holder; recessed deck fittings; skid plate; drain plug.","short_description":"Less than 12 ft. long, the versatile Wilderness Systems Ride 115 Sit-On-Top Kayak is packed with features to rival any longer sit on top on inland waterways, flatwater and coastal areas.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s450263.png","image_url":"http://i1.avlws.com/115/l450263.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450263&tt=df","retail_price":"899.00","sale_price":"899.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450263\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450263.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868368&amp;link=&amp;tabs=-Details\"></script>","variants":{"8683680001":{"sku":"8683680001","vendor_sku":"97517440","upc":"729282751294","size":"11 FT 5 IN","color":"RED","retail_price":"899.00","sale_price":"899.00"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
