{"sku":"868310","manufacturer_id":"0150104006","brand_name":"Tifosi","product_name":" Tifosi Altar Interchangeable Sunglasses - 2013 Closeout","long_description":"The wrap-around Tifosi Altar Interchangeable Sunglasses give you 3 lens options so you can find just the right level of light for running, biking or hiking whether the sky is sunny or overcast. Frame includes 3 sets of lenses that accommodate bright light, low-medium light and nighttime. Gloss White/Teal frames feature Smoke gradient lenses that transition from dark at the top to light at the bottom and provide true color definition. Sunglasses also include additional AC Red lenses for sunny-to-cloudy days and a set of clear lenses that are ideal for early morning or nighttime use. Lightweight and virtually shatterproof, polycarbonate lenses are 20 times more impact-resistant than glass and one-third the weight. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact-resistant. Rubber nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather; ear pieces bend for a custom fit. Ventilated lenses increase airflow to help eliminate fogging; lenses block 100% of harmful UVA and UVB light. Tifosi Altar interchangeable sunglasses fit small to large faces. Semirigid carrying case and cleaning cloth included. Overstock.","short_description":"The wrap-around Tifosi Altar Interchangeable Sunglasses give you 3 lens options so you can find just the right level of light for running, biking or hiking whether the sky is sunny or overcast.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423475.png","image_url":"http://i1.avlws.com/115/l423475.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423475&tt=df","keywords":"Cycling","retail_price":"59.95","sale_price":"39.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423475\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423475.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868310&amp;link=&amp;tabs=-Details\"></script>","variants":{"8683100001":{"sku":"8683100001","vendor_sku":"0150104006","upc":"486831000011","size":"SMOKE GRADIENT/AC RED/CLE","color":"GLOSS WHITE/TEAL","retail_price":"39.73","sale_price":"39.73"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
