{"sku":"868311","manufacturer_id":"0150303930","brand_name":"Tifosi","product_name":" Tifosi Altar Photochromic Sunglasses - 2013 Closeout","long_description":"The wraparound Tifosi Altar Photochromic Sunglasses feature photochromic red lenses so you get just the right level of light for running, biking or hiking whether the sky is sunny or overcast. Photochromic lenses automatically adjust tint according to light conditions; lenses darken in bright light and lighten when there's less light. Lightweight and virtually shatterproof, polycarbonate lenses are 20 times more impact resistant than glass and one-third the weight. Rubber nosepiece and temple ends become tackier when wet for reliable grip during exercise and hot weather; ear pieces bend for a custom fit. Grilamid(R) TR90 lightweight nylon frames offer a consistent fit and flexibility in all temperatures and are extremely impact resistant. Ventilated lenses increase airflow to help eliminate fogging; lenses block 100% of harmful UVA and UVB light. Tifosi Altar Photochromic sunglasses fit small to large faces; semirigid carrying case and cleaning cloth included. Tifosi Altar frames are compatible with Tifosi interchangeable lenses (not included). Closeout.","short_description":"The wraparound Tifosi Altar Photochromic Sunglasses feature photochromic red lenses so you get just the right level of light for running, biking or hiking whether the sky is sunny or overcast.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423479.png","image_url":"http://i1.avlws.com/115/l423479.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423479&tt=df","keywords":"Cycling","retail_price":"69.95","sale_price":"45.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423479\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423479.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868311&amp;link=&amp;tabs=-Details\"></script>","variants":{"8683110001":{"sku":"8683110001","vendor_sku":"0150303930","upc":"874444007532","size":"HIGH SPEED RED FOTOTEC","color":"GLOSS WHITE/PINK","retail_price":"45.73","sale_price":"45.73"}}}
