{"sku":"868413","manufacturer_id":"14SUP3A106A4","brand_name":"Naish","product_name":"Naish Alana Air Inflatable Stand Up Paddleboard - 10' 6\"","long_description":"The Naish Alana Air 10 ft. 6 in. Inflatable Stand Up Paddleboard offers women of all skill levels a fun, maneuverable board that's easy to paddle. Specifically designed with a smaller, wider frame, the Alana inflatable is perfect for women who may not have storage space for a hard board. Spanning the interior of the inflatable like an iron spider's web, thousands of drop-stitch fibers allow a very high, almost rock-hard, inflation pressure. High air pressure creates a rigid hull without the use of frame parts; unlike hard boards, there's no need to worry about dings or chipped surfaces. Graphics on the board include numerical reference points indicating proper standing position, serving as helpful reminders and visual cues. 10 ft. 6 in. length and 30 in. width offer stability without being unwieldy for smaller paddlers. 4 in. thickness creates a thinner, lighter profile suitable for smaller paddlers. 2 side fins and removable center fin provide maneuverability and increased tracking. Includes canvas carry pack, high pressure gauge pump, repair kit and slide-in center fin. Packed dimensions of the Naish Alana Air 10 ft. 6 in. Stand Up Paddleboard are 33 x 20 x 12 in.","short_description":"The Naish Alana Air 10 ft. 6 in. Inflatable Stand Up Paddleboard offers women of all skill levels a fun, maneuverable board that's easy to paddle.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s457839.png","image_url":"http://i1.avlws.com/115/l457839.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457839&tt=df","retail_price":"1179.00","sale_price":"1179.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457839\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457839.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868413&amp;link=&amp;tabs=-Details\"></script>","variants":{"8684130001":{"sku":"8684130001","vendor_sku":"14SUP3A106A4","upc":"486841300019","size":"10 FT 6 IN","color":"BLUE/PINK","retail_price":"1179.00","sale_price":"1179.00"}},"categories":["paddling","paddleboarding","paddleboards"]}
