{"sku":"868691","manufacturer_id":"PMEV2011","brand_name":"Powertraveller","product_name":" Powertraveller Power Monkey Explorer Luminous Solar Battery Charger","long_description":"The Powertraveller Power Monkey Explorer Luminous Solar Battery Charger collects energy from the the sun's rays during the day, then glows so you can find it with ease in your pack or at night. Charger works with 5V devices, giving you up to 96 hours of standby power on most mobile phones, 40 hours on an iPod, 5 hours on a game console and 6 hours on an MP3 player. Fully charged, the integrated battery recharges a smartphone or GPS up to 2 times and an MP3 player up to 6 times. Integrated battery can be recharged 3 ways: built-in solar panel, USB or AC wall charger. Rip-and-stick strap lets you attach the charger to a pack or tent-perfect for charging the battery unit when you're out and about in the sun. The light, compact and tough Powertraveller Power Monkey Explorer Luminous Solar Battery Charger features a rubberized water-resistant casing. Includes 9 mobile device tips: Nokia, mini Nokia, mini USB, micro USB, iPod/iPhone (3G/3GS/4/4S), Samsung, LG, Sony Ericsson, Sony PSP and Nintendo DSi. Also includes an AC wall charger and travel pouch.","short_description":"The Powertraveller Power Monkey Explorer Luminous Solar Battery Charger collects energy from the the sun's rays during the day, then glows so you can find it with ease in your pack or at night.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Solar And Portable Power","thumb_url":"http://i1.avlws.com/115/s413267.png","image_url":"http://i1.avlws.com/115/l413267.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=413267&tt=df","retail_price":"110.00","sale_price":"110.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=413267\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m413267.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868691&amp;link=&amp;tabs=-Details\"></script>","variants":{"8686910001":{"sku":"8686910001","vendor_sku":"PMEV2011","color":"GLOW/YELLOW","retail_price":"110.00","sale_price":"110.00"}},"categories":["camping-hiking","camp-electronics","solar-and-portable-power"]}
