{"sku":"868632","manufacturer_id":"07.7660.3010","brand_name":"Necky","product_name":"Necky Rip 10 Kayak with Skeg","long_description":"Equipped with a drop-down skeg for enhanced tracking, the Necky Rip 10 is a lively, playful kayak designed to help newer paddlers build skills without sacrificing fun on the water. Sharp keel promotes glide and a moderate rocker makes the boat easy to maneuver. Tough and affordable polyethylene hull provides long-lasting wear and resists UV degradation; molded-in graphics won't peel or fade. Adjustable seat flexes with each paddle stroke, promoting comfort whether you're paddling hard or taking it easy; cup holder keeps a beverage close by. Thigh pads on the coaming offer comfort and control, and generously-sized cockpit allows easy entry and exit. Adjustable foot pedals accommodate different size paddlers. Cross-Lock buckle system on hatch secures cover easily even if you have cold hands; a gasket seals out water and keeps a tight fit. Bungee deck rigging at bow and stern secures extra gear on board; toggle carry handles offer convenient transport of the kayak to and from the water. The Necky Rip 10 Kayak with Skeg weighs 43 lb.","short_description":"Equipped with a drop-down skeg for enhanced tracking, the Necky Rip 10 is a lively, playful kayak designed to help newer paddlers build skills without sacrificing fun on the water.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s456571.png","image_url":"http://i1.avlws.com/115/l456571.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456571&tt=df","retail_price":"659.95","sale_price":"659.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456571\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456571.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868632&amp;link=&amp;tabs=-Details\"></script>","variants":{"8686320001":{"sku":"8686320001","vendor_sku":"07.7660.3010","upc":"785978077215","size":"10 FT 6 IN","color":"STORM","retail_price":"659.95","sale_price":"659.95"}},"categories":["paddling","kayaks","recreational-kayaks"]}
