{"sku":"868637","manufacturer_id":"07.7830.0146","brand_name":"Necky","product_name":"Necky Elias Kayak with Rudder","long_description":"An agile, playful and responsive touring kayak, the Necky Elias Kayak with Rudder offers a balance of glide, maneuverability and reduced drag so you can paddle more efficiently during any outing. The Elias takes its design cues from Necky's popular Eliza kayak, with a slightly longer and larger hull designed to appeal to a broad variety of paddlers. Hull shape is optimized for easy paddling and nearly effortless glide, and it provides stability for maneuvering through wind and waves. Performance-fit cockpit enables paddlers to grip the boat for edging and lean turning while still maintaining an easy feel for the more casual paddler. Boat is crafted from durable superlinear polyethylene for long-lasting service, easy care and reliable performance. Foot-pedal-controlled rudder system with cockpit deployment controls helps with steering and tracking in rough and windy water. Adjustable foam seat is designed specifically to reduce pressure on your sciatic nerve, helping prevent your legs and feet from falling asleep during long paddles. Fully bulkheaded bow and stern hatches with easy-to-use Cross Lock hatch covers provide generous dry cargo storage for day and overnight trips. Bungee deck rigging secures extra gear on deck for easy access. Carry toggles at bow and stern allow easy portaging to and from the water; boat features perimeter lines for safety and easier re-entry. The Necky Elias Kayak with Rudder weighs 47 lbs.","short_description":"An agile, playful and responsive touring kayak, the Necky Elias Kayak with Rudder offers a balance of glide, maneuverability and reduced drag so you can paddle more efficiently during any outing.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s460243.png","image_url":"http://i1.avlws.com/115/l460243.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460243&tt=df","retail_price":"1599.95","sale_price":"1599.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460243\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460243.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868637&amp;link=&amp;tabs=-Details\"></script>","variants":{"8686370001":{"sku":"8686370001","vendor_sku":"07.7830.0146","upc":"785978069722","size":"15 FT 6 IN","color":"STORM","retail_price":"1599.95","sale_price":"1599.95"}},"categories":["paddling","kayaks","touring-kayaks"]}
