{"sku":"868625","manufacturer_id":"181138","brand_name":"Electra","product_name":" Electra Townie 3i Step-Through Women's Bike - 2014","long_description":"Easy to mount and dismount thanks to the curved top tube, the women's Electra Townie 3i Step-Through Bike offers a comfortable riding position for fun and easy cruises around town. Step-through frame makes mounting and dismounting the saddle quick and easy. Flat Foot Technology(R) places rider upright for comfortable, heads-up positioning; aft positioning allows a rider to place both feet on the ground at a stop. Lightweight aluminum frame provides vertical stiffness for prompt acceleration and uphill power; it's also easy to lift for storage and transport. Shimano Nexus internal rear hub provides 3 smooth-shifting speeds and is remarkably maintenance-free compared to conventional cassette systems. Shimano Revo twist shifter is intuitively easy to use. Hand-operated, linear-pull brake controls front wheel while rear coaster brake offers intuitive deceleration with simple backpedaling. Saddle features shock-absorbing elastomers for all-day riding comfort. Convenient platform pedals accept most casual shoes, while the full-length chainguard keeps dirt and oil off your legs. Semi-slick 26 x 2.0 tires provide a smooth and stable ride over a variety of riding surfaces. Specs on the Townie 3i Step-Through Women's Bike are subject to change.","short_description":"Easy to mount and dismount thanks to the curved top tube, the women's Electra Townie 3i Step-Through Bike offers a comfortable riding position for fun and easy cruises around town.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378679.png","image_url":"http://i1.avlws.com/115/l378679.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378679&tt=df","retail_price":"549.00","sale_price":"549.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378679\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378679.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868625&amp;link=&amp;tabs=-Details\"></script>","variants":{"8686250002":{"sku":"8686250002","vendor_sku":"181138","upc":"846635027421","size":"One Size","color":"CHAMPAGNE","retail_price":"549.00","sale_price":"549.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
