{"sku":"868636","manufacturer_id":"07.7490.1030","brand_name":"Necky","product_name":"Necky Looksha 14 Kayak with Rudder","long_description":"Designed to carry lots of gear, handle rough water and go the distance with efficiency, the Necky Looksha 14 Kayak with Rudder offers friendly handling and smooth gliding for long day tours. Tough-as-nails polyethylene hull provides long-lasting wear and resists UV degradation; molded-in graphics won't peel or fade. Multi-edged hull design offers excellent edge control and provides excellent stability. Seat features 4 separate adjustments to dial in the comfort, and channels on the seating surface enhance airflow and drainage. Padded thighbraces and adjustable footbraces personalize the boat fit to enhance stability and control while paddling. Adjustable foot pedals accommodate different-size paddlers; controls in cockpit deploy foot-pedal-controlled rudder. Rudder assists with maneuvering and tracking in challenging conditions; rudder catch protects deck while bungee retains rudder during transport. Fully bulkheaded bow and stern hatches with flush-mount hatch covers provide generous dry cargo storage for extended voyages. Cross-Lock buckle system on hatch secures cover easily even if you have cold hands; a gasket seals out water and keeps a tight fit. Bow, stern and center bungee deck rigging securely store extra gear on top, and reflective safety perimeter lines boost visibility and aid in re-entry after a wet exit. The Necky Looksha 14 Kayak with Rudder weights 54 lbs. and comes with toggle carry handles.","short_description":"Designed to carry lots of gear, handle rough water and go the distance with efficiency, the Necky Looksha 14 Kayak with Rudder offers friendly handling and smooth gliding for long day tours.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s458675.png","image_url":"http://i1.avlws.com/115/l458675.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458675&tt=df","retail_price":"1399.95","sale_price":"1399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458675\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458675.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868636&amp;link=&amp;tabs=-Details\"></script>","variants":{"8686360001":{"sku":"8686360001","vendor_sku":"07.7490.1030","upc":"785978076652","size":"14 FT 1.5 IN","color":"SUNRISE","retail_price":"1399.95","sale_price":"1399.95"}},"categories":["paddling","kayaks","touring-kayaks"]}
