{"sku":"868633","manufacturer_id":"07.7658.3030","brand_name":"Necky","product_name":" Necky Rip 12 Kayak","long_description":"Equipped with a skeg, bulkheads and everything you need to grow your paddling skills, the Necky Rip 12 is a lively, playful kayak designed to boost confidence and skill in new paddlers. A fine choice for large paddlers, 12 ft. length offers a touch more speed and high capacity than its smaller, 10 ft. counterpart. Sharp keel promotes glide, a moderate rocker makes the boat easy to maneuver and drop-down skeg enhances tracking in rough water. Tough and affordable polyethylene hull provides long-lasting wear and resists UV degradation; molded-in graphics won't peel or fade. Adjustable seat flexes with each paddle stroke, promoting comfort whether you're paddling hard or taking it easy; cup holder keeps a beverage close by. Thigh pads on the coaming offer comfort and control, adjustable foot pedals accommodate different size paddlers and generously-sized cockpit allows easy entry and exit. Cross-Lock buckle system on hatch secures cover easily even if you have cold hands; a gasket seals out water and keeps a tight fit. Bungee deck rigging at bow and stern secures extra gear on board; toggle carry handles offer convenient transport of the kayak to and from the water. The Necky Rip 12 Kayak with Skeg weighs 49 lb.","short_description":"Equipped with a skeg, bulkheads and everything you need to grow your paddling skills, the Necky Rip 12 is a lively, playful kayak designed to boost confidence and skill in new paddlers.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s456575.png","image_url":"http://i1.avlws.com/115/l456575.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456575&tt=df","retail_price":"759.95","sale_price":"759.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456575\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456575.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868633&amp;link=&amp;tabs=-Details\"></script>","variants":{"8686330001":{"sku":"8686330001","vendor_sku":"07.7658.3030","upc":"785978077376","size":"12 FT","color":"RED","retail_price":"759.95","sale_price":"759.95"}},"categories":["paddling","kayaks","recreational-kayaks"]}
