{"sku":"868623","manufacturer_id":"100000","brand_name":"Electra","product_name":" Electra Townie GO! Bike - 2014","long_description":"The Electra Townie GO! Bike is a pedal-assist bike with surprising power. The extra boost kicks in when you need it to help you conquer hills and long distances without breaking a sweat. The motor monitors your pedaling power and speed, then automatically delivers extra power as you need it. 6061-T6 aluminum frame with steel fork offers high durability. Flat Foot Technology(R) places rider upright for comfortable, heads-up positioning; aft positioning allows a rider to place both feet on the ground at a stop. Front and rear LED lights are powered by the Hub Dynamo so you'll always have a little extra visibility. The Electra Townie GO! Bike features linear-pull brakes, alloy spring tensioners, braided stainless inner wires and cable casings. 30 mi. average distance on full charge (dependent on conditions, terrain and rider); rear-mounted battery charges in 3 - 4 hrs. and offers a maximum assisted speed of 15.5 mph. Specs on the Electra Townie GO! Bike are subject to change.","short_description":"The Electra Townie GO! Bike is a pedal-assist bike with surprising power. The extra boost kicks in when you need it to help you conquer hills and long distances without breaking a sweat.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378671.png","image_url":"http://i1.avlws.com/115/l378671.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378671&tt=df","keywords":"beach","retail_price":"2299.00","sale_price":"2299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378671\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378671.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868623&amp;link=&amp;tabs=-Details\"></script>","variants":{"8686230001":{"sku":"8686230001","vendor_sku":"100000","upc":"846635025502","size":"One Size","color":"EBONY","retail_price":"2299.00","sale_price":"2299.00"}}}
