{"sku":"868771","manufacturer_id":"08698","brand_name":"Msr","product_name":" MSR Hubba Hubba 2 Tent & Gear Shed - 2013 Closeout","long_description":"The freestanding MSR Hubba Hubba 2 Tent & Gear Shed remains one of the best options for all-around backpacking performance. Enjoy light weight and cavernous space at less than 3 lbs. per person. 2 doors and 2 vestibules ensure easy access and gear storage; stay-dry entries ensure water won't drip into the tent when door is opened for ventilation in rainy weather. Configured to maximize the tent's interior space, the hubbed pole system is strong and light, and setup is fast and easy. Vertical end panels keep the tent end from hitting the footbox of sleeping bag-even for tall campers. Mesh canopy offers excellent ventilation in warm climates and the dark color is easy to see through with little or no distortion. High-tech ripstop nylon rainfly reduces weight and the silicon and polyurethane coating increases durability and resistance to damaging UV rays. Rainfly rolls back halfway for a great view on starry nights and quickly rolls down if needed; vestibules can be rolled back in either direction for maximum ventilation. Tent also features organization pockets, hang loops, taped seams, reinforced stress points, ultralight stake loops and user-friendly door toggles. Gear Shed vestibule adds nearly 26 sq. ft. of space with a peak height of 35 in. Save weight and create a minimalist shelter by using just the rainfly, footprint (sold separately), poles and stakes. The MSR Hubba Hubba 2 Tent & Gear Shed includes stuff sacks, J-stakes and guyline/tighteners. Closeout.","short_description":"The freestanding MSR Hubba Hubba 2 Tent & Gear Shed remains one of the best options for all-around backpacking performance. Enjoy light weight and cavernous space at less than 3 lbs. per person.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424275.png","image_url":"http://i1.avlws.com/115/l424275.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424275&tt=df","retail_price":"499.90","sale_price":"349.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424275\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424275.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868771&amp;link=&amp;tabs=-Details\"></script>","variants":{"8687710001":{"sku":"8687710001","vendor_sku":"08698","upc":"040818086988","color":"GREEN","retail_price":"349.73","sale_price":"349.73"}},"categories":["camping-hiking","tents","backpacking-tents"]}
