{"sku":"868703","manufacturer_id":"07.7700.0123","brand_name":"Necky","product_name":"Necky Vector 13 Sit-On-Top Kayak","long_description":"Built to push the performance of sit-on-top kayaks, the 13 ft. Necky Vector 13 features an unusually fast design with a touring seat for covering water on long day tours or short-distance overnights. Long, sleek hull offers the stability of a sit-on-top but cuts through the water with ease. Adjustable touring seat is designed specifically to reduce pressure on your sciatic nerve, helping prevent your legs and feet from falling asleep during long paddles. Large rear tankwell uses a stretchy cover with multiple adjustment points to secure bulky gear, and cockpit features a mesh storage pouch for small items and a bottle holder. Adjustable foot pedals accommodate different size paddlers. Cross-Lock buckle system on hatch secures cover easily even if you have cold hands; a gasket seals out water and keeps a tight fit. Includes 4 medium scupper valves to prevent water from entering via the scupper holes and to drain water that comes over the side while paddling. The Necky Vector 13 Sit-On-Top Kayak weighs 59 lbs.","short_description":"Built to push the performance of sit-on-top kayaks, the 13 ft. Necky Vector 13 features an unusually fast design with a touring seat for covering water on long day tours or short-distance overnights.","category":"Paddling","subcategory":"Kayaks","product_group":"Sit-On-Top Kayaks","thumb_url":"http://i1.avlws.com/115/s456579.png","image_url":"http://i1.avlws.com/115/l456579.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456579&tt=df","retail_price":"999.95","sale_price":"999.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456579\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456579.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868703&amp;link=&amp;tabs=-Details\"></script>","variants":{"8687030001":{"sku":"8687030001","vendor_sku":"07.7700.0123","upc":"785978064673","size":"13 FT 2 IN","color":"RED","retail_price":"999.95","sale_price":"999.95"}},"categories":["paddling","kayaks","sitontop-kayaks"]}
