{"sku":"868745","manufacturer_id":"7611311","brand_name":"Alps Mountaineering","product_name":" ALPS Mountaineering Rechargeable Air Bed - Twin - Special Buy","long_description":"Whether you're headed out for a weekend of camping or staying with out-of-town friends, bring along the twin-size ALPS Mountaineering Rechargeable Air Bed to ensure a good night's sleep. Industry-leading thick and durable PVC material makes the mattress puncture resistant; welded seams add extra durability. Reinforced bed construction provides a comfortable, uniform sleeping surface and the outer ring provides a stable edge support. Plush, velvety-soft flocked top provides a luxurious sleep surface and prevents bedding from slipping or sliding around. Included state-of-the-art rechargeable pump inflates and deflates; includes a car charger and wall charger. Inflates quickly and easily with the flip of a switch; bed will be inflated from start to finish in just over 1 min. Easily fits in most camping tents. ALPS Mountaineering Rechargeable Air Bed comes with a carry bag. Special buy.","short_description":"Whether you're headed out for a weekend of camping or staying with out-of-town friends, bring along the twin-size ALPS Mountaineering Rechargeable Air Bed to ensure a good night's sleep.","category":"Camping And Hiking","subcategory":"Sleeping Pads, Cots And Hammocks","product_group":"Air Mattresses","thumb_url":"http://i1.avlws.com/115/s421999.png","image_url":"http://i1.avlws.com/115/l421999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421999&tt=df","keywords":"mats,inflatable","retail_price":"99.99","sale_price":"69.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868745&amp;link=&amp;tabs=-Details\"></script>","variants":{"8687450001":{"sku":"8687450001","vendor_sku":"7611311","upc":"703438761108","size":"TWIN","color":"RUST/KHAKI","retail_price":"69.73","sale_price":"69.73"}}}
