{"sku":"868811","manufacturer_id":"S4401","brand_name":"Bic Sport","product_name":"BIC Sport C-Tec Stand Up Paddle Board - 12' - 2012 Closeout","long_description":"For intermediates and above who are looking for versatile flatwater performance, Bic Sport C-Tec 12 ft. Stand Up Paddleboard supports paddlers up to 225 lbs. for fitness, touring and occasional surf. 12 ft. length makes it easy to glide along the shore, and sharp V-shape and high-volume bow cut easily through chop to smooth out your ride. EPS foam core wrapped with an epoxy resin/fiberglass cloth is encased in a styrene polymer outer shell; construction offers lightweight durability. Multiaxial fiberglass cloth distributes weight in multiple directions in the board, offering excellent stiffness and low weight. Padded deck supplies reliable wax-free traction when paddling in the standing or kneeling position, and it increases comfort on long paddles. 10 in. single fin promotes straight tracking in the water. Deck clips offer multiple spots to attach day-tripping accessories. Integrated carry handle on deck makes toting the 33 lb. board easy. Closeout.","short_description":"For intermediates and above who are looking for versatile flatwater performance, Bic Sport C-Tec 12 ft. Stand Up Paddleboard supports paddlers up to 225 lbs. for fitness, touring and occasional surf.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s430855.png","image_url":"http://i1.avlws.com/115/l430855.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430855&tt=df","retail_price":"1399.95","sale_price":"1025.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430855\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430855.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868811&amp;link=&amp;tabs=-Details\"></script>","variants":{"8688110001":{"sku":"8688110001","vendor_sku":"S4401","upc":"883667003719","size":"12 FT","color":"WHITE/ORANGE","retail_price":"1025.73","sale_price":"1025.73"}},"categories":["paddling","paddleboarding","paddleboards"]}
