{"sku":"868858","manufacturer_id":"12733","brand_name":"Arc'teryx","product_name":" Arc'teryx Theta SV Bib Shell Pants - Women's","long_description":"Arc'teryx Theta SV women's bib shell pants thrive and protect in harsh weather. They're crafted from robust GORE-TEX(R) Pro shell fabric for high-performance protection and durability. Waterproof, windproof and breathable, GORE-TEX Pro offers exceptional durability and full weather protection in a supple, notably soft-to-the-touch fabric. Gore micro-grid backer slides easily over mid layers. Reinforced in the knees, lower legs and seat to protect high-wear areas. Micro-seam allowances and tiny Gore(R) seam tape reduce bulkiness and weight. Bib helps keep out snow, yet is low cut for core breathability; rear elastic waist is integrated for comfort and a clean finish; adjustable suspenders. Full separating 2-way side zippers provide a drop-seat option without the need to remove suspenders, and allow easy removal over boots and crampons. Zippers are watertight and feature garages, including the zippers on the 2 external bib pockets. Articulated knees and gusseted crotch on the Arc'teryx Theta SV bib shell pants for women enhance mobility and comfort. Heavy-duty instep patches protect against damage by boots, crampons and ski edges. Cordura(R) powder cuffs with lace hooks fit easily over boots and secure into position; large pant-cuff diameter works well with alpine boots; hems have cord cinches. Arc'teryx expedition fit is cut slightly roomy to accommodate multiple layers without restricting movement; suitable for winter and extreme weather.","short_description":"Arc'teryx Theta SV women's bib shell pants thrive and protect in harsh weather. They're crafted from robust GORE-TEX(R) Pro shell fabric for high-performance protection and durability.","category":"Women's Clothing","subcategory":"Women's Pants","product_group":"Women's Snow Pants","thumb_url":"http://i1.avlws.com/115/s447935.png","image_url":"http://i1.avlws.com/115/l447935.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=447935&tt=df","keywords":"hardshell","retail_price":"475.00","sale_price":"331.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=447935\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m447935.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868858&amp;link=&amp;tabs=-Details\"></script>","variants":{"8688580004":{"sku":"8688580004","vendor_sku":"12733","upc":"806955642537","size":"L","color":"BLACK","retail_price":"331.93","sale_price":"331.93"}}}
