{"sku":"868827","manufacturer_id":"14-14-1364","brand_name":"Raleigh","product_name":"Raleigh Revenio 2.0 Bike - 2014","long_description":"A sporty road bike for training and commutes, the 18-speed Raleigh Revenio 2.0 keeps you comfortable during long rides with a relaxed pedaling position and vibration-reducing carbon fork. Hydroformed and butted aluminum frame features a geometry that blends comfort and performance for a sporty ride with good handling and power transfer. Carbon fork with chromoly steer tube helps dampen road vibration for a smooth ride. FSA Vero Compact crankset drives a wide-ranging 11-32 cassette for 18 gear combinations to tackle hills, straightaways and more. Shimano Sora shifters and derailleurs offer responsive shifts throughout the 18 gear combinations, even when in the drops, enabling you to spin the right gear for the grade. Slick Vittoria Zaffiro tires offer rugged construction, great grip and smooth rolling during long rides. Bike comes with a basic set of composite platform pedals (pedals not pictured). Specs on the Raleigh Revenio 2.0 road bike are subject to change.","short_description":"A sporty road bike for training and commutes, the 18-speed Raleigh Revenio 2.0 keeps you comfortable during long rides with a relaxed pedaling position and vibration-reducing carbon fork.","category":"Cycling","subcategory":"Bikes","product_group":"Road Bikes","thumb_url":"http://i1.avlws.com/115/s443059.png","image_url":"http://i1.avlws.com/115/l443059.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=443059&tt=df","retail_price":"899.00","sale_price":"899.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=443059\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m443059.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=868827&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["cycling","bikes","road-bikes"]}
