{"sku":"869072","manufacturer_id":"117983","brand_name":"Leupold","product_name":" Leupold BX-2 Acadia 8x32mm Waterproof Binoculars","long_description":"The Leupold BX-2 Acadia 8x32mm Waterproof Binoculars offer 8x magnification and the compact size of a roof-prism design, making them great for bird watching, travel and sporting events. Roof-prism design creates a smaller and more streamlined look and feel than traditional porro prism styles, making the binoculars much easier to hold and carry. Dielectrically coated BAK-4 prism surfaces boost light transmission and greatly improve resolution, contributing to a razor sharp, bright image in all lighting conditions. Large, central focus wheel and adjustable diopter make focus easy to achieve and maintain, even while wearing gloves. Excellent close focus ability allows user to enjoy a sharp view of objects only 5 ft. away. Twist up/down eyecups make it easy for eyeglass wearers to enjoy a full field of view. Armored, waterproof and nitrogen filled, the Acadia binoculars are well protected against field conditions. Named after the Acadia National Park in Maine, the first National Park to be created east of the Mississippi River. Leupold BX-2 Acadia 8x32mm Waterproof Binoculars include a case, quick-detach neoprene neck strap, eyepiece covers and tethered objected lens covers.","short_description":"The Leupold BX-2 Acadia 8x32mm Waterproof Binoculars offer 8x magnification and the compact size of a roof-prism design, making them great for bird watching, travel and sporting events.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Binoculars And Optics","thumb_url":"http://i1.avlws.com/115/s418051.png","image_url":"http://i1.avlws.com/115/l418051.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418051&tt=df","retail_price":"180.00","sale_price":"180.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418051\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418051.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869072&amp;link=&amp;tabs=-Details\"></script>","variants":{"8690720001":{"sku":"8690720001","vendor_sku":"117983","upc":"030317002831","color":"BLACK","retail_price":"180.00","sale_price":"180.00"}}}
