{"sku":"869077","manufacturer_id":"HP25R4GY","brand_name":"Fenix","product_name":" Fenix HP25 Headlamp","long_description":"With flood and spotlights that can be adjusted individually, the Fenix HP25 Headlamp puts you in charge. Its maximum 360 lumen output lights up the darkest trails when you're hiking and biking. 2 Cree XP-E LEDs (1 spot and 1 flood) have a maximum combined output of 360 lumens; use the spot and flood LEDs together or separate with the individual on/off switches. Dedicated spotlight LED has a maximum output of 180 lumens on high and it throws light 153m for long-range lighting; switch to mid for 90 lumens or low for 45 lumens. Dedicated floodlight outputs 180 lumens on turbo and has a 90deg wide beam angle for awareness of your surroundings at close range. Switch the floodlight to high for 90 lumens, mid for 45 lumens and low for 4 lumens; use the 90-lumen SOS strobe to signal for help. In flood mode, alkaline batteries provide 4 hrs. of use on turbo, 11 hrs. on high, 30 hrs. on mid and 220 hrs. on low. Regulated output ensures consistent lighting levels even as battery power is reduced. Lockout design prevents the light from accidentally turning on when it's in your backpack. Operates on 4 alkaline, lithium or NiHM rechargeable batteries (sold separately); rugged aluminum chassis sheds heat and stands up to impacts. Intelligent memory circuit automatically enters the previously used brightness level when the headlamp is turned on. Fenix HP25 Headlamp has an IPX6 water-resistance rating, which indicates protection against forceful projected water.","short_description":"With flood and spotlights that can be adjusted individually, the Fenix HP25 Headlamp puts you in charge. Its maximum 360 lumen output lights up the darkest trails when you're hiking and biking.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s417211.png","image_url":"http://i1.avlws.com/115/l417211.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=417211&tt=df","retail_price":"69.95","sale_price":"69.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=417211\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m417211.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869077&amp;link=&amp;tabs=-Details\"></script>","variants":{"8690770001":{"sku":"8690770001","vendor_sku":"HP25R4GY","color":"IRON GRAY","retail_price":"69.95","sale_price":"69.95"}}}
