{"sku":"869070","manufacturer_id":"117985","brand_name":"Leupold","product_name":"Leupold BX-3 Mojave 8x32mm Waterproof Binoculars","long_description":"Weighing in at just over a pound and providing 8x magnification in an easy-to-handle format, the Leupold BX-3 Mojave 8x32mm Waterproof Binoculars are ideal for hiking, traveling and bird watching. Roof-prism design creates a smaller and more streamlined look and feel than traditional porro prism styles, making the binoculars much easier to hold and carry. Fully multicoated lenses combine with BAK-4 prisms to provide excellent photopic transmission for a very bright image under all lighting conditions. Phase coating to the prisms virtually eliminates any diffraction, to ensure the image is crisp; cold-mirror coating offers excellent color reproduction, resolution and clarity. Large, central focus wheel and adjustable diopter make focus easy to achieve and maintain, even while wearing gloves. Excellent close focus ability allows user to enjoy a sharp view of objects only 7 ft. away. Long eye relief enhances viewing comfort by reducing eye strain regardless of whether user is wearing eyeglasses or not. Twist up/down eyecups make it easy for eyeglass wearers to enjoy a full field of view. Armored, waterproof and nitrogen filled, the Mojave binoculars are well protected against field conditions. Leupold BX-3 Mojave 8x32mm Waterproof Binoculars include a case, quick-detach neoprene neck strap, eyepiece covers and tethered objective lens covers.","short_description":"Weighing in at just over a pound and providing 8x magnification in an easy-to-handle format, the Leupold BX-3 Mojave 8x32mm Waterproof Binoculars are ideal for hiking, traveling and bird watching.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Binoculars And Optics","thumb_url":"http://i1.avlws.com/115/s418043.png","image_url":"http://i1.avlws.com/115/l418043.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418043&tt=df","retail_price":"350.00","sale_price":"350.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418043\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418043.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869070&amp;link=&amp;tabs=-Details\"></script>","variants":{"8690700001":{"sku":"8690700001","vendor_sku":"117985","upc":"030317002862","color":"BLACK","retail_price":"350.00","sale_price":"350.00"}},"categories":["camping-hiking","gadgets","binoculars-and-optics"]}
