{"sku":"869040","manufacturer_id":"980-0003-R01","brand_name":"Magellan","product_name":" Magellan Triton 500 GPS Receiver - Refurbished - 2008/2009 Closeout","long_description":"The simple-to-use refurbished Magellan Triton 500 GPS is perfect for the first-time GPS user, but advance navigators will also enjoy it with the full-color display, SD-card compatibility and accuracy. Simple menus and intuitive button and scroll pad control make navigation fun and effortless; full-color display shows maps in easy-to-view graphics. Digital compass determines accurate direction of travel and allows user to sight and navigate precise bearings. Barometric altimeter analyzes pressure differences to determine accurate elevation; pressure tracking helps user forecast weather conditions. Expandable memory via SD cards (not included) allows storage of maps, audio, pictures and more. Triton 500 offers compatibility with National Geographic TOPO! State series and Weekend Explorer 3D maps (not included). Triton 500 GPS features a rugged rubberized housing that's easy to grip; strap loop facilitates attachment to packs or clothing. Waterproof construction keeps unit functioning; meets IEC 60529 lPX7 standards (submersible to 1m for 30 min.). Strong SiRFstarIII(TM) chipset provides rapid satellite fix and position lock in narrow valleys, dense woodlands and urban jungles. WAAS-enabled (Wide Area Augmentation System) receiver delivers accuracy to within 10 ft. in North America. Comes with preloaded basemap of the continental United States, Alaska and Canada along with a catalog of major points of interest. Upload your tracks and waypoints to your Windows computer and use the free VantagePoint software to view your data, manage maps and plan routes; not Mac compatible. Magellan Triton 500 GPS is powered by 2 AA batteries (not included). Closeout.","short_description":"The simple-to-use refurbished Magellan Triton 500 GPS is perfect for the first-time GPS user, but advance navigators will also enjoy it with the full-color display, SD-card compatibility and accuracy.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s412639.png","image_url":"http://i1.avlws.com/115/l412639.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412639&tt=df","retail_price":"109.99","sale_price":"85.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412639\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412639.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869040&amp;link=&amp;tabs=-Details\"></script>","variants":{"8690400001":{"sku":"8690400001","vendor_sku":"980-0003-R01","upc":"763357119053","color":"RED","retail_price":"85.73","sale_price":"85.73"}},"categories":["camping-hiking","camp-electronics","gps"]}
