{"sku":"869152","manufacturer_id":"LSF101402","brand_name":"Lifestraw","product_name":"LifeStraw Family Gravity Purifier","long_description":"Lightweight and portable, the LifeStraw Family Gravity Purifier makes purifying water at a base camp or car-camping site a breeze. It's also great to have at home in the event of a natural disaster. Hollow-fiber filter membrane offers a flow rate of 9 - 12 liters per hr.; simply fill the blue bucket with water and hold it or hang it above a container you want to fill. Water passes through the 3 ft. long blue PVC hose and gravity creates sufficient pressure on the membrane cartridge to reach the high flow rate. 0.2-micron filter physically removes 99.9999% of all bacteria, such as salmonella, cholera and E.coli; removes 99.9% of all protozoa, such as giardia and cryptosporidium. Also removes 99.99% of viruses, such as Hepatitis A. Hollow-fiber filter is rated to purify up to 18,000 liters of water over its lifetime; that's enough to supply a family of five with clean drinking water for up to 3 yrs. Requires no electrical power, batteries or replacement parts. Easy-to-clean 80-micron prefilter inside the blue water bucket removes larger particles before they reach the filter. LifeStraw Family Gravity Purifier has a backwashing bulb on the side that makes cleaning the hollow-fiber membrane simple. For every LifeStraw product sold, one student in Kenya receives clean water for a year thanks to the donation efforts of the North American distributor, Eartheasy. Eartheasy's goal is to provide clean water to 500 schools in Kenya in 2014 through the donation of large community filters.","short_description":"Lightweight and portable, the LifeStraw Family Gravity Purifier makes purifying water at a base camp or car-camping site a breeze. It's also great to have at home in the event of a natural disaster.","category":"Camping And Hiking","subcategory":"Water Bottles And Treatment","product_group":"Water Treatment","thumb_url":"http://i1.avlws.com/115/s449171.png","image_url":"http://i1.avlws.com/115/l449171.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449171&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449171\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449171.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869152&amp;link=&amp;tabs=-Details\"></script>","variants":{"8691520001":{"sku":"8691520001","vendor_sku":"LSF101402","color":"BLUE","retail_price":"89.95","sale_price":"89.95"}},"categories":["camping-hiking","water-bottles-and-treatment","water-treatment"]}
