{"sku":"869148","manufacturer_id":"RST-PC4FW-220","brand_name":"Aqua-Bound","product_name":" Aqua-Bound Sting Ray Hybrid Posi-Lok Four-Piece Paddle","long_description":"A 4-piece paddle that breaks down for travel, the Aqua-Bound Sting Ray Hybrid Posi-Lok carbon-shaft kayak paddle is suited to exploring your local waters via a low-angle paddling style. Small-diameter shaft is designed for paddlers with smaller hands, and size of blade is optimized for low-angle paddling and produces a smooth stroke with minimal flutter. Simple, intuitive and strong, the Posi-Lok(R) ferrule uses a 2-button release to detach and adjust feather angle. To join, simply slide the Posi-Lok ferrule together and listen for the audible click. Posi-Lok resists corrosion and completely eliminates play between each piece of the paddle. Feathering is adjustable in the increments of 0 / 45deg right or left. Lightweight carbon shaft provides low swing weight and slight shaft flex, promoting a comfortable experience in the cockpit from launch until takeout. Fiberglass-reinforced nylon blades provide excellent durability when pushing off rocks or barnacles.","short_description":"A 4-piece paddle that breaks down for travel, the Aqua-Bound Sting Ray Hybrid Posi-Lok carbon-shaft kayak paddle is suited to exploring your local waters via a low-angle paddling style.","category":"Paddling","subcategory":"Paddles","product_group":"Kayak Paddles","thumb_url":"http://i1.avlws.com/115/s446451.png","image_url":"http://i1.avlws.com/115/l446451.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=446451&tt=df","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=446451\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m446451.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869148&amp;link=&amp;tabs=-Details\"></script>","variants":{"8691480001":{"sku":"8691480001","vendor_sku":"RST-PC4FW-220","upc":"717320485317","size":"220 CM","color":"WHITE","retail_price":"149.95","sale_price":"149.95"}},"categories":["paddling","paddles","kayak-paddles"]}
