{"sku":"869271","manufacturer_id":"OO9193-12","brand_name":"Oakley","product_name":" Oakley LBD Breast Cancer Awareness Edition Polarized Sunglasses - Women's","long_description":"The \"little black dress\" of sunglasses with a fresh pink twist, the Oakley LBD Breast Cancer Awareness Edition Polarized Sunglasses offer retro glam and also support the Young Survival Coalition. Oakley donates $20 of each purchase to Young Survival Coalition, a nonprofit dedicated to the critical issues unique to young women who are diagnosed with breast cancer. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Optically correct, shatterproof and scratch-resistant polycarbonate lenses offer great durability. Polished black frames feature grey polarized lenses for reduced glare and true color perception in extremely bright light. Lightweight, flexible nylon frames resist damaging stresses. Unique 3-point fit from Oakley includes optical alignment for sharp accurate vision, impact absorption for improved safety and geometry that extends the peripheral view. Oakley LBD Breast Cancer Awareness Edition Polarized Sunglasses feature hydrophilic nose pads and earpads that become tackier when you perspire for a secure fit.","short_description":"The \"little black dress\" of sunglasses with a fresh pink twist, the Oakley LBD Breast Cancer Awareness Edition Polarized Sunglasses offer retro glam and also support the Young Survival Coalition.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s442899.png","image_url":"http://i1.avlws.com/115/l442899.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=442899&tt=df","keywords":"Cycling","retail_price":"190.00","sale_price":"190.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=442899\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m442899.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869271&amp;link=&amp;tabs=-Details\"></script>","variants":{"8692710001":{"sku":"8692710001","vendor_sku":"OO9193-12","upc":"700285835068","size":"OO GREY POLAR","color":"POLISHED BLACK","retail_price":"190.00","sale_price":"190.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
