{"sku":"869270","manufacturer_id":"OO9181-19","brand_name":"Oakley","product_name":"Oakley Radarlock Path Interchangeable Sunglasses - Men's","long_description":"With a semi-rimless design, the Oakley Radarlock Path Interchangeable Sunglasses give you wide peripheral vision that is perfect for riding, running and everything else you do fast. Switchlock(TM) interchangeable lens technology enables quick and easy lens switch-outs; sunglasses include black and positive red iridium lenses. Polished Black frame features gray-tint Black Iridium lenses, ideal for extremely bright sunlight. Infrared frame features contrast-tint Positive Red Iridium lenses, perfect for enhanced contrast in medium to bright sunlight. Both frames also come with contrast-tint VR28 lenses for flat to medium light. Stress-resistant nylon frames are light and flexible for all-day comfort. 19mm nose-bridge height offers a large field of view. Open-edge design extends your vertical field of vision and retains peripheral clarity. Oakley 3-point fit includes optical alignment for sharp, accurate vision, impact absorption for improved protection and geometry designed to enhance peripheral view. Oakley Radarlock Path Interchangeable Sunglasses feature hydrophilic nose pads and earpads that get tackier when you perspire, holding the sunglasses in place as you move.","short_description":"With a semi-rimless design, the Oakley Radarlock Path Interchangeable Sunglasses give you wide peripheral vision that is perfect for riding, running and everything else you do fast.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423523.png","image_url":"http://i1.avlws.com/115/l423523.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423523&tt=df","keywords":"Cycling","retail_price":"220.00","sale_price":"220.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423523\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423523.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869270&amp;link=&amp;tabs=-Details\"></script>","variants":{"8692700001":{"sku":"8692700001","vendor_sku":"OO9181-16","upc":"700285798462","size":"POSITIVE RED IRIDIUM","color":"INFRARED","retail_price":"220.00","sale_price":"220.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
