{"sku":"869291","manufacturer_id":"523-02MR","brand_name":"Maui Jim","product_name":" Maui Jim Switchbacks Polarized Interchangeable Sunglasses - Men's","long_description":"The Maui Jim Switchbacks Polarized Sunglasses sport a light frame with full shield coverage for protection against the sun's harmful rays. They let you switch lenses at the touch of a button. Proprietary interchangeable locking mechanism and interchangeable polarized shields provide coverage for many light conditions at the touch of a button. Matte Black frames feature Neutral Grey lenses for especially bright, direct sunlight; they offer rich color and contrast along with very high light production. Matte Rootbeer frames feature HCL (High Contrast Lens) Bronze lenses for added contrast on overcast or foggy days; subtle bronze tint is ideal for variable sunlight. Included clear lenses offers glare protection in extremely low light. PolarizedPlus2 lenses eliminate 99.9% of glare; patented multilayer design and lens treatment maximize color transmission and enhance visible color. Proprietary CLEARSHELL provides excellent scratch-resistance on front and back of lenses. Injection-molded, optically correct lenses are lightweight and extremely impact-resistant. Anti-corrosive spring hinges; Rabalon nose pads prevent slippage and are adjustable for a secure, custom fit. Modified rectangle shield frames complement round-, oval- and square-shaped faces and best fit medium or large faces. The Maui Jim Switchbacks Polarized Sunglasses come with a case and cleaning cloth.","short_description":"The Maui Jim Switchbacks Polarized Sunglasses sport a light frame with full shield coverage for protection against the sun's harmful rays. They let you switch lenses at the touch of a button.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s449511.png","image_url":"http://i1.avlws.com/115/l449511.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449511&tt=df","keywords":"Cycling","retail_price":"319.00","sale_price":"319.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449511\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449511.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869291&amp;link=&amp;tabs=-Details\"></script>","variants":{"8692910002":{"sku":"8692910002","vendor_sku":"H523-26M","upc":"603429028053","size":"HCL BRONZE","color":"MATTE ROOTBEER","retail_price":"319.00","sale_price":"319.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
