{"sku":"869206","manufacturer_id":"HS247-16","brand_name":"Maui Jim","product_name":" Maui Jim Cliff House Polarized Sunglasses - Men's","long_description":"With modified aviator style, the Maui Jim Cliff House Polarized Sunglasses deliver the renowned glare protection of Maui Jim patented PolarizedPlus2 lenses. Lightweight pure titanium frames are ideal for active adventurers who demand durable, comfortable, high-performing sunglasses; they complement small and medium facial shapes. PolarizedPlus2 lenses eliminate 99.9% of glare; Maui Evolution lens material fuses the best properties of both SuperThin glass and polycarbonate lenses. Multilayer lens treatment maximizes color transmission and enhances visible color; Maui Gradient tint eliminates overhead glare while allowing appropriate light transmission. Gold frames feature HCL (High Contrast Lens) Bronze lenses for added contrast on overcast or foggy days; subtle bronze tint is ideal for variable sunlight. Silver frames feature Neutral Grey lenses for especially bright, direct sunlight; they offer rich color and contrast along with very high light production. The Maui Jim Cliff House Polarized Sunglasses feature anti-corrosive spring hinges, non-slip silicone nose pads and high gloss finish. Sunglasses come with a case and cleaning cloth.","short_description":"With modified aviator style, the Maui Jim Cliff House Polarized Sunglasses deliver the renowned glare protection of Maui Jim patented PolarizedPlus2 lenses.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Casual Sunglasses","thumb_url":"http://i1.avlws.com/115/s449459.png","image_url":"http://i1.avlws.com/115/l449459.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449459&tt=df","retail_price":"279.00","sale_price":"279.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449459\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449459.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869206&amp;link=&amp;tabs=-Details\"></script>","variants":{"8692060001":{"sku":"8692060001","vendor_sku":"HS247-16","upc":"603429019679","size":"HCL BRONZE","color":"GOLD","retail_price":"279.00","sale_price":"279.00"},"8692060002":{"sku":"8692060002","vendor_sku":"GS247-17","upc":"603429019662","size":"NEUTRAL GREY","color":"SILVER","retail_price":"279.00","sale_price":"279.00"}}}
