{"sku":"869361","manufacturer_id":"35421913LR","brand_name":"Kelty","product_name":" Kelty Ignite 40 Sleeping Bag - Long - 2013 Closeout","long_description":"For warm-weather campers and backpackers who want great performance without spending a fortune, the long Kelty Ignite 40 Sleeping Bag is a great choice. With an EN lower-limit rating of 37degF, the Ignite 40 is ideal for mild-weather backpacking trips throughout spring, summer and fall. ECOPET Soft synthetic fill insulation is light, warm and compressible, and it's made from recycled PET plastic. Long length benefits tall campers; efficient formfitting hood keeps your head warm. Draft tube backs the 58 in. 2-way zipper to prevent cold air from getting in. Ground-level side seams keep the draft tube in place, further helping prevent cold air from seeping through the 2-way, locking zipper. Internal loops provide attachment for a liner (not included) to increase the warmth of the bag. Pad loops provide attachment points to keep your sleeping bag and pad together, so you needn't worry about rolling onto the cold, hard ground (not included). Hang loops allow easy drying and storage. Kelty Ignite 40 Sleeping Bag comes with a stuff sack. Closeout.","short_description":"For warm-weather campers and backpackers who want great performance without spending a fortune, the long Kelty Ignite 40 Sleeping Bag is a great choice.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421883.png","image_url":"http://i1.avlws.com/115/l421883.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421883&tt=df","keywords":"compact","retail_price":"119.95","sale_price":"89.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421883\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421883.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869361&amp;link=&amp;tabs=-Details\"></script>","variants":{"8693610001":{"sku":"8693610001","vendor_sku":"35421913LR","upc":"727880038175","size":"Long","color":"AVACADO","retail_price":"89.73","sale_price":"89.73"}}}
