{"sku":"869376","manufacturer_id":"2000014047","brand_name":"Coleman","product_name":" Coleman Triton Series Mossy Oak 2-Burner Stove","long_description":"Cook breakfast, lunch and dinner with the legendary durability of a Coleman Triton(TM) Series Mossy Oak 2-Burner Stove. It's ideal for camping, tailgating and outdoor cooking during power outtages. InstaStart(TM) push-button matchless lighting system makes ignition easy. Once this propane camping stove starts to heat up, PerfectHeat(TM) Technology gets the temperatures just right for even and efficient cooking. WindBlock(TM) shields keep the wind from blowing the flames around; PerfectFlow Pressure Control System keeps the heat steady on each of the 11,000-BTU burners. Spacious cooking surface is large enough to fit a 10 in. (25.4 cm) frying pan and 12 in. (30.48 cm) frying pan at the same time. Independently-adjustable controls allow you to set your heat anywhere from simmer to boil; boils 1 liter of water in about 2 min. 50 sec. 2-burner stove is also efficient, with a 1 hr. runtime on high using a single 16.4 oz. propane cylinder. Durable steel construction withstands rugged cooking conditions. When the meal is done, the removable, heavy-duty nickel-chrome grates make cleaning easy; built-in handle will have you carrying this lightweight stove effortlessly. Due to flammable item shipping restrictions, we cannot sell fuel canisters online; they are available at REI retail stores.","short_description":"Cook breakfast, lunch and dinner with the legendary durability of a Coleman Triton(TM) Series Mossy Oak 2-Burner Stove. It's ideal for camping, tailgating and outdoor cooking during power outtages.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Stoves","thumb_url":"http://i1.avlws.com/115/s456299.png","image_url":"http://i1.avlws.com/115/l456299.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456299&tt=df","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456299\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456299.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869376&amp;link=&amp;tabs=-Details\"></script>","variants":{"8693760001":{"sku":"8693760001","vendor_sku":"2000014047","upc":"076501235456","color":"CAMO","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","camp-kitchen","stoves"]}
