{"sku":"869474","manufacturer_id":"010-01199-10","brand_name":"Garmin","product_name":" Garmin GPSMAP 64s GPS","long_description":"The waterproof, full-featured Garmin 64s GPS boasts wireless connectivity and a high-sensitivity receiver that works with Russian GLONASS and U.S. GPS satellites for superior reception and navigation. Bright, sunlight-readable TFT transflective display with 65K color measures 2.6 in. with 240 x 160 pixels to present imagery in crisp and colorful detail. Quad helix antenna and high-sensitivity GPS/GLONASS receiver quickly locate your position and maintain precise location even in heavy cover and deep canyons. Worldwide base map features shaded relief; easily add more maps such as TOPO U.S. 24K and City Navigator (sold separately) with microSD card slot and 4GB internal memory. Included 1-year BirdsEye Satellite Imagery subscription allows you to download an unlimited amount of satellite imagery (subscription can be extended at $29.99 per year). 3-axis electronic compass with accelerometer tilt compensation shows where you're heading even when you're standing still, without the need to hold the unit level. Barometric altimeter tracks changes in pressure to pinpoint your altitude; use it to plot barometric pressure over time, helping you keep an eye on changing weather conditions. Wireless connectivity via Bluetooth(R) and ANT+(TM) lets you share your waypoints, tracks, routes and geocaches wirelessly with other compatible devices. Also connects wirelessly to Garmin VIRB action cams and accessory sensors, including Garmin tempe(TM), foot pods and heart rate monitors (cams and sensors sold separately). Smart Notification wirelessly receives email, texts and alerts from your iPhone 4s or later; stay connected without having to dig into your backpack for your smartphone. With photo navigation, you can download geotagged pictures from the Internet and navigate to them. Enjoy paperless geocaching with 250,000 preloaded caches, locations, hints, terrain and difficulty descriptions from Geocaching.com.","short_description":"The waterproof, full-featured Garmin 64s GPS boasts wireless connectivity and a high-sensitivity receiver that works with Russian GLONASS and U.S. GPS satellites for superior reception and navigation.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s447999.png","image_url":"http://i1.avlws.com/115/l447999.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=447999&tt=df","retail_price":"400.00","sale_price":"400.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=447999\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m447999.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869474&amp;link=&amp;tabs=-Details\"></script>","variants":{"8694740001":{"sku":"8694740001","vendor_sku":"010-01199-10","upc":"753759115838","retail_price":"400.00","sale_price":"400.00"}},"categories":["camping-hiking","camp-electronics","gps"]}
