{"sku":"869411","manufacturer_id":"NIPB2-01-R8","brand_name":"Nite Ize","product_name":"Nite Ize Action iPhone Armband","long_description":"The Nite Ize Action iPhone Armband is a sleek, durable and flexible way to protect your phone and stay connected hands-free while you're hiking, running, or hitting the gym. Medium size fits iPhone(R) 4/4s and iPod(R) touch 4th generation and similar; Large size fits iPhone 5, iPod Touch 5th generation and similar, and Android. Just slide your device into the main pocket, thread the weather-resistant microfiber strap through the lightweight metal loop, press it closed around your upper arm, and go. Because the main pocket is faced with clear, touch-responsive thermoplastic urethane, your phone stays visible and functional as well as protected. Other design features include strategic openings at both top and bottom for headphone access and a rear slot to fit a driver's license, credit card or cash. Micro rip-and-stick fabric at both pocket flap and arm strap for secure, streamlined closure; second slit pocket with attached S-Biner and Curvyman Cord Supervisor included. Ventilated and non-absorbent microfiber repels moisture; it's lined with reflective detail and backed with 2 narrow gripper strips to prevent slipping. Flexible, seamless design for comfort during any activity; sonic welding ensures a flat, smooth fit with no seams or stitch lines to chafe or irritate your arm. Easily adjusts to fit arms from 10.5 - 16 in. in circumference. The Nite Ize Action iPhone Armband features reflective trim for passive reflectivity.","short_description":"The Nite Ize Action iPhone Armband is a sleek, durable and flexible way to protect your phone and stay connected hands-free while you're hiking, running, or hitting the gym.","category":"Fitness","subcategory":"Running","product_group":"Running Packs","thumb_url":"http://i1.avlws.com/115/s460119.png","image_url":"http://i1.avlws.com/115/l460119.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460119&tt=df","retail_price":"30.00","sale_price":"30.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460119\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460119.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869411&amp;link=&amp;tabs=-Details\"></script>","variants":{"8694110001":{"sku":"8694110001","vendor_sku":"NIPB2-01-R8","upc":"094664026254","size":"L","color":"BLACK","retail_price":"30.00","sale_price":"30.00"},"8694110002":{"sku":"8694110002","vendor_sku":"NIPB-08-01","upc":"094664021792","size":"M","color":"BLACK","retail_price":"30.00","sale_price":"30.00"}},"categories":["fitness","running","running-packs"]}
