{"sku":"869409","manufacturer_id":"SLP-03-51","brand_name":"Nite Ize","product_name":"Nite Ize SlapLit Safety Light - Red LED","long_description":"Remember slap bracelets? With its red LED, the Nite Ize SlapLit Safety Light features that same easy \"slap it to snap it\" functionality with the added benefit of LED illumination. Made of durable nylon and patterned with a reflective spider-web design, the SlapLit is powered by a bright, easy-to-activate LED that lights up the entire wrap. Turn it on, slap it on your wrist, upper arm or ankle (or any tubular-shaped object), and you've got instant nighttime visibility. Lightweight and durable, the SlapLit is perfect for after-dark lawn games, running, walking, or cycling at night and outdoor evening concerts and events. The SlapLit can be straightened with a simple twist of the thumb and stored flat or hung in its straightened form and used as an LED marker beacon. Bright red LED offers active illumination with a steady glow or flash mode. Single, easily replaceable 2032 3V lithium battery (included) delivers up to 100 hours of light. The Nite Ize SlapLit Safety Light measures 13.75 x 1.52 x 0.33 in.","short_description":"Remember slap bracelets? With its red LED, the Nite Ize SlapLit Safety Light features that same easy \"slap it to snap it\" functionality with the added benefit of LED illumination.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s460107.png","image_url":"http://i1.avlws.com/115/l460107.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460107&tt=df","retail_price":"12.00","sale_price":"12.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460107\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460107.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869409&amp;link=&amp;tabs=-Details\"></script>","variants":{"8694090001":{"sku":"8694090001","vendor_sku":"SLP-03-51","upc":"094664019904","color":"RED","retail_price":"12.00","sale_price":"12.00"}},"categories":["fitness","running","fitness-electronics"]}
