{"sku":"869473","manufacturer_id":"010-01199-00","brand_name":"Garmin","product_name":" Garmin GPSMAP 64 GPS","long_description":"The waterproof, full-featured Garmin 64 GPS boasts a high-sensitivity receiver that works with both Russian GLONASS and U.S. GPS satellites for superior reception and navigation. Bright, sunlight-readable TFT transflective display with 65K color measures 2.6 in. with 240 x 160 pixels to present imagery in crisp and colorful detail. Quad helix antenna and high-sensitivity GPS/GLONASS receiver quickly locate your position and maintain precise location even in heavy cover and deep canyons. Worldwide base map has shaded relief; easily add more maps such as BirdsEye, TOPO U.S. 24K and City Navigator (sold separately) with microSD card slot and 4GB internal memory. With photo navigation, you can download geo-tagged pictures from the Internet and navigate to them. Enjoy paperless geocaching with 250,000 preloaded caches, locations, hints, terrain and difficulty descriptions from Geocaching.com. Free BaseCamp software lets you view and organize maps, waypoints, routes and tracks, and allows you to create adventures that you can share with friends and fellow explorers. Hunt/fish calendar; sun/moon info; custom points of interest; picture viewer; 5,000 waypoints; 200 routes; track log with 10,000 points and 200 saved tracks. The slim and lightweight Garmin 64 GPS features an active battery life of up to 16 hrs. with 2 AA batteries; IPX7 rating protects against 1m immersion for up to 30 min.","short_description":"The waterproof, full-featured Garmin 64 GPS boasts a high-sensitivity receiver that works with both Russian GLONASS and U.S. GPS satellites for superior reception and navigation.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Gps","thumb_url":"http://i1.avlws.com/115/s445223.png","image_url":"http://i1.avlws.com/115/l445223.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=445223&tt=df","retail_price":"300.00","sale_price":"300.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=445223\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m445223.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869473&amp;link=&amp;tabs=-Details\"></script>","variants":{"8694730001":{"sku":"8694730001","vendor_sku":"010-01199-00","upc":"753759115814","retail_price":"300.00","sale_price":"300.00"}}}
