{"sku":"869419","manufacturer_id":"SPOT-TRACE-01","brand_name":"Spot","product_name":"SPOT Trace GPS Tracker","long_description":"The rugged, waterproof and compact SPOT Trace GPS Tracker mounts discretely to your valuables, offering you peace of mind with its theft alerts and movement tracking anywhwere around the world. Satellite network tracks the whereabouts of your vehicle, boat or other mobile assets on your online SPOT account, and sends a text/email message when new movement is detected. Subscribe to Basic service ($99.99 yearly) to track GPS coordinates every 5, 10, 30 or 60 minutes; Add Extreme Tracking (additional $99.99 yearly) to track every 2.5 minutes. Motion-activated tracking uses vibration sensors to send GPS coordinates only when Trace is moving; when stationary for 5 minutes, Trace enters Suspended Track mode. Automatic Stop Message from the resting location at the next tracking interval lets you know your asset is no longer moving. The SPOT Trace GPS Tracker also sends Daily Status, Low Battery and Power Off alerts. For a boat, Dock mode helps eliminate false tracks caused by wave movement. Compact size helps ensure easy, unnoticeable mounting; includes reversible mounting bracket, industrial double-sided tape, adhesive grip pad and adhesive rip-and-stick strips. SPOT Trace GPS Tracker operates in temperatures ranging from -22deg to 140degF (-30deg to 60degC) and from -328 to 21,320 ft. (-100 to 6,500m) altitude. Includes 4 AAA rechargeable lithium batteries that last up to 4.5 months (with clear skies and tracking movement of 1 hour per day at 5 min. intervals). Optional line power is also available via microUSB port (cable not included). Note: Trace requires an active SPOT subscription, credit card information and valid email address; current SPOT customers can log into existing accounts to activate Trace.","short_description":"The rugged, waterproof and compact SPOT Trace GPS Tracker mounts discretely to your valuables, offering you peace of mind with its theft alerts and movement tracking anywhwere around the world.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Plbs And Satellite Messengers","thumb_url":"http://i1.avlws.com/115/s440063.png","image_url":"http://i1.avlws.com/115/l440063.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=440063&tt=df","keywords":"personal locator beacons,beacon,plb,locator","retail_price":"99.95","sale_price":"99.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=440063\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m440063.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869419&amp;link=&amp;tabs=-Details\"></script>","variants":{"8694190001":{"sku":"8694190001","vendor_sku":"SPOT-TRACE-01","upc":"893049001578","color":"BLACK","retail_price":"99.95","sale_price":"99.95"}},"categories":["camping-hiking","camp-electronics","plbs-and-satellite-messengers"]}
