{"sku":"869538","manufacturer_id":"130 302 515","brand_name":"Native Eyewear","product_name":"Native Eyewear Sprint Polarized Sunglasses - 2013 Closeout","long_description":"The Native Eyewear Sprint Polarized Sunglasses include 2 pairs of lenses that you can swap out as light conditions change throughout your day. Snap-Back(TM) Interchange lens system lets you switch lenses to accommodate a variety of light conditions and activities. Polarized gray-tinted lenses are ideal for extremely bright sunlight; Sportflex(TM) rose-tinted lenses have a mirror coating suitable for low-light conditions. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. SportFlex lenses block 40% of infrared light to decrease eye fatigue, offer blue light filtering and 100% UV protection to minimize haze and enhance clarity. Lightweight frames are flexible and durable enough to withstand high-velocity collisions; they also endure extreme highs and lows in temperature. Vents incorporated into the top of the frames enhance airflow and help eliminate fog and condensation. Nonslip temple ends and adjustable, nonslip nose pads; cam-action hinges. The Native Sprint Polarized Sunglasses are sized to best fit medium-large profiles. Closeout.","short_description":"The Native Eyewear Sprint Polarized Sunglasses include 2 pairs of lenses that you can swap out as light conditions change throughout your day.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s463487.png","image_url":"http://i1.avlws.com/115/l463487.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463487&tt=df","keywords":"Cycling","retail_price":"129.00","sale_price":"76.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463487\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463487.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869538&amp;link=&amp;tabs=-Details\"></script>","variants":{"8695380001":{"sku":"8695380001","vendor_sku":"130 302 515","upc":"764824005268","size":"BROWN","color":"ASPHALT","retail_price":"76.73","sale_price":"76.73"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
