{"sku":"869652","manufacturer_id":"949207","brand_name":"Burley","product_name":" Burley Honey Bee Bike Trailer with Stroller Kit - Double","long_description":"With room to seat 2 kids, the Burley Honey Bee Bike Trailer includes a stroller kit so you can tow it to your destination, detach it from your bike, then flip down the stroller wheel and stroll away! Includes an easy-to-use bike tow bar, which enables you to pull the Burley Honey Bee by bike; hitch positioning is designed for superior trailer tracking. Included Stroller Kit features a single, easy-tracking front wheel for easy strolling and walking; wheel can be folded up out of the way for use with bike tow bar. The Burley Honey Bee Bike Trailer is decked out with fresh updates including an easy-to-latch folding system, a strong parking brake and a 2-in-1 non-zip weather cover. Height-adjustable handlebar doubles as a roll bar; rear tailgate offers easy access to rear cargo. Comfy suspended seat is built with breathable flow-through mesh and a helmet pocket; 5-point harness system with padded shoulder straps keeps children comfortable and secure. 20 in. alloy wheels with wheel guards roll easily and can be removed with a simple push of a button. Reflectors, reflective trim and safety flag provide low-light visibility; tinted windows have UV protection. Folds quickly and compactly for easy storage; folded dimensions are 37 x 24.5 x 11. The Burley Honey Bee Bike Trailer with Stroller Kit includes bike tow bar and hitch, stroller kit, safety flag and manual.","short_description":"With room to seat 2 kids, the Burley Honey Bee Bike Trailer includes a stroller kit so you can tow it to your destination, detach it from your bike, then flip down the stroller wheel and stroll away!","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trailers","thumb_url":"http://i1.avlws.com/115/s376811.png","image_url":"http://i1.avlws.com/115/l376811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=376811&tt=df","keywords":"baby,trsp123","retail_price":"399.00","sale_price":"399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=376811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m376811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869652&amp;link=&amp;tabs=-Details\"></script>","variants":{"8696520001":{"sku":"8696520001","vendor_sku":"949207","upc":"840840007872","color":"RED","retail_price":"399.00","sale_price":"399.00"}}}
