{"sku":"869602","manufacturer_id":"W378337","brand_name":"Vibram","product_name":" Vibram FiveFingers KMD Sport LS Multisport Shoes - Women's - 2013 Closeout","long_description":"From track to gym floor, the women's Vibram FiveFingers KMD Sport LS Multisport Shoes offer a snug, comfortable barefoot feel that's easily adjusted by a quick-lace system. Stretchy uppers hug feet and offer quick-drying comfort; breathable stretch-mesh panels keep debris and grit out. Zero drop from heel to toe encourages a natural midfoot or forefoot strike to promote forward momentum and reduce the impact of heel striking. Quick-lace closure system and locking buckle allow for a snug, personalized fit with just a single pull; lace end secures with small rip-and-stick tab. AEGIS Microbe Shield(R) antimicrobial treatment helps control odor development. Individual toe slots enhance dexterity, control and stability to help deliver a natural motion. Seamless 2mm polyurethane footbeds reduce friction underfoot for a stable, comfortable platform; EVA arch shanks help provide light support. 4mm Vibram outsoles are made of nonmarking Vibram TC1 rubber and feature traction pods that follow the contours of your feet and toes for enhanced traction. Recommended for running and fitness; in order to allow your feet to adapt to using different muscles, gradually increase usage of these shoes. Women's Vibram FiveFingers KMD Sport LS Multisport Shoes are machine washable in cold water; air dry only. To determine size, stand with heels against a wall and measure from the wall to the tip of the longest toe; use the longest toe length in conjunction with the size chart. Closeout.","short_description":"From track to gym floor, the women's Vibram FiveFingers KMD Sport LS Multisport Shoes offer a snug, comfortable barefoot feel that's easily adjusted by a quick-lace system.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s388167.png","image_url":"http://i1.avlws.com/115/l388167.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=388167&tt=df","retail_price":"110.00","sale_price":"74.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=388167\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m388167.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869602&amp;link=&amp;tabs=-Details\"></script>","variants":{"8696020001":{"sku":"8696020001","vendor_sku":"W378337","upc":"486960200016","size":"37","color":"BLACK/CORAL","retail_price":"74.73","sale_price":"74.73"}},"categories":["footwear","womens-footwear","womens-shoes"]}
