{"sku":"869653","manufacturer_id":"946202","brand_name":"Burley","product_name":"Burley Bee Bike Trailer","long_description":"A simple, durable and dependable trailer without the premium price tag, the Burley Bee Bike Trailer offers seating for 1 or 2 children and 100 lbs. of carrying capacity. Includes an easy-to-use bike tow bar, which enables you to pull the Burley Bee by bike; hitch positioning is designed for superior trailer tracking. Rear tailgate offers easy access to rear cargo, and a 2-in-1 non-zip cover offers protection from the weather and easy viewing. Comfy suspended seat is built with breathable flow-through mesh and a helmet pocket; 5-point harness system with padded shoulder straps keeps children comfortable and secure. 20 in. alloy wheels with wheel guards roll easily and can be removed with a simple push of a button. Reflectors, reflective trim and safety flag provide low-light visibility; tinted windows have UV protection. Folds quickly and compactly for easy storage; folded dimensions are 37 x 25 x 11 in. The Burley Bee Bike Trailer includes bike tow bar and hitch, cover, safety flag and manual.","short_description":"A simple, durable and dependable trailer without the premium price tag, the Burley Bee Bike Trailer offers seating for 1 or 2 children and 100 lbs. of carrying capacity.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Trailers","thumb_url":"http://i1.avlws.com/115/s454071.png","image_url":"http://i1.avlws.com/115/l454071.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454071&tt=df","keywords":"baby,trsp123","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454071\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454071.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869653&amp;link=&amp;tabs=-Details\"></script>","variants":{"8696530001":{"sku":"8696530001","vendor_sku":"946202","upc":"840840007865","color":"YELLOW","retail_price":"299.00","sale_price":"299.00"}},"categories":["cycling","bike-accessories","bike-trailers"]}
