{"sku":"869830","manufacturer_id":"S7ARFW-343","brand_name":"Skullcandy","product_name":"Skullcandy Air Raid Portable Speaker","long_description":"A portable party in a box, the drop-proof and water-resistant Skullcandy Air Raid Portable Speaker connects wirelessly to any Bluetooth-enabled device and pumps out intense sound on the go. Bluetooth wireless connection reaches up to 33 ft. without interference and connects up to 2 devices simultaneously (only 1 device's audio will be heard at any one time). Control music tracks directly from the Air Raid speaker with Track Forward and Track Backward buttons. Two 50mm drivers deliver rich audio with 5 watts each at up to 88 decibels without sacrificing quality; for 360deg sound, position the speakers facing up. The Skullcandy Air Raid Portable Speaker handles relentless outdoor use with a rugged design that stands up to drops, splashes, and heavy rain. Rechargeable battery lets you play your music louder and longer, with up to 14 hrs. play time at mid volume, 10 hrs. at mid/high volume and 5 hrs. at max volume. In addition to Bluetooth wireless connectivity, Air Raid supports wired auxiliary with a 3.5mm Audio In jack. Comes with a micro USB to AC charging adapter.","short_description":"A portable party in a box, the drop-proof and water-resistant Skullcandy Air Raid Portable Speaker connects wirelessly to any Bluetooth-enabled device and pumps out intense sound on the go.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s412939.png","image_url":"http://i1.avlws.com/115/l412939.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=412939&tt=df","retail_price":"149.95","sale_price":"149.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=412939\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m412939.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869830&amp;link=&amp;tabs=-Details\"></script>","variants":{"8698300001":{"sku":"8698300001","vendor_sku":"S7ARFW-343","upc":"878615070790","color":"BLACK","retail_price":"149.95","sale_price":"149.95"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
