{"sku":"869897","manufacturer_id":"LD41L2BK-B","brand_name":"Fenix","product_name":" Fenix Fenix LD41 Flashlight","long_description":"It might be pocket-sized, but this flashlight packs a serious punch. The Fenix LD41 flashlight puts out a powerful 680 lumen beam to light up the darkest trails. High-intensity Cree XL-L2 LED operates in 4 brightness levels and 2 flashing modes to meet all your lighting needs. Choose between turbo, high, mid and low to light up the trail or for use around camp; a standard strobe and an SOS strobe come in handy when signaling. Standard strobe puts out 520 lumens and the SOS strobe 80 lumens. 4 AA batteries provide 1 hr. 15 min. of run time on turbo, 5 hrs. 45 min. on high, 21 hrs. on medium and 150 hrs. on low. Intelligent memory circuit remembers the brightness level you were using when you turned the light off and automatically turns on at that level next time. Regulator maintains consistent light output over the lifetime of the batteries. Rugged aircraft-grade aluminum body is scratch resistant; flat body is comfortable to hold. Fenix LD41 flashlight has an IPX8 water resistance rating for protection against prolonged immersion in water deeper than 1m (3.3 ft.). Flashlight measures 1.6 x 6.9 in. Includes a holster, lanyard and a spare O-ring.","short_description":"It might be pocket-sized, but this flashlight packs a serious punch. The Fenix LD41 flashlight puts out a powerful 680 lumen beam to light up the darkest trails.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s444531.png","image_url":"http://i1.avlws.com/115/l444531.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=444531&tt=df","retail_price":"78.95","sale_price":"78.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=444531\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m444531.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869897&amp;link=&amp;tabs=-Details\"></script>","variants":{"8698970001":{"sku":"8698970001","vendor_sku":"LD41L2BK-B","color":"BLACK","retail_price":"78.95","sale_price":"78.95"}}}
