{"sku":"869979","manufacturer_id":"EC-20396010","brand_name":"Eagle Creek","product_name":"Eagle Creek Flip Switch Wheeled Convertible Luggage - 28\" - 2013 Overstock","long_description":"The Eagle Creek 28 in. Flip Switch Wheeled Convertible Luggage has a versatile design that lets you wheel it or carry it as a backpack with a detachable suspension system hidden in the front panel. In an innovative move, the backpack suspension system is located on the front of the luggage, so the wheels and rigid handle stay away from your back. Contoured shoulder straps and padded hip belt feature dual-density foam and a moisture-wicking air-mesh back panel for comfort; sternum strap (with whistle) secures pack. Suspension zips cleanly away in front panel when not in use; simply unclip and remove the straps when you want to save weight. Hidden, padded quick-stash zippered pocket in the suspension back panel secures a passport, tablet or e-reader. Secondary, larger slip pocket behind removable suspension system can also hold a tablet, papers or magazines. Lockable, self-repairing zippers have finger-friendly zipper pulls; luggage locks sold separately. Interior compression straps help secure load. Large interior and exterior pockets provide additional organization. Oversize super-tread wheels with protective housing guards roll easily over urban obstacles. Handle extends smoothly and offers a comfortable grip; cleanly zips away when not deployed. Durable bag features rugged corner guards, reinforced hypalon material blocking, bumper protection and reinforced bartacks. Includes an ID tag, reflective accents for dusk and nighttime visibility and a zippered, gusseted water bottle pocket on the side. Bag weights 8 lbs. 6 oz. (including shoulder straps and hipbelt). Overstock.","short_description":"The Eagle Creek 28 in. Flip Switch Wheeled Convertible Luggage has a versatile design that lets you wheel it or carry it as a backpack with a detachable suspension system hidden in the front panel.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s433991.png","image_url":"http://i1.avlws.com/115/l433991.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433991&tt=df","retail_price":"310.00","sale_price":"199.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433991\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433991.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869979&amp;link=&amp;tabs=-Details\"></script>","variants":{"8699790001":{"sku":"8699790001","vendor_sku":"EC-20396010","upc":"486997900019","size":"28 IN","color":"BLACK","retail_price":"199.73","sale_price":"199.73"}},"categories":["travel","luggage","wheeled-luggage"]}
