{"sku":"869920","manufacturer_id":"PD12L2BK-B","brand_name":"Fenix","product_name":" Fenix PD12 Flashlight","long_description":"With a powerful 360-lumen beam and 4 brightness levels, the Fenix PD12 flashlight sheds a little-or a lot-of light on the issue at hand without weighing down your pack. Features 3 brightness levels plus a burst mode that outputs a stunning 360-lumen beam that shines 120m (394 ft.) to illuminate the darkest forests and trails. High-quality Cree XP-G LED bulb outputs 200 lumens on high, 80 lumens on medium and 10 lumens on low. Click the side switch to turn flashlight on; press and hold down for burst mode, let go to exit burst mode; single clicks rotate through the brightness levels. PD12 remembers the last output level, so the next time you turn it on it starts where you left off. 1 CR123A lithium battery (included) provides 60 hrs. of runtime on low, 6 hrs. 30 min. on medium, 2 hrs. 30 min. on high. Regulated output maintains consistent light output over the lifetime of the batteries. Rugged aircraft-grade aluminum body is designed to resist rolling and has a knurled finish for good grip; flashlight resists impact up to 1 meter. PD12 flashlight has an IPX8 water resistance rating for protection against prolonged immersion in water up to 2m deep. The Fenix PD12 flashlight measures a mere 3 x 1 in., making it easy to carry in a purse, pack or coat pocket.","short_description":"With a powerful 360-lumen beam and 4 brightness levels, the Fenix PD12 flashlight sheds a little-or a lot-of light on the issue at hand without weighing down your pack.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416955.png","image_url":"http://i1.avlws.com/115/l416955.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416955&tt=df","retail_price":"49.95","sale_price":"49.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416955\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416955.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869920&amp;link=&amp;tabs=-Details\"></script>","variants":{"8699200001":{"sku":"8699200001","vendor_sku":"PD12L2BK-B","color":"BLACK","retail_price":"49.95","sale_price":"49.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
