{"sku":"869904","manufacturer_id":"673040809853","brand_name":"Spy","product_name":"Spy Cutter Polarized Interchangeable Sunglasses - Men's","long_description":"With understated fashion and glare protection, the Spy Cutter Polarized Interchangeable Sunglasses offer technologically advanced performance for a wide range of activities and light conditions. Matte Black/White frames come with 2 pairs of lenses: bronze for bright sunlight and rose for filtered light and overcast conditions. Fast Track lens replacement system lets you customize your sunglasses when light conditions change; simply pop, pull and replace. Polarized lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Lenses are treated with a unique coating that repels moisture and oils, helping keep sweat and grease from clouding your vision. Lightweight Grilamid frame resists stress cracks and material fatigue, and stands up well against UV exposure and extreme temperatures. Patented Scoop ventilation system forces air through strategically placed vents to combat lens fogging. The Spy Cutter Polarized Interchangeable Sunglasses feature Hytrel rubber nose pads and temple tips that get tacky with moisture to help keep your shades securely on your face.","short_description":"With understated fashion and glare protection, the Spy Cutter Polarized Interchangeable Sunglasses offer technologically advanced performance for a wide range of activities and light conditions.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s452739.png","image_url":"http://i1.avlws.com/115/l452739.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=452739&tt=df","keywords":"Cycling","retail_price":"219.95","sale_price":"219.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=452739\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m452739.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869904&amp;link=&amp;tabs=-Details\"></script>","variants":{"8699040001":{"sku":"8699040001","vendor_sku":"673040809853","upc":"648478739727","size":"POLAR AND ROSE","color":"MATTE BLACK/WHITE","retail_price":"219.95","sale_price":"219.95"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
