{"sku":"869924","manufacturer_id":"79997-0001","brand_name":"Levi's","product_name":"Levi's Commuter Series Hooded Trucker Jacket - Men's - 2013 Closeout","long_description":"The men's Levi's Commuter Series Hooded Trucker Jacket blends right in with the urban environment of an everyday bike commute. Its ride-friendly features keep you comfortable on and off the bike. Stretch denim fabric comfortably moves with you, whether you're riding or hanging out at your favorite spot. Water-resistant and dirt-repellent Schoeller NanoSphere(R) protective finish helps fend off light rain, mud and road grit. Thin, roll-away hood with brim resists moisture and fits smoothly under a helmet to retain heat during chilly rides. 2 rear pockets across lower back have flaps to help keep contents secure. 2 hand pockets; 2 button-flap chest pockets; left-side chest pocket with an earphone port for your media player. Extended tail and sleeves offer good coverage when you're riding; back vent encourages airflow. Odor-resistant finish. Levi's Commuter Series Hooded Trucker Jacket has a regular fit and a hem that hits just below the hip; 27.25 in. back length. Closeout.","short_description":"The men's Levi's Commuter Series Hooded Trucker Jacket blends right in with the urban environment of an everyday bike commute. Its ride-friendly features keep you comfortable on and off the bike.","category":"Cycling","subcategory":"Cycling Clothing","product_group":"Cycling Jackets","thumb_url":"http://i1.avlws.com/115/s462303.png","image_url":"http://i1.avlws.com/115/l462303.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=462303&tt=df","retail_price":"148.00","sale_price":"95.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=462303\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m462303.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869924&amp;link=&amp;tabs=-Details\"></script>","variants":{"8699240005":{"sku":"8699240005","vendor_sku":"79997-0001","upc":"887035647093","size":"XXL","color":"PERFORMANCE FOREST","retail_price":"95.73","sale_price":"95.73"}},"categories":["cycling","cycling-clothing","cycling-jackets"]}
