{"sku":"869946","manufacturer_id":"101278","brand_name":"Fritschi Diamir","product_name":" Fritschi Diamir Vipec 12 Randonee Bindings with Brakes - 2013/2014","long_description":"Built for tough mountaineering challenges and long backcountry tours, the powerful Fritschi Diamir Vipec 12 Randonee Bindings with Brakes balance ski performance, ease of use and reliable release. Similar to the release system found in downhill bindings, the lateral release in the toe units occurs in 2 phases to release when you need it to but not when you don't. Heel units are on gliding plates that ensure the bindings have consistent contact pressure on the boots, even when the skis are significantly bent. Getting in the bindings is quick and easy-simply move the tips of your boots forward over the step-in bracket in the toe units and press down to click in. Unlike other tech-style bindings, the toe pieces on the Vipec bindings will release even when you're in uphill touring mode, but only when you need them to. Quickly switch back-and-forth between ski and tour mode by flipping the rear levers up or down with a pole; there's no need to release from the bindings to switch modes. Nonrotating heel pieces create a very stable platform for excellent control and power transfer to the skis. Heel pieces include flip-up climbing bars that can be changed easily with a ski pole; raise your heels to 9deg or 13deg depending on the steepness of the hill. Bindings include ski brakes to prevent runaway skis; choose from 120mm- or 108mm-wide brakes depending on your ski width. Choose the size that's just wider than the underfoot width of your skis; for example, choose 108mm size for 105mm-waisted skis. Fritschi Diamir Vipec 12 Randonee Bindings with Brakes have adjustable DIN release settings from 5 - 12. Compatible with boots featuring tech system toe and heel attachments, such as those found on all Dynafit boots and select styles of Garmont and Scarpa boots. Compatible with the Fritschi Diamir Traxion Crampons, not included.","short_description":"Built for tough mountaineering challenges and long backcountry tours, the powerful Fritschi Diamir Vipec 12 Randonee Bindings with Brakes balance ski performance, ease of use and reliable release.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Randonee Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381699.png","image_url":"http://i1.avlws.com/115/l381699.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381699&tt=df","retail_price":"599.95","sale_price":"599.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381699\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381699.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869946&amp;link=&amp;tabs=-Details\"></script>","variants":{"8699460001":{"sku":"8699460001","vendor_sku":"101278","size":"108 MM","color":"BLACK/WHITE","retail_price":"599.95","sale_price":"599.95"}},"categories":["snow","ski-bindings","randonee-ski-bindings"]}
