{"sku":"869919","manufacturer_id":"TK75L2BK-BC","brand_name":"Fenix","product_name":"Fenix TK75 Flashlight","long_description":"The rechargeable Fenix TK75 Flashlight has a searing 2,900-lumen beam to turn night into day when you're searching for a trail or navigating your way through a dark campsite. 3 Cree XM-L (U2) LEDs each have their own reflector to throw a stunning white beam more than 690m (2,264 ft.). Features 4 brightness levels to meet your needs; flashlight outputs 2,600 lumens on turbo, 1,100 lumens on high, 40 lumens on medium and 18 lumens on low. Standard strobe mode outputs 2,900 lumens and SOS strobe mode outputs 400 lumens for effective signaling. Includes four 18650 rechargeable batteries that power the flashlight for 1 hr. 15 min. on turbo, 4 hrs. on high, 12 hrs. on medium and 200 hrs. on low. Recharge the batteries at home or in your car with the included charger. Regulated output maintains consistent light output over the lifetime of the batteries. Rugged aircraft-grade aluminum body is anodized to withstand regular use in harsh environments. Dual-button switch on the neck of the flashlight makes it easy to navigate between modes. Stand the flashlight up on its flat tail cap for use as a candle. The Fenix TK75 rechargeable flashlight has an IPX8 water resistance rating for protection against prolonged immersion in water deeper than 1m (3.3 ft.). Includes a carrying case, 4 rechargeable batteries, battery charger, lanyard and spare O-rings.","short_description":"The rechargeable Fenix TK75 Flashlight has a searing 2,900-lumen beam to turn night into day when you're searching for a trail or navigating your way through a dark campsite.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s454991.png","image_url":"http://i1.avlws.com/115/l454991.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454991&tt=df","retail_price":"274.95","sale_price":"274.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454991\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454991.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=869919&amp;link=&amp;tabs=-Details\"></script>","variants":{"8699190001":{"sku":"8699190001","vendor_sku":"TK75L2BK-BC","color":"BLACK","retail_price":"274.95","sale_price":"274.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
