{"sku":"870110","manufacturer_id":"16713","brand_name":"Rei","product_name":"REI Stratocruiser Wheeled Backpack - 26\"","long_description":"A new breed of light and versatile multiday luggage, the REI Stratocruiser 26 Wheeled Backpack comes with a full-featured removable daypack. Tubular aluminum frame combines with lightweight nylon fabric to keep overall weight low-just 7 lbs. 12 oz. Removable daypack rides in a pocket that doubles as a stow pocket; compression straps snug the pocket to fit its contents; weight with daypack removed is cut to 6 lbs. 9 oz. Padded shoulder straps and hipbelt let you comfortably carry this luggage as a backpack; hipbelt detaches and \"leave behind\" panel also lets you detach the harness. When you want to travel ultralight by removing the daypack, harness and hipbelt, you reduce total weight down to just 5 lbs. 10 oz. Both the shoulder straps and hipbelt stow behind a zippered panel to create a clean exterior when checking as baggage. Daypack has a padded tablet-size sleeve and multiple pockets; long main zipper is designed to allow access when the daypack is worn over one shoulder. Telescoping pull handle locks in up/down position and has a soft grip; rugged wheels roll smoothly over a variety of surfaces. Bottom kickstand lets you park it upright; kickstand also doubles as a grab handle. Main pack's organization features include interior compression straps and mesh pockets, and an outer zip pocket . Exterior zippers on the Stratocruiser 26 Wheeled Luggage can be secured with standard travel locks, sold separately.","short_description":"A new breed of light and versatile multiday luggage, the REI Stratocruiser 26 Wheeled Backpack comes with a full-featured removable daypack.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s458895.png","image_url":"http://i1.avlws.com/115/l458895.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458895&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458895\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458895.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=870110&amp;link=&amp;tabs=-Details\"></script>","variants":{"8701100001":{"sku":"8701100001","vendor_sku":"16713","upc":"487011000012","color":"ASPHALT","retail_price":"299.00","sale_price":"299.00"},"8701100002":{"sku":"8701100002","vendor_sku":"16713","upc":"487011000029","color":"GRASSHOPPER","retail_price":"299.00","sale_price":"299.00"}},"categories":["travel","luggage","wheeled-luggage"]}
