{"sku":"870110","manufacturer_id":"16713","brand_name":"Rei","product_name":"REI Stratocruiser Wheeled Luggage - 26\"","long_description":"The REI Stratocruiser 26 Wheeled Luggage combines the ease of wheeled luggage with the flexibility of a backpack. It's big enough for longer trips and includes a detachable daypack for versatility. Backpack-style shoulder harness, lumbar pad and padded waistbelt provide a great fit and comfortable carrying; suspension system hides cleanly away with a single zipper. A handy detachable daypack secures to the main pack via front-panel buckles and a zipper, or slide it over the telescoping handle of the main bag. Daypack has a an organizer panel and back security pocket; interior neoprene pocket fits tablets and most 13 in. laptops. Rugged wheels and housings help the bag roll smoothly; kickstand lets you park it upright. Rugged telescopic pull handle locks in up/down position and has a soft handle grip. Interior frame provides structure; top and side grab handles ease hauling. Panel-opening zipper provides easy access to main compartment; mesh pockets and compression straps help organize the interior. Main front zip pocket is roomy enough for a jacket; side stash pocket has an elastic closure. Exterior zippers on the Stratocruiser 26 Wheeled Luggage can be secured with standard travel locks, sold separately.","short_description":"The REI Stratocruiser 26 Wheeled Luggage combines the ease of wheeled luggage with the flexibility of a backpack. It's big enough for longer trips and includes a detachable daypack for versatility.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Wheeled Luggage","thumb_url":"http://i1.avlws.com/115/s458895.png","image_url":"http://i1.avlws.com/115/l458895.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458895&tt=df","retail_price":"299.00","sale_price":"299.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458895\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458895.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=870110&amp;link=&amp;tabs=-Details\"></script>","variants":{"8701100001":{"sku":"8701100001","vendor_sku":"16713","upc":"487011000012","color":"ASPHALT","retail_price":"299.00","sale_price":"299.00"},"8701100002":{"sku":"8701100002","vendor_sku":"16713","upc":"487011000029","color":"GRASSHOPPER","retail_price":"299.00","sale_price":"299.00"}},"categories":["travel","luggage","wheeled-luggage"]}
