{"sku":"870415","manufacturer_id":"OU9627-314","brand_name":"Mountain Hardwear","product_name":" Mountain Hardwear Archer 3 Tent - 2013 Closeout","long_description":"Quick and easy to pitch, the spacious Mountain Hardwear Archer 3 Tent offers generous interior volume and a highly durable material ready to give you backcountry protection from the elements. Easy access with 2 side doors and 2 dry-entry vestibules; vestibule design creates a dry storage area and helps prevent water from reaching the tent floor. DAC Featherlite(R) poles have a high strength-to-weight ratio; they use extrusions to minimize breakage and are anodized without the use of harmful acids. Evolution Tension Arch(TM) stabilizes tent using fewer poles. SVX window offers a bright interior and visibility of exterior conditions. Reflective guyout loops, starter point and zipper pulls ensure easy set-up at night. Superlight buckles and webbing save weight; canopy storage pockets help keep your tent organized. Guaranteed watertight construction with fully taped fly, taped perimeter seams, welded corners and welded guy clip anchors. Fly, footprint (not included) and poles pitch without the canopy to create a lightweight shelter. The Mountain Hardwear Archer 3 Tent comes with stuff sacks, aluminum stakes and owner's manual. Closeout.","short_description":"Quick and easy to pitch, the spacious Mountain Hardwear Archer 3 Tent offers generous interior volume and a highly durable material ready to give you backcountry protection from the elements.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424283.png","image_url":"http://i1.avlws.com/115/l424283.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424283&tt=df","retail_price":"400.00","sale_price":"299.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424283\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424283.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=870415&amp;link=&amp;tabs=-Details\"></script>","variants":{"8704150001":{"sku":"8704150001","vendor_sku":"OU9627-314","upc":"786559872564","color":"GREEN MOUNTAIN","retail_price":"299.73","sale_price":"299.73"}},"categories":["camping-hiking","tents","backpacking-tents"]}
