{"sku":"870411","manufacturer_id":"OU8498-029","brand_name":"Mountain Hardwear","product_name":" Mountain Hardwear Hibachi 45 Sleeping Bag - Regular - 2013 Closeout","long_description":"Explore the outdoors on mild spring, summer and fall nights with the regular-length Mountain Hardwear Hibachi 45 Sleeping Bag with water-repellent 600-fill down. With a European Norm (EN) lower-limit rating of 40degF the Hibachi 45 is ideal for lightweight 3-season adventures on warm nights in the mountains. Insulated with lightweight and compressible Q.Shield 600-fill-power goose down to keep you warm. Q.Shield DOWN advance water repellency technology protects individual down fibers from moisture so they retain loft and insulation properties; Q.Shield won't wear off. Comfort mummy cut gives you room to move around while maintaining great warmth. 30-denier ripstop nylon shell is lightweight and tear resistant; fabric is treated with a durable water repellent finish to repel moisture. Tight, 5-in. baffle spacing keeps down from shifting and prevents cold spots. Insulated draft tube extends to bottom of bag to eliminate cold spots. Multi-baffled, tailored hood lies close along the sides of neck and face for easy warmth. Ergonomic collar drapes comfortably over neck and shoulders, sealing out drafts; no need to cinch it unless the temperature outside is close to bag's limit. When it's cold enough to cinch down the hood, the down-insulated face gasket snugs comfortably and holds in warmth. Full-length, 2-way zipper has locking sliders that stay in place when bag is partially unzipped for ventilation. Comfort footbox is shaped to allow feet to rest naturally; shape preserves loft and allows insulation to drape close to feet for warmth. Mountain Hardwear Hibachi 45 Sleeping Bag comes with a mesh storage sack and stuff sack. European Norm (EN) is an independent third-party temperature rating, allowing accurate comparisons across brands with other EN-rated bags. Closeout.","short_description":"Explore the outdoors on mild spring, summer and fall nights with the regular-length Mountain Hardwear Hibachi 45 Sleeping Bag with water-repellent 600-fill down.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421923.png","image_url":"http://i1.avlws.com/115/l421923.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421923&tt=df","keywords":"compact","retail_price":"275.00","sale_price":"205.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421923\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421923.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=870411&amp;link=&amp;tabs=-Details\"></script>","variants":{"8704110001":{"sku":"8704110001","vendor_sku":"OU8498-029","upc":"786559901356","size":"Regular Left","color":"GRAPHITE","retail_price":"205.73","sale_price":"205.73"},"8704110002":{"sku":"8704110002","vendor_sku":"OU8498-029","upc":"786559901363","size":"Regular Right","color":"GRAPHITE","retail_price":"205.73","sale_price":"205.73"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
