{"sku":"870637","manufacturer_id":"BJ35436","brand_name":"Baby Jogger","product_name":"Baby Jogger F.I.T. Stroller - Single","long_description":"Built for speed and safety, the Baby Jogger F.I.T. single stroller is a foldable, durable and easy-to-use jogging stroller designed for active parents. Baby Jogger-patented Quick-Fold design ensures easy transport and storage; 1-step folding process allows stroller to fold with the simple lift of a strap. Hand-operated brake supplies responsive braking power and added control on hilly terrain, and fixed front wheel keeps you on course so you can run straight and fast. 16 in. quick-release molded polymer wheels are outfitted with pneumatic tires to roll smoothly on varied terrain. Plush padded seat (back is vented) reclines to enhance child's comfort; retractable weather cover helps protect child from sun and sprinkles. Multiposition sun canopy with clear view window securely closes with magnets; won't pinch fingers. Adjustable, 5-point padded safety harness with padded shoulder straps keeps child comfortably secure. Bring all the baby gear and more, thanks to the expanding seat back storage compartment and large storage basket under the seat. The Baby Jogger F.I.T. single stroller has a 75 lb. weight capacity.","short_description":"Built for speed and safety, the Baby Jogger F.I.T. single stroller is a foldable, durable and easy-to-use jogging stroller designed for active parents.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s453715.png","image_url":"http://i1.avlws.com/115/l453715.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=453715&tt=df","retail_price":"300.00","sale_price":"300.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=453715\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m453715.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=870637&amp;link=&amp;tabs=-Details\"></script>","variants":{"8706370001":{"sku":"8706370001","vendor_sku":"BJ35436","upc":"745146354364","color":"SLATE/CRIMSON","retail_price":"300.00","sale_price":"300.00"}},"categories":["fitness","running","strollers"]}
