{"sku":"870730","manufacturer_id":"LS140111","brand_name":"Laird Standup","product_name":" Laird StandUp Surfer EPS Composite Stand Up Paddleboard","long_description":"Refined through expert design, the Laird Surfer EPS Composite Stand Up Paddleboard is the ideal tool to get out on your favorite waters for touring, fitness and surf. The original Laird-Pearson shape represents the state of the art for all-around high performance. Unique shape with low-entry nose and round pintail paddles smoothly and accelerates quickly. Nose rides like a dream in surf and offers excellent maneuverability. At the heart of each board is a waterproof EPS core that's wrapped in fiberglass, then layered with a bamboo veneer for strength, durability and beauty. The result is a board that offers years of performance, responsive handing and high durability. Center fin and 2 side fins promote straight tracking in the water; integrated deck pad provides exceptional grip and reduces foot fatigue. Handle makes transporting your paddleboard a breeze.","short_description":"Refined through expert design, the Laird Surfer EPS Composite Stand Up Paddleboard is the ideal tool to get out on your favorite waters for touring, fitness and surf.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s447615.png","image_url":"http://i1.avlws.com/115/l447615.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=447615&tt=df","retail_price":"1679.00","sale_price":"1679.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=447615\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m447615.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=870730&amp;link=&amp;tabs=-Details\"></script>","variants":{"8707300001":{"sku":"8707300001","vendor_sku":"LS140107","size":"10 FT 6 IN","color":"BAMBOO/RED","retail_price":"1599.00","sale_price":"1599.00"}}}
