{"sku":"870788","manufacturer_id":"BJ31410","brand_name":"Baby Jogger","product_name":" Baby Jogger Summit X3 Stroller - Single","long_description":"The Baby Jogger Summit X3 Stroller boasts all-terrain versatility and a 1-handed, quick-folding design for easy transport and storage when your adventure is over. All-wheel independent suspension delivers a comfortable, smooth ride; 16 in. and 12 in. quick-release wheels have air-filled tires that roll smoothly on changing terrain. Front wheel can pivot freely for mobility or be locked for predictable tracking; front wheel lock can be easily engaged or disengaged while standing behind stroller. Hand-operated rear drum running brakes increase control on hills; stroller includes a parking brake to keep stroller steady when you stop. Main compartment for 1 child has an easy-to-secure, adjustable 5-point seatbelt system with comfy shoulder pads. Padded and adjustable reclining seat offers excellent passenger comfort; seat can recline to nearly-flat position for easy napping on the go. Multi-position sun canopy has top windows and side ventilation panels; retractable weather cover protects passenger if you're caught out in wet or windy weather. Sizeable seat back storage compartment and under-seat basket let you carry more stuff for longer outings. The Baby Jogger Summit X3 Stroller features a 75 lb. weight capacity.","short_description":"The Baby Jogger Summit X3 Stroller boasts all-terrain versatility and a 1-handed, quick-folding design for easy transport and storage when your adventure is over.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s453719.png","image_url":"http://i1.avlws.com/115/l453719.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=453719&tt=df","retail_price":"430.00","sale_price":"430.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=453719\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m453719.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=870788&amp;link=&amp;tabs=-Details\"></script>","variants":{"8707880002":{"sku":"8707880002","vendor_sku":"BJ31439","upc":"745146314399","color":"ORANGE/GRAY","retail_price":"430.00","sale_price":"430.00"}},"categories":["fitness","running","strollers"]}
