{"sku":"870803","manufacturer_id":"34251 55200","brand_name":"Deuter","product_name":" Deuter Futura 32 Pack - 2013 Closeout","long_description":"The Deuter Futura 32 Pack is perfectly sized and equipped for long day trips and quick weekend getaways. This technical pack takes you from forested trails to paved sidewalks in lightweight comfort. Contoured, padded shoulder straps are lined with air-mesh for breathability; they also feature \"load lifter\" stabilizing straps for ideal positioning of the pack. Soft, bi-laminate hip pads and hipbelt wrap your body, stabilizing and controlling lateral pack movement. Mesh ventilated back panel holds the pack body away from your back, enhancing airflow and reducing perspiration; spring steel frame transfers load weight to your hips. Main compartment has plenty of room for food, clothing and the 10 essentials; 2 side mesh pockets and 2 side bellows pockets are roomy enough for water bottles and snacks. Front pocket and 2 lid pockets store your map, GPS, headlamp and other often-used gear. Bottom compartment is separated from the rest of the pack, ideal for separating wet/dirty items. Hydration-compatible design features a 3-liter reservoir pocket and drink tube exit port for on-the-go hydration (reservoir not included). Side compression straps let you cinch down loads for jostle-free carrying. The Deuter Futura 32 Pack features a built-in raincover that can be pulled out in a flash, protecting contents from sudden downpours. Closeout.","short_description":"The Deuter Futura 32 Pack is perfectly sized and equipped for long day trips and quick weekend getaways. This technical pack takes you from forested trails to paved sidewalks in lightweight comfort.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410947.png","image_url":"http://i1.avlws.com/115/l410947.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410947&tt=df","keywords":"multiday","retail_price":"139.00","sale_price":"103.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410947\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410947.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=870803&amp;link=&amp;tabs=-Details\"></script>","variants":{"8708030002":{"sku":"8708030002","vendor_sku":"34251 55200","upc":"487080300020","color":"FIRE/CRANBERRY","retail_price":"103.73","sale_price":"103.73"}}}
