{"sku":"871025","manufacturer_id":"TZRPPIGBK","brand_name":"Smith","product_name":" Smith Trailblazer ChromaPop Polarchromic Sunglasses - Men's","long_description":"The rimless Smith Trailblazer ChromaPop Polarchromic Sunglasses give you unobstructed views of the surf, sand and sea. Advanced lenses offer auto-adjust tint, clarity, contrast and vivid colors. ChromaPop lenses use a proprietary technology to optimize color and increase clarity and definition, enabling you to see the outside world with exceptional vibrance. UV-sensitive, self-adjusting Polarchromic lenses respond to ambient light, offering crisp optics and soothing light levels from dawn until dusk. Polarized glass lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Black frame color features rose-tinted lenses, ideal for medium-to-bright light. The Smith Trailblazer ChromaPop Polarchromic Sunglasses feature a hydrophilic Megol nosepiece and temple ends that get tacky when wet for grip during exercise and hot weather. 53% bio-based Evolve frames are made with Rilsan(R) Clear, a light, durable, non-petroleum-based material derived from renewable, non-GMO castor plants.","short_description":"The rimless Smith Trailblazer ChromaPop Polarchromic Sunglasses give you unobstructed views of the surf, sand and sea. Advanced lenses offer auto-adjust tint, clarity, contrast and vivid colors.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423571.png","image_url":"http://i1.avlws.com/115/l423571.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423571&tt=df","keywords":"Cycling","retail_price":"239.00","sale_price":"239.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423571\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423571.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871025&amp;link=&amp;tabs=-Details\"></script>","variants":{"8710250001":{"sku":"8710250001","vendor_sku":"TZRPPIGBK","upc":"715757437565","size":"POLARCHROMIC IGNITOR","color":"BLACK","retail_price":"239.00","sale_price":"239.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
