{"sku":"871095","manufacturer_id":"R34AN 070","brand_name":"Petzl","product_name":"Petzl Arial 9.5mm x 70m Dry Rope","long_description":"With a 9.5mm diameter, the Petzl Arial 9.5mm x 70m Dry Rope is designed for experienced climbers, offering maximum longevity and performance in any conditions, thanks to its Duratec Dry treatment. Thin diameter makes the Arial versatile for experienced climbers; ideal for use in rock, mixed, snow and ice climbing. Duratec Dry treatment makes the rope more resistant to water, dirt and abrasion; handling and grip are retained longer in cold, wet conditions. Core and sheath are bonded together at the rope ends by an ultrasonic process to give greater durability and avoid frayed ends. Special EverFlex thermal treatment stabilizes the core strands and improves consistency; offers excellent grip and consistent handling over time. Middle of the rope is marked to facilitate setting up rappels. ClimbReady coil allows the rope to be used right out of the package; butterfly coil prevents tangles and kinking, just tie-in and start climbing. Kernmantle design features a stretchy core protected by a durable outer sheath which combine for strength and good handling. 70m length allows for extended leads and rappels on today's modern routes. Petzl Arial 9.5mm x 70m Dry Rope meets or exceeds UIAA tests for falls, impact force and elongation.","short_description":"With a 9.5mm diameter, the Petzl Arial 9.5mm x 70m Dry Rope is designed for experienced climbers, offering maximum longevity and performance in any conditions, thanks to its Duratec Dry treatment.","category":"Climbing","subcategory":"Climbing Ropes","product_group":"Single Ropes","thumb_url":"http://i1.avlws.com/115/s369551.png","image_url":"http://i1.avlws.com/115/l369551.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=369551&tt=df","keywords":"dynamic","retail_price":"260.00","sale_price":"260.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=369551\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m369551.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871095&amp;link=&amp;tabs=-Details\"></script>","variants":{"8710950001":{"sku":"8710950001","vendor_sku":"R34AN 070","color":"BLACK","retail_price":"260.00","sale_price":"260.00"}},"categories":["climbing","climbing-ropes","single-ropes"]}
