{"sku":"871163","manufacturer_id":"00151213","brand_name":"Sierra Designs","product_name":" Sierra Designs Flash 2 Tent - 2013 Closeout","long_description":"The Sierra Designs Flash 2 backpacking tent is extra roomy and ultralight. it sets up in a matter of seconds and has an integrated rainfly so the inner body of the tent stays dry during setup. ExoFusion setup combines an external frame with an integrated fly to speed setup and increase interior space. Less material saves weight: Exterior skeleton/hybrid wall construction allows double walls where necessary and single walls otherwise. Well-ventilated comfort: The exterior skeleton/hybrid wall construction allows effective vent placement and airflow planning that isn't possible with traditional construction. D-shape doors on the Sierra Designs Flash 2 provide roomy access; 2 vestibules provide separate storage areas. Light yet strong, DAC Featherlite(R) NSL poles are anodized without the use of harmful acids. Hub/pole design reduces the possibility of pitching errors and aids in the speed of the pitch. Jake's Feet(TM) corner anchor system locks poles in place during setup and aids in tensioning out the floor. Taped rainfly seams and a seam-sealed floor offer weatherproof protection. Reflective door trim and guyouts aid nighttime visibility of tent. Mesh windows have closeable flaps to prevent weather from creeping in. Includes stuff sacks, guylines, tent stakes, user guide and setup instructions. Closeout.","short_description":"The Sierra Designs Flash 2 backpacking tent is extra roomy and ultralight. it sets up in a matter of seconds and has an integrated rainfly so the inner body of the tent stays dry during setup.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424291.png","image_url":"http://i1.avlws.com/115/l424291.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424291&tt=df","retail_price":"339.95","sale_price":"270.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424291\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424291.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871163&amp;link=&amp;tabs=-Details\"></script>","variants":{"8711630001":{"sku":"8711630001","vendor_sku":"00151213","upc":"487116300017","color":"ICE BLUE","retail_price":"270.73","sale_price":"270.73"}},"categories":["camping-hiking","tents","backpacking-tents"]}
