{"sku":"871177","manufacturer_id":"100101","brand_name":"Thule","product_name":"Thule RideAlong Child Bike Seat","long_description":"Built with smart safety features and intuitive harness adjustments, the Thule RideAlong Child Bike Seat easily attaches to your bike so your little one can come along for the ride. Adjustable and fully padded 3 point harness provides maximum child safety and comfort. One-hand tilt function of up to 20deg, allows for 5 different reclining options. Single-hand adjustable foot straps and foot rests allow for convenience and flexibility as a child grows. Childproof safety buckle with large buttons quickly secures child. Integrated protection wings safeguard child's hands when bike is leaned against a wall. Universal quick release bracket allows seat removal from bike in seconds. Quick release bracket is lockable to prevent seat from being removed when locked (lock included). Detachable, water-repellant padding is machine washable and reversible, offering two color options. Thule has designed and tested this bike seat for children up to 48.5 lbs., from 1 - 6 years old (Thule suggests consulting a pediatrician for children under 1 yr.). The Thule RideAlong Child Bike Seat meets stringent safety standards (DIN EN 14344).","short_description":"Built with smart safety features and intuitive harness adjustments, the Thule RideAlong Child Bike Seat easily attaches to your bike so your little one can come along for the ride.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Child Bike Seats","thumb_url":"http://i1.avlws.com/115/s458567.png","image_url":"http://i1.avlws.com/115/l458567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458567&tt=df","keywords":"toddler","retail_price":"180.00","sale_price":"180.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871177&amp;link=&amp;tabs=-Details\"></script>","variants":{"8711770001":{"sku":"8711770001","vendor_sku":"100101","upc":"091021539624","color":"LIGHT GRAY","retail_price":"180.00","sale_price":"180.00"}},"categories":["cycling","bike-accessories","child-bike-seats"]}
