{"sku":"871250","manufacturer_id":"00596612XL","brand_name":"Sierra Designs","product_name":" Sierra Designs Wild Bill 35 Sleeping Bag - X Long - 2013 Closeout","long_description":"Warm, reliable and affordable, the extra-long, synthetic-fill Sierra Designs Wild Bill 35 Sleeping Bag is ideal for backpacking adventures in mild weather throughout spring, summer and fall. Heatsync(TM) polyester insulation has a high warmth-to-weight ratio and continues to insulate even if wet. With an EN lower-limit rating of 37degF, the Wild Bill 35 is great for 3-season, warm-weather trips. Offset layer construction eliminates cold spots at quilt lines and produces a high warmth-to-weight ratio. Snag-free zipper tracks prevent the dreaded stuck zipper by creating a barrier between the lining and the zipper. Draft tube backs the full-length zipper to prevent cold air from getting in. Stuff your jacket or camp pillow (not included) in the pillow pocket to increase comfort. Keep your watch or headlamp in the small chest pocket for easy access. Sierra Designs Wild Bill 35 Sleeping Bag comes with a stuff sack and storage bag. Closeout.","short_description":"Warm, reliable and affordable, the extra-long, synthetic-fill Sierra Designs Wild Bill 35 Sleeping Bag is ideal for backpacking adventures in mild weather throughout spring, summer and fall.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421943.png","image_url":"http://i1.avlws.com/115/l421943.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421943&tt=df","keywords":"compact","retail_price":"119.95","sale_price":"95.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421943\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421943.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871250&amp;link=&amp;tabs=-Details\"></script>","variants":{"8712500001":{"sku":"8712500001","vendor_sku":"00596612XL","upc":"054003708890","size":"XLong","color":"BISTRE","retail_price":"95.73","sale_price":"95.73"}}}
