{"sku":"871206","manufacturer_id":"1201321B351.055","brand_name":"Brooks","product_name":"Brooks PureConnect 2 Road-Running Shoes - Women's - 2013 Closeout","long_description":"Featuring plenty of feel, flex and response, the women's Brooks PureConnect 2 Road-Running Shoes feature a minimalist platform that connects you with the ground. Lightweight uppers feature highly breathable polyester mesh and a rubber instep band to provide a comfortable, secure fit regardless of foot shape. Midsoles feature BioMoGo polymer alloy foam, which provides cushioning, energy return and reduced foot fatigue; nontoxic additive helps midsoles break down in landfill. 4mm heel-to-toe drop encourages a natural midfoot or forefoot strike to promote forward momentum and reduce the impact of heel striking. Split toe groove under the forefoot enhances forefoot flexibility and lets the toes function independently for better balance. Low-profile rubber outsoles grip well on the road, sidewalk and gentle trails. Designed on an anatomical last, the minimalist Brooks PureConnect 2 Road-Running Shoes contour to the feet, providing a glovelike fit. All-synthetic construction makes these vegan-friendly. Closeout.","short_description":"Featuring plenty of feel, flex and response, the women's Brooks PureConnect 2 Road-Running Shoes feature a minimalist platform that connects you with the ground.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s388207.png","image_url":"http://i1.avlws.com/115/l388207.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=388207&tt=df","retail_price":"90.00","sale_price":"62.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=388207\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m388207.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871206&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","womens-footwear","womens-shoes"]}
