{"sku":"871252","manufacturer_id":"LTRPGNBK","brand_name":"Smith","product_name":"Smith Lookout ChromaPop Polarized Sunglasses - Women's - Black Frame","long_description":"The women's Smith Lookout ChromaPop Polarized Sunglasses give you sporty, sophisticated style with a refined shape and thin temples. Advanced lenses offer unmatched clarity and color vibrancy. ChromaPop lenses use a proprietary technology to optimize color and increase clarity and definition, enabling you to see the outside world with exceptional vibrance. Polarized Trivex(R) lenses reduce 99% of visible glare from water, snow, sand and pavement for increased visual acuity and decreased eye strain. Black frames feature gray-green tinted lenses, ideal for medium-to-bright light. The Smith Lookout ChromaPop Polarized Sunglasses feature a hydrophilic Megol nosepiece and temple ends that get tacky when wet for extra grip during exercise and hot weather. 53% bio-based Evolve frames are made with Rilsan(R) Clear, a light, durable, non-petroleum-based material derived from renewable, non-GMO castor plants.","short_description":"The women's Smith Lookout ChromaPop Polarized Sunglasses give you sporty, sophisticated style with a refined shape and thin temples. Advanced lenses offer unmatched clarity and color vibrancy.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s423607.png","image_url":"http://i1.avlws.com/115/l423607.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=423607&tt=df","keywords":"Cycling","retail_price":"209.00","sale_price":"209.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=423607\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m423607.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871252&amp;link=&amp;tabs=-Details\"></script>","variants":{"8712520001":{"sku":"8712520001","vendor_sku":"LTRPGNBK","upc":"715757440046","size":"POLAR GRAY GREEN","color":"BLACK","retail_price":"209.00","sale_price":"209.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
