{"sku":"871360","manufacturer_id":"I420","brand_name":"Cycleops","product_name":"CycleOps 420 Pro Indoor Cycle","long_description":"Offering stiffness and stability that's second to none, the CycleOps 420 Pro Indoor Cycle duplicates your favorite ride and targets specific goals, taking your training to new levels. The 420 Pro is intended to be used with an iPad, Android Tablet or Windows computer; it does not come with a cycling computer (not compatible with CycleOps Cervo or Joule 1.0). Compatible with iPad and Android Tablets using CycleOps Virtual Training software (Wahoo ANT+ key available at Wahoo Fitness required for use with tablets, not included). Control target power, slope or gearings with an Android tablet, iPad or Windows computer and Virtual Training software (subscription required after 2 week free trial). Virtual Training software lets you ride routes virtually, syncing resistance and video to enhance your training experience for impressive real-world look and feel. Using electronically controlled resistance, the 420 Pro supplies infinite, precise resistance that can be tailored and preprogrammed to meet your training needs. Using the route's data, the trainer will automatically adjust resistance to mimic the route's features-resistance will increase for a climb or decrease for a descent. Resistance can also be set up so that you can target specific power outputs, gradients or gearing for precise and tailored training. PowerTap meter provides precise power measurement, taking the guesswork out of your workouts and offers +/-1.5% accurate power feedback. 4 points of adjustment let you duplicate your outdoor bike's positioning for seamless switches between indoor and outdoor riding. The wide platform and stiff frame offer excellent stability and efficiency, making it easy to do simulated sprint or hill-climbing workouts without loss of efficiency. Includes a CycleOps saddle, which can be easily swapped out for a personalized ride; pedals are not included.","short_description":"Offering stiffness and stability that's second to none, the CycleOps 420 Pro Indoor Cycle duplicates your favorite ride and targets specific goals, taking your training to new levels.","category":"Cycling","subcategory":"Bikes","product_group":"Stationary Bikes","thumb_url":"http://i1.avlws.com/115/s456703.png","image_url":"http://i1.avlws.com/115/l456703.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456703&tt=df","retail_price":"2340.00","sale_price":"2340.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456703\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456703.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871360&amp;link=&amp;tabs=-Details\"></script>","variants":{"8713600001":{"sku":"8713600001","vendor_sku":"I420","upc":"012527012183","color":"GRAY","retail_price":"2340.00","sale_price":"2340.00"}},"categories":["cycling","bikes","stationary-bikes"]}
