{"sku":"871560","manufacturer_id":"HC50","brand_name":"Nitecore","product_name":" Nitecore HC50 Headlamp","long_description":"Designed for hiking, climbing, camping and general outdoor recreation, the Nitecore HC50 Headlamp outputs a scorching 565 lumens on high to light up the darkest trails. High-quality Cree XM-L2 (T6) LED outputs 565 lumens and throws light up to 85m on high; choose from 5 brightness levels. Optimized wide-beam optics are designed for outdoor use and provide up to 100deg of coverage to illuminate everything in your field of vision. Light housing provides 90deg vertical movement to eliminate illumination dead zones. Direct access to red light mode with a runtime of up to 145 hrs.; red LEDs are ideal for use when you don't want to impact your natural night vision. Powered by a single 18650 lithium-ion battery (sold separately) that combines with the high-efficiency circuit to provide up to 400 hrs. of runtime on low. Also compatible with 2 CR123 batteries (not included); integrated red/green power-indicator light displays the remaining battery power. High-efficiency regulation circuit provides unwavering output. Toughened ultra-clear mineral glass has an anti-reflective coating. Nitecore HC50 Headlamp features a user-friendly single-button 2-stage switch. Body is constructed from aerospace-grade aluminum alloy for excellent durability; headband is chafe-free and breathable nylon. IPX8 water-resistance rating allows submersion down to 2m; impact-resistant to 1.5m.","short_description":"Designed for hiking, climbing, camping and general outdoor recreation, the Nitecore HC50 Headlamp outputs a scorching 565 lumens on high to light up the darkest trails.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Headlamps","thumb_url":"http://i1.avlws.com/115/s450815.png","image_url":"http://i1.avlws.com/115/l450815.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450815&tt=df","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450815\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450815.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871560&amp;link=&amp;tabs=-Details\"></script>","variants":{"8715600001":{"sku":"8715600001","vendor_sku":"HC50","color":"BLACK","retail_price":"59.95","sale_price":"59.95"}}}
