{"sku":"871559","manufacturer_id":"P12","brand_name":"Nitecore","product_name":" Nitecore P12 Flashlight","long_description":"The compact Nitecore P12 Flashlight fits easily in a pocket and has 7 settings-4 brightness levels and 3 strobes-to light up your campsite or home. Premium Cree XM-L2 (T6) LED has a maximum output of 950 lumens; throws light up to 222m. 3 special strobes include standard strobe, SOS strobe and location beacon to find the flashlight easily at night. Operates on either one 18650 or two CR123 batteries (sold separately); 18650 battery provides up to 520 hrs. of runtime on the lowest output level and 1 hr. 15 min. on high. Second generation Crystal Coating Technology combined with Precision Digital Optics Technology provide extreme reflector performance. Side switch interface allows 1-handed operation and easy access to all functions; includes an indicator light that displays remaining battery power. Intelligent memory function stores your preferred brightness setting. High-efficiency regulated circuit board provides unwavering output. Toughened ultra-clear mineral glass has an anti-reflective coating. Constructed from aerospace-grade aluminum alloy with HAIII military-grade hard-anodized finish. Waterproof in accordances with IPX8 water-resistance rating, allowing submersion down to 2m; impact-resistant to 1.5m. Nitecore P12 Flashlight comes with a stainless-steel, titanium-plated clip; also comes with a holster, tactical ring, lanyard, spare tail cap and a spare O-ring.","short_description":"The compact Nitecore P12 Flashlight fits easily in a pocket and has 7 settings-4 brightness levels and 3 strobes-to light up your campsite or home.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s450811.png","image_url":"http://i1.avlws.com/115/l450811.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450811&tt=df","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450811\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450811.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871559&amp;link=&amp;tabs=-Details\"></script>","variants":{"8715590001":{"sku":"8715590001","vendor_sku":"P12","color":"BLACK","retail_price":"59.95","sale_price":"59.95"}}}
