{"sku":"871762","manufacturer_id":"TJR4SL12","brand_name":"Big Agnes","product_name":"Big Agnes Jack Rabbit SL4 Tent - 2013 Closeout","long_description":"A superlight, 3-season, freestanding backpacking shelter, the Big Agnes Jack Rabbit SL4 Tent offers easy sleeping for 4 campers thanks to 2 doors and 2 vestibules. Ultralight trail weight of 6 lbs. 4 oz. goes easy on your group's pack loads. Hubbed pole design and pole clips ensure a quick and easy setup; crossover pole puts ample space around your head and shoulders where you need it most. TH72M aluminum DAC Pressfit poles offer improved durability and the latest advancements in lightweight tent poles. Durable ripstop nylon fly and floor feature a waterproof polyurethane coating; tent body is made from lightweight nylon and polyester mesh. Door zippers on both vestibules feature protective stormflaps; a vent in the rainfly enhances air circulation. Waterproof, solvent-free polyurethane tape seals all seams (no PVC or VOCs). Reflective guylines and stake-outwebbing increase nighttime visibility. Interior mesh pockets organize gear; gear loft loops let you add a gear loft (not included) for more storage room. Media pockets located above sleeping area enable easy earbud cord routing from phones or other devices. Save weight and create a minimalist shelter by using just the rainfly, footprint (not included), poles and stakes. The Big Agnes Jack Rabbit SL4 tent comes with stuff sacks and 10 aluminum hook stakes. Closeout.","short_description":"A superlight, 3-season, freestanding backpacking shelter, the Big Agnes Jack Rabbit SL4 Tent offers easy sleeping for 4 campers thanks to 2 doors and 2 vestibules.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424307.png","image_url":"http://i1.avlws.com/115/l424307.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424307&tt=df","retail_price":"499.95","sale_price":"369.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424307\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424307.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871762&amp;link=&amp;tabs=-Details\"></script>","variants":{"8717620001":{"sku":"8717620001","vendor_sku":"TJR4SL12","upc":"487176200012","color":"OLIVE/RUST","retail_price":"369.73","sale_price":"369.73"}},"categories":["camping-hiking","tents","backpacking-tents"]}
