{"sku":"871777","manufacturer_id":"7424M1.MD","brand_name":"Marker","product_name":"Marker Squire 110 Alpine Ski Bindings","long_description":"If you like to cruise fast and throw in the occasional trick, the lightweight, versatile Marker Squire 110 Alpine Ski Bindings will suit your needs with their powerful energy transmission. DIN setting adjust from 3 - 11, a range suited to intermediate and advanced skiers at medium to high speeds. Cross-axis toe spring and compact mounting pattern create a short binding that enables fluid spins and twists. Compact Triple Pivot Light toe pieces offer a combination of light weight and solid power transmission. Hollow Linkages Heels feature hollow horizontal axles that save weight and maximize power transmission, creating lightweight bindings with excellent performance. Stainless-steel antifriction device allows essential lateral boot movement despite the condition of dirty or worn soles. 110mm brake fits most all-mountain wide skis and some powder skis; brake is designed to offer extra clearance when skiing backward. Mounting configuration requires a 76mm minimum ski width. Marker Squire B110 bindings are built to accommodate skiers ranging from 65 to 240 lbs.","short_description":"If you like to cruise fast and throw in the occasional trick, the lightweight, versatile Marker Squire 110 Alpine Ski Bindings will suit your needs with their powerful energy transmission.","category":"Skiing","subcategory":"Ski Bindings","product_group":"Downhill Ski Bindings","thumb_url":"http://i1.avlws.com/115/s381639.png","image_url":"http://i1.avlws.com/115/l381639.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=381639&tt=df","retail_price":"189.00","sale_price":"149.93","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=381639\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m381639.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871777&amp;link=&amp;tabs=-Details\"></script>","variants":{"8717770001":{"sku":"8717770001","vendor_sku":"7424M1.MD","upc":"883295100613","size":"110 MM","color":"WHITE/GREEN/BLUE","retail_price":"149.93","sale_price":"149.93"}},"categories":["snow","ski-bindings","downhill-ski-bindings"]}
