{"sku":"871770","manufacturer_id":"BWSRR11","brand_name":"Big Agnes","product_name":" Big Agnes Slavonia Sleeping Bag - Women's Regular - 2013 Closeout","long_description":"Undaunted by damp, chilly air, the Big Agnes Slavonia Women's Sleeping Bag features quick-drying synthetic insulation for warmth in wet weather, and it's roomier than a standard mummy bag. Bag has a temperature rating of 30degF for comfort in cold conditions. Designed for women, with a narrow cut at the shoulders, more width at the hips and extra insulation in the footbox and torso where it's needed most. Underside insulation has been eliminated and replaced with a sleeve for a Big Agnes 20 in. wide rectangular pad, not included. Semirectangular bag features short staple synthetic insulation with 97% recycled content that provides high loft, superior warmth and excellent compressibility. Shingle construction prevents insulation from moving around, creating consistent warmth with the trapped \"air pockets\" formed by the insulation. Ripstop nylon shell is treated with a durable water repellent finish; soft, breathable nylon taffeta lining cocoons you in comfort. Comes with a 2-way, full-length, locking zipper with big, easy-to-grab zipper pull. Large draft tube located behind the zipper prevents warm air from escaping and cold air from entering. Pillow pocket allows you to stuff extra clothing or your travel pillow inside. Interior fabric loops stabilize a sleeping bag liner, not included. Big Agnes Slavonia Women's Sleeping Bag includes a nylon stuff sack and large cotton storage bag. Closeout.","short_description":"Undaunted by damp, chilly air, the Big Agnes Slavonia Women's Sleeping Bag features quick-drying synthetic insulation for warmth in wet weather, and it's roomier than a standard mummy bag.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421967.png","image_url":"http://i1.avlws.com/115/l421967.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421967&tt=df","keywords":"compact","retail_price":"159.95","sale_price":"119.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421967\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421967.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871770&amp;link=&amp;tabs=-Details\"></script>","variants":{"8717700001":{"sku":"8717700001","vendor_sku":"BWSRR11","upc":"487177000017","size":"Regular Right","color":"RASPBERRY/COAL","retail_price":"119.73","sale_price":"119.73"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
