{"sku":"871716","manufacturer_id":"033846-736","brand_name":"Osprey","product_name":" Osprey Exos 46 Pack - 2013 Closeout","long_description":"Sophisticated in design, the Osprey Exos 46 Pack offers comfort and super-light weight without a sacrifice in ventilation. Use it for thru-hikes to weekend hikes. Aluminum frame transfers weight to hips; breathable mesh backpanel has side ventilation for cool comfort. Ventilated, padded shoulder straps; sternum strap has a built-in whistle and pocket for energy gel. ErgoPull hipbelt closure relieves hipbone pressure by spreading the tension along both the top and the bottom of the belt, not in a single line along the middle. Innovative system allows you to stow and remove trekking poles without taking off the pack. Top-loading design features a floating lid pocket; another pocket under the lid further extends your gear storage options. Features a front pocket with vertical zipper, a stretch-woven front pocket, side mesh pockets and zippered mesh pockets on hipbelt. Hydration design places the reservoir (sold separately) in a cavity behind the back panel for easy refilling. Superlight side compression straps route over or under side pockets. Thin tool loop and bungee tie-off let you strap on an ice tool. Osprey Exos 46 Pack has an adjustable sternum strap and integrated sleeping pad straps. Closeout.","short_description":"Sophisticated in design, the Osprey Exos 46 Pack offers comfort and super-light weight without a sacrifice in ventilation. Use it for thru-hikes to weekend hikes.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s448987.png","image_url":"http://i1.avlws.com/115/l448987.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448987&tt=df","keywords":"multiday","retail_price":"179.00","sale_price":"137.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448987\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448987.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871716&amp;link=&amp;tabs=-Details\"></script>","variants":{"8717160001":{"sku":"8717160001","vendor_sku":"033846-736","upc":"487171600015","size":"S","color":"JUNGLE GREEN","retail_price":"137.73","sale_price":"137.73"}},"categories":["camping-hiking","backpacks","backpacking-packs"]}
