{"sku":"871766","manufacturer_id":"BESL11","brand_name":"Big Agnes","product_name":" Big Agnes Encampment Sleeping Bag - Men's Short - 2013 Closeout","long_description":"Cold weather is no match for the Big Agnes Encampment Men's Short Sleeping Bag. It delivers cozy warmth and has plenty of room so you can enjoy a good night's sleep in the backcountry. Bag has a temperature rating of 15degF for comfort in cold conditions; length accommodates sleepers up to 5 ft. 8 in. Underside insulation has been eliminated and replaced with a sleeve for a Big Agnes 20 in. wide rectangular pad (not included). Modified mummy bag features short staple synthetic insulation with 97% recycled content that provides high loft, superior warmth-to-weight ratio and excellent compressibility. A-Flex(TM) construction increases loft and maximizes heat retention by combining layers of \"flexed\" insulation with smaller \"anchor\" pieces. Ripstop nylon shell is treated with a durable water repellent finish; soft, breathable nylon taffeta lining cocoons you in comfort. Features a 2-way, full-length, locking zipper with big, easy-to-grab zipper pull. Create a pillow by stuffing a jacket or clothing into the built-in pillow sleeve, which keeps it in place all night long. Interior fabric loops stabilize a sleeping bag liner (not included). Draft tube located behind the zipper prevents warm air from escaping and cold air from entering. Big Agnes Encampment Men's Short Sleeping Bag includes a nylon stuff sack and cotton storage bag. Closeout.","short_description":"Cold weather is no match for the Big Agnes Encampment Men's Short Sleeping Bag. It delivers cozy warmth and has plenty of room so you can enjoy a good night's sleep in the backcountry.","category":"Camping And Hiking","subcategory":"Sleeping Bags And Accessories","product_group":"Sleeping Bags","thumb_url":"http://i1.avlws.com/115/s421951.png","image_url":"http://i1.avlws.com/115/l421951.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=421951&tt=df","keywords":"compact","retail_price":"159.95","sale_price":"119.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=421951\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m421951.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871766&amp;link=&amp;tabs=-Details\"></script>","variants":{"8717660001":{"sku":"8717660001","vendor_sku":"BESL11","upc":"487176600010","size":"Short Left","color":"RED/GRAY","retail_price":"119.73","sale_price":"119.73"}},"categories":["camping-hiking","sleeping-bags-and-accessories","sleeping-bags"]}
