{"sku":"871758","manufacturer_id":"TWTSL212","brand_name":"Big Agnes","product_name":"Big Agnes Wyoming Trail SL2 Tent - 2013 Closeout","long_description":"The Big Agnes Wyoming Trail SL2 tent has a huge vestibule but, thanks to super lightweight materials, it won't weigh you down, giving you lots of living space without loading down your pack. Single D-shape door allows convenient access for 2 backpackers; giant vestibule creates a garagelike auxiliary shelter and space to store gear, relax or dry out wet clothing. Lightweight DAC(R) NSL pole system with Pressfit(R) connectors offers high strength; poles are anodized without the use of harmful acids. Fly and floor are lightweight, silicone-treated ripstop nylon with a 1200mm waterproof polyurethane coating; tent body is lightweight nylon and polyester mesh. Mesh body offers excellent ventilation; fly vents ensure good air circulation when rainfly is deployed. Stormflap over vestibule zipper keeps the rain out; all seams are taped with waterproof, solvent-free polyurethane tape. Plastic clips and sleeves attach tent body to pole frame. Interior mesh pocket above door keeps small items up off the floor. Footprint (not included) extends beyond tent body and acts as a vestibule floor. Big Agnes Wyoming Trail SL2 tent includes stuff sacks and 14 lightweight aluminum hook stakes. Save weight and create a minimalist shelter by using just the rainfly, footprint, poles and stakes (footprint not included). Closeout.","short_description":"The Big Agnes Wyoming Trail SL2 tent has a huge vestibule but, thanks to super lightweight materials, it won't weigh you down, giving you lots of living space without loading down your pack.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424303.png","image_url":"http://i1.avlws.com/115/l424303.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424303&tt=df","retail_price":"499.95","sale_price":"373.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424303\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424303.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871758&amp;link=&amp;tabs=-Details\"></script>","variants":{"8717580001":{"sku":"8717580001","vendor_sku":"TWTSL212","upc":"487175800015","color":"CHAMPAGNE/GREEN","retail_price":"373.73","sale_price":"373.73"}},"categories":["camping-hiking","tents","backpacking-tents"]}
