{"sku":"871885","manufacturer_id":"1TS1PW0000","brand_name":"Current Designs","product_name":"Current Designs Solara 100 Kayak","long_description":"Set out for fun times on the water with the rock-solid Current Designs Solara 100 Kayak. It's a great starter kayak for smaller paddlers looking to spend leisurely days exploring local waterways. Shallow-V hull enhances tracking and offers friendly stability and a lively feel in the water. Rotomolded polyethylene construction offers performance, responsiveness and rugged durability. Open cockpit is very easy to get into and so roomy that you'll enjoy paddling all day long without feeling confined. Cockpit features enough space to put extra gear between your legs, and sliding foot pegs lock to adjust the fit for different paddlers. Seat pan is tilted up away from the cockpit floor to create a natural, comfortable paddling position. To prevent numbness, seat pan features a contoured space for lower vertebrae and is covered with plush, nonabsorbent, very thick padding. Seat back moves up and down and back and forth, and it articulates to move with your paddling motion. Rear hatch provides water-resistant storage for bulky gear and features an easy-to-use, rubberized hatch cover with 3 lever locks. Closed-cell foam bulkheads enhance flotation when hatches are sealed and prevent contents of rear hatch from shifting. Small front hatch; bungee rigging; paddle keeper; toggled carry handles. The Current Designs Solara 100 Kayak weighs 54 lbs.","short_description":"Set out for fun times on the water with the rock-solid Current Designs Solara 100 Kayak. It's a great starter kayak for smaller paddlers looking to spend leisurely days exploring local waterways.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s459599.png","image_url":"http://i1.avlws.com/115/l459599.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=459599&tt=df","retail_price":"599.00","sale_price":"599.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=459599\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m459599.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871885&amp;link=&amp;tabs=-Details\"></script>","variants":{"8718850001":{"sku":"8718850001","vendor_sku":"1TS1PW0000","upc":"818317010441","size":"10 FT","color":"YELLOW","retail_price":"599.00","sale_price":"599.00"}},"categories":["paddling","kayaks","recreational-kayaks"]}
