{"sku":"871884","manufacturer_id":"1TKSPW0000","brand_name":"Current Designs","product_name":"Current Designs Kestrel 120 Roto Kayak","long_description":"Talk about easy to paddle! The Kestrel 120 Roto Kayak from Current Designs gets you out having fun on day tours and short overnights with a full array of touring features and a very comfortable seat. 12 ft. length maintains speed and enhances ease of motion when you're looking to cover distance on relatively calm waters. Shallow-V hull enhances tracking and offers friendly stability and a lively feel in the water, and Swede-form construction enhances speed and maneuverability. Rotomolded polyethylene construction offers performance, responsiveness and rugged durability. Roomy cockpit makes it easy for large paddlers to enter kayak, and sliding foot pegs lock in to adjust the fit for different paddlers. Seat pan is tilted up away from the cockpit floor to create a natural, comfortable paddling position. To prevent numbness, seat pan features a contoured space for lower vertebrae and is covered with plush, nonabsorbent, very thick padding. Seat back adjusts up and down and back and forth, and it articulates to move with your paddling motion. Rear hatch provides enough storage for an overnight trip and features an easy-to-use, rubberized hatch cover. Closed-cell foam stern bulkhead; generous bungee rigging; paddle keeper; toggle handles. The Current Designs Kestrel 120 Roto Kayak weighs 49 lbs.","short_description":"Talk about easy to paddle! The Kestrel 120 Roto Kayak from Current Designs gets you out having fun on day tours and short overnights with a full array of touring features and a very comfortable seat.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s460247.png","image_url":"http://i1.avlws.com/115/l460247.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460247&tt=df","retail_price":"799.00","sale_price":"799.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460247\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460247.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871884&amp;link=&amp;tabs=-Details\"></script>","variants":{"8718840001":{"sku":"8718840001","vendor_sku":"1TKSPW0000","upc":"818317010502","size":"12 FT","color":"MANGO","retail_price":"799.00","sale_price":"799.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
