{"sku":"871883","manufacturer_id":"1KTSFW0000","brand_name":"Current Designs","product_name":" Current Designs Solstice GTS Fiberglass Kayak With Rudder","long_description":"Sized for small-framed paddlers, the Current Designs Solstice GTS Fiberglass Kayak with Rudder has excellent acceleration, is highly efficient and can hold plenty of gear for trips big or small. Incredibly light, strong and stiff, the vacuum-bagged fiberglass layup eliminates excess resin, which improves strength and reduces weight to 52 lbs. Shallow-V hull enhances tracking and offers friendly stability and a lively feel, low decks minimize wind resistance, and fish-form shape enhances flotation in the surf zone. Keyhole-shaped cockpit provides a responsive fit, yet it's still easy to get into. Built-in thighbraces on the underside of the rim maximize control when edging and rolling. Seat back with foam backpad creates cushy comfort during long hours on the water. Cockpit-deployable rudder enhances tracking in rough weather; use the footbraces to direct the rudder and steer the kayak. Hatches provide ample storage for an extended trip and feature easy-to-use compression hatch covers. Compression hatch covers sit flush with the deck and feature a rubber gasket that creates a watertight seal when tightened with cam straps. Current Designs Solstice GTS Fiberglass Kayak with Rudder comes with bow, stern and center bungee deck rigging, toggled carry handles and internal rudder cable routing.","short_description":"Sized for small-framed paddlers, the Current Designs Solstice GTS Fiberglass Kayak with Rudder has excellent acceleration, is highly efficient and can hold plenty of gear for trips big or small.","category":"Paddling","subcategory":"Kayaks","product_group":"Touring Kayaks","thumb_url":"http://i1.avlws.com/115/s430735.png","image_url":"http://i1.avlws.com/115/l430735.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=430735&tt=df","retail_price":"3399.00","sale_price":"3399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=430735\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m430735.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871883&amp;link=&amp;tabs=-Details\"></script>","variants":{"8718830001":{"sku":"8718830001","vendor_sku":"1KTSFW0000","upc":"818317010489","size":"17 FT 7 IN","color":"TANGERINE","retail_price":"3399.00","sale_price":"3399.00"}},"categories":["paddling","kayaks","touring-kayaks"]}
