{"sku":"871881","manufacturer_id":"A-ZS120XEREI","brand_name":"Seals","product_name":"Seals Sneak Spray Skirt - Elie Sound 120 XE","long_description":"Designed for the Elie Sound 120 XE Kayak, the Seals Sneak Spray Skirt is great for moderate paddling conditions. It helps keep water out of your cockpit while protecting your legs from the sun. Midweight nylon packcloth is coated with polyurethane for water resistance. Strong bungee rim gripping system firmly secures skirt to cockpit coaming. Front webbing grab loop with handle assists with entry and wet exits. Tensioned deck stay creates a convex bend in fabric so water runs off, rather than collecting and pooling on top the skirt. Water-resistant zipper that starts at the waistband and ends at the deck stay makes it easy to put the skirt on quickly. Zipper also makes accessing items in the cockpit possible without having to undo the skirt from the coaming. Removable elastic shoulder straps secure skirt and keep tunnel tensioned; neoprene waist has adjustable rip-and-stick sides for a custom fit. Mesh deck pockets store small essentials for quick access. Double-stitched construction with sealed seams ensures long-lasting wear and water resistance.","short_description":"Designed for the Elie Sound 120 XE Kayak, the Seals Sneak Spray Skirt is great for moderate paddling conditions. It helps keep water out of your cockpit while protecting your legs from the sun.","category":"Paddling","subcategory":"Kayak Accessories","product_group":"Spray Skirts","thumb_url":"http://i1.avlws.com/115/s452163.png","image_url":"http://i1.avlws.com/115/l452163.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=452163&tt=df","retail_price":"90.00","sale_price":"90.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=452163\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m452163.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871881&amp;link=&amp;tabs=-Details\"></script>","variants":{"8718810001":{"sku":"8718810001","vendor_sku":"A-ZS120XEREI","upc":"872244001804","color":"BLACK","retail_price":"90.00","sale_price":"90.00"}},"categories":["paddling","kayak-accessories","spray-skirts"]}
