{"sku":"871961","manufacturer_id":"F-NOMADV2PRO","brand_name":"Brunton","product_name":"Brunton Nomad V2 Pro Digital Altimeter - 2013 Closeout","long_description":"A tool you'll want close at hand while mountaineering or hiking, the Brunton Nomad V2 Pro Digital Altimeter tracks altitude and weather changes while helping you stay on course with a digital compass. Altimeter reports altitude in 1 ft. resolution; records 20 ascents to memory with accumulated and max altitude. Barometric weather tracker reports changes in pressure with 0.02 inHg (1 mbar/hpa) resolution. Programmable digital compass provides bearing to 1deg; adjustable declination for fine-tuned local accuracy. Forward-bearing indicator points direction of travel; off-course indicator prevents deviation. Bubble level for +/- 2deg accuracy. Thermometer displays temperature in either Celsius or Fahrenheit. The Brunton Nomad V2 Pro Digital Altimeter features time/date display, dual time zones and 2 programmable alarms. Backlit digital display is easy to read in low-light conditions. Features a low-battery indicator; includes 1 CR2032 3V lithium battery and a neck/wrist lanyard. Closeout.","short_description":"A tool you'll want close at hand while mountaineering or hiking, the Brunton Nomad V2 Pro Digital Altimeter tracks altitude and weather changes while helping you stay on course with a digital compass.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Compasses","thumb_url":"http://i1.avlws.com/115/s418179.png","image_url":"http://i1.avlws.com/115/l418179.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418179&tt=df","retail_price":"120.00","sale_price":"77.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418179\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418179.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871961&amp;link=&amp;tabs=-Details\"></script>","variants":{"8719610001":{"sku":"8719610001","vendor_sku":"F-NOMADV2PRO","upc":"487196100019","color":"SILVER","retail_price":"77.73","sale_price":"77.73"}},"categories":["camping-hiking","gadgets","compasses"]}
