{"sku":"871962","manufacturer_id":"81-230318","brand_name":"Brunton","product_name":"Brunton Carbon Fiber Tripod - 2013 Closeout","long_description":"Upgrade your old tripod with the lightweight Brunton Carbon Fiber Tripod. At just over 5 lbs., it's easy to carry while you're on the trail, and strong enough to endure the rigors of outdoor use. Carbon fiber construction offers superior strength-to-weight ratio for easy carrying and travel. 3-way removable pan head lets you manipulate cameras, binoculars or spotting scopes with smooth, steady movement; includes a built-in bubble level. Legs swing out to near horizontal position for easy setup on any terrain; rubber feet with retractable steel spikes offer stability. Rapid-action twist locks offer easy setup and takedown; padded foam \"leg warmers\" provide good grip while carrying or adjusting the tripod. Universal head mount accommodates most optical gear including cameras, binoculars and spotting scopes. 67.5 in. maximum height. The Brunton Carbon Fiber Tripod includes a heavy-duty canvas carry case with adjustable shoulder strap and internal zippered pocket for accessories. Closeout.","short_description":"Upgrade your old tripod with the lightweight Brunton Carbon Fiber Tripod. At just over 5 lbs., it's easy to carry while you're on the trail, and strong enough to endure the rigors of outdoor use.","category":"Electronics","subcategory":"Photography","product_group":"Tripods And Monopods","thumb_url":"http://i1.avlws.com/115/s426995.png","image_url":"http://i1.avlws.com/115/l426995.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=426995&tt=df","retail_price":"470.00","sale_price":"309.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=426995\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m426995.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=871962&amp;link=&amp;tabs=-Details\"></script>","variants":{"8719620001":{"sku":"8719620001","vendor_sku":"81-230318","upc":"080078303180","color":"BLACK","retail_price":"309.73","sale_price":"309.73"}},"categories":["electronics","photography","tripods-and-monopods"]}
