{"sku":"872111","manufacturer_id":"BC-1367419W-1U","brand_name":"Marin","product_name":"Marin San Anselmo DS3 Step-Through Women's Bike - 2013 Overstock","long_description":"The Marin San Anselmo DS3 Step-Through Women's Bike is an everyday bike for commuting, runnning errands or just getting out and riding with ease, speed and comfort. 6061 aluminum frame features hydroformed top and down tubes to increase strength without adding weight; shaped seatstays and chainstays improve ride quality. A comfortable upright ride is provided by the bike's overall geometry and flat handlebar, minimizing body strains and optimizing visibility. Step-through design facilitates easy mounting and dismounting. Suspension front fork softens the bumps of city streets and back roads; preload adjustment and lockout let you customize the ride. 27 gears supply easy pedaling for tackling hills and cruising bike paths; dependable Shimano shifters and derailleurs offer quick, precise shifting. Hydraulic disc brakes provide smooth, controlled deceleration. 700c wheels feature tough Alex DC25 Disc rims and double-sealed hubs for efficient and smooth rolling. Duro Spitfire tires have puncture protection for confidence on long country rides; wide width boosts stability at slow speeds. Specs on the Marin San Anselmo DS3 step-through women's bike are subject to change. Overstock.","short_description":"The Marin San Anselmo DS3 Step-Through Women's Bike is an everyday bike for commuting, runnning errands or just getting out and riding with ease, speed and comfort.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s378719.png","image_url":"http://i1.avlws.com/115/l378719.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=378719&tt=df","retail_price":"799.99","sale_price":"629.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=378719\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m378719.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=872111&amp;link=&amp;tabs=-Details\"></script>","variants":{"8721110001":{"sku":"8721110001","vendor_sku":"BC-1367415W-1U","upc":"841323085691","size":"15 IN","color":"BLACK WHITE","retail_price":"629.73","sale_price":"629.73"},"8721110003":{"sku":"8721110003","vendor_sku":"BC-1367419W-1U","upc":"841323085714","size":"19 IN","color":"BLACK WHITE","retail_price":"629.73","sale_price":"629.73"}},"categories":["cycling","bikes","hybrid-bikes"]}
