{"sku":"872676","manufacturer_id":"31-001142","brand_name":"Gerber","product_name":"Gerber MP1 Multitool","long_description":"As easy to use as it is tough, the compact, lightweight Gerber MP1 Multitool makes quick work of light or heavy tasks. It delivers the components you need in a distinctive butterfly design. High-quality forged jaws are spring-loaded and stronger than cast versions; butterfly-style opening is easy to use. Large serrated blade and large fine-edge blade feature high-grade 420 HC stainless steel. Utility blade is the perfect implement for rough work and scraping surfaces that might damage the fine-edge blade. Multipurpose plier jaws are forged from 6150 carbon steel; they include wire strippers and diagonal cutters for electrical projects. Magnetic bit driver features a #2 Phillips for all-around versatility, but can be used with any bit; large and small flat screwdrivers handle your straight-slot screw needs. Extra-thick pry bar is thicker than the other components and is tough enough for heavy-duty use; pry bar doubles as a bottle opener. The Gerber MP1 Multitool features a wedge lock for all components, glass-filled nylon handle and a polyester sheath.","short_description":"As easy to use as it is tough, the compact, lightweight Gerber MP1 Multitool makes quick work of light or heavy tasks. It delivers the components you need in a distinctive butterfly design.","category":"Camping And Hiking","subcategory":"Gadgets","product_group":"Knives And Tools","thumb_url":"http://i1.avlws.com/115/s418719.png","image_url":"http://i1.avlws.com/115/l418719.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=418719&tt=df","retail_price":"109.95","sale_price":"109.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=418719\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m418719.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=872676&amp;link=&amp;tabs=-Details\"></script>","variants":{"8726760001":{"sku":"8726760001","vendor_sku":"31-001142","upc":"013658126428","color":"BLACK","retail_price":"109.95","sale_price":"109.95"}},"categories":["camping-hiking","gadgets","knives-and-tools"]}
