{"sku":"872623","manufacturer_id":"UC40L2BK","brand_name":"Fenix","product_name":"Fenix Fenix UC40 Flashlight - Ultimate Edition","long_description":"Drawing on USB power, rechargeable and non-rechargeable batteries, the powerful, portable Fenix UC40 Ultimate Edition Flashlight does its best to make sure you're never stuck in the dark. Included USB cable fully charges the flashlight in 6 hours; draw on rechargeable 3400mAh/3.6V batteries after that; keep 2 CR123A batteries on hand as a final power source. Two 18650 Lithium-ion batteries can be used in place of the CR123A batteries. When charged, flashlight delivers 1 hr. 30 min. runtime on turbo, 3 hrs. 45 min. on high, 16 hrs. on medium and 150 hrs. on low. High-quality Cree XM-L2 U2 LED bulb outputs 400 lumens on high, 110 lumens on medium and 10 lumens on low; turbo and strobe modes output an astounding 960 lumens. Click the side switch to turn flashlight on; press and hold down for burst mode, let go to exit burst mode; single clicks rotate through the brightness levels. Fenix UC40 Ultimate Edition Flashlight remembers the last output level, so the next time you turn it on it starts where you left off. Regulated output maintains consistent light output over the lifetime of the batteries. Rugged aircraft-grade aluminum body is designed to resist rolling and has a knurled finish for good grip; flashlight resists impact up to 1 meter. IPX8 water resistance rating for protects against prolonged immersion in water up to 2 meters deep. Measuring only 1 x 6.8 in., the UC40 Ultimate Edition Flashlight is easy to stow in your backpack or car glove compartment.","short_description":"Drawing on USB power, rechargeable and non-rechargeable batteries, the powerful, portable Fenix UC40 Ultimate Edition Flashlight does its best to make sure you're never stuck in the dark.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s416971.png","image_url":"http://i1.avlws.com/115/l416971.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=416971&tt=df","retail_price":"89.95","sale_price":"89.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=416971\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m416971.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=872623&amp;link=&amp;tabs=-Details\"></script>","variants":{"8726230001":{"sku":"8726230001","vendor_sku":"UC40L2BK","color":"BLACK","retail_price":"89.95","sale_price":"89.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
