{"sku":"872622","manufacturer_id":"TK09G2BK-B","brand_name":"Fenix","product_name":" Fenix TK09 Flashlight","long_description":"Keep the Fenix TK09 LED flashlight close by for a bright, reliable beam that will light up the night while you're camping, hiking or waiting out a power outage. Featuring 3 brightness settings, the flashlight has a single high-quality LED that outputs 450 lumens on turbo and 15 lumens on low. Deep-dish reflector projects a powerful focused beam up to 230m on turbo. Operates on 2 CR123A lithium batteries (included) or single 18650 rechargeable lithium-ion battery (not included). Batteries provide up to 2 hrs. of use on high, 7 hrs. on mid and 65 hrs. on low. Tail cap push-button on/off switch is easy to operate for constant, on/off, momentary (for quick bursts of light) and mode selection. Regulated output maintains consistent light output over the lifetime of the batteries. Rugged hard-anodized aircraft-grade aluminum body will stand up to regular use in the outdoors; body is designed to resist rolling. Flashlight has an IPX8 water resistance rating for protection against prolonged immersion in water deeper than 1m (3.3 ft.). Fenix TK09 LED flashlight includes a body clip, lanyard, holster, a spare rubber switch boot and a spare O-ring.","short_description":"Keep the Fenix TK09 LED flashlight close by for a bright, reliable beam that will light up the night while you're camping, hiking or waiting out a power outage.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Flashlights","thumb_url":"http://i1.avlws.com/115/s454155.png","image_url":"http://i1.avlws.com/115/l454155.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454155&tt=df","retail_price":"59.95","sale_price":"59.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454155\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454155.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=872622&amp;link=&amp;tabs=-Details\"></script>","variants":{"8726220001":{"sku":"8726220001","vendor_sku":"TK09G2BK-B","color":"BLACK","retail_price":"59.95","sale_price":"59.95"}},"categories":["camping-hiking","camp-lighting","flashlights"]}
