{"sku":"872795","manufacturer_id":"IZ-PATHP-M-BK","brand_name":"Currie","product_name":" Currie E3 Path+ Bike - 2014","long_description":"With a rear rack, fenders and disc brakes for commutes or long rides, the Currie E3 Path+ Bike uses a powerful, 500W electric motor to zip up hills, cruise flats and reduce the stresses of riding. A battery-powered motor assists you to make pedaling easy, and if you're ready to relax, you can switch modes to \"twist and go\" and cruise without pedaling. Powered by a rack-mounted, removable lithium-ion battery pack that you can charge anywhere. LCD showing speed, distance and time is mounted conveniently on the handlebar, and remote button lets you operate the bike without moving your hands from the handlebar. Fenders and full-length chain guard help keep you clean and dry, and disc brakes offer powerful stopping in any weather. Battery range of the pedal-assist mode is 25 - 30 mi. Battery is easy to detach from the rear rack for simple recharging (charger included) or for added security when you're locking the bike up outside. Motor tops out at a safe speed of 20 mph; 8 speeds offer smooth and easy pedaling; includes kickstand. Please note: battery range distances for the the Currie E3 Path+ Bike can vary due to factors such as rider and gear weight, amount of rider pedaling and terrain.","short_description":"With a rear rack, fenders and disc brakes for commutes or long rides, the Currie E3 Path+ Bike uses a powerful, 500W electric motor to zip up hills, cruise flats and reduce the stresses of riding.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s448835.png","image_url":"http://i1.avlws.com/115/l448835.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448835&tt=df","retail_price":"2199.00","sale_price":"2199.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448835\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448835.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=872795&amp;link=&amp;tabs=-Details\"></script>","variants":{"8727950001":{"sku":"8727950001","vendor_sku":"IZ-PATHP-M-BK","upc":"694027003146","size":"M","color":"BLACK","retail_price":"2199.00","sale_price":"2199.00"}}}
