{"sku":"872888","manufacturer_id":"IZ-VB-GY-W","brand_name":"Izip","product_name":"IZIP E3 Vibe Women's Bike - 2014","long_description":"Offering a comfortable sitting position and an easy-to-mount, step-through frame, the Currie E3 Vibe women's bike uses a 250W electric motor to zip up hills and reduce the stress of riding. A battery-powered motor assists you to make pedaling easy, and if you're ready to relax, you can switch modes to \"twist and go\" and cruise without pedaling. Powered by a rack-mounted, removable lithium-ion battery pack. Battery gauge, power and motor controls are conveniently mounted on the handlebar; controlling power is easy with the twist throttle. Suspension fork and suspension seatpost soak up the bumps and jolts of rough urban roads or unpaved trails. Battery range of the pedal-assist feature is 15 - 22 mi.; battery range for \"twist-and-go\" is 18 - 20 mi. Motor assistance tops out at a safe speed of 15 mph. 7 speeds offer smooth and easy pedaling; twist shifter changes gears with an easy flick of the wrist. Battery is easy to detach from the rear rack for simple recharging (charger included) or for added security when you're locking the bike up outside. Included smart charger features an LED status display to let you know the battery's charging level. Please note: battery range distances for the Currie E3 Vibe women's bike can vary due to factors such as rider and gear weight, amount of rider pedaling and terrain.","short_description":"Offering a comfortable sitting position and an easy-to-mount, step-through frame, the Currie E3 Vibe women's bike uses a 250W electric motor to zip up hills and reduce the stress of riding.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s448847.png","image_url":"http://i1.avlws.com/115/l448847.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448847&tt=df","retail_price":"1499.00","sale_price":"1499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448847\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448847.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=872888&amp;link=&amp;tabs=-Details\"></script>","variants":{"8728880001":{"sku":"8728880001","vendor_sku":"IZ-VB-GY-W","upc":"694027002149","size":"One Size","color":"GRAY","retail_price":"1499.00","sale_price":"1499.00"}},"categories":["cycling","bikes","hybrid-bikes"]}
