{"sku":"872993","manufacturer_id":"010-01040-60","brand_name":"Garmin","product_name":"Garmin fenix 2 GPS + ABC Watch","long_description":"With the best features of fitness and outdoor watches, the Garmin fenix 2 GPS + ABC Watch is an athlete's ideal training partner for running, climbing, cycling, hiking, paddling, skiing or swimming. fenix 2 lets you easily switch between feature sets so you can access the information you need. Real-time performance data such as time, distance, pace, calories, speed, lap data and heart rate. Pair with a heart rate monitor (sold separately) to use the recovery advisor with recovery time and recovery check, race predictor and VO2 max oxygen consumption. Pair with HRM-Run(TM) monitor (not included) to measure cadence, vertical oscillation and ground contact time. Built-in accelerometer tracks distance and pace when indoors. Ski mode with auto pause and run detection measures 3D speed, distance, time, vertical drop and total runs; it features ski-specific data pages, history and performance data. Indoor/outdoor swim mode records strokes, intervals, distance, pace and time; it also counts pool lengths, detects stroke type and computes the SWOLF (\"swim golf\") score. Virtual Partner allows you to set time, distance or speed goals and then compete against a running/cycling icon that appears on your screen. Automatically uploads data wirelessly to Garmin Connect(TM) LiveTrack and social media (via a smartphone and Garmin Connect Mobile app). Smart Notification lets you receive emails, texts and alerts directly on the fenix 2. Comes with an easy-to-adjust rip-and-stick fabric wriststrap plus an extender that accommodates all wrist sizes and clothing types. GPS lets you create routes, record up to 1,000 waypoints and record tracks while on the move; TracBack(R) function guides you back along a previously recorded track. Barometric altimeter provides accurate elevation information to keep track of ascent and descent. Barometer helps you monitor and predict weather changes by showing you changes in air pressure.","short_description":"With the best features of fitness and outdoor watches, the Garmin fenix 2 GPS + ABC Watch is an athlete's ideal training partner for running, climbing, cycling, hiking, paddling, skiing or swimming.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s460851.png","image_url":"http://i1.avlws.com/115/l460851.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=460851&tt=df","keywords":"waterproof,odometer","retail_price":"400.00","sale_price":"400.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=460851\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m460851.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=872993&amp;link=&amp;tabs=-Details\"></script>","variants":{"8729930001":{"sku":"8729930001","vendor_sku":"010-01040-60","upc":"753759120665","color":"BLACK","retail_price":"400.00","sale_price":"400.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
