{"sku":"873159","manufacturer_id":"947104","brand_name":"Burley","product_name":"Burley Tail Wagon Pet Stroller/Bike Trailer","long_description":"A stroller for your pooch that converts to a bike trailer, the Burley Tail Wagon uses a flip-down tailgate for quick loading and a suspended, removable floor for easy cleaning. The Burley Tail Wagon includes a tow arm and hitch so you can attach it to your bike and take your furry passenger for a tour. Removable mesh cover and mesh windows on all 4 sides circulate air to keep your pet cool; weatherproof cover rolls down to protect against rain and snow. Durable, lightweight aluminum frame and an aerodynamic shape make the Tail Wagon easy to push or tow; bright colors enhance visibility. Durable, drum-tight fabric and side battens prevent animals from leaning into rotating wheels; pooch rides comfortably suspended above axle. Axle positioning at the back of the trailer provides a smooth ride for your pet and easy towing for you. 360deg reflectivity and wheel reflectors increase visibility in low light; includes a safety flag, too. Carries 1 animal and gear up to 75 lbs. total; mesh pockets inside offer extra storage. Wheels detatch and frame folds down for easy storage; folded dimensions are 38 x 28 x 10 in. The Tail Wagon comes with a standard axle hitch and handlebar.","short_description":"A stroller for your pooch that converts to a bike trailer, the Burley Tail Wagon uses a flip-down tailgate for quick loading and a suspended, removable floor for easy cleaning.","category":"Fitness","subcategory":"Running","product_group":"Strollers","thumb_url":"http://i1.avlws.com/115/s454399.png","image_url":"http://i1.avlws.com/115/l454399.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454399&tt=df","retail_price":"399.00","sale_price":"399.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454399\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454399.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873159&amp;link=&amp;tabs=-Details\"></script>","variants":{"8731590001":{"sku":"8731590001","vendor_sku":"947104","upc":"840840007971","color":"YELLOW","retail_price":"399.00","sale_price":"399.00"}},"categories":["fitness","running","strollers"]}
