{"sku":"873288","manufacturer_id":"SP8091","brand_name":"Ozoboards","product_name":"oZoboards Cruiser Stand Up Paddleboard and Paddle - 10' 6\"","long_description":"A great choice for your first board, the 10 ft. 6 in. oZoboards Cruiser stand up paddleboard with paddle features a soft outer skin for comfort and a 32.5 in. width for excellent stability. EPS Core with triple stringers provides high strength and excellent rigidity; soft skin provides comfort for all skill levels of riders. 10 ft. 6 in. length offers excellent glide and plenty of stability for flatwater exploration, yet remains nimble for longboard fun in the surf. The raised platform deck provides extra flotation and solid grip when paddling, kneeling and standing, and the soft deck doesn't hurt when you fall. Enhanced nose kick makes the board more forgiving in rough water and on those late drops in the surf. Fin box, carry handle, leash plug and life-vest straps are molded into the internal structure of the high-density foam core for greater strength and durability. 9 in. fin enhances tracking in flatwater, and 28 lb. 6 oz. weight makes car topping easy. Optimal for riders 200 - 250 lbs., but rated to 300 lbs. for riders of higher ability. The 10 ft. 6 in. oZoboards Cruiser stand up paddleboard an adjustable paddle, double-swivel leash and deck strap to secure a life vest.","short_description":"A great choice for your first board, the 10 ft. 6 in. oZoboards Cruiser stand up paddleboard with paddle features a soft outer skin for comfort and a 32.5 in. width for excellent stability.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s457595.png","image_url":"http://i1.avlws.com/115/l457595.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457595&tt=df","retail_price":"699.95","sale_price":"699.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457595\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457595.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873288&amp;link=&amp;tabs=-Details\"></script>","variants":{"8732880001":{"sku":"8732880001","vendor_sku":"SP8091","upc":"845541080919","size":"10 FT 6 IN","color":"BLUE/RED/WHITE","retail_price":"699.95","sale_price":"699.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
