{"sku":"873257","manufacturer_id":"SP8090","brand_name":"Ozoboards","product_name":"oZoboards Mom's Stand Up Paddleboard and Paddle - 9' 6\"","long_description":"Your ticket to a new sport, the 9 ft. 6 in. oZoboards Mom's stand up paddleboard with paddle features a soft outer skin for comfort and a 31.5 in. width for stability on flatwater and small waves. EPS Core with triple stringers provides high strength and excellent rigidity; soft skin provides comfort for all skill levels of riders. The raised platform deck provides extra flotation and solid grip when paddling, kneeling and standing, and the soft deck doesn't hurt when you fall. 9 ft. 6 in. length offers plenty of stability for flatwater exploration but is easy to turn in waves. Enhanced nose kick makes the board more forgiving in rough water and on those late drops in the surf. Fin box, carry handle, leash plug and life-vest straps are molded into the internal structure of the high-density foam core for greater strength and durability. Light weight means that mom can easily get it onto the roof of the car. Optimal for riders 140 - 200 lbs., but rated to 250 lbs. for riders of higher ability. 9 in. fin enhances tracking in flatwater. The 9 ft. 6 in. oZoboards Mom's stand up paddleboard includes an adjustable paddle, double-swivel leash and deck strap to secure a life vest.","short_description":"Your ticket to a new sport, the 9 ft. 6 in. oZoboards Mom's stand up paddleboard with paddle features a soft outer skin for comfort and a 31.5 in. width for stability on flatwater and small waves.","category":"Paddling","subcategory":"Paddleboarding","product_group":"Paddleboards","thumb_url":"http://i1.avlws.com/115/s457591.png","image_url":"http://i1.avlws.com/115/l457591.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=457591&tt=df","retail_price":"649.95","sale_price":"649.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=457591\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m457591.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873257&amp;link=&amp;tabs=-Details\"></script>","variants":{"8732570001":{"sku":"8732570001","vendor_sku":"SP8090","upc":"845541080902","size":"9 FT 6 IN","color":"APPLE GREEN/RED","retail_price":"649.95","sale_price":"649.95"}},"categories":["paddling","paddleboarding","paddleboards"]}
