{"sku":"873423","manufacturer_id":"02-0013A-BGY5W","brand_name":"Boreas","product_name":" Boreas Lost Coast 60 Pack - Women's - 2013 Closeout","long_description":"The women's Boreas Lost Coast 60 Pack offers a smart and simple multiday packing solution for people who care about weight but may not be crazy enough to cut the handles off their toothbrushes. Light, no-nonsense hipbelt and shoulder straps with sternum strap are sized for a woman and made with resilient foam that keeps its volume and helps distribute pressure evenly. Simple, zigzag foam back panel and removable framesheet are shaped to match the curve of your back and pump fresh air through the channels as you walk. Streamlined pack body features a light polyurethane rib cage design that adds structure; removable top lid features a zippered pocket and helps fend off precipitation. Full-length front stretch pocket, 2 side stretch pockets and 2 hipbelt pockets let you organize and easily access gear, clothing, water bottles and snacks. The Boreas Lost Coast 60 Pack features tuck-away daisy chains, raincover, hidden gear loops on the shoulder straps and hydration compatability (reservoir not included). Closeout.","short_description":"The women's Boreas Lost Coast 60 Pack offers a smart and simple multiday packing solution for people who care about weight but may not be crazy enough to cut the handles off their toothbrushes.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Backpacking Packs","thumb_url":"http://i1.avlws.com/115/s410963.png","image_url":"http://i1.avlws.com/115/l410963.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=410963&tt=df","keywords":"multiday","retail_price":"209.99","sale_price":"146.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=410963\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m410963.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873423&amp;link=&amp;tabs=-Details\"></script>","variants":{"8734230001":{"sku":"8734230001","vendor_sku":"02-0013A-BGY5W","upc":"487342300010","size":"L","color":"GOLDEN GATE","retail_price":"146.73","sale_price":"146.73"}}}
