{"sku":"873612","manufacturer_id":"A92PE6A","brand_name":"The North Face","product_name":" The North Face Surge II Daypack - 2013 Closeout","long_description":"Power through the day with the Surge II Daypack from The North Face. It boasts plenty of pockets for easy organization and dedicated sleeves for both a laptop and tablet. Dedicated, zippered and padded laptop compartment handles laptops up to 17 in.; neoprene sleeve holds up to a 10 in. tablet. Main pocket holds books, papers and files. Middle pocket features a deluxe organizer and front pocket features dual zip access to multiple pockets for must-have items. Zippered and padded bottom compartment is sized to hold a power cord and other accessories. Side stretch-woven pockets keep water bottle from bouncing around. Adjustable, padded shoulder straps and padded back panel offer load-carrying comfort; polyethylene sheet along back adds structure and support. Padded and stowable hipbelt enhances carrying support and stability. Constructed of abrasion-, moisture- and tear-resistant ballistic nylon for exceptional durability. The North Face Surge II daypack also has reflective hits to increase visibility in low light and a daisy chain to lash on gear. This pack is endorsed by the American Chiropractic Association, recognizing the comfort and function of its shoulder straps, back panel and interior organization. Closeout.","short_description":"Power through the day with the Surge II Daypack from The North Face. It boasts plenty of pockets for easy organization and dedicated sleeves for both a laptop and tablet.","category":"Travel And Luggage","subcategory":"Luggage","product_group":"Travel Packs","thumb_url":"http://i1.avlws.com/115/s433739.png","image_url":"http://i1.avlws.com/115/l433739.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433739&tt=df","retail_price":"125.00","sale_price":"93.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433739\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433739.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873612&amp;link=&amp;tabs=-Details\"></script>","variants":{"8736120002":{"sku":"8736120002","vendor_sku":"A92PD7W","upc":"887040684588","size":"One Size","color":"BIKING RED DISTRESSED PLA","retail_price":"93.73","sale_price":"93.73"},"8736120003":{"sku":"8736120003","vendor_sku":"A92PE6A","upc":"487361200032","size":"One Size","color":"PRUSSIAN BLUE/SULPHUR GRE","retail_price":"93.73","sale_price":"93.73"}}}
