{"sku":"873635","manufacturer_id":"A7EZJK3","brand_name":"The North Face","product_name":"The North Face T-Dubs Cargo Shell Pants - Men's Short - 2013 Closeout","long_description":"The North Face T-Dubs Cargo Shell Pants in men's short length deliver tough waterproof protection and a suspender system that aces the fit from parking lot to drop-in. Rugged HyVent(TM) 2-layer construction is waterproof, windproof and breathable; fully sealed seams prevent moisture from seeping through. Removable and adjustable suspenders with sternum strap help keep pants up and secure; adjustable waist tabs dial in the fit. Zip hand pockets; flap cargo pockets; flap back pockets. Cargo pockets feature The North Face Lot Lift System: adjustable cords in pockets allow you to lift up the rear part of pant cuffs, preventing them from dragging on the ground. Zippered thigh vents have mesh gussets to vent air, letting you regulate heat and your comfort. Pants can be connected to the powder skirt of compatible jackets from The North Face for fully integrated protection. Stretch leg gaiters feature elastic grippers and boot hooks to seal out snow around boots. Reinforced hem guards protect your cuffs from abrasion and sharp edges. The North Face T-Dubs Cargo Shell Pants in men's short length have a 29 in. inseam and a relaxed waist with roomy thighs, knees and cuffs. Closeout.","short_description":"The North Face T-Dubs Cargo Shell Pants in men's short length deliver tough waterproof protection and a suspender system that aces the fit from parking lot to drop-in.","category":"Men's Clothing","subcategory":"Men's Pants","product_group":"Men's Snow Pants","thumb_url":"http://i1.avlws.com/115/s403767.png","image_url":"http://i1.avlws.com/115/l403767.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=403767&tt=df","keywords":"hardshell","retail_price":"199.00","sale_price":"148.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=403767\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m403767.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873635&amp;link=&amp;tabs=-Details\"></script>","variants":{"8736350009":{"sku":"8736350009","vendor_sku":"A7EZJK3","upc":"808390967992","size":"XXL Short","color":"TNF BLACK","retail_price":"148.73","sale_price":"148.73"}},"categories":["mens","mens-pants","mens-snow-pants"]}
