{"sku":"873629","manufacturer_id":"A92Z65J","brand_name":"The North Face","product_name":" The North Face Yavapai Pack - 2013 Closeout","long_description":"No need to scrimp on comfort, durability and style. The North Face Yavapai Pack is a clean and simple gear hauler for the precise, organized minimalist. Features adjustable shoulder straps, a sternum strap and a foam back panel with breathable mesh channels for ventilation and load-carrying comfort. Hipbelt tucks away when not in use. Panel-loading design offers plenty of room for gear and clothing; also includes a universal padded sleeve for a laptop or hydration (reservoir not included). Front pocket features an internal organizer for pens, pencils, wallet, electronics and other necessities. Small front stash pocket and dual mesh water bottle pockets allow quick access to gear. Side compression straps help stabilize and control the load; front tool loop and lash point let you strap on trekking poles or other gear. The North Face Yavapai Pack features reflective accents that help increase your nighttime visibility to others. This pack is endorsed by the American Chiropractic Association, recognizing the comfort and function of its shoulder straps, back panel and interior organization. Closeout.","short_description":"No need to scrimp on comfort, durability and style. The North Face Yavapai Pack is a clean and simple gear hauler for the precise, organized minimalist.","category":"Travel And Luggage","subcategory":"Day Bags And Packs","product_group":"Travel Daypacks","thumb_url":"http://i1.avlws.com/115/s433379.png","image_url":"http://i1.avlws.com/115/l433379.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=433379&tt=df","keywords":"backpack","retail_price":"89.00","sale_price":"66.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=433379\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m433379.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873629&amp;link=&amp;tabs=-Details\"></script>","variants":{"8736290001":{"sku":"8736290001","vendor_sku":"A92Z65J","upc":"053329800912","size":"One Size","color":"TNF RED/ASPHALT GREY","retail_price":"66.73","sale_price":"66.73"}}}
