{"sku":"873942","manufacturer_id":"TSHSL214","brand_name":"Big Agnes","product_name":"Big Agnes Seedhouse SL 2 Tent","long_description":"A signature design for ultralight backpacking, the updated Big Agnes Seedhouse SL 2 Tent is like a gin martini or a peanut butter and jelly sandwich-simple, efficient and classic. Straightforward, weight-saving design features a single vestibule and D-shaped door, stormflaps on the vestibule zipper, and reflective guylines and corner webbing. Waterproof, silicone-treated nylon ripstop fly and floor; all seams are taped with waterproof, solvent-free polyurethane tape (no PVC or VOCs). Ultralight DAC Featherlite NSL pole system features Pressfit connectors and lightweight hubs; plastic clips make it easy to attach the tent body to the pole frame. DAC Green Anodizing(TM) reduces the need for the hazardous chemicals phosphoric and nitric acid by eliminating the chemical polishing stage; wastewater is also recycled. All-mesh tent body for light weight and effective ventilation; 2 interior mesh pockets; gear loft loops (gear loft not included). Fast Fly setup available with footprint (sold separately). The Big Agnes Seedhouse SL 2 Tent comes with 11 aluminum J stakes, guylines and stuff sacks.","short_description":"A signature design for ultralight backpacking, the updated Big Agnes Seedhouse SL 2 Tent is like a gin martini or a peanut butter and jelly sandwich-simple, efficient and classic.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s446407.png","image_url":"http://i1.avlws.com/115/l446407.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=446407&tt=df","retail_price":"349.95","sale_price":"349.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=446407\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m446407.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873942&amp;link=&amp;tabs=-Details\"></script>","variants":{"8739420001":{"sku":"8739420001","vendor_sku":"TSHSL214","upc":"873840012287","color":"OLIVE/MOSS","retail_price":"349.95","sale_price":"349.95"}},"categories":["camping-hiking","tents","backpacking-tents"]}
