{"sku":"873943","manufacturer_id":"TSHSL314","brand_name":"Big Agnes","product_name":" Big Agnes Seedhouse SL 3 Tent","long_description":"The ultralight, freestanding Big Agnes Seedhouse SL3 tent is for 3 backpackers (or 2 and a dog) who like to count ounces and still have a little elbow room to read at night. Seedhouse SL3 is simple, efficient and classic; it's built for adventures like cross-country bike tours or those weekend peaks you've been looking to bag. Hub/pole system is super lightweight and tent body attaches quickly and easily to the pole frame with plastic clips; fabric loops along the ridge pole increase weight savings. Innovative pole design provides exceptional headroom without excess weight. 1 large door allows easy entry/exit for 3 occupants. Walls are constructed of woven nylon mesh, providing excellent ventilation and 360deg views. Rainfly and seamless floor are made of high-tenacity ripstop nylon and are both polyurethane- and silicone-coated for waterproofness and durability. Light yet strong, DAC Featherlite(R) NSL pole system with pressed-in connectors and lightweight hubs are anodized without the use of harmful acids. Includes 4 interior mesh pockets and loops for a gear loft (holds a Big Agnes Large Trapezoid Loft or Entertainment Center Loft, not included). All seams on tent body and fly are sealed with waterproof, solvent-free polyurethane seam tape; vestibule stormflap protects zipper from the elements. Big Agnes Seedhouse SL3 includes stuff sacks, 11 superlight aluminum J-stakes, and reflective guylines and webbing on tent corners. Save weight and create a minimalist shelter by using just the rainfly, footprint (sold separately), poles and stakes.","short_description":"The ultralight, freestanding Big Agnes Seedhouse SL3 tent is for 3 backpackers (or 2 and a dog) who like to count ounces and still have a little elbow room to read at night.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s450235.png","image_url":"http://i1.avlws.com/115/l450235.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450235&tt=df","retail_price":"399.95","sale_price":"399.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450235\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450235.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=873943&amp;link=&amp;tabs=-Details\"></script>","variants":{"8739430001":{"sku":"8739430001","vendor_sku":"TSHSL314","upc":"873840012300","color":"OLIVE/MOSS","retail_price":"399.95","sale_price":"399.95"}}}
