{"sku":"874040","manufacturer_id":"EF-NIT-L-BK","brand_name":"Currie","product_name":" Currie E3 Nitro Bike - 2013","long_description":"Featuring high-end SRAM Apex parts and built for city streets, the cutting-edge Currie E3 Nitro Bike uses a powerful 500W electric motor to propel the bike and reduce the stresses of riding. A battery-powered motor assists you to make pedaling easy, and if you're ready to relax, you can switch modes to \"twist and go\" and cruise without pedaling. LCD showing speed, distance and time is mounted conveniently on the handlebar, and remote button lets you operate the bike without moving your hands from the handlebar. Battery is easy to detach from the seatpost for simple recharging (charger included) or for added security when you're locking the bike up outside. Front suspension system neutralizes the bumps for a comfortable and smooth ride. Outfitted with a SRAM Apex 2x10 drivetrain so you always have the perfect gear for any type of terrain. Battery range of the pedal-assist feature is 25 - 35 mi. Motor tops out at a safe speed of 20 mph or 28 mph with hard pedaling; includes kickstand. Please note: battery range distances for the the Currie E3 Nitro Bike can vary due to factors such as rider and gear weight, amount of rider pedaling and terrain.","short_description":"Featuring high-end SRAM Apex parts and built for city streets, the cutting-edge Currie E3 Nitro Bike uses a powerful 500W electric motor to propel the bike and reduce the stresses of riding.","category":"Cycling","subcategory":"Bikes","product_group":"Hybrid Bikes","thumb_url":"http://i1.avlws.com/115/s448859.png","image_url":"http://i1.avlws.com/115/l448859.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448859&tt=df","retail_price":"3499.00","sale_price":"3499.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448859\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448859.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874040&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t"}
