{"sku":"874254","manufacturer_id":"14SUP4PA70V","brand_name":"Naish","product_name":" Naish Alana 7.0 Vario Adjustable Stand Up Paddle - Women's","long_description":"The Naish Alana 7.0 Vario Adjustable Stand Up Paddle is designed for women who want a lightweight paddle that offers outstanding performance for racing, wave riding and touring. The Naish Alana 7.0 Vario adjusts from 64 - 89 in. using an easy flip-open tab: Flip open tab on ferrule, adjust length, and then close tab to lock down shaft. Medium, 7 in. blade is ideal for light paddlers and the high-cadence stroke rate used during flatwater tours and racing. Vertical markings on the shaft help ensure you adjust the T-shaped handle in alignment with the blade, and horizontal markings show the length adjustment of the paddle. Carbon fiber and Kevlar(R) shaft provides an extremely lightweight, stiff and responsive connection to the water; shaft material also increases impact resistance. Fiberglass and carbon-fiber blade provides responsive power, and blade shape pulls smoothly through the water. Tough ABS edge protects the blade from impact with barnacles or rocks. Hollow, T-shaped grip fits naturally in your hand and has a coating that allows you to maintain your grip when wet.","short_description":"The Naish Alana 7.0 Vario Adjustable Stand Up Paddle is designed for women who want a lightweight paddle that offers outstanding performance for racing, wave riding and touring.","category":"Paddling","subcategory":"Paddles","product_group":"Paddleboard Paddles","thumb_url":"http://i1.avlws.com/115/s451755.png","image_url":"http://i1.avlws.com/115/l451755.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=451755&tt=df","retail_price":"309.00","sale_price":"309.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=451755\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m451755.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874254&amp;link=&amp;tabs=-Details\"></script>","variants":{"8742540001":{"sku":"8742540001","vendor_sku":"14SUP4PA70V","upc":"849520001346","size":"106 IN","color":"WHITE","retail_price":"309.00","sale_price":"309.00"}},"categories":["paddling","paddles","paddleboard-paddles"]}
