{"sku":"874255","manufacturer_id":"14SUP4PH85V","brand_name":"Naish","product_name":" Naish Hele 8.5 Vario Adjustable Stand Up Paddle","long_description":"Light in the hand and smooth in the water, the Naish Hele 8.5 Vario Adjustable Stand Up Paddle offers solid all-around performance in a carbon and fiberglass construction. The Naish Hele 8.5 Vario adjusts from 64 - 89 in. using an easy flip-open tab: Flip open tab on ferrule, adjust length, and then close tab to lock down shaft. 8.5 in. blade is designed for medium to heavy paddlers using a mix of high-cadence strokes and power strokes for touring or surfing. Vertical markings on the shaft help ensure you adjust the T-shaped handle in alignment with the blade, and horizontal markings show the length adjustment of the paddle. Sliding adjustment will not twist during use. 30 percent carbon fiber and 70 percent fiberglass shaft provides high durability. Fiberglass blade pulls smoothly through the water. Hollow, T-shaped grip fits naturally in your hand and has a coating that allows you to maintain your grip when wet.","short_description":"Light in the hand and smooth in the water, the Naish Hele 8.5 Vario Adjustable Stand Up Paddle offers solid all-around performance in a carbon and fiberglass construction.","category":"Paddling","subcategory":"Paddles","product_group":"Paddleboard Paddles","thumb_url":"http://i1.avlws.com/115/s431119.png","image_url":"http://i1.avlws.com/115/l431119.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=431119&tt=df","retail_price":"229.00","sale_price":"229.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=431119\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m431119.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874255&amp;link=&amp;tabs=-Details\"></script>","variants":{"8742550001":{"sku":"8742550001","vendor_sku":"14SUP4PH85V","upc":"849520001339","size":"115 IN","color":"YELLOW","retail_price":"229.00","sale_price":"229.00"}},"categories":["paddling","paddles","paddleboard-paddles"]}
