{"sku":"874212","manufacturer_id":"YT75T","brand_name":"Yeti","product_name":" YETI Tundra 75 Cooler","long_description":"Sized to accommodate big groups and built to handle the abuse of outdoor adventures while keeping your food and drinks icy cold, the super-rugged YETI Tundra 75 Cooler is anything but ordinary. Rotomolded polyethylene construction, the same process used to make whitewater kayaks, ensures excellent impact resistance and long-lasting durability. Extra-thick walls contain proprietary PermaFrost(TM) insulation that is pressure injected, giving the cooler outstanding resistance to outside temperatures. YETI coolers are designed to handle extremely low temperatures and are compatible with dry ice; dry ice provides about 3 times the cooling power of regular ice. Tundra 75 cooler has a 70.75-liter capacity that will hold 50 cans and plenty of ice; designed to accommodate long-neck bottles. Tundra lid seals shut with a freezer-quality gasket around the entire lid to minimize air exchange. Interagency Grizzly Bear Committee has certified the Tundra 75 as a bear-resistant food container when used with 2 padlocks (sold separately) on both front corners. Tie-down slots are molded into the cooler body for solid mounting in your boat or truck; cooler can be secured while allowing access to the inside; straps sold separately. Full-length, rustproof aluminum rod connects and holds the body and lid together; hinge stops are molded in the lid so the hinge will never break. Screw-in gasketed drain plug won't leak; partially unscrew the plug to drain water. Haul handles on the ends are designed to make carrying a loaded cooler easier for 2 people; textured grips are secured with marine-grade nylon rope. Use the integrated recessed handles when you're carrying the cooler by yourself. Included dry goods rack keeps your sandwiches from getting soggy. Nonmarking rubber feet on the bottom of the cooler keep it from sliding around the deck of your boat. YETI Tundra 75 Cooler measures 33.25 x 17.9 x 18 in.","short_description":"Sized to accommodate big groups and built to handle the abuse of outdoor adventures while keeping your food and drinks icy cold, the super-rugged YETI Tundra 75 Cooler is anything but ordinary.","category":"Camping And Hiking","subcategory":"Camp Kitchen","product_group":"Coolers","thumb_url":"http://i1.avlws.com/115/s443435.png","image_url":"http://i1.avlws.com/115/l443435.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=443435&tt=df","keywords":"ice chests","retail_price":"450.00","sale_price":"450.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=443435\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m443435.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874212&amp;link=&amp;tabs=-Details\"></script>","variants":{"8742120001":{"sku":"8742120001","vendor_sku":"YT75T","upc":"014394530760","color":"TAN","retail_price":"450.00","sale_price":"450.00"}}}
