{"sku":"874369","manufacturer_id":"015401210109","brand_name":"Point 65","product_name":" Point 65 Martini GTX Solo Modular Kayak","long_description":"The Point 65 Martini GTX Solo Modular Kayak is a take-apart touring kayak with a roomy, comfortable cockpit so you can explore your favorite lakes and then take the boat home in the back of your car. The Martini GTX is designed for both kids and adults; whether you're paddling, fishing or relaxing, this comfortable kayak is stable and strong for family fun on the water. Made from durable single-layer, UV-resistant polyethylene plastic, the Martini GTX snaps apart and re-assembles in seconds, making the kayak easy to transport in a car. No need to buy 2 kayaks-snap in the middle section (sold separately) to turn the Martini GTX into a tandem kayak. Equipped with a comfortable AIR seat with backrest; seat cover is made of durable, comfortable honeycomb-patterned material with meshlike fabric that's laminated over EVA foam. Molded-in carrying handles for simple carrying. Integrated rudder in back and rudder foot pedals inside the cockpit. Includes watertight front and rear gear compartments. Bungee cords offer additional storage, and \"Fish-O-Meter\" hash marks on hull measure your catch. Use the paddle keeper to secure your paddle to the boat to free your hands when you're fishing. Integrated cup holders are located behind the cockpit.","short_description":"The Point 65 Martini GTX Solo Modular Kayak is a take-apart touring kayak with a roomy, comfortable cockpit so you can explore your favorite lakes and then take the boat home in the back of your car.","category":"Paddling","subcategory":"Kayaks","product_group":"Recreational Kayaks","thumb_url":"http://i1.avlws.com/115/s455567.png","image_url":"http://i1.avlws.com/115/l455567.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=455567&tt=df","retail_price":"999.00","sale_price":"999.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=455567\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m455567.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874369&amp;link=&amp;tabs=-Details\"></script>","variants":{"8743690001":{"sku":"8743690001","vendor_sku":"015401210109","size":"9 FT 4 IN","color":"BLUE","retail_price":"999.00","sale_price":"999.00"}}}
