{"sku":"874308","manufacturer_id":"GLN4-M1-R8","brand_name":"Nite Ize","product_name":" Nite Ize Gear Line Organization System","long_description":"Attach camp gear to the Nite Ize Gear Line Organization System with sturdy S-Biner double-gated carabiner clips in alternating sizes, attached to a sturdy loop with reusable twist ties on each end. Attach tools, gear, gadgets or clothing to each S-Biner and hang the Gear Line to any hook or knob via the Gear Tie reusable twist ties. Go vertical when you want to maximize storage and save wall space; hang horizontally to keep things easily accessible at eye level or quickly dry out gear. Each S-Biner clips securely closed and unclips easily for fast, convenient attachment and detachment, and can easily be interchanged. Use Gear Lines in the garage, on the boat, in the home, at camp and in countless other places where things need to be secured and organized. 4 ft. length includes five #2 and five #4 plastic S-Biners; features high-quality, durable webbing. Colorful translucent S-Biner double-gated carabiner clips easily hold a variety of items for secure attachment and easy release. The Nite Ize Gear Line Organization System features a 2 x 12 in. Gear Tie on each end for versatile attachment options.","short_description":"Attach camp gear to the Nite Ize Gear Line Organization System with sturdy S-Biner double-gated carabiner clips in alternating sizes, attached to a sturdy loop with reusable twist ties on each end.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Tent Accessories","thumb_url":"http://i1.avlws.com/115/s453111.png","image_url":"http://i1.avlws.com/115/l453111.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=453111&tt=df","retail_price":"19.95","sale_price":"19.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=453111\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m453111.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874308&amp;link=&amp;tabs=-Details\"></script>","variants":{"8743080001":{"sku":"8743080001","vendor_sku":"GLN4-M1-R8","upc":"094664027145","size":"4 FT","retail_price":"19.95","sale_price":"19.95"}}}
