{"sku":"874325","manufacturer_id":"61317-0903-11.5","brand_name":"Salewa","product_name":"Salewa Vertical Pro GTX Mountaineering Boots - Men's","long_description":"Climb waterfall ice or cross Mt. Rainier glaciers with the insulated and waterproof Salewa Vertical Pro GTX Mountaineering Boots. The soles adjust from fully rigid to flexible depending on your use. 3mm Perwanger leather uppers are paired with polyamide fabric panels to offer highly abrasion-resistant performance with good flexibility; full rubber rands for protection. Breathable GORE-TEX(R) membranes allow vapor to leave boots yet stop water from reaching feet; nylon inner linings wick moisture away from feet. GORE-TEX Duratherm synthetic insulation is bonded to the membrane, offering lightweight warmth and breathability without bulk. Salewa 3F System Evo fit supports your ankles without decreasing motion and foward movement. Flex System allows you to stiffen the soles while on the go; choose from either climb mode or walk mode. Boots can be adjusted to become 100% rigid for climbing or semi-flexible for more comfortable walking on the approach. Nylon/fiberglass shanks provide support and torsional rigidity for comfort over the long haul, and stiffness when ice climbing. Cinch the integrated ankle gaiters snug with the drawstrings and cordlocks to keep snow and trail debris out of the boots. Salewa Vertical Pro GTX Mountaineering Boots boast durable Vibram rubber outsoles for great all-around performance.","short_description":"Climb waterfall ice or cross Mt. Rainier glaciers with the insulated and waterproof Salewa Vertical Pro GTX Mountaineering Boots. The soles adjust from fully rigid to flexible depending on your use.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Boots","thumb_url":"http://i1.avlws.com/115/s450051.png","image_url":"http://i1.avlws.com/115/l450051.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450051&tt=df","retail_price":"474.00","sale_price":"474.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450051\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450051.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874325&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["footwear","mens-footwear","mens-boots"]}
