{"sku":"874459","manufacturer_id":"05145","brand_name":"Msr","product_name":"MSR Mutha Hubba Tent - 2013 Closeout","long_description":"The MSR Mutha Hubba Tent is ideal for a minimalist trio backpacking deep into the Sierras in the heat of summer, or tackling the Appalachian Trail for an extended trip in the spring. Configured to maximize the tent's interior space, the strong and light hubbed pole system sets up easily. Vertical end panels help keep the tent wall from hitting the footbox of your sleeping bag-even for tall campers. Rainfly and floor fabrics balance weight and durability; you get a long-lasting, high performing tent that won't weigh you down. High-tech ripstop nylon rainfly reduces weight, and the silicon and polyurethane coating increases durability and resistance to damaging UV rays. 2 doors and 2 vestibules give each person easy access and personal gear storage. Stay-dry entries ensure water won't drip into the tent when door is opened for ventilation in rainy weather. Mesh canopy offers excellent ventilation in warm climates and the dark color is easy to see through with little or no distortion. Pockets at each end of tent help keep small items organized; hang loops inside tent provide points to hang your headlamp or damp clothes. Rainfly rolls back halfway for a great view on starry nights and quickly rolls down if clouds move in. Vestibule can be rolled back in either direction for maximum ventilation or, in strong rainstorms, can be left open at the bottom to facilitate ventilation. Taped seams; reinforced stress points; ultralight stake loops; user-friendly door toggles. Save weight and create a minimalist shelter by using just the rainfly, footprint (sold separately), poles and stakes. Includes stuff sacks, J-stakes and guyline/tighteners. Closeout.","short_description":"The MSR Mutha Hubba Tent is ideal for a minimalist trio backpacking deep into the Sierras in the heat of summer, or tackling the Appalachian Trail for an extended trip in the spring.","category":"Camping And Hiking","subcategory":"Tents","product_group":"Backpacking Tents","thumb_url":"http://i1.avlws.com/115/s424315.png","image_url":"http://i1.avlws.com/115/l424315.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=424315&tt=df","retail_price":"449.95","sale_price":"329.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=424315\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m424315.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874459&amp;link=&amp;tabs=-Details\"></script>","variants":{"8744590001":{"sku":"8744590001","vendor_sku":"05145","upc":"487445900018","color":"GREEN","retail_price":"329.73","sale_price":"329.73"}},"categories":["camping-hiking","tents","backpacking-tents"]}
