{"sku":"874452","manufacturer_id":"41301","brand_name":"Goal Zero","product_name":"Goal Zero Guide 10 Plus Solar Recharge Kit with Rock Out 2 Speaker","long_description":"The Goal Zero Guide 10 Plus Solar Recharge Kit and Rock Out 2 Speaker bring together a battery pack, Nomad 7 solar panel, and portable speaker to keep you powered up and enjoying tunes in the sun. Guide 10 Plus battery pack includes 4 rechargeable AA batteries, a AAA adapter and charges 2 ways: either use the Nomad 7 solar panel or plug it into a USB power source. Once charged, the Guide 10 will power your smartphone, MP3, GPS or tablet via the USB connection, or use the removable AA or AAA batteries for headlamps, flashlights and more. Weather-resistant Nomad 7 solar panel unfolds to capture the sun's power and charge your handheld USB- and 12V-compatible devices. Rock Out 2 portable speaker lets you take epic sound with you anywhere; amped-up sound and toned-down size fit the bill for all your excursions and impromptu dance parties. Speaker amplifies tunes from your MP3, phone or laptop for over 20 hrs. without draining battery power from your device. Recharge anywhere, anytime-juice up the internal lithium battery in 2 hrs. from USB, or from the sun using the included Nomad 7 solar panel.","short_description":"The Goal Zero Guide 10 Plus Solar Recharge Kit and Rock Out 2 Speaker bring together a battery pack, Nomad 7 solar panel, and portable speaker to keep you powered up and enjoying tunes in the sun.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Solar And Portable Power","thumb_url":"http://i1.avlws.com/115/s458247.png","image_url":"http://i1.avlws.com/115/l458247.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=458247&tt=df","keywords":"charger,rechargeable batteries","retail_price":"180.00","sale_price":"180.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=458247\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m458247.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874452&amp;link=&amp;tabs=-Details\"></script>","variants":{"8744520001":{"sku":"8744520001","vendor_sku":"41301","upc":"847974003022","color":"GRAY","retail_price":"180.00","sale_price":"180.00"}},"categories":["camping-hiking","camp-electronics","solar-and-portable-power"]}
