{"sku":"874470","manufacturer_id":"L30922300","brand_name":"Salomon","product_name":" Salomon XR Mission CS Trail-Running Shoes - Women's - 2013 Closeout","long_description":"Built for training runs on trails or the occasional road, the women's Salomon XR Mission CS Trail-Running Shoes feature ClimaShield(TM) forefoot membranes for breathable, waterproof protection. Breathable, abrasion-resistant nylon mesh uppers feature synthetic leather overlays that wrap insteps for lateral stability. ClimaShield(TM) waterproof, breathable membranes over the forefoot area keep mud and rain off your toes without sacrificing breathability through the rest of the shoe. Quicklace(TM) lacing system with friction-free eyelets takes just a single pull for a perfect fit; lace pocket hides lacing away. Protective toe caps guard against bumps and abrasion. Foam insoles enhance comfort. Polyester mesh linings wick moisture away from feet for dry comfort. EVA midsoles protect against trail impacts, and thermoplastic urethane inserts provide a barrier against sharp rocks underfoot. OS Tendon thermoplastic urethane frames run along the outsoles of the shoes to facilitate better heel-to-toe transitions and push-off efficiency. Contagrip(R) rubber outsoles provide tenacious grip. Salomon XR Mission CS Trail-Running Shoes for women have reflective detailing to increase visibility in low light. Closeout.","short_description":"Built for training runs on trails or the occasional road, the women's Salomon XR Mission CS Trail-Running Shoes feature ClimaShield(TM) forefoot membranes for breathable, waterproof protection.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s443211.png","image_url":"http://i1.avlws.com/115/l443211.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=443211&tt=df","retail_price":"130.00","sale_price":"90.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=443211\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m443211.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874470&amp;link=&amp;tabs=-Details\"></script>","variants":{"8744700001":{"sku":"8744700001","vendor_sku":"L30922300","upc":"080694759217","size":"5","color":"MOOREA BLUE","retail_price":"90.73","sale_price":"90.73"}}}
