{"sku":"874581","manufacturer_id":"56P-GRY","brand_name":"Mio","product_name":" MIO LINK Heart Rate Monitor","long_description":"Make Mio LINK Heart Rate Monitor the heart of your training! This accurate, continuous heart rate wristband connects to mobile fitness apps and sport devices to drive your optimal training results. Enjoy Mio Continuous Technology with EKG-accurate heart rate data at even performance speeds with no uncomfortable chest strap. In extensive testing against top heart rate chest straps, Mio LINK consistently performed with 99% EKG accuracy, even while running and cycling at speeds of up to 14.4 MPH. LED lights and an electro-optical cell \"sense\" the volume of blood under the skin; sophisticated algorithms are applied to your pulse signal to detect your heart's true rhythm. 5 customizable heart rate zones; LED lights tell you which zone you're in, so you can stay on track with your training goals. Connect to your favorite fitness apps and sport devices with Bluetooth Smart (4.0) and ANT+ wireless. Soft silicone and a formfitting design make the lightweight Mio LINK comfortable to wear, even during the most rigorous workouts. The Mio LINK Heart Rate Monitor fits a wide range of wrist sizes; with no need for a chest strap, it is easy to put on and take off.","short_description":"Make Mio LINK Heart Rate Monitor the heart of your training! This accurate, continuous heart rate wristband connects to mobile fitness apps and sport devices to drive your optimal training results.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s455731.png","image_url":"http://i1.avlws.com/115/l455731.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=455731&tt=df","keywords":"watch","retail_price":"99.00","sale_price":"99.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=455731\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m455731.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874581&amp;link=&amp;tabs=-Details\"></script>","variants":{"8745810001":{"sku":"8745810001","vendor_sku":"56P-GRY","upc":"693472586747","size":"S/M","color":"SLATE","retail_price":"99.00","sale_price":"99.00"},"8745810002":{"sku":"8745810002","vendor_sku":"56P-GRY-L","upc":"693472586723","size":"L/XL","color":"SLATE","retail_price":"99.00","sale_price":"99.00"}},"categories":["fitness","running","fitness-electronics"]}
