{"sku":"874600","manufacturer_id":"131302502","brand_name":"Native Eyewear","product_name":"Native Eyewear Cable Polarized Sunglasses - Men's","long_description":"Whether you're in the snow or at the beach, keep your eyes protected from sun and glare with the Cable Polarized Sunglasses from Native Eyewear. Snap-Back(TM) Interchange lens system lets you switch lenses to accommodate a variety of light conditions and activities. Includes 2 pairs of lenses: the polarized N3(TM) and non-polarized Sport-Flex(TM) for low light; both block 100% of UVA and UVB rays. Additional lenses are sold separately. Innovative and advanced polarized N3 lenses pass Z87.1 testing and feature up to 40% IR reduction, UV protection up to 400nm, and state-of-the-art blue light filtering. Polarized Crystal Carbonate(R) optical-quality, impact- and scratch-resistant lenses block 100% of harmful UV light and eliminate glare for sharp, clear vision. Reflex lenses work well for all light conditions, especially extremely bright to moderate sunlight because the Reflex coating blocks more light. Rhyno-Tuff(R) Air frames endure extreme highs and lows in temperature. 4-point Anti-Ocular Intrusion System(R) helps prevent lenses from touching your eyes in the event of high-velocity impact. Venting system incorporated into the frames enhances airflow and virtually eliminates fog and condensation. Self-adjusting Cushinol(TM) nosepads create a nonslip grip that keeps sunglasses in place, ensuring a soft feel and custom fit;. Cushinol temple boots keep sunglasses from slipping during athletic activity. Cam-Action Hinges(TM) allow the temples to quickly lock into position, getting you ready for action. Native Eyewear Cable Polarized Sunglasses best fit a large to extra-large profile; includes a soft carry bag and cleaning cloth.","short_description":"Whether you're in the snow or at the beach, keep your eyes protected from sun and glare with the Cable Polarized Sunglasses from Native Eyewear.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s444587.png","image_url":"http://i1.avlws.com/115/l444587.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=444587&tt=df","keywords":"Cycling","retail_price":"129.00","sale_price":"129.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=444587\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m444587.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874600&amp;link=&amp;tabs=-Details\"></script>","variants":{"8746000001":{"sku":"8746000001","vendor_sku":"131302502","upc":"764824006234","size":"GRAY","color":"ASPHALT","retail_price":"129.00","sale_price":"129.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
