{"sku":"874664","manufacturer_id":"SS020658000","brand_name":"Suunto","product_name":" Suunto Ambit2 R GPS Multifunction Heart Rate Monitor","long_description":"The Suunto Ambit2 R GPS Multifunction Heart Rate Monitor enhances your running experience with a heart rate monitor, GPS and accelerometer for pace, speed, cadence, distance and full route navigation. Included heart rate monitor allows you to track heart rate limits and graph in real time. Training plans and running apps make it easy to improve and keep track of every aspect of your performance. Plan, analyze and share your runs on Movescount.com; choose from dozens of running-specific Suunto Apps to further customize your training experience. Enjoy accurate route navigation with up to 12 hrs. of battery life with GPS turned on. Training functions include speed, pace, distance, running cadence and training plans. Key outdoor functions include route navigation, track back, GPS altitude and a compass. ANT+ wireless compatibility with included heart rate monitor and optional foot pod (not included). The Suunto Ambit2 R GPS Multifunction Heart Rate Monitor is water-resistant to 50m (164 ft.).","short_description":"The Suunto Ambit2 R GPS Multifunction Heart Rate Monitor enhances your running experience with a heart rate monitor, GPS and accelerometer for pace, speed, cadence, distance and full route navigation.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s448403.png","image_url":"http://i1.avlws.com/115/l448403.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448403&tt=df","keywords":"odometer,waterproof","retail_price":"299.95","sale_price":"299.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448403\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448403.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874664&amp;link=&amp;tabs=-Details\"></script>","variants":{},"extended_xml_attributes":"\n\t\t\t\n\t\t","categories":["camping-hiking","camp-electronics","watches"]}
