{"sku":"874770","manufacturer_id":"M33844","brand_name":"Vibram","product_name":"Vibram FiveFingers Speed Shoes - Men's - 2011 Closeout","long_description":"Vibram FiveFingers Speed Shoes offer casual appeal for after-sport or travel, thanks to a classic look and lace-up design, all aboard the natural FiveFingers platform. Airy polyester and nylon mesh uppers ensure great breathability and comfort while keeping debris out; Lycra(R) nylon flex panels stretch to provide a snug fit. Individual toe slots enhance dexterity, control and stability to deliver a natural foot motion; toe bumpers enhance protection. Traditional lacing system allows for a comfortable, custom fit across a wide range of foot shapes. Antibacterial treatment helps deter odors. Moisture-wicking nylon covers 2mm polyurethane insoles to provide comfort and cushioning underfoot, with special emphasis under the ball of the foot. Outsole traction pods follow the curves of feet and toes; made of nonmarking Vibram TC1 rubber. 3M reflective hits increase your visibility in low light. In order to allow your feet to adapt to using different muscles, begin use of these shoes gradually and increase over time. Vibram FiveFingers Speed Shoes are machine washable in cold water; air dry only, away from sun or heat source. To determine size, stand with heels against a wall and measure from the wall to the tip of the longest toe on each foot; use the longer of the 2 lengths with the size chart. Closeout.","short_description":"Vibram FiveFingers Speed Shoes offer casual appeal for after-sport or travel, thanks to a classic look and lace-up design, all aboard the natural FiveFingers platform.","category":"Footwear","subcategory":"Men's Footwear","product_group":"Men's Shoes","thumb_url":"http://i1.avlws.com/115/s448215.png","image_url":"http://i1.avlws.com/115/l448215.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448215&tt=df","retail_price":"100.00","sale_price":"61.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448215\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448215.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874770&amp;link=&amp;tabs=-Details\"></script>","variants":{"8747700004":{"sku":"8747700004","vendor_sku":"M33844","upc":"487477000045","size":"44","color":"BLACK/WHITE/BLACK LACE","retail_price":"61.73","sale_price":"61.73"}},"categories":["footwear","mens-footwear","mens-shoes"]}
