{"sku":"874772","manufacturer_id":"W453840","brand_name":"Vibram","product_name":" Vibram FiveFingers Spyridon Trail-Running Shoes - Women's - 2012 Closeout","long_description":"Light, agile and tough, Vibram FiveFingers Spyridon Trail-Running Shoes boast minimalist construction with trail-hungry outsoles and formfitting, breathable uppers. Lightweight, formfitting uppers are 34% post-industrial coconut fibers to offer natural breathability and odor-resistance; sturdy construction ensures trail-ready resilience. Instep straps provide a secure fit that's easily adjusted with the rip-and-stick closures. Individual toe slots enhance dexterity, control and stability to help enable a natural foot motion; toe bumpers supply added protection. Reflective detailing increases your visibility in low light. Moisture-wicking, anti-microbial Drilex(R) nylon covers 3mm polyurethane insoles, which act as the midsoles, providing comfort and cushioning underfoot. Molded nylon mesh under the outsoles allows for full mobility of the shoes and helps disperse impacts over a wide surface area, lessening the impact. 3.5mm Vibram rubber outsoles feature an aggressive tread design to supply dynamic, sure-footed traction in all directions. Recommended for light trekking and trail-running. In order to allow your feet to adapt to using different muscles, begin use of these shoes gradually and increase over time. Vibram FiveFingers Spyridon trail-running shoes are machine washable in cold water; air dry only, away from sun or heat source. All-synthetic construction makes these vegan-friendly. To determine size, stand with heels against a wall and measure from the wall to the tip of the longest toe on each foot; use the longer of the 2 lengths with the size chart. Closeout.","short_description":"Light, agile and tough, Vibram FiveFingers Spyridon Trail-Running Shoes boast minimalist construction with trail-hungry outsoles and formfitting, breathable uppers.","category":"Footwear","subcategory":"Women's Footwear","product_group":"Women's Shoes","thumb_url":"http://i1.avlws.com/115/s448235.png","image_url":"http://i1.avlws.com/115/l448235.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=448235&tt=df","retail_price":"110.00","sale_price":"76.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=448235\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m448235.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=874772&amp;link=&amp;tabs=-Details\"></script>","variants":{"8747720002":{"sku":"8747720002","vendor_sku":"W453837","upc":"487477200025","size":"37","color":"LILAC/BLACK/GREEN","retail_price":"76.73","sale_price":"76.73"},"8747720003":{"sku":"8747720003","vendor_sku":"W453838","upc":"487477200032","size":"38","color":"LILAC/BLACK/GREEN","retail_price":"76.73","sale_price":"76.73"},"8747720004":{"sku":"8747720004","vendor_sku":"W453839","upc":"487477200049","size":"39","color":"LILAC/BLACK/GREEN","retail_price":"76.73","sale_price":"76.73"},"8747720005":{"sku":"8747720005","vendor_sku":"W453840","upc":"487477200056","size":"40","color":"LILAC/BLACK/GREEN","retail_price":"76.73","sale_price":"76.73"}}}
