{"sku":"875225","manufacturer_id":"62026","brand_name":"Camelbak","product_name":" CamelBak Cloud Walker Hydration Pack - 70 fl. oz. - 2013 Closeout","long_description":"The CamelBak Cloud Walker Hydration Pack is perfect for short outings and day hikes. It offers storage for your gear and easy, hands-free drinking while you're on the trail. 70 fl. oz. Antidote(TM) reservoir features a welded center baffle and low-profile shape for stability. Hydration compartment loads easily, holding the reservoir flat against your back to leave more room for layers and gear. Wide-mouth port cuts weight and makes it easy to fill and clean the reservoir; quick-snap cap tightens in just a quarter turn. Folding arms lock into position to hold the reservoir open when drying; arms tuck out of the way around the port when not in use. Bite valve is ergonomically positioned for easy drinking; handy HydroLock(TM) securely shuts off water flow. Reservoir is taste-free, easy to clean and easy to fill via its large, 3.5-in. opening. Main compartment holds gear while the outside zippered pocket keeps small essentials close at hand. Harness and air-mesh back panel offer stability, ventilation and comfort. 2 compression straps help stabilize the load. Features an abrasion-resistant ripstop nylon construction. Closeout.","short_description":"The CamelBak Cloud Walker Hydration Pack is perfect for short outings and day hikes. It offers storage for your gear and easy, hands-free drinking while you're on the trail.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s449047.png","image_url":"http://i1.avlws.com/115/l449047.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449047&tt=df","retail_price":"80.00","sale_price":"62.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449047\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449047.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=875225&amp;link=&amp;tabs=-Details\"></script>","variants":{"8752250001":{"sku":"8752250001","vendor_sku":"62026","upc":"487522500018","size":"70 FL OZ","color":"BRICK/SOIL","retail_price":"62.73","sale_price":"62.73"}}}
