{"sku":"875223","manufacturer_id":"62000","brand_name":"Camelbak","product_name":"CamelBak Alpine Explorer Hydration Pack - 100 fl. oz. - 2013 Closeout","long_description":"The CamelBak Alpine Explorer Hydration Pack has great cargo capacity, technical features and easy access to the reservoir inside. It's perfect for fast-paced, done-in-a-day endeavors. Dynamic Suspension(TM) harness with Slider(TM) sternum strap sports shoulder straps that adjust automatically to find a comfortable position on wide or narrow shoulders. Comfortable hipbelt is removable. Air Director(TM) back panel features foam pods covered in soft mesh that create multiple ventilation channels, helping ensure air flow and comfort. 100 fl. oz. Antidote(TM) reservoir features a welded center baffle and a low-profile shape for stability. Quick Link(TM) system lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director, flow meter or hanger (accessories not included). Hydration sleeve holds the reservoir flat against your back to leave more room for layers and gear. Wide mouth makes it easy to fill and clean the reservoir; quick-snap cap tightens in just a quarter turn. Folding arms lock into position to hold the reservoir open when drying; arms tuck out of the way around the port when not in use. Features include an organizer pocket, quick-stash stuff-it pocket, sunglasses/media pocket, tool attachment points, mesh side pockets and 4-point compression straps. Closeout.","short_description":"The CamelBak Alpine Explorer Hydration Pack has great cargo capacity, technical features and easy access to the reservoir inside. It's perfect for fast-paced, done-in-a-day endeavors.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s449039.png","image_url":"http://i1.avlws.com/115/l449039.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449039&tt=df","retail_price":"115.00","sale_price":"89.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449039\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449039.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=875223&amp;link=&amp;tabs=-Details\"></script>","variants":{"8752230002":{"sku":"8752230002","vendor_sku":"62000","upc":"487522300021","size":"100 FL OZ","color":"SOIL/BRICK","retail_price":"89.73","sale_price":"89.73"}},"categories":["camping-hiking","backpacks","day-packs"]}
