{"sku":"875268","manufacturer_id":"61923","brand_name":"Camelbak","product_name":" CamelBak Ultra LR Hydration Vest - 2013 Closeout","long_description":"Before your next long-distance run or trail race, load up the CamelBak Ultra LR Hydration Vest with water and energy food to get you through the day. 70 fl. oz. Antidote(TM) lumbar reservoir is equipped with the Quick Link(TM) connection system for hassle-free removal of the drinking tube. Reservoir is housed in the lumbar portion of the pack to keep the water weight off your shoulders. Big Bite(TM) valve is easy to use-just bite and sip; HydroLock(TM) valve shuts off water, preventing leakage during transport. Cargo pockets on the shoulder straps are sized to fit water bottles; keep energy bars and gels handy in the waistbelt pockets. Stuff an extra clothing layer in the mesh shockcord pocket; pack provides 200 cu. in. of storage space. Harness system adjusts quickly and easily to fit most back lengths. 2 sternum straps adjust up and down so you can position them for the most comfortable fit. Safety whistle on the left shoulder strap. The CamelBak Ultra LR Hydration Vest has reflective hits to increase visibility in low light. Closeout.","short_description":"Before your next long-distance run or trail race, load up the CamelBak Ultra LR Hydration Vest with water and energy food to get you through the day.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s449059.png","image_url":"http://i1.avlws.com/115/l449059.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449059&tt=df","retail_price":"130.00","sale_price":"100.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449059\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449059.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=875268&amp;link=&amp;tabs=-Details\"></script>","variants":{"8752680001":{"sku":"8752680001","vendor_sku":"61923","upc":"487526800015","size":"70 FL OZ","color":"SKYDIVER/EGRET","retail_price":"100.73","sale_price":"100.73"}}}
