{"sku":"875224","manufacturer_id":"62077","brand_name":"Camelbak","product_name":" CamelBak Rim Runner Hydration Pack - 100 fl. oz. - 2013 Closeout","long_description":"The comfortable CamelBak Rim Runner Hydration Pack is a capable gear hauler with an ample reservoir to keep you hydrated during done-in-a-day adventures. 100 fl. oz. Antidote(TM) reservoir features a welded center baffle and low-profile shape for stability. Quick Link(TM) system lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director, flow meter or hanger (accessories not included). Hydration compartment loads easily, holding the reservoir flat against your back to leave more room for layers and gear. Wide-mouth port cuts weight and makes it easy to fill and clean the reservoir; quick-snap cap tightens in just a quarter turn. Folding arms lock into position to hold the reservoir open when drying; arms tuck out of the way around the port when not in use. Reservoir is taste-free, easy to clean and easy to fill via a large, 3.5-in.-wide opening. Big Bite(TM) valve is ergonomically positioned for easy drinking, and stores clean and protected inside bite valve cover. Ergonomically designed harness spreads the weight across the back for load stability and comfort. Padded shoulder straps with sternum strap and a removable webbing hipbelt help distribute the load evenly. Breathable back panel with air mesh keeps air flowing across the back; 1-in.-wide hipbelt is removable for weight savings. Main compartment holds lunch or gear; front pocket, with a weather-resistant zipper, keeps small essentials close at hand. Small zippered pocket with soft lining is perfect for storing sunglasses or MP3 player; includes exit port for headphones cord. Dual side-compression straps stabilize the load; daisy chain and bungee cinch system stash gear outside. Closeout.","short_description":"The comfortable CamelBak Rim Runner Hydration Pack is a capable gear hauler with an ample reservoir to keep you hydrated during done-in-a-day adventures.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s449043.png","image_url":"http://i1.avlws.com/115/l449043.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449043&tt=df","retail_price":"100.00","sale_price":"79.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449043\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449043.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=875224&amp;link=&amp;tabs=-Details\"></script>","variants":{"8752240001":{"sku":"8752240001","vendor_sku":"62077","upc":"487522400011","size":"100 FL OZ","color":"BAMBOO/SPROUT","retail_price":"79.73","sale_price":"79.73"}}}
