{"sku":"875220","manufacturer_id":"61933","brand_name":"Camelbak","product_name":"CamelBak Vantage FT 35 Hydration Pack - 100 fl. oz. - 2013 Closeout","long_description":"The CamelBak Vantage FT 35 Hydration Pack helps you stay comfortable and well-watered during a long day or an overnighter. It offers easy zippered access to the reservoir via the back panel. 100 fl. oz. Antidote(TM) reservoir features a welded center baffle and low-profile shape for stability. Quick Link(TM) system lets you effortlessly add accessories such as a Fresh(TM) filter, insulated tube, tube director, flow meter or hanger (accessories not included). Hydration compartment loads easily, holding the reservoir flat against your back to leave more room for layers and gear. Wide-mouth port cuts weight and makes it easy to fill and clean the reservoir; quick-snap cap tightens in just a quarter turn. Folding arms lock into position to hold the reservoir open when drying; arms tuck out of the way around the port when not in use. Big Bite(TM) valve is ergonomically positioned for easy drinking. Reservoir does not retain tastes or odors and is easy to clean and fill via the large, 3.5-in. opening. PureFlow(TM) delivery tube makes every drink taste clean, not like plastic. With its separate zippered opening, the reservoir can be easily refilled without removing it from the pack; insulated reservoir pocket keeps your water cool for hours. Padded shoulder straps, sternum strap and load-bearing hipbelt provide maximum comfort and even load distribution. Back panel offers ventilation and a stable center of gravity; dual V-shaped aluminum stays provide support and transfer load weight to the hipbelt. Main compartment holds food, gear and your 10 essentials for a 1-day peak ascent or an overnight trip. Zippered lid pocket keeps electronics, cell phone and other valuables close at hand. Side compression straps help stabilize the load; tool loops and lash points let you attach extra gear on the outside. Side stretch pockets, front stash pocket and internal organizer pocket store hiking essentials. Closeout.","short_description":"The CamelBak Vantage FT 35 Hydration Pack helps you stay comfortable and well-watered during a long day or an overnighter. It offers easy zippered access to the reservoir via the back panel.","category":"Camping And Hiking","subcategory":"Backpacks","product_group":"Day Packs","thumb_url":"http://i1.avlws.com/115/s449027.png","image_url":"http://i1.avlws.com/115/l449027.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=449027&tt=df","retail_price":"195.00","sale_price":"149.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=449027\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m449027.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=875220&amp;link=&amp;tabs=-Details\"></script>","variants":{"8752200001":{"sku":"8752200001","vendor_sku":"61933","upc":"487522000013","size":"100 FL OZ","color":"NUGGET GOLD","retail_price":"149.73","sale_price":"149.73"}},"categories":["camping-hiking","backpacks","day-packs"]}
