{"sku":"875374","manufacturer_id":"2640010","brand_name":"Eureka","product_name":" Eureka Magic 125 LED Lantern - 2014 Overstock","long_description":"The handy battery-operated Magic 125 LED Lantern from Eureka is safe to hang in your tent or camper van and transforms from lantern to flashlight. Bright yet soft LED lighting produces 125 lumens on high, 45 on low; there's also a flashing mode. Knob on rim lets you rotate the LED housing so the light is emitted through the top for use as a torch-style flashlight. Textured opaque lens directs light in flashlight mode. Rippled convex reflector cone disperses light into smooth pattern in lantern mode. Swiveling wire loop on bottom plus included small carabiner-style clip let you hang the lantern upside down in a tent. Multi-function push-button switch for off, high, low and hold for strobe. Green LED locater light flashes every 5 seconds so you can find the lantern in the dark when it's turned off. Eureka Magic 125 LED Lantern features an aluminum housing with anodized finish for durability. Carry strap and carabiner-style clip included; runs on 4 AA batteries, also included. Overstock.","short_description":"The handy battery-operated Magic 125 LED Lantern from Eureka is safe to hang in your tent or camper van and transforms from lantern to flashlight.","category":"Camping And Hiking","subcategory":"Camp Lighting","product_group":"Lanterns","thumb_url":"http://i1.avlws.com/115/s450191.png","image_url":"http://i1.avlws.com/115/l450191.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=450191&tt=df","retail_price":"39.99","sale_price":"29.73","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=450191\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m450191.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=875374&amp;link=&amp;tabs=-Details\"></script>","variants":{"8753740001":{"sku":"8753740001","vendor_sku":"2640010","upc":"083826400100","color":"YELLOW","retail_price":"29.73","sale_price":"29.73"}}}
