{"sku":"876183","manufacturer_id":"9781612386614","product_name":"Rick Steves' Best of Europe - 2014","long_description":"In the 2014 edition of. Author: Rick Steves. Softcover; 1,455 pages; black-and-white photos and maps and color maps. Avalon Travel Publishing; copyright 2014. Guide covers the best of Austria, Belgium, the Czech Republic, Denmark, France, Germany, Great Britain, Italy, the Netherlands, Spain and Switzerland. Picking the best places featured in his travel guides, Steves balances exciting cities with cozy towns, plus a healthy dose of Back Door ingenuity. Book is organized by countries and destination cities, each a mini-vacation on its own, filled with exciting sights and affordable accommodations. Each chapter covers: Planning Your Time, Orientation, Sights, Entertainment, Shopping, Sleeping, Eating, and Transportation Connections. The appendix provides telephone tips, climate chart, U.S. embassies and national tourist offices. Provides scores of custom-designed, user-friendly maps. 2-in. thick book is packed with info and measures 8 x 4.5 in.","short_description":"In the 2014 edition of Rick Steves' Best of Europe , the godfather of travel breaks Europe into its top destinations and explains how to maximize your fun while traveling.","category":"Books And Maps","subcategory":"Guidebooks","product_group":"Travel Guidebooks","thumb_url":"http://i1.avlws.com/115/s459259.png","image_url":"http://i1.avlws.com/115/l459259.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=459259&tt=df","retail_price":"25.98","sale_price":"25.98","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=459259\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m459259.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=876183&amp;link=&amp;tabs=-Details\"></script>","variants":{"8761830001":{"sku":"8761830001","vendor_sku":"9781612386614","retail_price":"25.98","sale_price":"25.98"}},"categories":["books","guidebooks","travel-guidebooks"]}
