{"sku":"876307","manufacturer_id":"010-01161-03","brand_name":"Garmin","product_name":"Garmin Edge 1000 GPS Bundle Bike Computer","long_description":"Bundled with speed, cadence and heart-rate sensors to enhance training, Garmin Edge 1000 GPS Bike Computer lets you compete against others in real time, compare past rides and connect to online media. Speed, cadence and heart-rate monitors offer a very accurate picture of your ride for analysis and training; GPS records distance, ascent descent, grade and more. Compete against yourself and others using Garmin Connect(TM) segments and see real-time results, including alerts for segment start and finish, and leaderboard rankings. Receive alerts for incoming calls, emails and text messages when paired with your smartphone and Garmin Connect Mobile app; instantly share your ride details via social media. Connect features allow you to send and receive course details, live tracking, social media sharing, weather and more. Bike-specific maps preloaded in Edge 1000 make it easy to get from point A to point B and back again; simply search for points of interest for turn-by-turn directions. Choose between cycling, touring and mountain biking modes to calculate the most appropriate route, taking you on paved roads, unpaved roads or on paths and trails. With round-trip routing, you can tell the Edge 1000 how far you'd like to ride and then choose from up to 3 ride options that will bring you back to where you started. User-friendly interface makes it easy to plan rest stops or to stop at cyclist-specific points of interest such bathrooms, cafes or full-service bike shops. Large 3 in. color touch screen displays info in an easily accessible and navigable format; touch screen is resistive, so you can still use it with gloves or in wet conditions. Touch-screen display adjusts automatically in low light. Unit measures 4.4 x 2.3 x .8 in.; display area is 3 in. diag. (2.6 x 1.5 in.), and 240 x 40 pixels; screen is readable in daylight.","short_description":"Bundled with speed, cadence and heart-rate sensors to enhance training, Garmin Edge 1000 GPS Bike Computer lets you compete against others in real time, compare past rides and connect to online media.","category":"Cycling","subcategory":"Bike Accessories","product_group":"Bike Computers","thumb_url":"http://i1.avlws.com/115/s459727.png","image_url":"http://i1.avlws.com/115/l459727.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=459727&tt=df","retail_price":"700.00","sale_price":"700.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=459727\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m459727.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=876307&amp;link=&amp;tabs=-Details\"></script>","variants":{"8763070001":{"sku":"8763070001","vendor_sku":"010-01161-03","upc":"753759120351","color":"BLACK","retail_price":"700.00","sale_price":"700.00"}},"categories":["cycling","bike-accessories","bike-computers"]}
