{"sku":"876438","manufacturer_id":"135 302 502","brand_name":"Native Eyewear","product_name":"Native Eyewear Wazee Polarized Sunglasses","long_description":"The Native Eyewear Wazee Polarized Sunglasses are comfortable at the park, on the river and everywhere in between. An exceptional value, these shades save plenty of dough for apres-activity fun. Glare-reducing polarization treatment offers sharp and crisp vision with increased contrast and depth perception. Single Snap-Back(TM) interchange lens system quickly and efficiently switches between different lens options (additional lenses not included). High-performance thermoplastic Rhyno-Tuff(R) air frames are extremely lightweight, yet durable enough to withstand high-velocity collisions and temperature extremes. Anti-Ocular Intrusion System(R) is designed to prevent the lenses from shooting toward the eyes in the event of high-velocity impact. Cushinol(TM) nose pads ensure a soft feel and custom fit regardless of nose shape or size, creating a non-slip fit that keeps sunglasses in place during athletic activity. Patented Cam-Action Hinges(TM) allow the temples to quickly lock into position. Mastoid Temple Grip(TM) ensures a secure and comfortable fit. Exhaust vents enhance airflow and virtually eliminate fog and condensation, while strategically placed hybrid vents and side vents keep frames snug on your face. Unique venting design allows maximum ventilation while blocking extraneous incoming light. The Native Eyewear Wazee Polarized Sunglasses come with a soft case.","short_description":"The Native Eyewear Wazee Polarized Sunglasses are comfortable at the park, on the river and everywhere in between. An exceptional value, these shades save plenty of dough for apres-activity fun.","category":"Camping And Hiking","subcategory":"Sunglasses","product_group":"Sport Sunglasses","thumb_url":"http://i1.avlws.com/115/s454583.png","image_url":"http://i1.avlws.com/115/l454583.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=454583&tt=df","keywords":"Cycling","retail_price":"89.00","sale_price":"89.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=454583\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m454583.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=876438&amp;link=&amp;tabs=-Details\"></script>","variants":{"8764380001":{"sku":"8764380001","vendor_sku":"135 302 502","upc":"764824006883","size":"GRAY","color":"ASPHALT","retail_price":"89.00","sale_price":"89.00"}},"categories":["camping-hiking","sunglasses","sport-sunglasses"]}
