{"sku":"876521","manufacturer_id":"53P-BLU","brand_name":"Mio","product_name":"Mio ALPHA Heart Rate Watch","long_description":"Love your heart rate monitor's chest strap? We didn't think so. With the Mio ALPHA Heart Rate Watch, kiss your sliding, chafing chest strap goodbye and enjoy accurate, comfortable monitoring. Strapless, continuous heart-rate monitoring breaks the mold with 2 light beams and an electro-optical cell in the case back that sense the volume of blood in your wrist. Signal from the electro-optical cell pulsates in sync with your heart; an advanced electronic circuit processes the signal and passes it to the embedded computer program. Separate motion sensor compensates for disruptions caused by arm movements that would otherwise interfere with the signal. User-settable heart rate zones feature 3-color visual alerts and audible alerts to keep you within your heart-rate target. Negative dot-matrix LCD screen provides continuous heart rate display. Data review includes total exercise time, average heart rate and time within your target zone; other features include a stopwatch and clock. Energy-efficient Bluetooth(R) Smart wireless transmitter works with popular exercise apps on iPhone 4s and newer to combine heart rate info with speed, distance and pace. Compatible apps include Endomondo, Wahoo Fitness, MapMyRun, MapMyRide, RunKeeper, Strava, miCoach and Mio GOiBike. The Mio ALPHA Heart Rate Watch features a soft silicone wristband with a secure snap latch, USB charging dock with magnetic alignment and a rechargeable lithium battery. Short wristband is sized for small wrists. Battery life in exercise mode lasts 10 - 15 hrs.","short_description":"Love your heart rate monitor's chest strap? We didn't think so. With the Mio ALPHA Heart Rate Watch, kiss your sliding, chafing chest strap goodbye and enjoy accurate, comfortable monitoring.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s456551.png","image_url":"http://i1.avlws.com/115/l456551.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=456551&tt=df","keywords":"watch","retail_price":"199.95","sale_price":"199.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=456551\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m456551.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=876521&amp;link=&amp;tabs=-Details\"></script>","variants":{"8765210001":{"sku":"8765210001","vendor_sku":"53P-BLU","upc":"693472586761","color":"INDIGO","retail_price":"199.95","sale_price":"199.95"}},"categories":["fitness","running","fitness-electronics"]}
