{"sku":"877060","manufacturer_id":"010-01241-41","brand_name":"Garmin","product_name":"Garmin Forerunner 15 GPS Fitness Monitor Bundle","long_description":"With the included heart rate monitor chest strap, the Garmin Forerunner 15 GPS Fitness Monitor Bundle is set for you to track your workout details, including heart rate, zone, distance, pace and more. Bundle comes with Forerunner 15 GPS Fitness Monitor and heart rate monitor to track your heart rate and zone data for any fitness activity. Stay on top of your fitness goals between workouts with activity tracking features that remind you when it's time to move. Watch yourself improve-the Garmin Forerunner 15 GPS Fitness Monitor Bundle tells you when you set a new fastest mile or longest run to date. Count your steps, calories and distance throughout the day; inactivity indicator motivates you to move when you've been sitting too long. Upload data to the free Garmin Connect online community to join fitness challenges and save, plan and share your progress. Record your distance while running indoors and review your cadence later on Garmin Connect; pair with a foot pod (sold separately) to capture distance data on treadmill runs. GPS-enabled for accurate distance and pace data; you can also view your run on a map when you upload later to Garmin Connect. Rechargeable battery lasts up to 8 hrs. with GPS on, or 5 weeks in watch/activity tracking mode.","short_description":"With the included heart rate monitor chest strap, the Garmin Forerunner 15 GPS Fitness Monitor Bundle is set for you to track your workout details, including heart rate, zone, distance, pace and more.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Watches","thumb_url":"http://i1.avlws.com/115/s459423.png","image_url":"http://i1.avlws.com/115/l459423.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=459423&tt=df","keywords":"waterproof,odometer","retail_price":"200.00","sale_price":"200.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=459423\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m459423.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=877060&amp;link=&amp;tabs=-Details\"></script>","variants":{"8770600001":{"sku":"8770600001","vendor_sku":"010-01241-40","size":"L","color":"BLACK/BLUE","retail_price":"200.00","sale_price":"200.00"},"8770600002":{"sku":"8770600002","vendor_sku":"010-01241-41","size":"L","color":"RED/BLACK","retail_price":"200.00","sale_price":"200.00"}},"categories":["camping-hiking","camp-electronics","watches"]}
