{"sku":"877178","manufacturer_id":"QSD-01-R7","brand_name":"Nite Ize","product_name":"Nite Ize QuikStand Computer Mount","long_description":"Made with sleek brushed aluminum and sturdy, flexible polypropylene, the Nite Ize QuikStand Computer Mount eliminates the need for a book, mug or box to prop up your smartphone or tablet. QuikStand adjusts to different viewing angles and holds your device securely in either portrait or landscape orientation. Fully folded, it's about the size of a credit card and easily fits in your wallet. Simply unsnap the aluminum back support out of the polypropylene base, raise the support bar to the desired position and slide your device between that and the front flap. Works with most mobile phones, e-readers, and small tablets, with or without a form-fit case. Front flap easily adjusts to the depth of your device for secure viewing without obstructing your screen. Easy portability makes it great for travel (especially long plane rides), reading recipes, video chat, browsing the Internet, or catching up with the news wherever you are. Measures 3.4 x 2.0 x 0.2 in.","short_description":"Made with sleek brushed aluminum and sturdy, flexible polypropylene, the Nite Ize QuikStand Computer Mount eliminates the need for a book, mug or box to prop up your smartphone or tablet.","category":"Fitness","subcategory":"Running","product_group":"Fitness Electronics","thumb_url":"http://i1.avlws.com/115/s465231.png","image_url":"http://i1.avlws.com/115/l465231.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=465231&tt=df","retail_price":"9.00","sale_price":"9.00","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=465231\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m465231.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=877178&amp;link=&amp;tabs=-Details\"></script>","variants":{"8771780001":{"sku":"8771780001","vendor_sku":"QSD-01-R7","upc":"094664030350","retail_price":"9.00","sale_price":"9.00"}},"categories":["fitness","running","fitness-electronics"]}
