{"sku":"877184","manufacturer_id":"OT1800-R","brand_name":"Outdoor Tech","product_name":"Outdoor Tech Turtle Shell 2.0 Portable Speaker","long_description":"The Outdoor Tech Turtle Shell 2.0 Portable Speaker offers total sonic freedom in a rugged, water-resistant, Bluetooth(R)-enabled design that's perfect for adding tunes to your outdoor fun. Based on the original Turtle Shell, the 2.0 brings more volume, more Hi-Fi audio, more battery life and a plethora of other feature improvements. Features omnidirectional, room-filling audio with a distinctive design aesthetic and a durable construction built for the Appalachian trail. Small enough to stash in your fanny pack, Turtle Shell 2.0 sports dual speakers and a passive bass radiator that wirelessly provide 96 decibels of clear sound. Water-resistant, dust-proof and shockproof outer shell is probably tougher than you are; built-in microphone functionality allows easy, hands-free conference calls. Turtle Shell 2.0 uses Bluetooth to wirelessly stream Hi-Fi audio from your smartphone or other compatible devices. Rechargeable lithium-ion battery gives you up to 16 hours of play time. Reconnects automatically to previously paired device; external controls allow you to adjust volume, change tracks, play/pause and answer calls. Voice prompts let you know what is going on. aptX audio codec for high-quality stereo audio; AVCRP to control track and volume remotely. Standard camera tether and extra strong metal leash clip for multiple mounting options. Bluetooth 4.0 offers 32-ft. range with enhancements like battery level \"fuel gauge\" displayed on source device, quick connections and low power consumption. 3.5mm audio-in port; microUSB charge port. Comes with a USB charging cable, 3.5mm to 3.5mm cable, signature Outdoor Tech carry pouch, user manual and stickers.","short_description":"The Outdoor Tech Turtle Shell 2.0 Portable Speaker offers total sonic freedom in a rugged, water-resistant, Bluetooth(R)-enabled design that's perfect for adding tunes to your outdoor fun.","category":"Camping And Hiking","subcategory":"Camp Electronics","product_group":"Radios And Headphones","thumb_url":"http://i1.avlws.com/115/s463267.png","image_url":"http://i1.avlws.com/115/l463267.png","buy_link":"http://www.avantlink.com/click.php?p=81603&pw=55475&pt=3&pri=463267&tt=df","retail_price":"129.95","sale_price":"129.95","product_page_view_tracking":"<img src=\"http://www.avantlink.com/dfpv.php?p=81603&amp;pri=463267\" width=\"0\" height=\"0\" style=\"border: none !important; margin: 0px !important;\" alt=\"\" />","medium_image_url":"http://i1.avlws.com/115/m463267.png","product_content_widget":"<script type=\"text/javascript\" src=\"http://www.avantlink.com/apcw.php?mode=5&amp;pw=55475&amp;df=115&amp;sku=877184&amp;link=&amp;tabs=-Details\"></script>","variants":{"8771840001":{"sku":"8771840001","vendor_sku":"OT1800-B","upc":"818389010714","color":"BLACK","retail_price":"129.95","sale_price":"129.95"},"8771840002":{"sku":"8771840002","vendor_sku":"OT1800-R","upc":"818389010769","color":"RED","retail_price":"129.95","sale_price":"129.95"}},"categories":["camping-hiking","camp-electronics","radios-and-headphones"]}
